[
  {
    "body": "So many Nvidia GPUs, so little open-source Linux driver support... until now!\n(Image credit: Tom's Hardware)\nIf you're an avid user of Discord and own an Nvidia graphics card, you may lose performance without knowing it.\nNvidia\n(opens in new tab)\nhas discovered a bug with the Discord application that will prevent the memory on even the best graphics cards from reaching its full speed.\nThe latest update to the Discord software throttles the memory clock on Nvidia graphics cards. When the software runs in the background, the graphics card will fail to hit the maximum memory clock, leading to a performance loss. It's an intriguing bug since it affects Nvidia graphics cards only, more specifically, the memory subsystem. The chipmaker didn't specify any specific model, so we can only assume that all graphics cards from the company are affected.\nNvidia didn't share how Discord is disrupting the memory on the graphics card. However, Discord recently enabled AV1 support for Nvidia's latest GeForce RTX 40-series (Ada Lovelace) graphics cards, so the bug could be potentially related to AV1 encoding support for video streaming. Nonetheless, it's a bug that has managed to slip through the developers.\nNvidia has stated it will push a fix for PC users with an over-the-air (OTA) update. However, there's a simple solution if you don't want to wait for the official fix. The chipmaker has shared the following method to solve the Discord application bug manually:\n1.\nto download the NVIDIA program GeForce 3D Profile Manager.\n2. Open the GeForce 3D Profile Manager.\n3. Click on the button Export SLI Profiles.\n(Image credit: Nvidia)\n4. A file explorer window will pop up. Select a location to export and save the NVIDIA Profiles text file.\n5. Open the text file saved in step 4 using Notepad (or any program that does not automatically apply formatting).\n6. Perform a search for the section \"Discord.\" Add a new line and type the following text as shown in the screenshot below:\nSetting ID_0x50166c5e = 0x00000000\n(Image credit: Nvidia)\n7. Save the edited NVIDIA Profiles as a txt file.\n8. Go back to the GeForce 3D Profile Manager and click on the Import SLI Profiles button.\n9. A file explorer window will appear. Select the updated \"NVIDIA Profiles.txt\" file and then click on the Open button.\n10. Once completed, you may close the GeForce 3D Profile Manager application.\nBe In the Know"
  },
  {
    "body": "AI/ML Networking in Data Centers to Exceed $8B in 2027 Led by Infiniband and Ethernet, According to 650 Group\nAI, ML, and HPC Network Bandwidth is Growing over 100% Each Year\nJanuary 31, 2023 11:43 ET\n| Source:\n650 Group\nIncline Vlg, Nevada, UNITED STATES\nINCLINE VILLAGE, Nev., Jan.  31, 2023  (GLOBE NEWSWIRE) -- A newly released report by 650 Group, a leading Market Intelligence Research firm for communications, data center, and cloud markets, indicates that the Data Center and Artificial Intelligence (AI) Networking market grew to over $1.5 B in 2022. The report also revealed significant regional differences in vendor performance with many records set.\nHighlights for 2022 include:\nVendors Arista and NVidia are the largest two players in this segment\nBy 2027, nearly 1 in 5 Ethernet Switch ports sold into data centers will be related to AI/ML and accelerated computing\nAI/ML will be disruptive to all verticals but at different times projected over the next decade\nHyperscaler CAPEX for 2023 will remain robust for AI/ML projects as traditional deployments begin to show weakness in early 2023\nThe market and vendors for AI/ML networking going forward is very different compared to the traditional Ethernet Switch market in the data center, said Alan Weckel, Founder and Technology Analyst at 650 Group. AI/ML puts a tremendous amount of bandwidth and performance requirements on the network, and AI/ML becomes one of the major growth drivers for Data Center Switching over the next five years. With bandwidth in AI growing, the portion of Ethernet switching attached to AI/ML and accelerated computing will move from a niche today to a significant portion of the market in 2027. We are excited to have a stand-alone report focused on this emerging market.\nThe Quarterly Data Center AI Networking report indicates that the top two vendors are Arista and NVidia. White box presence in AI is not as high compared to the overall white penetration in the market. In addition, the report highlights the difference between Infiniband and Ethernet in vendor shares and market forecasts.\nAbout the Data Center and AI Networking Quarterly Report\nThe Data Center AI Networking Quarterly Report offers a market assessment of vendor performance and market share for Ethernet and Infiniband networking deployed in AI/ML and HPC. The report covers the following port speeds: 25 Gbps, 50 Gbps, 100 Gbps, 200 Gbps, 400 Gbps, 800 Gbps, 1.6 Tbps, and 3.2 Tbps.  650 Group publishes additional segment-specific reports on Data Center Switching. For more information about the report, contact the sales department at 650 Group at +1 650 600 7104 or val@650group.com or www.650group.com.\nAbout 650 Group\n650 Group is a leading Market Intelligence Research firm for communications, data center, and cloud markets.  Our team has decades of research experience, has worked in the technology industry, and is actively involved in standards bodies. To learn more, visit http://www.650group.com"
  },
  {
    "body": "Tuesday, January 31, 2023, 11:15 AM EDT\nComments\nAcer's recent foray into the DIY discrete graphics card market coincided with Intel's modern entry. The former launched an introductory Predator BiFrost model based on latter's flagship Arc A770 GPU, complete with a custom cooling solution and factory overclock. It may not be Acer's last, either. Rumor has it that Acer is expanding its resale GPU lineup with AMD Radeon RX 7000 models on tap.\nDetails are rather sparse and sketchy, but if true, Acer's expansion would be a big win for AMD and a notable loss for NVIDIA. Part of what's interesting here is that NVIDIA already lost a major hardware partner in EVGA, which abruptly (and shockingly) exited the GPU business altogether right before the launch of the GeForce RTX 40 series.\nThe story of the long-term impact on NVIDIA's bottom line has yet to be written. What can be said, however, is that EVGA's departure created a void and an opportunity for another manufacturer to step in and take its place as NVIDIA's right-hand man, so to speak. Acer is apparently not interested in that role, though again, this is all just a rumor at this point.\nSource: BoardChannels via\nVideocardz\nIt originates from a post on the BoardChannels forum in China. We were unable to register for direct access to the forum post, but the folks at Videocardz took a screenshot of the translated text, shown above. It's a rough translation from our reading, but the gist of the post is that Acer wants to become a more serious player in the DIY discrete graphics card market, and will focus on Intel and AMD models for the time being.\nAs things stand, Acer offers two DIY graphics cards in its lineupone is the aforementioned Predator BiFrost Arc A770 OC, and the other is a Predator A380 model without the BiFrost branding or fancier cooling solution. That said, this isn't completely new territory for Acer. In addition to its recent DIY models, Acer has been making discrete cards for its prebuilt Predator gaming PCs for years.\nFocusing on the DIY market is the next logical step. EVGA's departure doesn't really mean there's less competition. It only made cards based on NVIDIA's GPUs, but given Acer's brand recognition, there's an opportunity to carve out a sizable piece of the pie. And who knows, the added competition could potentially help keep prices in check, though we'll have to wait and see."
  },
  {
    "body": "Cyberpunk 2077\nDLSS 3 support is finally a thing, and itll help the CD Projekt Red RPG reach new frame rate heights on Nvidia RTX 4000 graphics cards. While the green teams Lovelace GPUs can boost fps further than their Ampere predecessors, Frame Generation makes playing the game with ultra ray tracing settings switched on a viable option.\nWe all know that Cyberpunk 2077 can make even the best graphics card contenders sweat, and ray tracing adds salt to the fleshy frame rate wound. Of course, if youve invested in something like the Asus TUF Gaming GPU featured in our Nvidia RTX 4090 review, youll be able to churn out nearly 100 fps with every bell and whistle turned on. However, if youre rocking a high refresh rate monitor, youll want to consider trying out the games newfound Frame Generation tricks.\nAs of right now, DLSS 3 is now an option with Cyberpunk 2077s settings menu, and Nvidia says Frame Generation will let you max out every setting and ray-traced option. That may sound like a bold claim, but our own benchmarks suggest you can hit 140 fps using an RTX 4090 without much visual compromise. That figure dips to around 110 fps on the cheaper RTX 4080, and the RTX 4070 Ti cant quite pull triple digits off, but youll still bag around up to 54% more frames compared toprevious\nDLSSgraphics\noptions.\nDLSS 3 support is slowly making its way to other games, so itll hopefully uplift performance across more of your Steam library soon. Recent editions to the fold include Marvels Midnight Suns, Hitman 3, and Dying Light: Stay Human, and it could be essential when it comes to ravenous ray tracing features in the future.\nSadly, not every new release wields the green teams AI tech, but weve still got you covered. Our best Dead Space settings guide will help your PC handle any performance horrors on board the USG Ishimura, while the best Forspoken settings will potentially save your rig from Square Enixs questionable specs.\nMore from PCGamesN\nNew Dreamlight Valley storage and auto-sorting coming in next update\nStar Wars Jedi Survivor system requirements and recommended PC specs\nFortnite Dragon Ball crossover announced pointing to Gohan and Piccolo\nMore from PCGamesN\nFollow us for daily PC games news, guides and reviews on Twitter, Facebook, Overwolf, Steam and Google News.\nPhantom Liberty is CDPR's most expensive DLC ever\nEdgerunners creators would work with CDPR again\nThe Witcher Remake release date will be after The Witcher 4\nFancy a free PC game? Here are the best available right now\nWhich 2022 gaming laptop is best?\nHow to build the best gaming PC money can buy\n 2023"
  },
  {
    "body": "Get Rating\n) during the third quarter, according to the company in its most recent 13F filing with the SEC. The institutional investor  bought 5,864 shares of the computer hardware makers stock, valued at approximately $712,000.\nOther institutional investors have also modified their holdings of the company. Loring Wolcott & Coolidge Fiduciary Advisors LLP MA raised its stake in shares of  NVIDIA by 6.5% in the 2nd quarter. Loring Wolcott & Coolidge Fiduciary Advisors LLP MA now owns 49,800 shares of the computer hardware makers stock valued at $7,549,000 after purchasing an additional 3,055 shares in the last quarter.  Fortune 45 LLC raised its stake in  NVIDIA by 34.4% during the second quarter. Fortune 45 LLC now owns 2,027 shares of the computer hardware makers stock worth $307,000 after acquiring an additional 519 shares during the period.  Covenant Partners LLC raised its stake in  NVIDIA by 6.2% during the second quarter. Covenant Partners LLC now owns 6,458 shares of the computer hardware makers stock worth $979,000 after acquiring an additional 377 shares during the period.  Apexium Financial LP raised its stake in  NVIDIA by 137.4% during the second quarter. Apexium Financial LP now owns 1,690 shares of the computer hardware makers stock worth $256,000 after acquiring an additional 978 shares during the period.  Finally, Coastline Trust Co raised its stake in  NVIDIA by 6.6% during the second quarter. Coastline Trust Co now owns 61,645 shares of the computer hardware makers stock worth $9,344,000 after acquiring an additional 3,843 shares during the period. Institutional investors and hedge funds own  61.80% of the companys stock.\nGet\nGet Rating\n) last issued its quarterly earnings results on Wednesday, November 16th. The computer hardware maker reported $0.34 EPS for the quarter, missing the consensus estimate of $0.44 by ($0.10). The firm had revenue of $5.93 billion during the quarter, compared to analysts expectations of $5.82 billion. NVIDIA had a net margin of 20.85% and a return on equity of 30.75%. The firms revenue was down 16.5% compared to the same quarter last year. During the same quarter last year, the company posted $1.01 EPS.  On average, sell-side analysts predict that  NVIDIA Co. will post 2.19 EPS for the current year.\nNVIDIA Dividend Announcement\nThe company also recently declared a quarterly dividend, which was paid on Thursday, December 22nd. Investors of record on Thursday, December 1st were given a $0.04 dividend. The ex-dividend date  was Wednesday, November 30th. This represents a $0.16 annualized dividend and a dividend yield of 0.08%. NVIDIAs dividend payout ratio (DPR) is presently 6.81%.\nAnalyst Upgrades and Downgrades\nSeveral equities research analysts recently weighed in on NVDA shares. Susquehanna Bancshares increased their price objective on shares of NVIDIA from $180.00 to $185.00 and gave the stock a positive rating in a research note on Thursday, November 17th. Citigroup dropped their price objective on shares of NVIDIA from $248.00 to $210.00 and set a buy rating on the stock in a research note on Tuesday, October 11th. Tigress Financial dropped their price target on shares of NVIDIA from $310.00 to $250.00 and set a buy rating on the stock in a research note on Thursday, December 8th. Barclays raised their price target on shares of NVIDIA from $170.00 to $250.00 and gave the company an overweight rating in a research note on Monday, January 23rd. Finally, Credit Suisse Group  restated an outperform rating and issued a $210.00 price target (up previously from $205.00) on shares of NVIDIA in a research note on Wednesday, November 16th. Two equities research analysts have rated the stock with a sell rating, nine have given a hold rating, twenty-three have given a buy rating and one  has given a strong buy rating to the stock. According to data from MarketBeat, NVIDIA currently has a consensus rating of Moderate Buy and a consensus price target of $209.23.\nAbout NVIDIA\nGet Rating\n)\nNVIDIA Corp. engages in the design and manufacture of computer graphics processors, chipsets, and related multimedia software. It operates through the following segments: Graphics Processing Unit (GPU), Tegra Processor, and All Other. The GPU segment consists of product brands, including GeForce for gamers, Quadro for designers, Tesla and DGX for AI data scientists and big data researchers, and GRID for cloud-based visual computing users.\nFeatured Articles"
  },
  {
    "body": "January 31, 2023\n\nIf you own one of the new 40-series graphics cards, then Cyberpunk 2077 is now going to look even more amazing, thanks to NVIDIA DLSS 3 support thats being added today via an update.\nUltimately, this update will mean that GeForce card users can play the game with every setting (including ray-tracing) maxed out, to get the best fidelity image possible, while maintaining performance levels youd expect. You can see a video of the DLSS 3 turned on and off in a side by side comparison, below:\n\nWith realistic shadows and lighting and the added performance of NVIDIA DLSS 3 no other platform will compare to the Cyberpunk 2077 experience on a GeForce RTX-powered PC.\nCyberpunk 2077 has emerged as the benchmark game for a new generation of gamers who are asking the question But can it run Cyberpunk. Cyberpunk 2077 should be included in any benchmark suite used to test GPUs and tested to deliver the best experience  every setting and ray-traced option maxed out and DLSS 3 enabled.\nPlaying Cyberpunk 2077 with the AI-powered performance of NVIDIA DLSS 3 is the best way to access the stunning visuals the game has to offer  this technology helps us take a new step toward combining unconstrained visual fidelity with exceptional performance.\nsaid Jakub Knapik, Global Art Director, CD PROJEKT RED.\nThe current version of the game uses ray-traced shadows, reflections, diffuse illumination, and ambient occlusion. If you turn on Psycho mode in the ray traced lighting settings, you will even see ray traced global illumination as sunlight bounces realistically around the scene.\nBasically, the update is designed to make those people who have 40x series NVIDIA GPUs be able to make CD Projekt REDs game look pretty stunning.\n\nElsewhere NVIDIA has informed us that Dying Light 2: Stay Human has also received a DLSS 3 upgrade today. NVIDIA says that DLSS 3 games are backwards compatible with DLSS 2 technology  developers simply integrate DLSS 3, and DLSS 2, also known as DLSS Super Resolution, is supported by default. Additionally, integrations of DLSS 3 also include NVIDIA Reflex, reducing system latency for all GeForce RTX users, making games more responsive.\nFor those not familiar, DLSS is short for Deep Learning Super Sampling, but what that means to you and I is that it uses artificial intelligent to get a higher frame rate for your PC game, by learning about the title as you play. Basically, this technology allows your game to render at a native resolution, and use the cores of the graphics card to predict how it should look, and make it look better. DLSS 3 was released along with the 4000 series graphics cards from NVIDIA, while older versions of DLSS should work on older cards.\nCyberpunk 2077 is available now on PC, PS4, PS5, Xbox One, and Xbox Series S|X.\nLiked it? Take a second to support GodisaGeek.com on Patreon!"
  },
  {
    "body": "India.\nNvidia brought in some major improvements when it comes to gaming, with the release of the RTX 40 series GPUs. Along with that, the company also introduced the new DLSS 3 technology, which uses AI to improve frame rates during gaming on your favourite titles.\nSo far, the list of DLSS 3 supported titles isn't pretty massive. However, there are some AAA games on the list such as HITMAN: World of Assassination, Marvel's Midnight Suns, and more. And the list receives a major boost in the form of CD Projekt RED title, Cyberpunk 2077, with the DLSS 3 patch out now.\nWith the addition of DLSS 3, Night City will come to life in an unprecedented way, with fans getting the best performance with Ray Tracing turned to the max. Thanks to the game's use of DirectX Ray Tracing, the environment seems much more true-to-life, and with DLSS 3, players can get the best of Ray Tracing without sacrificing on performance.\nFurthermore, with the arrival of DLSS 3, Cyberpunk 2077 sets the stage for the Ray Tracing: Overdrive Mode, which will improve the visuals of the game to am even higher level in an upcoming update.\nAlong with Cyberpunk 2077, Nvidia has also launched DLSS 3 for Dying Light 2 Stay Human. While DLSS 2 Super Resolution gave major improvements to the game's performance, the technology's successor offers even more, when it comes to gaming on 4K resolution with the RTX 40 series GPUs."
  },
  {
    "body": "alerts:\nWall Street Analyst Weigh In\nSeveral brokerages recently issued reports on NVDA. Stifel Nicolaus upped their price objective on shares of NVIDIA from $165.00 to $175.00 and gave the company a hold rating in a research note on Thursday, November 17th. Morgan Stanley cut their price target on shares of NVIDIA from $182.00 to $175.00 and set an equal weight rating on the stock in a research note on Thursday, November 17th. Tigress Financial cut their price target on shares of NVIDIA from $310.00 to $250.00 and set a buy rating on the stock in a research note on Thursday, December 8th. Credit Suisse Group  reaffirmed an outperform rating and set a $210.00 price target (up previously from $205.00) on shares of NVIDIA in a research note on Wednesday, November 16th. Finally, Truist Financial increased their price target on shares of NVIDIA from $198.00 to $238.00 and gave the stock a buy rating in a research note on Monday, January 23rd. Two equities research analysts have rated the stock with a sell rating, nine have assigned  a hold rating, twenty-three have assigned  a buy rating and one  has issued  a strong buy rating to the company. According to data from MarketBeat, the stock presently has a consensus rating of Moderate Buy and an average price target of $209.23.\nInsider Transactions at NVIDIA\nIn other news, EVP Debora Shoquist sold 23,532 shares of the firms stock in a transaction dated Friday, January 27th. The shares were sold at an average price of $205.00, for a total value of $4,824,060.00. Following the transaction, the executive vice president now directly owns 162,944 shares in the company, valued at approximately $33,403,520. The transaction was disclosed in a legal filing with the SEC, which is available at this link. In related news, EVP Debora Shoquist sold 23,532 shares of NVIDIA stock in a transaction dated Friday, January 27th. The shares were sold at an average price of $205.00, for a total value of $4,824,060.00. Following the sale, the executive vice president now directly owns 162,944 shares in the company, valued at approximately $33,403,520. The sale was disclosed in a legal filing with the SEC, which is available at the SEC website. Also, Director Mark A. Stevens sold 60,000 shares of NVIDIA stock in a transaction dated Wednesday, December 21st. The shares were sold at an average price of $165.09, for a total transaction of $9,905,400.00. Following the completion of the sale, the director now owns 2,250,193 shares in the company, valued at $371,484,362.37. The disclosure for this sale can be found here. In the last three months, insiders have sold 262,060 shares of company stock worth $43,817,257. 4.04% of the stock is currently owned by insiders.\nNVIDIA Trading Down 5.9 %"
  },
  {
    "body": "Jan 31, 2023 08:55 AM EST\n\nA recent shipping manifest might be our first hint that NVIDIA is indeed working on a brand new Titan RTX graphics card featuring the Ada architecture.\nNVIDIA Titan RTX With Ada Lovelace GPU Architecture Spotted With 48 GB GDDR6X Memory & PG137 Board\nThe shipping manifests can be seen listed at Volza which tracks global import data and has various containers of the \"PG137-0000\" GPUs (prototypes)  heading out from the United States to India for further testing & validation. There are several other GPUs mentioned but those have already been launched as the RTX 4090, RTX 4080, and RTX 4070 Ti. There's currently no graphics card out there that utilizes the specific PG137 board and features 48 GB GDDR6 memory. One might expect this to be the RTX 6000 Ada but that's a vastly different board design.\nNVIDIA GeForce RTX 4070 Non-Ti Features 2475 MHz Boost, OC Variants At 2.5 GHz+ Clocks\nNVIDIA Titan RTX Ada Graphics Card 'Rumored' Specifications\nAccording to the Kopite7kimi, the next-generation NVIDIA Titan RTX graphics card based on the Ada Lovelace GPU architecture is expected to feature the AD102 GPU, rocking 142 SMs on 18,176 CUDA cores. A similarly configured chip is rumored to be featured on the GeForce RTX 4090 Ti card & has the AD102-400-A1 designation. Only the fully enabled SKU with all 144 SMs should get the AD102-450-A1 designation but it is unlikely that a product with such a chip is expected to launch. It could be introduced later on as another Workstation or BFGPU-class card but no rumor has listed a fully enabled Ada AD102 GPU yet.\nThe NVIDIA Titan RTX \"Ada\"  is also rumored to be equipped with 48 GB of GDDR6 memory across a 384-bit wide bus interface. Now the listing clearly reads GDDR6 and not GDDR6X memory but it would be weird to not include the fastest memory solution on a premium product such as the RTX Titan. One possibility is that the standard Non-X memory is used to lower the outrageously high power consumption which is rated around 800-900W. The other possibility is that the listing simply doesn't differentiate between the GDDR6 and GDDR6X memory standards. The latter seems more plausible since that's also the case with the RTX 4090/4080/4070 Ti listings by the same lister.\nMore recently, Matthew Smith of TechPowerUP reported (now redacted via\nVideocardz\n) that the NVIDIA Titan RTX \"Ada\" graphics card is indeed being tested and has shown up in validation with a 2235 MHz base & 2520 MHz boost clocks along with 48 GB GDDDR6X memory. Now, this doesn't mean that the card is ready for prime launch but only gives us an indication that there's something more powerful out there that may or may not come to market. The graphics card is expected to feature a quad-slot cooling solution and a very unique PCB and I/O design which we detailed here.\nThe card would easily pass the 100 TFLOPs barrier even at stock clocks considering the RTX 4090 can already hit 2.8-2.9 GHz boost frequencies casually and the same would've been the case with the TITAN.\nNVIDIA GeForce RTX 40 Series Graphics Card Lineup (Rumored):\nGraphics Card"
  },
  {
    "body": "Reuters\n31-Jan-23 03:45 PM IST\nTaiwanese contract manufacturer Foxconn said it will manufacture electronic control units (ECUs) for cars based on Nvidia's DRIVE Orin chip made specifically for computing in connected and autonomous vehicles.\nThe ECUs will serve the global automotive market, Foxconn said.\nCompanies developing electric and autonomous cars have struggled to bring products to the market in recent years as they grapple with rising costs and difficulties in ramping up production.\nNvidia said its technology, which includes chips to process information from sensors in real time, will help Foxconn overcome some of those challenges.\nIt sees a market opportunity of $300 billion in the automotive sector and reported revenue of $251 million in the third quarter from the segment.\nThe chipmaker said the tie-up will allow it to scale efforts to meet growing demand for chips made for autonomous and connected vehicles.\nFoxconn, which operates a vehicle manufacturing facility in Ohio, said its vehicles will contain ECUs based on DRIVE Orin and Nvidia's DRIVE Hyperion sensors for autonomous driving.\nTaiwan-based Foxconn makes electric vehicles for Lordstown Motors Corp and has a contract to make Fisker Inc's second car model, PEAR. It also manufactures Apple Inc products.\nThe company said in October it hopes to eventually make cars for Tesla Inc as it ramps up electric vehicle manufacturing to diversify its business.\n#"
  },
  {
    "body": "SEE ALL\nNVIDIA launched the Jetson Orin NX 16GB module designed for use in low-power robots in India. | Photo Credit: Special Arrangement\nNVIDIA launched the Jetson Orin NX 16GB modulus with enhanced performance and efficiency for the small form factor, low-power robots in India.\n(For insights on emerging themes at the intersection of technology, business, and policy,\nsubscribe\nto our tech newsletter Todays Cache.)\nThe new module delivers up to 100 TOPS of AI performance with the ability to configure power between 10-25 W and delivers 3x the performance of the NVIDIA Jetson AGX Xavier and 5x the performance of the NVIDIA Jetson Xavier NX.\nExplained | What went wrong with some of NVIDIAs new graphics cards?\nThe system-on-module from NVIDIA supports multiple AI applications with the companys Ampere architect GPU and allows users to develop solutions using complex AI modes in natural language understanding, 3D perception, and multi-sensor fusion.\nThe Jetson Orin NX also brings support for sparsity, enabling greater performance by increasing the throughput for Tensor Core operations.\nThe module is ideal for use in drones and handheld devices and can be used for advanced applications such as manufacturing, logistics, retail, agriculture, healthcare, and life sciences, the company shared.\nNVIDIA also released the JetPack 5.1, bringing support for the Orin NX 16 GB and the latest CUDA-X stack on Jetson Orin which supports a broad range of carrier boards and peripherals such as sensors, cameras, and connectivity modules (5G, 4G, Wi-Fi)."
  },
  {
    "body": "The newer 4070 Ti\nseems like an inferior card in all aspects. It has a lower CUDA core count, narrower memory interface bandwidth, and, overall, a less chunky design.\nIn addition, the Ada Lovelace-based relies on higher clock speeds to deliver performance. The GPU has a lower total board power. Nvidia recommends a 600 W PSU for the card, which makes it ideal for mid-range gaming cards.\nRTX 3080 Ti vs RTX 4070 Ti performance comparison\nBased on the specs, the 4070 Ti has a theoretical performance of 40.09 TFLOPs The last-generation 3080 Ti comes with an FP32 performance of 34.10 TFLOPs. Thus, it is evident that the Ampere-based card is slightly weaker than the new launch from Nvidia.\nAccording to TechPowerUp's GPU computing prowess aggregates, the 4070 Ti is about 4% faster than the 3080 Ti. The Lovelace card levels the RTX 3090 by about 3% and is slightly slower than the RTX 3090 Ti.\nRegarding performance with video games, the RTX 3080 Ti and the 4070 Ti come close.\nWhile the Ada Lovelace-based card beats the 80-class entry from the last-gen in multiple titles like Forza Horizon 5 and Dying Light 2, the card loses it in games like Fortnite Assassin's Creed Valhalla, according to the benchmarks conducted by YouTuber Game Tests.\nHowever, the RTX 4070 Ti and the 3080 Ti offer equivalent performance with most games. This can be seen across the board in heavy titles like Spider-Man: Miles Morales and Horizon Zero Dawn.\nConclusion\nThe RTX 4070 Ti and 3080 Ti are close competitors in terms of performance. Both GPUs perform similarly across video games and creative software. Thus, the answer boils down to which GPU is available at a better price.\nCurrently, the 4070 Ti starts from around $799, while the cheapest 3080 Ti is available for around $959. Thus, gamers should opt for the newer Ada Lovelace-based card. Gamers can also access technologies like frame generation and better power efficiency with this card.\nNote: We may receive a small commission from the links included in the article.\nPoll :"
  },
  {
    "body": "January 30, 2023\nThat AD102 configuration is similar to the one used in the RTX 6000 Ada Generation card aimed at the professional and enterprise market, though that $7,000+ product packs 48GB of GDDR6.\nThe specs would push the RTX 4090 Ti's maximum bandwidth to 1,152 GB/s, meaning not only would the Ti pack more FP32 Cuda cores than the standard version of the card, but also feature more bandwidth.\nOne area where the RTX 4090 has the unreleased card beaten is its Total Board Power (TBP). The current Lovelace flagship has a 450W TBP, while the RTX 4090 Ti is said to have a 600W TBP. We can also expect the Ti to carry an even heftier price tag than its sibling, which has an eye-watering $1,600 MSRP and usually sells for a lot more. The Ti version could be closer to $2,000, and that's just the recommended retail price.\nThere's no word on when the RTX 4090 Ti might arrive. VideoCardz notes that an alleged photo of some metal from the card's cooler design has already leaked, possibly indicating that a new consumer flagship is in the works.\nAs expensive, fast, and power-hungry as the RTX 4090 Ti is, it will likely be surpassed in those areas by the Titan RTX Ada. Purported photos (above) of the enterprise-focused card leaked yesterday, and it's alleged to feature 48GB of GDDR6X, 18,176 CUDA cores, and a TDP of 800W."
  },
  {
    "body": "Jan 31, 2023 01:00 AM EST\n\nCopy Shortlink\nThe newly updated SDK for Vulkan was released today (version 1.3.239.0) in collaboration with The Khronos Group, which is supported by both Windows & Linux environments. This complete support will be optimized for four Vulkan Video extensions that were recently stabilized at the end of 2022. The new Vulkan Video extensions will include Validation Layer integration and header upgrades. Several graphics card vendors, including giants AMD and NVIDIA, will now be able to utilize Vulkan Video acceleration in H2.64 and H.265 decoding seen in frameworks and software.\nVulkan updates the Software Development Kit to now fully support Vulkan Video extensions in Windows and Linux platforms\nSeveral Vulkan drivers that support the new Vulkan Video extensions are being delivered from multiple GPU vendors, including NVIDIA and AMD, for implementation in Windows and Linux environments, depending on the vendor. The group does report that Intel will soon support Vulkan Video in an upcoming Intel Graphics Driver focused on the Intel Arc A-Series and Iris Xe Graphics.\nThe open-source community is also moving forward with Vulkan Video support into the Vulkan RADV drivers for AMD and the ANV drivers for Intel GPUs. GStreamer and FFmpeg, among others, are introducing Vulkan Video acceleration across multiple platforms.\nMany companies have worked hard on Vulkan Video to deliver specifications, conformance tests, drivers, tools, samples, and now an SDK to enable developers to efficiently utilize this groundbreaking API, and we are thrilled by the early engagement and adoption by the open source community.\nWe are also keenly aware of the strong industry interest in encode extensions, including for VP9 and AV1 codecs, together with additional features to optimize a growing range of use cases. Delivering on our roadmap will be the subgroups focus in 2023, and we appreciate the community's ongoing support!\n Ahmed Abdelkhalek, Vulkan Video technical subgroup chair\nVulkan Video Support in the Vulkan SDK\nVulkan's software development kit adds the necessary headers, validation layers, and more so that developers can fully utilize Vulkan Video extensions.\nThe new Vulkan validation layers, API header files, and API registry are listed below:\nVK_KHR_video_queue: common APIs for all video coding operations.\nVK_KHR_video_decode_queue: common APIs for all video decode operations.\nVK_KHR_video_decode_h264: H.264 decode-specific capabilities and parameters.\nVK_KHR_video_decode_h265: H.265 decode-specific capabilities and parameters.\nVulkan Video codec-specific headers in the new software development kit provide the following header files for developers:\nvulkan_video_codec_h264std.h: defines structures and types shared by H.264 decode and encode operations.\nvulkan_video_codec_h264std_decode.h: defines structures used only by H.264 decode operations.\nvulkan_video_codec_h265std.h: defines structures and types shared by H.265 decode and encode operations.\nvulkan_video_codec_h265std_decode.h: defines structures used only by H.265 decode operations.\nvulkan_video_codecs_common.h: defines a versioning macro used by other standard headers for version maintenance.\nThe Khronos Group, along with members of the Vulkan Video subgroup, are constantly working on additional Vulkan Video resources, such as:\nThe blog from December 2022 on the Khronos Group's website has a complete description of the current Vulkan Video extensions.\nThe new version 2022.7 is anticipated to be a February 2023 release that will include the NVIDIA Nsight Graphics frame debugger and the NVIDIA Nsight Systems system profiler that will specifically support Vulkan Video.\nNVIDIA has provided an open-source vk_video_decode sample that showcases and explains how to parse a video stream from an input file, use hardware-accelerated decoding, and transmit the decoded stream frame-by-frame into graphics processing and presentation. The sample code can be used as a customizable library to increase the development process.\nThe Khronos Vulkan Video subgroup welcomes developers' feedback while simultaneously monitoring the Vulkan GitHub issue tracker.\nNews Source:"
  },
  {
    "body": "NVIDIA's Eye Contact AI will revolutionise the world of streaming. The NVIDIA Eye Contact, a new NVIDIA Broadcast app feature, uses artificial intelligence (AI) to simulate your eyes as if you were looking right at the camera while recording. When you're distracted, the AI-powered feature instantly edits your video in real-time to make you appear to be staring straight at the camera. What is NVIDIA Eye Contact? The \"Eye Contact\" feature of NVIDIA Broadcast 1.4 employs artificial intelligence to replace your eyes with \"simulated\" ones that are positioned in front of your camera. When you're not actually making eye contact with the camera, the NVIDIA Eye Contact AI feature makes it look like you are. NVIDIA Eye Contact AI was unveiled as a new feature as part of this month's 1.4 patches for NVIDIA Broadcast, which enhances video for live-streaming and videoconferencing. As per NVIDIA, Eye Contact is intended for creators who want to look directly into the camera at all times, even if they have to glance away from the action to perform tasks like reading notes, a script, or a screenplay. The Eye Contact feature is just one more example of how artificial intelligence is progressively being incorporated into daily life. NVIDIA claims that Eye Contact features a \"disconnect option in case you look too far away\" and will make an effort to match the colour of your virtual eyes to those of your actual ones. The beta badge denotes that NVIDIA is actively seeking community feedback to advance and enhance the functionality. Broadcast also has background replacement, which may be used as a virtual green screen, and the ability to cancel out any unwanted noises picked up by your microphone. Both these capabilities are powered by artificial intelligence (AI). NVIDIA added additional features to Broadcast version 1.4 along with Eye Contact. The latest version improves the Blur, Replacement, and Removal Virtual Background effects, while also including a vignette effect that NVIDIA claims is similar to Instagram's. For users with RTX graphics cards, the update is available for download. The new technology has alarmed users due to its artificial appearance and feel. There are, however, a lot more encouraging remarks to be discovered. Do you want to give it a go? Check first to see if you can fulfil the requirements. NVIDIA Eye Contact requirements The software requires a minimum of 8GB of RAM and a GeForce RTX 2060 graphics card (or a Quadro-compatible GPU). As a minimum CPU requirement, NVIDIA advises using an Intel Core i5-8600 or AMD Ryzen 5 2600. The NVIDIA Eye Contact AI feature could initially feel unnatural to use. Being glared upon by an artificially flawless avatar could be unnerving because even the most professional presenters periodically turn away. However, if you feel uncomfortable making eye contact with the camera, this could help you connect with your viewers. Does your machine satisfy these specifications? If so, let's look more closely at how to get and use NVIDIA Eye Contact. How to get the Eye Contact AI feature? Update to the latest version of the NVIDIA Broadcast (1.4) for your PC or laptop. Your menu will now include the NVIDIA Eye Contact feature after the update. How to use NVIDIA Eye Contact?Use the new NVIDIA Eye Contact feature by following these steps:Download NVIDIA Broadcast if you haven't already. You may click on this link.Go to CameraTap on EffectChoose Eye Contact (Beta)"
  },
  {
    "body": "Free Report\n)     has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nShares of this maker of graphics chips for gaming and artificial intelligence have returned +31.1% over the past month versus the Zacks S&P 500 composite's +4.8% change. The Zacks Semiconductor - General industry, to which Nvidia belongs, has gained 21.1% over this period. Now the key question is: Where could the stock be headed in the near term?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nFor the current quarter, Nvidia is expected to post earnings of $0.81 per share, indicating a change of -38.6% from the year-ago quarter. The Zacks Consensus Estimate has changed +0.2% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $3.26 points to a change of -26.6% from the prior year. Over the last 30 days, this estimate has remained unchanged.\nFor the next fiscal year, the consensus earnings estimate of $4.38 indicates a change of +34.2% from what Nvidia is expected to report a year ago. Over the past month, the estimate has changed -0.1%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Nvidia is rated Zacks Rank #4 (Sell).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nRevenue Growth Forecast\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nIn the case of Nvidia, the consensus sales estimate of $6.01 billion for the current quarter points to a year-over-year change of -21.3%. The $26.94 billion and $29.3 billion estimates for the current and next fiscal years indicate changes of +0.1% and +8.8%, respectively.\nLast Reported Results and Surprise History\nNvidia reported revenues of $5.93 billion in the last reported quarter, representing a year-over-year change of -16.5%. EPS of $0.58 for the same period compares with $1.17 a year ago.\nCompared to the Zacks Consensus Estimate of $5.93 billion, the reported revenues represent a surprise of +0.02%. The EPS surprise was -17.14%.\nOver the last four quarters, Nvidia surpassed consensus EPS estimates two times. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nNvidia is graded F on this front, indicating that it is trading at a premium to its peers. Click here  to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Nvidia. However, its Zacks Rank #4 does suggest that it may underperform the broader market in the near term.\nIn-Depth Zacks Research for the Tickers Above\nNormally $25 each - click below to receive one report FREE:"
  },
  {
    "body": "January 31, 2023, 17:21\nTechSpot is about to celebrate its 25th anniversary. TechSpot means tech analysis and advice youcantrust.\nIn brief: If you frequently leave Discord open on your desktop and have recently noticed degraded game performance from your Nvidia GPU, a Discord glitch might be the culprit. Nvidia will release a fix soon, but also offers directions for manually rectifying the problem.\nThis week, Nvidia acknowledged that a recent update to Discord caused it to throttle the memory on Nvidia GPUs. This glitch could affect game performance as it prevents the VRAM from reaching its full clock speed while launching games.\nThe GPU manufacturer plans to patch the issue with a future update, but has also provided a roundabout solution for those who can't wait. The manual fix involves using the GeForce 3D Profile Manager to edit an SLI profile  a fairly complex operation.\nUsers who don't have the 3D Profile Manager can download it from Nvidia's website. After installing and opening the program, select \"Export SLI Profiles.\" Once a file explorer window appears, choose a location to export to and save the Nvidia Profiles file, which should be a text file.\nThen open the file in Notepad and search for \"Discord.\" A section should appear starting with \"Profile 'Discord'\" and ending with \"EndProfile.\" At the bottom, right above \"EndProfile\" and below \"Setting ID_0x809d5f60 = 0x10000000,\" type \"Setting ID_0x50166c5e = 0x00000000.\" The section should then appear like the screenshot above.\nAfterward, save the profile as a .txt file, return to the 3D Profile Manager, and select \"Import SLI Profiles.\" When the explorer window appears, select the file you just saved, click \"Open,\" and then close the 3D Profile Manager.\nNvidia didn't clarify which update may have caused the problem. It may have been the recent Discord patch that added the ability for streamers with RTX 40 series GPUs to encode using the AV1 codec.\nThe new codec has shown significant efficiency gains over H.264, letting streamers and content creators encode clearer videos while consuming less bandwidth. Furthermore, AV1 is royalty-free, unlike H.265.\nHowever, encoding H.265 through hardware requires the latest graphics cards like the RTX 40 series, AMD's RDNA3, and Intel's Arc Alchemist. Intel's upcoming Meteor Lake CPUs will also include hardware AV1 encoding.\nDiscord now uses this functionality to let Nitro subscribers encode at 8Mbps in 4K@60fps. It isn't clear when Discord might extend AV1 encoding to subscribers with RDNA3 or Arc Alchemist GPUs."
  },
  {
    "body": "As experiments with the viral ChatGPT model continue and users test the technologys limits and capabilities, new use cases for AI applications are emerging, and investors are seeking ways to invest in the promising sector. Could this mark the reversal of a historic low for the semiconductor industry?\r\n\r\n- Nvidias stock jumped 42% in January, Seagates share price is up 28.87%, and Qualcomm is up 24.28% in the last month.\r\n\r\n- Samsung is increasing its capital expenditure despite the current demand-supply gap in the chip industry.\r\n\r\n- The iShares PHLX Semiconductor ETF is up 16.31% in the last month.\r\n\r\nWall Street is betting on the semiconductors industry in attempts to capitalise on investment opportunities related to the AI revolution that OpenAIs popular language chatbot ChatGPT has brought about, threatening to disrupt sectors and replace jobs.\r\n\r\nNvidia Corp. [NVDA], as a dominant name in the space, is among the sectors biggest winners, with its shares jumping as much as 42% in January and adding $5.1bn to CEO Jensen Huangs wealth, making him one of the largest percentage gainers in net-worth among US billionaires in 2023 so far, according to the Bloomberg Billionaire Index. Nvidias shares have rallied at least 59% from their lowest point last year in October 2022.\r\n\r\n\r\n\r\n  \r\n  NVDA stock chart by TradingView\r\n  \r\n  \r\n  new TradingView.widget(\r\n  {\r\n  \"autosize\": true,\r\n  \"symbol\": \"NASDAQ:NVDA\",\r\n  \"interval\": \"D\",\r\n  \"timezone\": \"Etc/UTC\",\r\n  \"theme\": \"light\",\r\n  \"style\": \"2\",\r\n  \"locale\": \"en\",\r\n  \"toolbar_bg\": \"#f1f3f6\",\r\n  \"enable_publishing\": false,\r\n  \"allow_symbol_change\": true,\r\n  \"container_id\": \"tradingview_b5066\"\r\n}\r\n  );\r\n  \r\n\r\n\r\n\r\nAnalysts at Barclays upgraded their ratings on chipmakers Advanced Micro Devices Inc. [AMD], Qualcomm Inc. [QCOM] and Seagate Technology Holdings [STX] on expectations that the sector is unlikely to revisit multi-year lows reached in October 2022. Seagates share price is up 28.87%, while Qualcomm is up 24.28% in the last month.\r\n\r\n\r\n\r\n  \r\n  STX stock chart by TradingView\r\n  \r\n  \r\n  new TradingView.widget(\r\n  {\r\n  \"autosize\": true,\r\n  \"symbol\": \"NASDAQ:STX\",\r\n  \"interval\": \"D\",\r\n  \"timezone\": \"Etc/UTC\",\r\n  \"theme\": \"light\",\r\n  \"style\": \"2\",\r\n  \"locale\": \"en\",\r\n  \"toolbar_bg\": \"#f1f3f6\",\r\n  \"enable_publishing\": false,\r\n  \"allow_symbol_change\": true,\r\n  \"container_id\": \"tradingview_f7e46\"\r\n}\r\n  );\r\n  \r\n\r\n\r\n\r\n\r\n\r\n  \r\n  QCOM stock chart by TradingView\r\n  \r\n  \r\n  new TradingView.widget(\r\n  {\r\n  \"autosize\": true,\r\n  \"symbol\": \"NASDAQ:QCOM\",\r\n  \"interval\": \"D\",\r\n  \"timezone\": \"Etc/UTC\",\r\n  \"theme\": \"light\",\r\n  \"style\": \"2\",\r\n  \"locale\": \"en\",\r\n  \"toolbar_bg\": \"#f1f3f6\",\r\n  \"enable_publishing\": false,\r\n  \"allow_symbol_change\": true,\r\n  \"container_id\": \"tradingview_a6a3e\"\r\n}\r\n  );\r\n  \r\n\r\n\r\n\r\nNew AI use cases for semiconductors\r\n\r\nAnalysts at Bank of America and Wells Fargo highlighted Nvidia as one of the strongest beneficiaries of the Chat-GPT-induced AI hype. Wells Fargo said Nvidias upcoming chip models are positioned to meet the demand for the additional computing requirements resulting from the new AI models.\r\n\r\nCitigroup strategists said the chipmaker could stand to benefit in sales of between $3bn and $11bn over the year from ChatGPTs growth, Bloomberg reported. Analyst Atif Malik came to this range based on estimations for the number of words generated by ChatGPT and revenue per word for Nvidia.\r\n\r\nNvidia has made a name for itself in creating chips for vehicles and robots, as well as graphics chips made for complex computing functions that power AI applications. As ChatGPT grows and adds more users to its database, the tool will require more computing power and memory capabilities to answer the queries and execute user demands and prompts, which can range from students asking for help with homework to software engineers asking it to write long pages of code and anything in between.\r\n\r\nHope for the struggling chip industry\r\n\r\nThe new investor confidence in chip stocks brings hope to the battered semiconductor industry, which is facing a historic low, with prices plummeting on the back of dwindling consumer demand as people cut spending on gadgets after supply increases with accelerated post-COVID production.\r\n\r\nWhile most chipmakers cut capital spending to recover from the gap between their excess inventory and consumer demand, South Korean electronics manufacturer and chipmaker Samsung raised eyebrows with its unexpected decision to go against the trend and ramp up its expenditure on new capacity instead.\r\n\r\nSamsung went ahead with this decision despite warning that it expects the chip industry to begin recovering in the second half of the year and demand for smartphones to shrink in 2023.\r\n\r\nThe move is likely to put pressure on smaller rivals who would struggle to keep up with pricing but could also indicate optimism returning for the chip industrys future.\r\n\r\nFunds in focus: iShares PHLX Semiconductor ETF\r\n\r\nThe iShares PHLX Semiconductor ETF [SOXX] provides exposure to various chip stocks, with an 8.87% weighting in Nvidia, its largest holding. The fund also includes other dominant players in the industry, including an 8.27% holding of Broadcom Inc. [AVGO], a 4.19% holding of Micron Technology Inc. [MU], and a 4.03% holding of Taiwan Semiconductor Manufacturing Co. [TSM]. The fund is up 16.31% in the last month.\r\n\r\nThe ARK Autonomous Technology & Robotics ETF [ARKQ] offers exposure to companies innovating in the AI and robotics space, including Tesla Inc. [TSLA] and UiPath Inc. [PATH]. The fund is up 19.02% in the last month.\r\n\r\nCHART"
  },
  {
    "body": "(NASDAQ: NVDA)\n. The consumer market continues to be a massive headwind for these semiconductor giants, but is there some good news for the chip industry? Check out the short video to learn more, consider subscribing, and click the special offer link below.\n*Stock prices used were the market prices of Jan. 30, 2023. The video was published on Jan. 30, 2023.\nFind out why Nvidia is one of the 10 best stocks to buy now\nOur award-winning analyst team has spent more than a decade beating the market. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\nThey just revealed their ten top stock picks for investors to buy right now. Nvidia is on the list -- but there are nine others you may be overlooking."
  },
  {
    "body": "VideoCardz\n(opens in new tab)\n), Intel has tracked down the source of the performance bottleneck and fixed the issue. A major driver update in the near future aims to roll these changes out to the broader Arc ecosystem.\nThis would be a major boon for Team Blue since reported issues, including incompatibility and visual corruption, are going to be a major turn off for gamers. That's the one audience these cards needs to appease if Intel ever hopes to take on the best graphics cards from AMD and Nvidia.\nTo that end, PCGH tested 66 games across the years, going as far back as Unreal Tournament 2004 GOTY Edition (a DirectX 8 title), and only Halo Infinite had severe issues. Most games in the trial ran perfectly  and that was before the forthcoming driver update, which is said to fix major performance issues Intel's Arc cards have been facing.\nIts not too late for Intel Arc, but time may be running out\nWith Intel Arc seemingly on the ropes for months (if not years), there's definitely reason to be cautionous about how much of a difference this driver update will make.\nIntel's most recent earnings call\ndid not exactly inspire confidence in the market\n(opens in new tab)\n, and Intel is going to be under enormous pressure to increase earnings in the year ahead. Intel's discrete graphics unit has already been in the crosshairs as the company's considerable investment hasn't resulted in a major graphics card launch that could compete with the likes of AMD and Nvidia.\nStill, while Intel's Arc cards might be threatened, they haven't been shut down yet, and the company says it remains committed to seeing its discrete graphics project through.\nWith so much of the delay in the card's release being tied to issues with software drivers rather than the hardware itself, there is reason to hope that Intel's new cards can prove themselves to be major contenders for the best cheap graphics cards available,\nThat is sorely needed, as both AMD and Nvidia continue to release unacceptably expensive graphics cards that a majority of gamers have little hope of being able to afford.\nTechRadar Newsletter"
  },
  {
    "body": "Comments (0)\n(Image credit: Intel)\nThe U.S. Department of Commerce has blacklisted hundreds of Chinese entities associated with military and nuclear research, in a bid to prevent the use of American technologies for these operations. But these entities can still obtain key hardware on the open market without any limitations, according to findings by the\nWall Street Journal\n.\nThestate-run China Academy of Engineering Physics(CAEP) has been on the U.S. export blacklist since 1997, but the organization continues to use computers based on Intel Xeon Gold processors equipped with Nvidia GeForce RTX graphics cards, according to its own research papers analyzed by the WSJ. Such CPUs and graphics cards cannot be sold by Intel or Nvidia directly to CAEP, but they are still available from marketplaces like Aliexpress and Taobao.\nThe China Academy of Engineering Physics conducts research in different fields. Physicists from CAEP helped to develop the country's first hydrogen bomb and were instrumental in China's nuclear program. U.S. authorities do not want China to further develop its nuclear capabilities, but it's believed the country has over 400 warheads and could stockpile as many as 1,500 by 2035.\nTo develop those warheads, Chinese researchers need high-performance computing (HPC), and because they cannot build powerful supercomputers based on leading-edge chips developed in the U.S., they use domestic CPUs instead. Both the Trump and Biden administrations have imposed strict curbs against China's semiconductor and supercomputer sectors in recent years.\nFor example, American wafer fab equipment makers cannot sell companies like China's SMIC tools that can be used to build chips on advanced fabrication technologies, yet SMIC still found a way to develop 7nm-like production nodes. Meanwhile, U.S. export regulations set last October bans shipping American technologies that enable supercomputers with performance of over 100 FP64 PetaFLOPS, or over 200 FP32 PetaFLOPS within a 41,600 cubic feet (1178 cubic meters) or smaller envelope to China.\nStill, CAEP continues to use PCs and servers based on recent Intel and Nvidia hardware, since it is impossible for the U.S. government to control every single chip that American companies sell, especially keeping in mind that China bought more than a third of all chips produced in the world in 2021. For example, CAEP's procurement tenders from 2020 included systems based on Intel CPUs and equipped with Nvidia V100 GPUs.\n\"It is insanely difficult to enforce the U.S. restrictions when it comes to transactions overseas,\" said former top Commerce Department official Kevin Wolf, to the WSJ.\nA representative of the U.S. Bureau of Industry and Security expanded on this idea, telling the publication, \"As mass-market products move through multiple parties in global supply chains, full visibility on ultimate end users is a large undertaking.\"\nThe CAEP does not hide the fact that its researchers use machines based on Intel CPUs and Nvidia GPUs. It is disclosing this fact in its research papers, and there is seemingly no way the American government can stop this.\nBe In the Know"
  },
  {
    "body": "The 2023 model of LGs ultralight Gram 17 now has an official release date and price. LG has announced that the devices will be available for purchase on February 1st on LGs website, with other select LG-authorized retailers to follow. Models will start at $1,999. \n\nA number of refreshes to the Gram line were announced at CES 2023 in early January. The laptops will support variable refresh rate and Dolby Atmos for the first time. Theyve also been updated to 13th Gen Intel processors. LG refers to these new LG Gram 17 models as the LG Gram Pro, though they are simply labeled as LG Gram 17 on its website.\n\nThere look to be two models available at launch. The $1,999.99 model will include an Nvidia RTX 3050 GPU, 16GB of RAM, and 1TB of SSD storage. A higher-end $2,299.99 model will bump up to 32GB of RAM and 2TB of storage. Both will be powered by the Core i7-1360P and will weigh 3.2 pounds (which, for a machine with a discrete GPU, is quite light).\n\nUpdates are also coming to the 16-inch, 15-inch, and 14-inch Gram sizes. These dont have release dates yet but are said to be launching later this year. Heres what LG has to say about those: \n\n> LGs new gram 17, 16, 15 and 14 laptops (models 17Z90R, 16Z90R, 15Z90R and 14Z90R); each deliver the brands signature combination of strong performance and light, compact design. Great for productivity and entertainment, the IntelEvo Platform certifiedlatest 17- and 16-inch grams are equipped with an NVIDIA GeForce RTX 3050 4GB GPU, a13th Gen Intel Core Processor, latest LPDDR5 RAM and blazing fast Gen4 NVMe SSD. \n> The new LG grams inherit its core DNA of ultra-light weight and the new models weigh in at less than 3.2Lbs despite having a large battery1that can handle more than 20 hours of video playback on a single charge and comes with a convenient compact adapter for added portability.2023 LG grams deliver excellent battery life, giving users the freedom to work, or play, wherever their day takes them.\n\nThese laptops arent to be confused with the new LG Gram Style, which is coated in an iridescent color-changing finish, or the 16-inch Gram UltraSlim, which is well under half an inch thick. Those models made a big splash at CES this January, but its likely the tried-and-true models like this regular Gram 17 will be safer (and perhaps more pragmatic) purchases for many shoppers this year."
  },
  {
    "body": "Get Rating\n) by 1.9% during the 3rd quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The institutional investor  owned 25,781 shares of the computer hardware makers stock after acquiring an additional 476 shares during the quarter. NVIDIA comprises about  1.0% of Berkshire Banks investment portfolio, making the stock its 27th biggest holding. Berkshire Banks holdings in NVIDIA were worth $3,129,000 at the end of the most recent quarter.\nOther hedge funds and other institutional investors have also recently bought and sold shares of the company. Loring Wolcott & Coolidge Fiduciary Advisors LLP MA increased its stake in  NVIDIA by 6.5% in the 2nd quarter. Loring Wolcott & Coolidge Fiduciary Advisors LLP MA now owns 49,800 shares of the computer hardware makers stock worth $7,549,000 after purchasing an additional 3,055 shares in the last quarter.  Fortune 45 LLC lifted its holdings in  NVIDIA by 34.4% in the 2nd quarter. Fortune 45 LLC now owns 2,027 shares of the computer hardware makers stock worth $307,000 after purchasing an additional 519 shares during the last quarter.  Covenant Partners LLC lifted its holdings in  NVIDIA by 6.2% in the 2nd quarter. Covenant Partners LLC now owns 6,458 shares of the computer hardware makers stock worth $979,000 after purchasing an additional 377 shares during the last quarter.  Apexium Financial LP lifted its holdings in  NVIDIA by 137.4% in the 2nd quarter. Apexium Financial LP now owns 1,690 shares of the computer hardware makers stock worth $256,000 after purchasing an additional 978 shares during the last quarter.  Finally, Coastline Trust Co lifted its holdings in  NVIDIA by 6.6% in the 2nd quarter. Coastline Trust Co now owns 61,645 shares of the computer hardware makers stock worth $9,344,000 after purchasing an additional 3,843 shares during the last quarter. 61.80% of the stock is currently owned by institutional investors.\nGet\nGet Rating\n) last posted its quarterly earnings results on Wednesday, November 16th. The computer hardware maker reported $0.34 EPS for the quarter, missing analysts consensus estimates of $0.44 by ($0.10). The company had revenue of $5.93 billion during the quarter, compared to analyst estimates of $5.82 billion. NVIDIA had a return on equity of 30.75% and a net margin of 20.85%. The companys revenue for the quarter was down 16.5% compared to the same quarter last year. During the same quarter in the previous year, the business posted $1.01 earnings per share.  On average, sell-side analysts anticipate that  NVIDIA Co. will post 2.19 EPS for the current year.\nNVIDIA Announces Dividend\nThe business also recently declared a quarterly dividend, which was paid on Thursday, December 22nd. Shareholders of record on Thursday, December 1st were issued a $0.04 dividend. This represents a $0.16 dividend on an annualized basis and a yield of 0.08%. The ex-dividend date of this dividend  was Wednesday, November 30th. NVIDIAs payout ratio is 6.81%.\nInsider Activity\nIn related news, CFO Colette Kress sold 10,741 shares of the firms stock in a transaction dated Thursday, January 26th. The shares were sold at an average price of $200.00, for a total transaction of $2,148,200.00. Following the transaction, the chief financial officer now directly owns 536,960 shares of the companys stock, valued at $107,392,000. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. In other NVIDIA news, Director Mark A. Stevens sold 60,000 shares of NVIDIA stock in a transaction dated Wednesday, December 21st. The shares were sold at an average price of $165.09, for a total value of $9,905,400.00. Following the sale, the director now owns 2,250,193 shares of the companys stock, valued at $371,484,362.37. The sale was disclosed in a legal filing with the SEC, which is accessible through this hyperlink. Also, CFO Colette Kress sold 10,741 shares of NVIDIA stock in a transaction dated Thursday, January 26th. The stock was sold at an average price of $200.00, for a total transaction of $2,148,200.00. Following the completion of the sale, the chief financial officer now directly owns 536,960 shares in the company, valued at approximately $107,392,000. The disclosure for this sale can be found here. Insiders sold 262,060 shares of company stock worth $43,817,257 over the last three months. 4.04% of the stock is currently owned by insiders.\nNVIDIA Profile\nGet Rating\n)\nNVIDIA Corp. engages in the design and manufacture of computer graphics processors, chipsets, and related multimedia software. It operates through the following segments: Graphics Processing Unit (GPU), Tegra Processor, and All Other. The GPU segment consists of product brands, including GeForce for gamers, Quadro for designers, Tesla and DGX for AI data scientists and big data researchers, and GRID for cloud-based visual computing users.\nRead More"
  },
  {
    "body": "Nvidias RTX 4090 Ti may be on the way, but do we really want it?\nBy\nJanuary 30, 2023 11:21AM\nShare\nNvidias most frequent leaker, kopite7kimi, just shared the specifications of a rumored RTX 4090 Ti GPU. Said to be even more powerful than the RTX 4090, Nvidias latest product would surely top any ranking of the best graphics cards.\nIt might not be the greatest GPU of this generation, though. Nvidia seems to have another ace up its sleeve that would defeat even the RTX 4090 Ti. But do we really want these two monstrous GPUs?\nRTX 4090 Ti\nJanuary 30, 2023\nThe successor to Nvidias RTX 3090 Ti pushes the specs even further than the RTX 4090 did. According to the Twitter tipster, the RTX 4090 Ti would come with 18,176 CUDA cores, meaning it would still be a cut-down version of the AD102 GPU (the full GPU has 18,432 cores). Compared to the RTX 4090, this means a core count increase, boosting the number by 1,792.\nThe memory module is also said to be upgraded to 24Gbps (versus 21Gbps on the RTX 4090), which equals a total bandwidth of 1,152GB/s. Kopite also teases a total board power (TBP) of 600 watts, but its hard to say whether this refers to the base board power or the maximum board power. It seems more likely that the GPU will simply allow a 600W power limit, much like the RTX 4090, due to the same shared 16-pin power connector. Thats right, the same one thats prone to melting.\nKopite7kimi is known for having accurately leaked many graphics cards in the past. While this still needs to be treated with a healthy dose of skepticism, its safe to assume there might be some merit to it, too  especially if you consider the fact that weve been hearing rumors of an RTX 4090 Ti for months now.\nWhenever wed hear about the RTX 4090 Ti, there was always the question of whether Nvidia might release a new Titan card instead. Weve heard whispers of a quad-slot GPU that could be the RTX 40 Titan, with telling hints of gold on the cooler design. Another leak, this time from MEGAsizeGPU on Twitter, seems to confirm the existence of such a card.\nThe Twitter user shared images of a massive Nvidia card equipped with the PG137 PCB. This is something Kopite has referred to in the past, calling the card the beast. The specifications dont quite add up if we assume that the RTX 4090 Ti will exist as well, though  both the GPUs are said to have 18,176 CUDA cores. On the other hand, the Titan GPU was said to feature a massive 48GB of 24Gbps GDDR6X memory; an unprecedented amount. Moreover, the total board power is said to sit at 800W, which is absolutely insane.\nThis is not what the market needs right now\nMEGAsizeGPU\nThese leaks are exciting, of course. We could potentially be getting not just the RTX 4090 Ti, but also the RTX 40 Titan, both of which would be intensely powerful. It does make one wonder, though  do we really need these graphics cards right now?\nThe $1,600 RTX 4090 is rarely sold at MSRP as things stand now. The $1,200 RTX 4080 serves as a good way to encourage more people to buy the RTX 4090, because the flagship is simply the better deal, despite being really expensive. Then, theres the RTX 4070 Ti, which trades blows with AMDs less-than-desirable RX 7900 XT.\nTo me it feels like the high-end portion of the market is rather saturated. We have plenty of beast GPUs in stock, and the RTX 4090 is beefy enough to carry every single game. Im not sure what the purpose of the RTX 4090 Ti or the RTX 40 Titan would be in a gaming scenario right now, aside from some serious future-proofing.\nWhat the market needs is more midrange GPUs that are still priced somewhat reasonably  the equivalent of the RTX 3060 and the base RTX 3070. These last-gen graphics cards are still selling well, and thats because theyre still sufficient, while current-gen stuff is priced through the roof.\nWill Nvidia launch both the RTX 4090 Ti and the RTX 40 Titan? It seems impossible, but the rumors seem to be pointing in that direction. However, it seems unlikely to happen anytime soon. It really does make more sense for Nvidia to focus on the more affordable cards before releasing more products that fall firmly within the ultra-high-end segment.\nToday's tech news, curated and condensed for your inbox\nSubscribe"
  },
  {
    "body": "Share to Linkedin\nNvidia's RTX 4090 is the undesputed king of the hill when it comes to gaming and is already a massive graphics card that can be tricky to fit in certain cases. However, if the latest leaked images are real, the RTX 4090 Ti could not only be bigger, but may have a radical new cooler design too.\nImages were posted on Twitter of the new GPU with a vertical stack of video outputs\nMEGAsizeGPU/@Zed__Wang\nThe vertical stack of ports is different to the horizontal stack with the RTX 4090, which suggests something different is going on with the actual heatsink and cooler design. For starters, this is a four-slot monster of a graphics card, with the RTX 4090 only requiring three slots as you can see below.\nThe RTX 4090 has three DisplayPort outputs and one HDMI output\nAntony Leather\nBelow, though, the cooler design appears to be completely different. This time, the cooler sits vertically on top of the graphics card's PCB, instead of sitting horizontally, This would suggest a narrower PCB, but this would also explain the four slots, allowing for a wider PCB to sit underneath.\nThe supposed RTX 4090 Ti cooler seems to suggest a vertical cooling arrangement, with the PCB\n... [+]\nWhere Housing Meets Health Care\nHow the graphics card would sit in your case could go two ways. If the PCB is flat then sitting against the cooler above and having the PCI bracket at the end as in the first photo would require a case with a vertical graphics card mount, but without a need for a PCI-E riser cable - the graphics card would slot directly into the motherboard.\nThe PCI bracket included in the rumored RTX 4090 Ti cooler photos suggests a vertically-mounted\n... [+]\ngraphics card\nMEGASIZEGPU/@ZED__WANG\nHowever, the new rotated cooler arrangement could use a PCB with an angled connector sitting at right angles to the rest of the PCB and allowing the cooler to sit normally in the case - just with a funky vertical PCB instead of one that sits level with the ports and PCI bracket.\nNvidia's GeForce RTX 4090\nAntony Leather\nNvidia is certainly no stranger to thinking outside the box when it comes to cooler designs, especially with its Founders Edition cards like the RTX 4090 above. However, there's one important design feature that the new PCB mounting might allow - a better-placed power connector.\nThe placement of the power connector has plagued its cards since the RTX 3000-series, with the side mount proving to be tricky to deal with in terms of cable tidying and building a clean-looking PC. as the PCB would sit next to the motherboard and if it has its own angled connector, could sit parallel to it, this might make hiding the power cables easier. At the very least it shows that Nvidia is considering a different PCB design, and with that, hopefully a better-placed power connector.\nFollow me on"
  },
  {
    "body": "kopite7kimi\nfor the RTX 4090 Ti. Plus, the photos of the Titan card come from the appropriately named MEGAsizedGPU. On the Ada Lovelace flagship GPU, it was previously leaked that Nvidia had come very far in developing this GPU prior to launch. It seems it wanted to have it in its back pocket in case AMDs RDNA3 GPUs took it by surprise. Way back in May of last year, we saw part of the cooler, which bore an RTX 4090 Ti engraving on it.\n(Image: Chiphell forums)\nThe new flagship Ada card will offer higher clocks, more CUDA cores and L2 cache, and faster memory than the current RTX 4090. CUDA count will go from 16,384 to 18,176. Thats an 11% increase over the existing GPU. Memory capacity will remain at 24GB, but Nvidia will swap out the existing 21Gb/s chips in favor of faster 24Gb/s Micron dies. L2 cache will be modestly bumped from 72MB to 90MB. Boost clocks will probably approach 3GHz or so. The leaker says these improvements nudge board power up to 600W. However, its unclear if thats the absolute maximum when overclocked or not. It is not credible that these additions would add 150W to the cards power consumption.\nAs far as the Titan card goes, this GPU has been discussed previously but was rumored to be cancelled. It was said at the time that it was just sucking up too much power, making it too impractical. However, new photos have emerged showing an unusual cooling design. This lends credence to the notion that Nvidia is far along in its development. However, whether it releases it is still an open question. The new photos from MEGAsizedGPU show a bracket with vertically stacked output connectors. Weve never seen anything like it before, and it indicates it would have a novel vertical PCB.\nThe cooler for the Titan class is so big it has to go next go the PCB instead of being under it. (Image: @\nMEGAsizedGPU\n)\nAs far as specs go, nothing has changed since the last time it was leaked. Its still being reported as an outlandish quad-slot, 800W GPU. Thats especially true since the new 16-pin ATX 3.0 power cable can only provide 600W in a single cable. We suppose Nvidia could put two of them on the GPU as shown in a previous leak. The card will sport 18,176 CUDA cores and 48GB of 24Gb/s G6X memory. This card was previously referred to as the beast, which is a fitting title.\nIts unclear if Nvidia will release either of these GPUs as it really has no reason to given what AMD is offering. However, we could see Nvidia launching the Titan card if only to satisfy that audience. The previous RTX Titan card is from the Turing era, so its quite long in the tooth. Nvidia also might be saving these huge dies for its even-pricier data center cards.\nNow read:"
  },
  {
    "body": "(Image credit: Nvidia)\nAudio player loading\nNvidias RTX 4060 and 4050 desktop graphics cards  the Lovelace GPUs which are of keenest interest to most people given their (hopefully) affordable nature  could arrive sooner than expected.\nToms Hardware\n(opens in new tab)\nspotted that RTX 4060 and 4050 models from Shangke Group  a Chinese firm that makes graphics cards, and other components too  have been filed with the EEC (Eurasian Economic Commission).\nTypically, products are filed with the EEC when their release is nearing, so this is a hint that the RTX 4060 and 4050 are perhaps closer to launch than the rumor mill has otherwise indicated.\nThen again, we have to be very cautious around presuming too much from EEC filings, as they can be carried out early in some cases, or they can even be performed speculatively for placeholder products.\nIn short, dont set too much store in these listings, but they are nonetheless a tantalizing hint that we could see the RTX 4060 and 4050 desktop graphics cards pop up in the near future (or indeed wed settle for one of these GPUs being pushed out soon-ish).\nAnalysis: Reasons to be doubtful\nThe case against the appearance of the RTX 4060 and 4050 being anytime soon is mostly based on the lack of chatter about these models on the GPU grapevine thus far (when product development is further down the line, there are generally leaks and rumors).\nThat said, we have actually been hearing a bit more about the RTX 4060 Ti recently  a decent bit, actually, though its not the news many want to hear in terms of how powerful this GPU might be. But as for the vanilla RTX 4060, most of the speculation has been around how long we might have to wait for this graphics card  like the middle of 2023, possibly.\nPlus we also need to consider that Nvidia still has RTX 3000 series stock to sell through (or its partners do), and therefore any mid-range release is going to have to wait until the inventory of GPUs like the RTX 3060 is considerably diminished.\nFurthermore, weve heard pretty much nothing about the RTX 4050, save for news on the laptop GPU. Of course, both the RTX 4050 and 4060 laptop versions have been revealed and are about to go on sale in portables, but those mobile graphics cards are very different kettles of fish from the desktop variants.\nTo sum up, were not buying the idea that the RTX 4060 and 4050 are in any way imminent, but we are certainly happy enough to take this as a tentative signal that maybe at least one of these cards  the RTX 4060, most likely  is going to pitch up perhaps in a few months time (and maybe the 4060 Ti, too). If were lucky. And indeed a lot may depend on how the GPU market fares in general in terms of getting rid of that RTX 3000 stock, regardless of what Nvidia may have planned right now, and might have told its manufacturing partners to expect.\nTodays best graphics card deals\n(opens in new tab)"
  },
  {
    "body": "0\nFILE - (AP Photo/Mark Lennihan, File)\nJust last week the Washington Free Beacon reported that former Speaker of the House Nancy Pelosi and her husband Paul may have used privileged information to cut their losses in the stock market.\nFinancial disclosure filings that Nancy submitted to the House Ethics Committee revealed that Paul sold 30,000 shares of Google worth approximately $3 million between Dec. 20 and Dec. 28.\nA month later, on Jan. 24, 2023, the Justice Department and attorneys general from eight statesincluding Pelosis home state of Californiasued Google for monopolizing digital advertising technologies via serial acquisitions and engaging in other anti-competitive practices.\nThe lawsuit may compel Google to break up into smaller units and have other restrictions instituted.\nThe news of the lawsuit caused the price of Googles stock to plummet by 6 percent.\nThis trade is the latest in a string of questionable transactions by the Pelosi couple.\nA Washington Free Beacon analysis revealed that the Pelosi couple have seen their fortune grow to $140 million since 2008, due to Pauls stock trades.\nPelosis stock market charades have sparked calls for tougher regulations on members of Congress cashing in on their positions of power.\nA House Speakers disclosure report from last year revealed that Paul invested $5 million in 20,000 shares of NVIDIA, a firm known for designing and manufacturing graphics-processing chips.\nThe Daily Caller revealed that Pauls stock purchase was prior to a vote on a bill that would deliver massive grants, subsidies, and tax credits to chip manufacturing.\nClearly, Speaker Pelosi was aware of the contents of the bill and the fact that it was heading for a vote in the Senate.\nPaul and Nancy saved roughly $600,000 in June by selling shares of microchip maker NVIDIA weeks before the U.S. government placed restrictions on the companys business in China and Russia.\nBack in 2021, Paul made over $5 million after trading stocks in Google parent company Alphabet Inc, Amazon, and Apple, prior to the House Judiciary Committees vote to advance five antitrust bills against the tech giants.\nPaul is not the only offender.\nLawmakers from both parties invested in sectors whose importance was elevated following the COVID-19 pandemic. They also sold investments from sectors adversely affected by the pandemic. Their investments were obviously based on prior knowledge of the emergency bills scheduled to be passed during the pandemic.\nBusiness Insiders Conflicted Congress investigation report from December 2021 revealed dozens of STOCK Act violations, numerous potential conflicts of interest driven by lawmakers stock holdings, and measly enforcement of anti-insider trading rules.\nForty-nine members of Congress and 182 senior congressional staffers were found to have violated laws aimed at preventing insider trading, but they received no punishment.\nWhat happens beyond D.C.?\nA Netflix employee was sentenced to 14 months in prison and $10,000 in fines for insider trading, while the husband of a former Amazon employee was sentenced to 26 months in prison for the same offense.\nIn 2004, Martha Stewart was sentenced to five months in prison and two years of supervised release along with $30,000 in fines for similar offenses.\nThe laws do not apply to those who make the laws.\nSo what is being done to combat this?\nLast September, House Democrat Rep. Abigail Spanberger of Virginia and GOP Rep. Chip Roy of Texas introduced a bill that banned members of Congress and other government officials, including Supreme Court justices from owning or trading stocks.\nBut the vote on the bill was delayed, by then-House Majority Leader Steny Hoyer, known to be a close Pelosi ally. The excuse for the postponement was that there was not enough time to read the 26-page bill.\nThe same House passed an omnibus spending bill last December that runs into 4,155 pagesm in a matter of hours.\nPelosi, who initially rejected the idea of a stock trading ban, claimed to have had a change of mind. But instead of simply supporting Rep. Spanbergers bill, Pelosi engaged in the usual skulduggery and subterfuge to kill the legislation.\nSo why should elected leaders and other government officials be banned from trading?\nShouldnt every individual regardless of the organization they work for be allowed to invest as they please in a free market economy?\nA free market economy works only when it is grounded in fairness.\nThe stock markets are fair only when all potential investors have identical access to the same information and some among them apply acumen to reap profits.\nGovernment officials both elected and unelected, often have access to information about actions to be taken by the government or laws to be passed that could affect certain sectors of business. Engaging in trade after this prior knowledge gives them an unfair advantage and is tantamount to abuse of office.\nIn light of the ongoing failure of even laws to police them, they must now refrain from misusing their position in government to reap profits.\nThey are always free to resign from their positions and dedicate their lives to making millions in the stock market.\nBut hope for fairness may be on the way.\nGOP Sen. Josh Hawley from Missouri recently introduced the Preventing Elected Leaders from Owning Securities and Investments Act also aptly named the PELOSI Act.\nThe goal behind the act is to prohibit members of Congress and their spouses from holding, acquiring, or selling stocks or equivalent economic interests during their tenure in elected office.\nHawley said the following:\nFor too long, politicians in Washington have taken advantage of the economic system they write the rules for, turning profits for themselves at the expense of the American people.\nAs members of Congress, both Senators and Representatives are tasked with providing oversight of the same companies they invest in, yet they continually buy and sell stocks, outperforming the market time and again.\nThere are some major challenges to the bill.\nPassing it through the House and Senate and getting signed by Biden is not going to be easy. There must be numerous rogue lawmakers in both parties who will be keen to kill the bill.\nIt will take some astute stewardship from House Speaker Kevin McCarthy and other leading members of the House to pass the bill. The previously failed legislation aimed to prevent insider trading by government officials had 71 co-sponsors, from MAGA Republican Rep. Matt Gaetz of Florida to squad member Rep. Ilhan Omar of Minnesota. Hence, there may be scope for bipartisanship here.\nWill Senate Majority Leader Chuck Schumer and Minority Leader Mitch McConnell lead the way to get the bill passed in the Senate, and most importantly, will Joe Biden sign the bill to make it a law?\nExperience would suggest that we dont hold our breath for that to occur.\nIf by some miracle the bill is passed, the challenge is to ensure that these laws and other existing laws are enforced to punish the offenders.\nS"
  },
  {
    "body": "Print\nA Chinese nuclear research and development lab has gained access to U.S.-made semiconductors even though such institutions have been banned from making similar technological procurements for more than two decades.\nThe China Academy of Engineering Physics (CAEP), a state-run institution that focuses on the testing, development, and research of nuclear weapons and related sciences, has successfully obtained semiconductors made by Nvidia and Intel since 2020 despite that the entity has been on a U.S. export blacklist since 1997,\nThe Wall Street Journal reported\n. CAEP is said to have bought sophisticated American chips at least 12 times during the past two-and-a-half years.\nMost of the chips acquired by CAEP were in the sizes of 7 to 14 nanometers, which China struggles to mass produce. However, these chips can be bought on the open market, even from online marketplaces.\nA review of CAEP papers showed that at least 34 of them referenced using U.S. semiconductors in research. In at least seven of these instances, the research carried out could be linked to the maintenance of nuclear stockpiles.\nIn six papers, researchers discussed using chips to improve the operation of inertial confinement fusion devices that use high-powered lasers to trigger fusion reactions similar to what happens on a bigger scale when using thermonuclear weapons.\nIn 2017, Beijing-based Institute of Applied Physics and Computational Mathematics, an affiliate of CAEP, admitted that Intel chips played a critical role in Chinas supercomputer Tianhe-2. The machine was used by China to perform calculations related to nuclear explosions.\nLimiting Chip Sales to China\nAccording to Nvidia, the semiconductors that were used by CAEP in their research were general-purpose chips that can also be found in personal computers. As millions of computers are sold annually, its difficult to trace each component, the company claimed.\nAs mass-market products move through multiple parties in global supply chains, full visibility on ultimate end users is a large undertaking, the U.S. Department of Commerce said, according to the Journal. The agency will seek to vigorously enforce the updated export regulations that Washington introduced in October 2022, it added.\nA close-up of a silicon wafer on display at Taiwan Semiconductor Research Institution in Hsinchu, Taiwan, on Sept. 16, 2022. (Annabelle Chih/Getty Images)\nLast October, the U.S. government issued new export controls that block U.S. companies from selling advanced semiconductors, and the equipment used to manufacture them, to some Chinese manufacturers unless a special license is obtained. In December, the government expanded these restrictions to apply to 36 more Chinese chip makers.\nWashington has also effectively prohibited U.S. citizens from supporting the production or development of chips covered under the restrictions. U.S. nationals who participate in Chinese chip-related companies will either have to quit their jobs or give up citizenship.\nThe day the ban came into effect, hundreds of Chinese Americans who worked in semiconductor companies in China were said to have resigned from their posts.\nThese measures are likely to be just the beginning for the U.S. government. If these measures are extended to other fields such as finance, biotechnology, etc., it will really become a headache for the CCP. That is the U.S.China decoupling is really happening, Chiou Jiunn-Rong, an economics professor at National Central University in Taiwan, told The Epoch Times in October.\nMeanwhile, a report published by the Center for Security and Emerging Technology at Georgetown University last year found that the Chinese military is making significant progress in adapting artificial intelligence to warfare and related technologies.\nOut of the 66,000 public contracts issued by the Chinese Peoples Liberation Army, analyzed by the report, 24 were about the purchase of high-end chips used for AI applications. Almost all of them were found to be made by U.S. manufacturers.\nEU Support in Restricting China\nLast week, a senior European Union trade official said that the region shares Americas goal of keeping Chinas semiconductor industry in check.\nWe cannot allow China to access the most advanced technologies, be they in semiconductors, quantum, cloud and edge, AI or connectivity, Thierry Breton, the EUs internal-market commissioner, said during a speech at the Center for Strategic and International Studies in Washington on Jan. 27.\nIn Europe, we fully agree with the objective of depriving China from the most advanced chips. And the same goes for quantum technologies.\nThe EU is expected to pass the European Chips Act this year with the aim of boosting the regions semiconductor manufacturing industry. It hopes to raise Europes current share of global chip production capacity to about 20 percent, which is double the present share.\nEpoch Share"
  },
  {
    "body": "Monday, January 30, 2023, 10:05 AM EDT\nComments\nThe GeForce RTX 4090 has no rival at the very top of the Mount Olympus of gaming GPUs, though the same could have once been said about the previous generation GeForce RTX 3090. If history is any indication, though, an upgraded \"Ti\" model will eventually emerge. As we wait, pictures of the beastly GPU's supposed Founders Edition cooling shroud have found their way to the web, along with some leaked specifications.\nBefore we get to the upcoming model, let's recap the existing GeForce RTX 4090's specs. NVIDIA's flagship card is based on its AD102 GPU (\nAda Lovelace\n) with 16,384 CUDA cores, 512 texture mapping units (TMUs), 176 render output units (ROPs), 512 Tensor cores, 128 RT cores, 72MB of L2 cache, and 24GB of GDDR6X memory (21Gbps) linked to a fat 384-bit memory bus. The card's rated power draw is 450W, with a maximum power limit of 600W.\nIt sits at the top of the GPU heap, but perhaps not for long. Pictures of a supposed Founders Edition cooler design for a GeForce RTX 4090 Ti or Titan card have broken cover. Assuming they're realand some prominent leakers say they arethis card will occupy four PCIe slots due to its massive girth.\nMEGAsizeGPU posted a couple of pictures on Twitter, as shown above, to which notable leaker @harukaze5719 commented, \"Confirmed. Nice job!,\" complete with a heart-filled smiling emoji.\nSource: Chiphell via @9550pro\nThe fresh set of photos follow some slightly older ones that were posted to Chiphell back in October. That post has since been removed, though they remain uploaded to Twitter courtesy of @9550pro, another popular leaker in the Twittersphere.\nThere's some debate over whether the upcoming card will be billed as a GeForce RTX 4090 Ti or if it will revive the Titan branding. According to @kopite7kimi (yet another reputable Twitter with a nose for sniffing out leaks), NVIDIA is working on a GeForce RTX 4090 Ti (PG136/139-SKU310) with 18,176 CUDA cores, 96MB of L2 cache, and 24GB of GDDR6X memory (24Gbps), with a max power draw also set at 600W.\nMeanwhile, @harukaze5719 reckons NVIDIA's next flagship card will actually debut as a Titan part with GDDR6 memory supporting error correcting code (ECC), rather than a GeForce RTX 4090 Ti with GDDR6X memory chips. Either way, if the leaked photos and other rumored specs are any indication, this is going to be absolute beast for both gaming and content creation chores.\nAs for pricing, we can only guess at this point. The GeForce RTX 4090 carries a $1,599 MSRP, so a Ti or Titan model will obviously be somewhere north of that (barring a round of price cuts). NVIDIA's also been known to throw last-minute curveballs, in terms of the specs and features, so we'll have to wait and see what actually emerges. We could be looking at a $1,999 or even $2,499 MSRP."
  },
  {
    "body": "January 30, 2023\nTo name them, the last graphics driver that was actually released for the RDNA 2-based Radeon RX 6000 series graphics cards was the 22.11.12 which was made for a November release. Then, AMD's Radeon RX 7900 graphics cards launched in December, and guess what? All four graphics drivers, 2 in December and two in January (2023) have been exclusive to the RDNA 3 architecture. These are the driver releases over the past two months:\nAMD Radeon Software 23.1.2 (RX 7900 Only) - 24th January\nAMD Radeon Software 23.1.1 (RX 7900 Only) - 12th January\nAMD Radeon Software 22.12.2 (RX 7900 Only) - 21st December\nAMD Radeon Software 22.12.1 (RX 7900 Only) - 13th December\nAMD Radeon Software 22.11.2 (RX 6000) - 1st December\nOne can understand why AMD has decided to cut off its driver efforts for the RDNA 2 GPU-based Radeon RX 6000 series graphics cards since their Radeon RX 7000 series based on the new RDNA 3 graphics core requires more attention and the recent drivers show that their are several known issues that still need to be addressed for the new cards. But that also means that for each driver release, AMD will have to work twice as much to get the same support added for older Radeon RX 6000 (RDNA 2) graphics cards. This doesn't sound like the FineWine that AMD is known for.\nForspoken is just one title and if this continues to be the trend, there will be many other titles that the RDNA 2 GPUs will miss out on. AMD's Radeon RX 6000 & 7000 GPUs have only received 4 game support since December which includes:\nThe Callisto Protocol\nThe Witcher 3: Wild Hunt Next-Gen Update\nForspoken\nMeanwhile, NVIDIA has included the following game-ready titles to its list of WHQL GeForce drivers since December:\nMarvel's Midnight Suns (DLSS 3)\nHitman III (DLSS 3)\nDeliver Us Marks (DLSS 3)\nDead Space\nThe Witcher 3: Wild Hunt Next-gen Update\nJurrasic World Evolution 2\nThe Callisto Protocol\n2 of 9\nNVIDIA not only has 3 times more games supported on their driver suite since December but the company hasn't left out its older GPUs either. The drivers are compatible with both RTX 30 & RTX 20 series graphics cards and many older GPUs too. There's not just the thing about having game-ready support for new titles but there are also various issues still affecting the Radeon RX 6000 GPUs that need to be resolved as was indicated by AMD themselves during the November GPU driver release. We hope that AMD delivers its next driver with both RDNA 3 and RDNA 2 support.\nAre you fine with AMD not releasing a graphics driver update for your RDNA 2 (RX 6000) GPU since 2 months?\nYes"
  },
  {
    "body": "January 30, 2023\nSee more\nThe leaker believes the current plan is for the revamped flagship GPU to run with 18,176 CUDA Cores, along with 24GB of GDDR6X VRAM (running at 24Gbps), and a total board power usage of around 600W. The 4090 Ti is also set to use the same board as the RTX 4090, which would be no great surprise.\nThis combines with another rumor from the weekend in which a second leaker on Twitter,\nMEGAsizeGPU\n(opens in new tab)\n, posted what is supposedly an image of the RTX Titan, which if correct will be a huge four-slot GPU that pushes power usage up to 800W (using the same AD102 GPU, but doubling up the video memory of the RTX 4090 to 48GB, no less).\nAnalysis: A robust upgrade from the RTX 4090, perhaps  but at what cost?\nNote that the mentioned 800W for the rumored RTX Titan is the maximum board power, not the rated TGP. Remember, the RTX 4090 has a TGP of 450W, but can be pushed further than this  up to 600W is the max power limit, at least with the Founders Edition (from Nvidia itself) and some third-party cards. So the RTX 4090 Ti will remain the same in this respect.\nIf there are RTX 4090 Ti and RTX Titan models coming, then maybe the Titan will differentiate itself with the full-fat core count for the AD102 chip, which is 18,432, slightly more than the rumored 18,176 CUDA Cores for the 4090 Ti here; and that would make sense. Although past rumors (from some time back, admittedly) have pegged the theoretical Titan with 18,176 cores (and weve heard nothing since to indicate this isnt the case).\nIn the past, though, there seems to have been quite a bit of confusion about where Nvidia might go with a Lovelace model that sits on top of the RTX 4090. Some time ago, we heard rumors about a 4090 Ti, and then that it was perhaps canceled, and then that it might actually be an RTX Titan.\nRather than trying to pick which route to go with a range-topping AD102-powered graphics card, though, it seems Nvidia may actually now be preparing to push out both an RTX 4090 Ti and an RTX Titan. Of course, multiple pinches of salt are required with that idea\nWe dont get any clues in terms of what release timeframe Nvidia might be looking at, but that could well be wrapped up in how threatened Team Green feels by AMDs RDNA 3 graphics cards. And right now, Nvidias RTX 4090 is not threatened by the RX 7900 XTX which is leading the charge for RDNA 3 (and compares more to the RTX 4080, broadly, rather than the 4090).\nHow much faster will the RTX 4090 Ti be than the current Lovelace flagship GPU? Well, the CUDA Core increase is 1,792, which isnt massive. However, we should remember that on top of this, its theoretically faster VRAM (24Gbps according to the leaker, versus 21Gbps for the 4090) could further pep performance  and clock speeds might (and likely will) be upped slightly with the Ti variant.\nSo, can we hope for maybe a 15% performance increase with the 4090 Ti, or something in that order? Perhaps, though thats likely a best-case scenario, and besides, the likely catch is that pricing will witness a bigger leap. The widely anticipated cost of the 4090 Ti is $2,000 (around 1,600, AU$2,800), or in other words, 25% dearer than the RTX 4090, compared to a 15% performance uptick.\nIn short, were expecting the overall value proposition of the 4090 Ti to be somewhat inferior to the 4090, and really, thatd hardly be a surprise given Nvidias form with premium graphics cards right now.\nTodays best graphics card deals\n(opens in new tab)"
  },
  {
    "body": "@kopite7kimi\n, this product will use the AD102 graphics processor in a nearly full configuration, and it will consume up to 600W of power.\nAccording to tweeted details, the Nvidia's GeForce RTX 4090 Ti modelPG136/139-SKU310features AD102 GPU with18,176CUDA cores, a96M L2cache and a 384-bit memory bus. Unlike the professional and datacenter-oriented\nRTX 6000 Ada Generation graphics card\nwith 48GB of memory  which uses the AD102 in a similar configuration  the product aimed at gamers and prosumers will 'only' carry 24GB of GDDR6X memory, with a 24 GT/s data transfer speed, which is enough for all games, at least for now.\nSwipe to scroll horizontally\n8GB 256-bit 14 GT/s GDDR6\n220W\n$499\nPower consumption of the new flagship graphics card from Nvidia will be up to 600W, according to the leaker, so expect it to feature an extremely sophisticated cooling system. In fact, it is logical to expect at least some of Nvidia's board partners to ship their GeForce RTX 4090 Ti versions with hybrid closed-loop cooling systems.\nNote that the AD102 GPU has 18,432 CUDA cores in total, so the GeForce RTX 4090 Ti will use almost all of them. At the moment, we are unsure whether Nvidia plans to ever use AD102 with all of its stream processors enabled, since it's likely tough to find enough perfect GPUs with all cores working properly at high clock speeds.\nIt also remains to be seen how much Nvidia will charge for the GeForce RTX 4090 Ti. Keep in mind that the GeForce RTX 4090 is currently the world's\nbest graphics card\nfor gaming, and that has no direct rivals. So it's very likely that the GeForce RTX 4090 Ti will be more expensive than the current flagship (which often sells for more than $2,000). We can only wonder how much will the Titanium variant is set to cost. But unless you're a professional user who can use a card like this in place of a much pricier option like the RTX 6000, it's unlikely you'll find the RTX 4090 Ti's street price all that appealing.\nBe In the Know"
  },
  {
    "body": "Click to share on Twitter (Opens in new window)\nLockheed Martin and high-tech company NVIDIA are teaming up to create a digital replica of the earth based on data from around the globe and space about the planets conditions. The work is for the National Oceanic and Atmospheric Administration, which wants to blend, analyze and centralize the huge volumes of information it receives. (Rendering provided by NVIDIA)\nBy Judith Kohler | jkohler@denverpost.com | The Denver Post\nJanuary 30, 2023 at 6:00 a.m.\nAn environmental slogan says there is no planet B. But what if there were a planet D, as in a digital twin of Earth that would produce a real-time picture of the environment with data from around the globe and space, one that scientists could use to detect patterns and track climate change?\nThats what\nNational Oceanic and Atmospheric Administration.\nInstead of trying to absorb gigabytes or terabytes of data streaming from satellites, weather stations and buoys and looking at different websites, the goal is to synthesize the information, use artificial intelligence to analyze it and create a digital replica of the Earth that can be accessed in one place.\nThey have all of this data coming in from all of these different sources and what they were really looking for was a kind of one-stop shop, said Lynn Montgomery, a senior research scientist with Lockheed Martin Space in Jefferson County and head of Lockheeds team on the project.\nNOAA asked for proposals to develop a centralized monitoring system. Lockheed won a $3 million contract to produce a prototype that fuses all the incoming data on sea surface, just one of the five major systems that NOAA monitors.\nThe other systems are land, the atmosphere, space weather and the cryosphere, which includes sea and lake ice, glaciers and snow cover.\nLockheed is working with NVIDIA, based in Santa Clara, Calif., to create a multidimensional image that will be updated continually with new data.\nWere giving them a visual basis of all of that insane amount of data coming in, Montgomery said.\nNow, NOAA staffers have to look at a series of websites fed by different sources to get a holistic view of conditions, she added.\nThe system should also flag anomalies in the information for scientists.\nWe have a huge increase in the volume and diversity of the environmental data and its expected to be even more in the future, said Sid Boukabara, a principal scientist at NOAA in the Washington, D.C., area.\nFor instance, more and more satellites that beam back data and images are being launched, Boukabara said. Even for each satellite, you have different sensors and for each sensor we have different products being generated.\nBy creating this digital replica of the Earth environment, were hoping to be able to streamline the handling of the environmental observations and to include nontraditional observations, from citizens, Boukabara added.\nIf the prototype is successful, Boukabara said NOAA hopes to eventually use the observations to make predictions, be it a few weeks from now or a few decades from now. The accuracy of  predictions relies on the accurate knowledge of current conditions, he said.\nOnce you do the monitoring and hook that to a predictive mechanism to project the state of the Earth into the future timescale, Boukabara continued, then you can start doing the what-if scenarios: what would be the state of the fire situation or extreme weather events or hurricane intensity.\nLockheed Martin and NVIDIA are collaborating on a project to provide more timely information about weather and land conditions to agencies dealing with huge wildfires driven by drought and a warming climate. Lockheed Martin staffers have flown on planes used by the Colorado Division of Fire Prevention and Control to see if the companys technology can speed up the analysis and transmission of data to crews on the ground.\nThe work with NOAA is another case where the companies are building a real-time monitoring system to enable users to prevent or predict events, said Dion Harris, lead product manager of accelerated computing at NVIDIA.\nThe scale of what were doing with NOAA is very unique and will require a new set of techniques and (data) pipelines to help develop this, Harris said. This is really sort of groundbreaking in terms of building a digital twin on this scale.\nLockheed Martin and NVIDIA will use their existing systems and technologies to blend incoming data. Theyll use artificial intelligence and machine learning to take in, fuse and format observations from multiple sources.\nThe data will be converted into a visual image using a process called Universal Scene Description, which was originally developed by Pixar Animation Studios. Another tool is NVIDIAs Omniverse Nucleus, which will enable data-sharing between researchers.\nHarris said the information will be available in four dimensions: height, depth, width and time. The model will show the sea-surface conditions over two weeks.\nThe plan is to allow users to click on the image, zoom in and out and call up data, such as line graphs.\nRelated Articles\nWhile NVIDIA and Lockheed Martin have cutting-edge technology to build the Earth-monitoring system, Harris expects the companies to have to develop some tools along the way.\nWhats an exciting part is that were really sort of creating new technologies, new workflows, Harris said.\nMontgomery with Lockheed said creating an Earth replica using the sea-surface temperatures will take about a year. Importing data on land, space weather and the other systems will follow.\nThe high-tech industry is leveraging similar techniques to develop digital twins of factories, molecular systems and using similar technology in self-driving cars and other products, Harris said.\nIt will be really interesting to see how these techniques are being brought to bear to solve a problem we all care about, which is understanding the world around us."
  },
  {
    "body": "A rumor has surfaced about NVIDIA RTX 4090 Ti specifications\nQuick update on RTX 4090 Ti specs shared by Kopite7kimi himself.\nIt looks like were getting closer to NVIDIA providing faster RTX 40 graphics cards.  Just a couple of days ago, a new leak confirmed that NVIDIA is working on a\n800W TITAN GPU\nIt will probably come with 48 GB of memory.  Today we learn that the TITAN and the RTX 4090 Ti must actually be two different models after all.\nAccording to Kopite, the RTX 4090 Ti will feature a stripped-down AD102 GPU with 18,176 cores (1,792 more than the RTX 4090), memory upgraded to 24Gbps and a TBP of 600W.  The last part isnt entirely clear if that refers to TDP, TGP, or simply the boards maximum power.  In any case, it may simply be the highest power of a virtual board (450W+), while the maximum configurable power is the same as on the RTX 4090 Ti (600W).  This is the maximum power for a single conductor of 16.\nRTX 4090 Ti\nFinal Fantasy 16 is in the \"final stages of development\"\nIts no secret that NVIDIA has been planning this card for a long time now.  One of the first things leaked before the RTX 40s launch was this piece of hardware from the new, cooler design, something that was later used for the RTX 4090 non-Ti model instead.\nKopite does not confirm when this card will be issued.  In fact, there seems to be no reason to launch a new Ti flagship now at all.  On the other hand, NVIDIA is now expected to have a keynote address for GTC in March, which would have been a good place to announce a new TITAN.\nRumored specifications of the NVIDIA GeForce RTX 40 series\nVideoCardz.com"
  },
  {
    "body": "Hot Stocks\nHost Hotels & Resorts Inc. (NASDAQ:HST)\nwent up by 1.58% from its latest closing price compared to the recent 1-year high of $21.36. The companys stock price has collected 5.79% of gains in the last five trading sessions. The Wall Street Journal reported on 02/16/22 that Roblox, Nvidia, Airbnb, ViacomCBS: What to Watch in the Stock Market Today\nIs It Worth Investing in Host Hotels & Resorts Inc. (NASDAQ :HST) Right Now?\nHost Hotels & Resorts Inc. (NASDAQ:HST) scored a price-to-earnings ratio above its average ratio, recording 16.56 x from its present earnings ratio. Plus, the 36-month beta value for HST is at 1.30. Opinions of the stock are interesting as 10 analysts out of 22 who provided ratings for Host Hotels & Resorts Inc. declared the stock was a buy, while 5 rated the stock as overweight, 5 rated it as hold, and 1 as sell.\n5 Best Growth Stocks To Own For 2023.\nSponsored\nThe average price from analysts is $20.89, which is $2.26 above the current price. HST currently public float of 706.78M and currently shorts hold a 4.90% ratio of that float. Today, the average trading volume of HST was 6.83M shares.\nHSTs Market Performance\nHST stocks went up by 5.79% for the week, with a monthly jump of 16.76% and a quarterly performance of 4.24%, while its annual performance rate touched 10.66%. The volatility ratio for the week stands at 2.21% while the volatility levels for the past 30 days are set at 2.43% for Host Hotels & Resorts Inc. The simple moving average for the period of the last 20 days is 10.30% for HST stocks with a simple moving average of 5.37% for the last 200 days.\nAnalysts Opinion of HST\nMany brokerage firms have already submitted their reports for HST stocks, with Morgan Stanley repeating the rating for HST by listing it as a Equal-Weight. The predicted price for HST in the upcoming period, according to Morgan Stanley is $20 based on the research report published on December 05th of the previous year 2022.\nOppenheimer, on the other hand, stated in their research note that they expect to see HST reach a price target of $21. The rating they have provided for HST stocks is Perform according to the report published on September 15th, 2022.\nWells Fargo gave a rating of Overweight to HST, setting the target price at $21 in the report published on August 29th of the previous year.\nHST Trading at 7.97% from the 50-Day Moving Average\nAfter a stumble in the market that brought HST to its low price for the period of the last 52 weeks, the company was unable to rebound, for now settling with -12.77% of loss for the given period.\nVolatility was left at 2.43%, however, over the last 30 days, the volatility rate increased by 2.21%, as shares surge +17.61% for the moving average over the last 20 days. Over the last 50 days, in opposition, the stock is trading +2.99% upper at present.\nDuring the last 5 trading sessions, HST rose by +5.79%, which changed the moving average for the period of 200-days by +4.37% in comparison to the 20-day moving average, which settled at $17.04. In addition, Host Hotels & Resorts Inc. saw 16.07% in overturn over a single year, with a tendency to cut further gains.\nInsider Trading\nReports are indicating that there were more than several insider trading activities at HST starting from TYRRELL NATHAN S, who sale 10,707 shares at the price of $21.00 back on Jun 07. After this action, TYRRELL NATHAN S now owns 379,285 shares of Host Hotels & Resorts Inc., valued at $224,847 using the latest closing price.\nRAKOWICH WALTER C, the Director of Host Hotels & Resorts Inc., sale 3,290 shares at $19.61 during a trade that took place back on May 20, which means that RAKOWICH WALTER C is holding 53,083 shares at $64,517 based on the most recent closing price.\nStock Fundamentals for HST\nCurrent profitability levels for the company are sitting at:\n-5.74 for the present operating margin\n-2.32 for the gross margin\nThe net margin for Host Hotels & Resorts Inc. stands at -0.38. Equity return is now at value 12.10, with 6.70 for asset returns."
  },
  {
    "body": "Jan 30, 2023 05:42 AM EST\n\nCopy Shortlink\nSpecifications of NVIDIA's GeForce RTX 4090 Ti graphics card have once again been revealed by Kopite7kimi which show vastly different specs than the Titan variant that is also reportedly in the works.\nNVIDIA's GeForce RTX 4090 Ti Graphics Card Rumored To Feature 11% More Cores Than RTX 4090 & Faster GDDR6X Memory\nThe NVIDIA GeForce RTX 4090 Ti graphics card has been rumored for a long time but according to the latest information, it looks like the card is a whole different entity. Previously, it was expected that the card was going to be branded as another Titan product but this specific variant is clearly going to be used by the GeForce RTX family while the possibility of the Titan variant still exists. It's due to the fact that the GeForce RTX 4090 Ti is expected to be based on the PG136/139-SKU310 & the Titan RTX \"Ada\" is expected to be based on the PG137 SKU.\nJanuary 30, 2023\nStarting with the specifications, the NVIDIA GeForce RTX 4090 Ti is rumored to feature a slightly cut-down AD102 GPU. That's 256 fewer cores than the full configuration which includes 18,432 cores. It packs 18,176 cores which is an 11% increase in cores over the RTX 4090, 96 MB of L2 cache which is a 33% increase over the RTX 4090, and 24 GB of GDDR6X memory. While the memory capacity still remains the same as the RTX 4090, the bandwidth will see a major boost.\nCompared to the 21 Gbps dies featured on the RTX 4090, the NVIDIA GeForce RTX 4090 Ti might be packing 24 Gbps dies. This is going to provide a bandwidth of up to 1.15 TB/s, an increase of 150.0 GB/s over the Non-Ti variant. The TBP of the card is also lower than the 800W monster the Titan is going to be. It is expected to be around 600W but does note that this is the board power and not the TGP which might be lower.\nA single 16-Pin 12VHPWR connector should be enough to feed the reference design but it looks like custom models may have to rely on dual 16-pin connectors or restrict their clock speeds to meet a conservative 600W power limit to allow for single connector designs. As for the cooling solution, we can expect to see the standard flow-through design for this variant but in a much heftier graphics card heatsink package that covers quad slots.\nThere's no word on when the NVIDIA GeForce RTX 4090 Ti would launch but it should cost around $2000 US. The only two major events in the coming months are going to be GDC and GTC so maybe we get to see a teaser or glimpse of either the new Ti or the Titan at the event.\nNVIDIA GeForce RTX 40 Series Graphics Card Lineup (Rumored):\nGraphics Card"
  },
  {
    "body": "January 30, 2023\n/ 10:15 AM IST\nONE of the biggest winners from the soaring popularity of the ChatGPT tool is a billionaire Taiwanese immigrant known for his black leather jackets and tattoo resembling the logo of Nvidia, the company he co-founded in 1993.\nJensen Huang has seen his fortune climb by 33 per cent this year to US$18.4 billion, a larger percentage gain than any other US billionaire, according to the Bloomberg billionaires Index. Its a sharp contrast to last year, when his wealth decline was one of the biggest among US technology titans, along with Meta Platforms Mark Zuckerberg.\nHis firm, initially focused on creating computer chips to create graphics for video games, has become the dominant player in powering artificial intelligence (AI) applications, from autonomous cars to robots to crypto mining. That speciality has made it one of Wall Streets top wagers for how to profit from exuberance about the future of AI, encouraged by Microsoft Corp. vowing to put US$10 billion into OpenAI, the startup that developed ChatGPT.\nChatGPT kind of started an arms race, said Christopher Rolland, senior analyst at Susquehanna Investment Group. Nvidia is far and away the leader.\nRapid growth from ChatGPT usage could result in sales of US$3 billion to US$11 billion for Nvidia over 12 months, Citigroup estimated last week. While acknowledging the difficulty in modelling growth for such a nascent service, analyst Atif Malik based his values on projections for the number of words generated by ChatGPT and revenue per word for Nvidia.\nRead More\nRelated stories"
  },
  {
    "body": "Washington Post\nIntel saw $8 billion wiped off its market value on Friday after the U.S. chipmaker reported historic dismal earnings projections, as the personal-computer market faces an unprecedented slump. Its revenue forecast was also $3 billion below estimates as it struggled with slowing growth in the data center business. Intel shares closed 6.4% lower, while rival Advanced Micro Devices (AMD.O) and Nvidia (NVDA.O) ended the session up 0.3% and 2.8%, respectively. Reuters reported that Intel has been losing market share to rivals which have used contract chipmakers such as Taiwan-based TSMC to make chips that outpace Intels technology. Analysts also claim that AMD data center chips have a strong price-performance advantage compared to Intels processors which would further drive down its share gains.\nSource:\nReuters\nAccording to a report by the Wall Street Journal, Chinas top nuclear weapons research institute has bought sophisticated U.S. computer chips, despite long standing export restrictions aimed at limiting the use of any U.S. products for atomic-weapons research by foreign powers. A Journal review of research papers published by the China Academy of Engineering Physics  CAEP, one of the first Chinese institutions put on the U.S. blacklist, found that at least 34 over the past decade referenced using American semiconductors in the research. Most of the chips procured by the academy ranged in size from 7 nanometers to 14 nanometers, many of which are difficult for China to mass produce. They are widely available on the open market. Versions of Intels Xeon Gold and Nvidias GeForce RTX chips purchased by CAEP can be bought off Taobao, one of Chinas largest e-commerce marketplaces.\nSource:\nWSJ\nDecreased advertising spend and revenue is driving the mass layoffs, a report by The Conversation revealed. Advertising revenue decreased last year  in part due to fears over a global recession triggered by the pandemic, leading to decreased expenditure on staffing. Large numbers of employees have been laid off from major tech companies, since the end of the pandemic hiring spree,  including Alphabet (12,000 employees), Amazon (18,000), Meta (11,000), Twitter (4,000), Microsoft (10,000) and Salesforce (8,000). The report reveals that these figures dont include the downstream layoffs, such as advertising agencies laying off staff as ad spend reduces, or manufacturers downsizing as tech product orders decrease or even potential layoffs yet to come. This does not mean much for consumers or the overall economy as work on tech products and services is still expanding, and layoffs, though striking, still represent a fraction of the total tech workforce.\nSource:\nThe Conversation\nMicrosoft is seeking to redesign and introduce a more touch-friendly navigation interface to the File Explorer app in Windows 11, according to a report from Windows Central. The new Explorer will reportedly have better photo viewing with larger previews, keyword and color tagging for organizing files as well as tighter integration with Microsoft 365 and OneDrive. An internal mock-up of the new interface features a new recommended section of files alongside the existing areas for pinned and recent files, with large previews of various documents and information about where the files are located (OneDrive, SharePoint, and the local Downloads folder are all listed). The new look will also come with more modern code under the hood, Ars Technica wrote.\nSource:"
  },
  {
    "body": "160W\nFeatures\nSince both graphic cards are built by different manufacturers, each offers distinctly unique features. Although the differences aren't majorly significant, they are enough to give them distinct pros and cons.\nThe two GPUs offer different VRR (variable refresh rate) technology. AMD uses FreeSync, whereas Team Blue uses GSync to reduce screen tearing by adjusting the monitor's refresh rate to sync with the rendered frame.\nNvidia uses DLSS (Deep Learning Super Sampling), whereas AMD uses FSR (FidelityFX Super Resolution) technology to enable the rendering of games at a lower resolution, and then uses machine learning techniques to enhance it to the native resolution of the display.\nyoutu.be/7CKnJ5ujL_Q\nThe idea is that this approach should provide near-identical visual quality compared to the traditional rendering method, but with a significant reduction in performance demands.\nAdditionally, both Nvidia and AMD have implemented features such as Nvidia Reflex, Ultra-Low Latency, and AMD Anti-Lag, with the goal of minimizing input lag, resulting in faster in-game response time.\nGaming performance\nBoth the graphic cards are considered 1080p gaming GPUs, however, it's surprising that they perform pretty well even in 1440p gaming. If you go by numbers, it's noted that the 6600 XT outperforms the RTX 3060 by 10% in 1080p gaming. This difference narrows as you move towards higher-resolution gaming.\nHowever, Nvidia's powerful technology beats AMD, as by turning on DLSS, you can experience a considerable increase in frame rates while only experiencing a small reduction in visual quality.\nAMD's FSR offers similar functionality but is not as widely supported across games. In most games that do support it, DLSS produces slightly better visuals than FSR.\nFinal verdict\nWith the launch of the AMD 6600 XT, it received a lukewarm reception as it was priced $50 higher than the Nvidia RTX 3060. Although it had slightly better FPS performance at a lower resolution, the extra cost did not justify the lack of features like DLSS and RT Cores, as well as a lower favorable memory configuration.\nHowever, now that prices have dropped, the 6600 XT is a more compelling choice, especially for those looking for high refresh rate competitive gaming at 1080p or 1440p. It offers better performance for a similar or lower price than the RTX 3060.\nHowever, if you are looking for a GPU that can handle high or maximum settings for AAA games, the RTX 3060's better memory configuration, ray tracing performance, and DLSS technology might make it worth the extra cost.\nNote: We may receive a small commission from the links included in the article.\nPoll :"
  },
  {
    "body": "Jan 29, 2023 9:57 PM CST\n1 minute & 36 seconds read time\nNVIDIA might be planning to release a GeForce RTX 4090 Ti with 24GB of GDDR6X and a 600W TGP in addition to a TITAN-class Ada Lovelace graphics card with a whopping 48GB of GDDR6X and a 800W TGP. This comes as NVIDIA leaker kopite7kimi releases specs for the currently planned GeForce RTX 4090 Ti.\n3\nVIEW GALLERY - 3 IMAGES\nHe lists RTX 4090 Ti using PG136/139-SKU310 and featuring 18176 FP32 (CUDA Cores), 96M L2 Cache, 24G GDDR6X memory, and total power of 600W. The CUDA Core count here represents a 10.9% increase over the GeForce RTX 4090.\nThis sits alongside his previous leak of \"\nthe beast\n\" using PG137-SKU0 featuring the same CUDA Core count as this new RTX 4090 Ti leak but with double the memory (48G GDDR6X) and a total power rating of 800W. With images we posted today showcasing a new four-slot cooler for an upcoming Founders Edition card from NVIDIA, we assumed that it was related to a single product.\n3\nNVIDIA's massive four-slot Titan class RTX 4090 Ti Series GPU pictured\nNow it could be part of two different SKUs - the RTX 4090 Ti and the next-gen TITAN card. Or simply one and not the other. Though the RTX 4090 and RTX 4080 share the same cooling design, the odds are that will be the case here too.\nAs we mentioned in the four-slot cooler write-up, there's nothing out at the moment that can match the RTX 4090's performance; one has to wonder if there's even a need to release something like the GeForce RTX 4090 Ti. Perhaps NVIDIA will sit on the RTX 4090 Ti and release it once AMD debuts its full line-up or announces the 7950XTX. The RTX 3090 TI launched six months before the RTX 4090 and RTX 4080, positioning itself more as the performance king of the Ampere generation versus a GPU that made any real sense for consumers.\nMSI Gaming GeForce RTX 4090 24GB GDRR6X\nToday\n* Prices last scanned on 1/29/2023 at 9:58 pm CST - prices may not be accurate, click links above for the latest price. We may earn an affiliate commission.\nNEWS SOURCE:\nKosta Andreadis\nKosta might be a relatively new member of TweakTown, but hes a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit.\nNewsletter Subscription"
  },
  {
    "body": "Jan 29, 2023 8:26 PM CST\n1 minute & 4 seconds read time\nGPU manufacturers use ECC (Eurasian Economic Commission) listings to register GPU model names for use at a later date, often indicating that a product launch is happening relatively soon. A new ECC filing by Chinese graphics card maker Shangke Group (MaxSun and Soyo) lists A GeForce RTX 4060 and GeForce RTX 4050 alongside the RTX 4070.\n4\nVIEW GALLERY - 4 IMAGES\nThe list doesn't mention any upcoming \"Ti\" models but indicates the expected release cadence of the GeForce RTX 4060 to follow the launch of the RTX 4070. What's interesting is that both of these cards represent the mainstream offerings for the GeForce RTX 40 Series, so even with a price increase over the previous Ampere generation - we should expect them to launch with prices relatively close to the RTX 3050's USD 249 and the RTX 3060's USD 329.\nAlso, the fact that both have shown up in this listing points to board partners being made aware of the entire Ada line-up and that NVIDIA could release these cards sooner than expected. And with NVIDIA launching its full laptop/mobile RTX 40 Series line-up, we could also see an accelerated timeline for desktops.\n4\nRTX 4060 and RTX 4050 listing. Source: Videocardz.com\nNo specs or other info has been revealed, but as the GeForce RTX 4060 Ti is set to use the AD106-350-A1 chip, 4352 CUDA Cores, 8GB of GDDR6 memory, and a TGP of only 160W - it's expected that the RTX 4060 and RTX 4050 will also aim for impressive power efficiency. How this will translate to in-game performance remains to be seen, especially when these mainstream Ada GPUs are rumored to feature a 128-bit bus interface.\nMSI Gaming GeForce RTX 4070 Ti 12GB GDRR6X\nToday\n* Prices last scanned on 1/29/2023 at 8:19 pm CST - prices may not be accurate, click links above for the latest price. We may earn an affiliate commission.\nNEWS SOURCE:\nKosta Andreadis\nKosta might be a relatively new member of TweakTown, but hes a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit.\nNewsletter Subscription"
  },
  {
    "body": "Jan 29, 2023 7:28 PM CST\n1 minute & 23 seconds read time\nPictures of what we assume will be NVIDIA's GeForce RTX 4090 Ti graphics card have surfaced, showcasing a massive four-slot cooling design that features what looks to be a two-slot exhaust. This could be the reason for the vertical orientation of the I/O ports, which is an interesting design change. The images were posted by the aptly named MEGAsizeGPU.\n5\nVIEW GALLERY - 5 IMAGES\nGeForce RTX 4090 Ti/TITAN. Source: MEGAsizeGPU\nThe RTX 4090 Ti, or next-gen Titan based on Ada Lovelace architecture, is expected to become the flagship GPU in the RTX 40 Series line-up. The image lists 699-1G137 SKU as the card, confirming this. The overall design will make it the largest Founders Edition GPU to date - with a more considerable physical presence than the already chunky RTX 4090 and RTX 4080 GPUs. It also features a gold-colored cooler design, putting it in the Titan-class range for NVIDIA.\nIt could be a prototype or the real deal; it's hard to say. As per established NVIDIA leaker Kopite7kimi, the RTX 4090 Ti, or \"the beast,\" is the PG137-SKU0 shown here. Granted that info comes from July 2022, where AD102-450-A1 is listed as the chip alongside 18176 FP32 (CUDA Cores), 48G 24Gbps GDDR6X memory, and an eyebrow-raising 800W power limit. And with that, it would also require dual 12VHPWR 16-pin connectors.\n5\nGeForce RTX 4090 Ti/TITAN. Source: Chiphell\nAs the current Ada line-up has been praised for its power efficiency, it would be a little strange for NVIDIA to push design and specs this hard when there's nothing that can match the baseline GeForce RTX 4090 when it comes to in-game performance. So even if this is the GeForce RTX 4090 Ti, and its cooler design is finalized, it could be a while before it releases.\nMSI Gaming GeForce RTX 4090 24GB GDRR6X\nToday\nKosta Andreadis\nKosta might be a relatively new member of TweakTown, but hes a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit.\nNewsletter Subscription"
  },
  {
    "body": "Image Source: Zacks Investment Research\nZacks Recommendation Upgrade Drives Bowman Consulting and Commercial Metals Higher\nShares of Bowman Consulting Group Ltd. BWMN and Commercial Metals Company CMC have surged 44% and 19.1% since their Zacks Recommendation was upgraded to Outperform on November 15 and November 14, respectively.\nWhile the Zacks Rank is our short-term rating system that is most effective over the one- to three-month holding horizon, the Zacks Recommendation aims to predict performance over the next 6 to 12 months. However, just like the Zacks Rank, the foundation for the Zacks Recommendation is trends in earnings estimate revisions.\nThe Zacks Recommendation classifies stocks into three groups  Outperform, Neutral and Underperform. While these recommendations are determined quantitatively, our analysts have the flexibility to override them for the 1100+ stocks they closely follow based on their better judgment of factors such as valuation, industry conditions and management effectiveness than the quantitative model.\nTo access our research reports with Zacks Recommendations for the 1100+ stocks we cover,\nclick here>>>\nZacks Focus List Model Portfolio NVIDIA, Block Skyrocket\nShares of NVIDIA Corporation NVDA, which belongs to the Zacks Focus List, have soared 43.9% over the past 12 weeks. The stock was added to the Focus List on May 20, 2019. Another Focus-List holding, Block, Inc. SQ, which was added to the portfolio on March 28, 2017, has returned 39.5% over the past 12 weeks.\nThe Zacks Focus List is a model portfolio of 50 hand-picked stocks that possess the right fundamental ingredients to outperform the market over the next 12 months. These 50 stocks are picked from a long list of stocks with the highest Zacks Rank.\nSince its inception on Feb 1, 1996, the Focus List portfolio has delivered an annualized return of +12.9%.\nUnlock all of our powerful research, tools and analysis, including the Focus List, Zacks #1 Rank List, Equity Research Reports, Zacks Earnings ESP Filter, Premium Screener and more, as part of Zacks Premium.\nGain full access now >>\nZacks ECAP Stocks Novo Nordisk and Oracle Rapidly Advance\nNovo Nordisk A/S NVO, a component of our Earnings Certain Admiral Portfolio (ECAP), jumped 22.9% over the past 12 weeks. Oracle Corporation ORCL followed Novo Nordisk with 17.1% returns.\nECAP is a model portfolio of 30 concentrated, ultra-defensive, long-term Buy and Hold stocks.\nWith little to no turnover and annual rebalance periodicity, the ECAP seeks to minimize capital loss by holding shares of companies whose earnings streams exhibit a proven 20+ year track record of surviving recessionary periods with minimal impact on aggregate earnings growth relative to the overall S&P 500.\nThe ECAP and many other model portfolios are available as part of Zacks Advisor Tools, a cloud-based solution to access Zacks award-winning stock, mutual fund and ETF research. Click here to schedule a demo.\nZacks ECDP Stocks Home Depot, C.H. Robinson Outperform Peers\nThe Home Depot, Inc. HD, which is part of our Earnings Certain Dividend Portfolio (ECDP), has returned 11.5% over the past 12 weeks. Another ECDP stock, C.H. Robinson Worldwide, Inc. CHRW, has climbed 8.9% over the same time frame. Of course, the inclination of investors toward quality dividend stocks to secure an income stream amid the heightened market volatility contributed to this performance.\nWith an extremely low Beta and a history of minimum earnings variability over the last 20+ years, this 25-stock portfolio helps significantly mitigate risk. The ECDP has consistently outperformed the S&P 500 Dividend Aristocrats ETF NOBL.\nClick here to access this portfolio on Zacks Advisor Tools.\nJust Released: Zacks Top 10 Stocks for 2023\nIn addition to the investment ideas discussed above, would you like to know about our 10 top picks for 2023?\nFrom inception in 2012 through November, the Zacks Top 10 Stocks portfolio has tripled the market, gaining an impressive +884.5% versus the S&P 500s +287.4%. Our Director of Research has now combed through 4,000 companies covered by the Zacks Rank and handpicked the best 10 tickers to buy and hold in 2023. Dont miss your chance to still be among the first to get in on these just-released stocks."
  },
  {
    "body": "8,719\nPulled from a working machine, placed into an AS bag and sitting on the shelf.\nNvidia Quadro P400, 2gb DDR5 memory, comes with full height bracket, dont have the low profile one.\nComes with 3x MiniDP to DP dongles"
  },
  {
    "body": "Get Rating\n) in the third quarter, according to the company in its most recent filing with the SEC. The fund bought 4,878 shares of the computer hardware makers stock, valued at approximately $592,000.\nSeveral other large investors have also recently modified their holdings of NVDA. State Street Corp lifted its stake in  NVIDIA by 1.8% in the second quarter. State Street Corp now owns 97,842,783 shares of the computer hardware makers stock worth $14,835,689,000 after purchasing an additional 1,743,632 shares during the last quarter.  Price T Rowe Associates Inc. MD raised its holdings in shares of  NVIDIA by 7.2% in the second quarter. Price T Rowe Associates Inc. MD now owns 56,929,819 shares of the computer hardware makers stock worth $8,629,991,000 after buying an additional 3,813,087 shares during the period.  Legal & General Group Plc lifted its stake in shares of  NVIDIA by 4.4% during the 2nd quarter. Legal & General Group Plc now owns 18,243,948 shares of the computer hardware makers stock worth $2,765,602,000 after acquiring an additional 764,184 shares during the last quarter.  UBS Asset Management Americas Inc. boosted its holdings in  NVIDIA by 3.3% during the 2nd quarter. UBS Asset Management Americas Inc. now owns 14,612,261 shares of the computer hardware makers stock valued at $2,215,073,000 after acquiring an additional 467,060 shares during the period.  Finally, Charles Schwab Investment Management Inc. lifted its position in shares of  NVIDIA by 2.0% during the first quarter. Charles Schwab Investment Management Inc. now owns 12,269,735 shares of the computer hardware makers stock worth $3,347,921,000 after purchasing an additional 243,671 shares during the last quarter. Institutional investors own  61.80% of the companys stock.\nGet\nGet Rating\n) last issued its earnings results on Wednesday, November 16th. The computer hardware maker reported $0.34 EPS for the quarter, missing analysts consensus estimates of $0.44 by ($0.10). The company had revenue of $5.93 billion during the quarter, compared to analysts expectations of $5.82 billion. NVIDIA had a return on equity of 30.75% and a net margin of 20.85%. The firms quarterly revenue was down 16.5% compared to the same quarter last year. During the same quarter in the previous year, the company earned $1.01 EPS.  Research analysts forecast that  NVIDIA Co. will post 2.19 earnings per share for the current year.\nNVIDIA Dividend Announcement\nThe company also recently announced a quarterly dividend, which was paid on Thursday, December 22nd. Stockholders of record on Thursday, December 1st were issued a dividend of $0.04 per share. This represents a $0.16 annualized dividend and a dividend yield of 0.08%. The ex-dividend date  was Wednesday, November 30th. NVIDIAs dividend payout ratio (DPR) is 6.81%.\nInsider Activity at NVIDIA\nIn other NVIDIA news, EVP Debora Shoquist sold 23,532 shares of NVIDIA stock in a transaction on Friday, January 27th. The shares were sold at an average price of $205.00, for a total value of $4,824,060.00. Following the completion of the transaction, the executive vice president now owns 162,944 shares of the companys stock, valued at $33,403,520. The transaction was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through this link. In other news, EVP Debora Shoquist sold 23,532 shares of the firms stock in a transaction dated Friday, January 27th. The stock was sold at an average price of $205.00, for a total transaction of $4,824,060.00. Following the sale, the executive vice president now directly owns 162,944 shares in the company, valued at approximately $33,403,520. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this hyperlink. Also, CFO Colette Kress sold 10,741 shares of NVIDIA stock in a transaction dated Thursday, January 26th. The shares were sold at an average price of $200.00, for a total value of $2,148,200.00. Following the completion of the transaction, the chief financial officer now owns 536,960 shares of the companys stock, valued at approximately $107,392,000. The disclosure for this sale can be found here. Insiders sold a total of 262,060 shares of company stock worth $43,817,257 in the last three months. Company insiders own  4.04% of the companys stock.\nNVIDIA Company Profile\nGet Rating\n)\nNVIDIA Corp. engages in the design and manufacture of computer graphics processors, chipsets, and related multimedia software. It operates through the following segments: Graphics Processing Unit (GPU), Tegra Processor, and All Other. The GPU segment consists of product brands, including GeForce for gamers, Quadro for designers, Tesla and DGX for AI data scientists and big data researchers, and GRID for cloud-based visual computing users.\nFurther Reading"
  },
  {
    "body": "Jan. 29, 2023 9:00 am ET\nprint\nListen to article\n(2 minutes)\nSINGAPOREChinas top nuclear-weapons research institute has bought sophisticated U.S. computer chips at least a dozen times in the past two and half years, circumventing decades-old American export restrictions meant to curb such sales.\nA Wall Street Journal review of procurement documents found that the state-run China Academy of Engineering Physics has managed to obtain the semiconductors made by U.S. companies such as\nIntel"
  },
  {
    "body": "The mention sources can contact us to remove/changing this article\nWhat Are The Main Benefits Of Comparing Car Insurance Quotes Online\nLOS ANGELES, CA / ACCESSWIRE / June 24, 2020, / Compare-autoinsurance.Org has launched a new blog post that presents the main benefits of comparing multiple car insurance quotes. For more info and free online quotes, please visit https://compare-autoinsurance.Org/the-advantages-of-comparing-prices-with-car-insurance-quotes-online/ The modern society has numerous technological advantages. One important advantage is the speed at which information is sent and received. With the help of the internet, the shopping habits of many persons have drastically changed. The car insurance industry hasn't remained untouched by these changes. On the internet, drivers can compare insurance prices and find out which sellers have the best offers. View photos The advantages of comparing online car insurance quotes are the following: Online quotes can be obtained from anywhere and at any time. Unlike physical insurance agencies, websites don't have a specific schedule and they are available at any time. Drivers that have busy working schedules, can compare quotes from anywhere and at any time, even at midnight. Multiple choices. Almost all insurance providers, no matter if they are well-known brands or just local insurers, have an online presence. Online quotes will allow policyholders the chance to discover multiple insurance companies and check their prices. Drivers are no longer required to get quotes from just a few known insurance companies. Also, local and regional insurers can provide lower insurance rates for the same services. Accurate insurance estimates. Online quotes can only be accurate if the customers provide accurate and real info about their car models and driving history. Lying about past driving incidents can make the price estimates to be lower, but when dealing with an insurance company lying to them is useless. Usually, insurance companies will do research about a potential customer before granting him coverage. Online quotes can be sorted easily. Although drivers are recommended to not choose a policy just based on its price, drivers can easily sort quotes by insurance price. Using brokerage websites will allow drivers to get quotes from multiple insurers, thus making the comparison faster and easier. For additional info, money-saving tips, and free car insurance quotes, visit https://compare-autoinsurance.Org/ Compare-autoinsurance.Org is an online provider of life, home, health, and auto insurance quotes. This website is unique because it does not simply stick to one kind of insurance provider, but brings the clients the best deals from many different online insurance carriers. In this way, clients have access to offers from multiple carriers all in one place: this website. On this site, customers have access to quotes for insurance plans from various agencies, such as local or nationwide agencies, brand names insurance companies, etc. \"Online quotes can easily help drivers obtain better car insurance deals. All they have to do is to complete an online form with accurate and real info, then compare prices\", said Russell Rabichev, Marketing Director of Internet Marketing Company. CONTACT: Company Name: Internet Marketing CompanyPerson for contact Name: Gurgu CPhone Number: (818) 359-3898Email:\n: https://compare-autoinsurance.Org/ SOURCE: Compare-autoinsurance.Org View source version on accesswire.Com:https://www.Accesswire.Com/595055/What-Are-The-Main-Benefits-Of-Comparing-Car-Insurance-Quotes-Online View photos\nRelated"
  },
  {
    "body": "January 29, 2023, 11:16\nTechSpot is about to celebrate its 25th anniversary. TechSpot means tech analysis and advice youcantrust.\nRumor mill: When it comes to performance, size, and price, the RTX 4090 is a beast of a graphics card, but it appears that an even more monstrous product is coming to the Ada Lovelace line. Alleged images of what is probably a Titan RTX Ada, though it could be an RTX 4090 Ti, have leaked, showing its massive quad-slot design and four display connectors on the I/O that are aligned vertically rather than the usual horizontal setup.\nAssuming they're the real deal, the photos from Hardware leaker MEGAsizeGPU confirm that the most powerful Lovelace card will use an Nvidia design quite different from what we've seen before. They suggest that the PCB is vertical, meaning it will be parallel to the motherboard when the card is inserted.\nWe can also see an exhaust grill so large that it covers two PCI slots, which could have led to Nvidia stacking the three DisplayPorts and one HDMI port vertically instead of horizontally.\nThere has been debate over whether this new card will be an RTX 4090 Ti or a Titan RTX Ada. Given the gold theme, it seems we're looking at the latter. There are more hints on the I/O bracket's sticker; the PG137 PCB board number was revealed by kopite7kimi in July last year in a leak about a flagship Lovelace card with 48GB of GDDR6X, 18,176 CUDA cores, and a TDP of 800W, earning it the appropriate nickname of 'the beast.' For reference, the RTX 4090's board number is PG139, and it has 16,384 CUDA cores.\n\"the beast\""
  },
  {
    "body": "https://t.co/Ojn1zDnrfc\nThese were the times without the ARC series of GPUs from Intel and good price-to-performance cards from AMD.\nConsidering the performance, even with the recently released God of War for PC, the GTX 1060 can manage a respectable 30 to 40 fps in the highest settings. With subsequent generational updates, the need to settle for a respectable card is long gone.\nThe answer for that depends on the needs and particular scenarios, but in general, there are much better investments to pick up in the GPU segment than the GTX 1060 in 2023.\nThe GTX 1060 is not recommended for purchase in 2023 because similarly priced cards offer drastically better performance\nIntel Arc A750\n512 GBps\n192 GBps\nConsider the recently released Intel Arc A750 GPU. The graphics memory bandwidth of the A750 is a staggering 512 GBps for a price similar to what a GTX 1060 retails for today while offering 192 GBps of bandwidth. This dramatic gap shows itself to be highly pronounced in games requiring extensive amounts of graphic memory, which entails most games in 2023.\nSimilarly, the 8 GB on the Arc A750 is based on a 256-bit memory bus width, compared to the 192-bit width on the 6 GB GTX 1060. Simply put, a higher memory bus width implies faster and larger communication between the memory VRAM and the GPU. The higher it is, the higher the frames obtained in general.\nMoreover, the memory clock speed on 1060 is 1.5 GHz, while the Arc A750 offers 2 GHz of memory clock speed. This results in a GPU capable of much faster calculations when it comes to rendering. In terms of the power draw, the GTX 1060 does consume far less power than cards like A750, but the performance sacrifice is not worth it.\nWith newer engines like UE5, games are going to look bonkers, thus needing as much power as they can get\nThe GTX 1060 will be a seven-year-old card in July of 2023. Not only will the support for official drivers from Nvidia start to dwindle, but this old card will age faster, thanks to more demanding upcoming games.\nTake, for example, Hogwarts Legacy, the much-awaited game from Portkey games. The official page enlists playing the game in 1080p high settings at 60 fps, they recommend a minimum of Nvidia 1080 ti. Of course, playing on a 1060 is possible, but youll have to consider massive trade-offs like sacrificing fps for resolution or vice-versa.\nAlthough Ray-tracing is still a luxury, the 1060 cannot handle it in upcoming games\nSay what anyone may about the current situation of ray-tracing in video games, it will become mainstream among even the most stringent of gamers. Currently, most gamers prefer higher frames over ray-tracing, but that may change as games get better by optimizing performance for ray-tracing.\nWith Unreal Engine 5, this looks achievable at a comparatively lesser price paid in performance to get good lighting in games. As developers fully utilize the UE5, the games shall get better optimized to handle it at available resources, thus making cards like the GTX 1060 a relic.\nThus, the 1060 is not worth the purchase in 2023. Interestingly, the only time it can be recommended is if the daily driver GPU malfunctions and one needs a decent card as a replacement. For everyone else, a similarly priced RX 6600 series, RTX 3060 series, or the Intel Arc A750 offers much more bang for the buck, although at a higher price.\nNote: We may receive a small commission from the links included in the article.\nPoll :"
  }
]