[
  {
    "body": "Cathie Wood Names the 1 Stock She'd Buy Today If She HAD to Hold It For 10 Years\nWhen Cathie Wood speaks, people listen.  The chief executive of Ark Investment Management has had a far-from-perfect record when it comes to her investment choices -- not to mention not exactly flattering feedback from CNBC's Jim Cramer.  When asked what stock Wood would choose she won a million dollar lottery and was forced to choose a stock for ten years, Wood's pick was just as disruptive as her reputation.\n1h ago\nNasdaq Bear Market: 2 Growth Stocks Down 74% and 95% to Buy in 2023\nThe Nasdaq Composite dipped into a bear market last year, and the tech-heavy index is still 28% off its high.  Investors often overreact to good and bad news, so stocks tend to rise too high during bull markets and fall too far during bear markets.  Warren Buffett hinted at that quirk of human nature when he said, \"Be fearful when others are greedy, and be greedy when others are fearful.\"\n3h ago\nCan SoFi Stock Soar Even Higher in 2023?\nDespite a dismal performance in 2022, shares of all-digital bank SoFi Technologies (NASDAQ: SOFI) climbed 50.3% in January.  There are lots of reasons for the run-up, not least of which were a better-than-expected performance during the fourth quarter of 2022 and an improved outlook.  Will the big gains SoFi made in January fizzle out in February, or is the stock at the beginning of a much longer bull run?\n7h ago\nCarvana stock has crashed back to Earth after a massive run, and these three indicators show just how bad things are.\n2h ago\nAre These 3 Companies Next for Short Squeezes?\nA short squeeze occurs when short-sellers rush to cover their positions on a stock.  The sudden rush of buying can quickly push a stock price higher.  After a tough market year in 2022, some stocks have built up large short-seller followings, potentially priming the pump for a new wave of short squeezes.\n5h ago\n3 Reasons to Love Coinbase Stock\nShares of Coinbase (NASDAQ: COIN) have gotten crushed since hitting public markets, but the business is in better shape than you might think. There's billions of dollars in cash on the balance sheet, and there are growing revenue sources from USDC and Ethereum (CRYPTO: ETH) staking.\n5h ago\nMeta stock soars after hours, analyst warns of 'magnitude' of move\nBrent Thill, Jefferies Equity Research Analyst, analyzes Meta's stock pop after earnings.  You can see the full interview here.  Key video highlights 00:25 On how Instagram has improved 00:40 On better ad targeting 00:55 On other social platforms 01:30 On the stock move\n19h ago\nThese high-octane income stocks, with yields ranging from 4.3% to 15.4%, have been bought hand over fist by billionaire investors.\n7h ago\n3 Ultra-High-Yield Dividend Stocks You Won't Regret Owning in 2023\nDividend stocks are a great way to mitigate downside risk, hedge against inflation, and generate reliable levels of passive income.  Closed-end funds, real estate investment trusts (REITs), and some actively managed diversified holding companies are purpose-built to return an outsize portion of cash flows to shareholders via regular distributions.  Arbor Realty Trust (NYSE: ABR) is a REIT with a current annualized yield of 10.75%.\n1h ago\n2 Dividend Growth Beasts That Have Tripled Their Payouts Within 7 Years\nDid you know that if a company were to increase its dividends by 5% per year, it would take 14 years for its payouts to double?  A couple of stocks with the most aggressive dividend growth records you can invest in today are UnitedHealth Group (NYSE: UNH) and Broadcom (NASDAQ: AVGO).  Health insurance giant UnitedHealth Group may not strike income investors as an ideal dividend stock to buy, as it yields just under 1.4%, which is below the S&P 500's current average yield of 1.7%.\n3h ago\nDividend investors should consider loading up on these stocks as this could be a good year for both of their businesses.\n4h ago\nCathie Wood pours millions into these 2 stocks  this is what makes them attractive buys\nJanuary has now been and gone and turned out to be a nice gift for investors. Battered by 2022s bear, the tech-heavy Nasdaq, in particular, put in an excellent showing, seeing out the month ~11% into the green, in what amounted to its best start to a year since 2001. That signals the appetite for risk is on again and that will be good news for Cathie Wood, the ARK Investment CEO, whose investing style heavily favors disruptors - equities that are naturally positioned at the risky end of the sca\n1d ago"
  },
  {
    "body": "Reddit\nAll of Thursdays best deals are now live and headlined by a chance to save $199 on the still very popular and quite compelling M1 MacBook Air. Its then joined by this VOCOlinc HomeKit Smart Plug, which is worth adding to your Siri setup at just $8. And if you need a workstation upgrade, OWCs metal Thunderbolt docks are now $50 off. Hit the jump for all of the best deals and more in the latest 9to5Toys Lunch Break.\nSave $199 on Apples oh-so popular M1 MacBook Air\nThe dust has settled on all of Apples big reveals for the start of the year, and now Best Buy offers\nat Amazon\n, youre looking at a $199 discount as well as a match of our previous mentions from throughout the holiday shopping season last year. It comes within $1 of that mention which also matches the all-time low, making todays offer the second-best weve seen to date.\nWhile it isnt that all-new version of Apples most portable MacBook, there is still something to be said for just how good of a value the\noriginal M1 MacBook Air\nstill is, especially with as steep of a discount attached as youll find. Centered around a 13-inch Retina display with Apple Silicon under the hood, theres also a pair of Thunderbolt ports supplemented by Wi-Fi 6 as well as 256GB of storage and 8GB of RAM. Get a better idea of its performance in\n.\nIf youre looking for more insight on why the M1 MacBook Air is worth considering over its\nJust $8 scores you this VOCOlinc HomeKit Smart Plug\nAmazon is now offering the\nVOCOlinc HomeKit Smart Plug for$8\n. Normally fetching $13, you can now score a Siri-enabled smart plug for 35% off. This is the second-best weve seen to date at within $0.50 of the all-time low last set in September, and the best since. Delivering an affordable way to have Siri, Alexa, and Google Assistant control lamps and appliances, this smart plug pairs right to your Wi-Fi, ditching the need for an external hub.\nIts quite rare to see an offering anywhere in this price range with HomeKit out of the box, which can be used to schedule and automate the smart plug alongside controlling over voice commands. Weve\nin the past, for a better idea of what to expect from the brand, too.\nOWC now taking $50 off metal Thunderbolt docks\nFrom now through this time next week, OWC is slashing\nAmazon\nbut regularly fetches $280 these days. Youre looking at a match for the Amazon low at $10 under our previous mention and at least $30 in savings.\nDesigned to convert your laptop into a workstation powerhouse, it delivers a pair of Thunderbolt ports, 10Gb/s USB-C, five USB-A ports at 5Gb/s, Mini DisplayPort, micro/SD card readers, 3.5mm audio, Ethernet, and more inside of an aluminum design. Alongside 85W of power passthrough for charging your device, it can also support a single 5K monitor or a pair of 4K displays.\nBest trade-in deals\n9to5Macalso keeps tabs on all the best trade-in deals on iPhone, iPad, MacBook, Apple Watch, and more every month. Be sure to"
  },
  {
    "body": "Twitter\nReddit\nBack in October, Apple confirmed its head of hardware design, Evans Hankey, was departing from the company after just three years of replacing the famed design chief Jony Ive.\nNow, Bloombergs Mark Gurman reports Apple wont be replacing the coveted design chief role, but instead having its entire team report to the companys chief operating officer, Jeff Williams, according to unnamed sources familiar with the matter.\nApples industrial design team numbers about 20 people and those with the most seniority at the company will gain larger roles. Williams apparently has decided there will not be one lead design chief, but instead, the group will report directly to him. This means the design team will now work more closely with Apples operations team, one of many areas led by Williams. This new setup has apparently caused tension among designers, says Bloomberg.\nApples design team brings together expert creatives from around the world and across many disciplines to imagine products that are undeniably Apple, said an Apple spokesperson in a statement last October. The senior design team has strong leaders with decades of experience. Evans plans to stay on as we work through the transition, and wed like to thank her for her leadership and contributions.\n, after departing from Apple and since then numerous designers from the iPhone maker have followed the iconic designer to his new company.\nBack in December 2021, Apple offered an exclusive behind-the-scenes look at its design studio at Apple Park.\nOther articles in the category: News\nNintendo Resurrects Switch Game Voucher Promotion in North America\nAfter four years, Nintendo is bringing back its game voucher promotion. In Canada, Nintendo Switch Online members can purchase a pair of vouchers and redeem each one for a digital game in order to save a bit of money on each game. A pair of Nintendo Switch game vouchers in Canada is available for $132.99....\nSteve Vegvari"
  }
]