{
  "_type": "news",
  "didUMean": "",
  "totalCount": 192,
  "relatedSearch": [],
  "value": [
    {
      "id": "4686777140793618452",
      "title": "Microsoft To Remove Several Games From Xbox 360 Store on February 7",
      "url": "https://www.latestly.com/technology/microsoft-announced-the-removal-of-several-games-from-xbox-360-store-on-february-7-4781811.html",
      "description": "Tech giant Microsoft has announced that it will remove a bunch of beloved games from the Xbox 360 Marketplace on February 7.",
      "body": "New Delhi, February 1 :Tech giant Microsoft has announced that it will remove a bunch of beloved games from the Xbox 360 Marketplace on February 7. &quot;A number of game titles and associated add-ons will be removed from the Xbox 360 Marketplace in a select set of regions per title. These removals will start on February 7, 2023,&quot; the company said on an Xbox support page.OnePlus 11R 5G Specifications Officially Revealed by Company Prior to February 7 Launch, Know All Details Here. &quot;Once purchased, you can always redownload these games or any other previously purchased games from your Xbox 360 Download History.&quot; On the support page, the company also provided the list of the games that will be removed based on the users' region. For example, in India, many games including 'Call of Duty: Advanced Warfare', 'Counter-Strike: GO', 'Assassin's Creed IV', 'Star Wars Battlefront' and 'Prince of Persia', will be removed.Apple Says No to Layoffs: Amid Mass Sackings at Tech Companies, Tim Cook Has Not Fired Employees; Here's Why. Meanwhile, last month, as 2022 was coming to an end, the tech giant had revealed its best Xbox games of last year. That list included titles like the racing game 'Forza Horizon 5 Hot Wheels', the action-adventure game 'Sea of Thieves', the survival game 'Grounded', and much more.",
      "snippet": "Tech giant <b>Microsoft</b> has announced that it will remove a ... February 7. New Delhi, February 1 :Tech giant <b>Microsoft</b> has announced that it will remove a ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T06:02:22",
      "provider": {
        "name": "latestly",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://st1.latestly.com/wp-content/uploads/2022/12/resize-3-9.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "latestly",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.latestly.com/technology/microsoft-announced-the-removal-of-several-games-from-xbox-360-store-on-february-7-4781811.html"
      }
    },
    {
      "id": "2707719073955848889",
      "title": "Microsoft To Remove THESE Popular Games From Xbox 360 This Month; Details",
      "url": "https://english.jagran.com/technology/microsoft-to-remove-these-popular-games-from-xbox-360-this-month-details-10063310",
      "description": "Microsoft is soon going to remove popular gaming titles from the Xbox 360 Marketplace on February 7, 2023.",
      "body": "The United States-based technology giant has announced that it would be removing a few popular game titles from its Xbox 360 gaming consoles Xbox 360 Marketplace from February 7, 2023. This came after the company announced the removal on its official Xbox support page, A selection of game titles and related add-ons will be withdrawn from the Xbox 360 Marketplace in a limited number of locations. These evictions will begin on February 7, 2023, according to the companys Xbox support page. You may always redownload these games, as well as any other titles youve already bought, from your Xbox 360 Download History, it added. Additionally, the company has announced that the removal of the games would be based on the users region and has also provided the list of games that will be removed. Many titles, such as Call of Duty: Advanced Warfare, Counter-Strike: GO, Assassins Creed IV, Star Wars Battlefront, and Prince of Persia, will be deleted from India. Meanwhile, as the year 2022 came to a close, Microsoft revealed its top Xbox games from the previous year. Among the titles on the list were the racing game Forza Horizon 5 Hot Wheels, the action-adventure game Sea of Thieves, the survival game Grounded, and many more. In terms of global layoffs, the company recently laid off over 10,000 employees and joined forces with other technology giants. Despite global economic tensions, the company has laid off approximately 5% of its workforce. Notably, this is one of the biggest job cuts made by the company. We saw customers accelerate their digital spend during the pandemic, and now were seeing them optimise their digital spend to do more with less, says the company. The SEC published a note to employees from CEO Satya Nadella. However, the company made similar layoffs during the year 2015. (With agency inputs)",
      "snippet": "<b>Microsoft</b> is soon going to remove popular gaming titles from the Xbox 360 Marketplace on February 7, 2023. The United States-based technology giant ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T05:49:59",
      "provider": {
        "name": "jagran",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imgeng.jagran.com/images/2023/feb/Microsoft Games1675230924501.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "jagran",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://english.jagran.com/technology/microsoft-to-remove-these-popular-games-from-xbox-360-this-month-details-10063310"
      }
    },
    {
      "id": "4908538082939048539",
      "title": "This Valentine's, give a gift that keeps on giving  an MS Surface tablet",
      "url": "https://newatlas.com/deals/microsoft-surface-tablet-valentines-day-deal/",
      "description": "Sure roses are beautiful and candy is sweet, but flowers die and candy gets eaten, leaving nothing behind but memories. This Valentines, why not get your loved one a gift that will not only last but will be used regularly, like this Microsoft Surface?",
      "body": "/\n1\nSure roses are beautiful and candy is sweet, but flowers die and candy gets eaten, leaving nothing behind but memories. This Valentines, why not get your loved one a gift that will not only last but will be used regularly, like this\nMicrosoft Surface\n?\nWere not suggesting that you forgo romantic presents. In fact, we think that if you really want to earn brownie points this February 14\nth\nthat you wrap up this tablet with a red bow and accompany it with an extra little treat to show you havent totally lost the meaning of the day. And since this Microsoft Surface 3 is being offered at such a low price, were sure youre going to have some left over for that extra touch  and even a card!\nBut its refurbished, youre thinking. Isnt that like giving your significant other a used gift? No! In fact, not only are you getting a good-as-new tablet at a fraction of the price, but youre saving a perfectly good device from potentially ending up in the landfill. See, you're showing your love for the earth as well as for your partner (or friend, or family member, or even yourself, if you so choose!)\nSo picture this  the big day arrives and you offer your gift (together with the aforementioned romantic gesture and bow  and make it a big one!) and whoever is opening it is giddy with anticipation. When the MS Surface is revealed, complete with its 2.4GHz speed, 10.8\" full HD display, 2GB of RAM,64GB of storage, 10 hours of battery life, plus so much more, wed be surprised if you werent showered with appreciation.\nThis Valentines Day we are offering this refurbished Microsoft Surface 3, complete with an aftermarket 30-day parts and labor warranty from a third party, for only $159.99 (no coupon necessary) thats more than 70% off the suggested retail price. But hurry! If you want it to arrive before the big day, you must put your order in before the end of the day February 3rd.\nAnd as an added bonus, they will think of you whenever the tablet is booted up. It truly is the gift that keeps on giving.\nPrices subject to change\nBoeing to build braced-wing airliner, shooting for 30% efficiency gain\nMilitary\nDARPA nails latest US hypersonic missile test flight\nSpace\nNASA's rotating detonation rocket engine posts record test results\nLoad More",
      "snippet": "... that will not only last but will be used regularly, like this <b>Microsoft</b> Surface?. / 1 Sure roses are beautiful and candy is sweet, but flowers die ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T05:34:50.909",
      "provider": {
        "name": "newatlas",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://assets.newatlas.com/dims4/default/06c667d/2147483647/strip/true/crop/1200x630+0+85/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnewatlas-brightspot.s3.amazonaws.com%2F39%2F6e%2Fcead2e91469f904db082a61df8da%2Fvaltab.jpeg&na.image_optimisation=0",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newatlas",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://newatlas.com/deals/microsoft-surface-tablet-valentines-day-deal/"
      }
    },
    {
      "id": "468291677243009392",
      "title": "Hackers Abused Microsoft's \"Verified Publisher\" OAuth Apps to Breach Corporate Email Accounts",
      "url": "https://thehackernews.com/2023/02/hackers-abused-microsofts-verified.html",
      "description": "Hackers abused Microsoft's \"Verified Publisher\" accounts to create malicious OAuth apps as part of a vicious scheme aimed at infiltrating organization",
      "body": "Ravie Lakshmanan\nEnterprise Security / Authentication\nMicrosoft on Tuesday said it took steps to disable fake Microsoft Partner Network (MPN) accounts that were used for creating malicious OAuth applications as part of a phishing campaign designed to breach organizations' cloud environments and steal email.\n\"The applications created by these fraudulent actors were then used in a consent phishing campaign, which tricked users into granting permissions to the fraudulent apps,\" the tech giant said. \"This phishing campaign targeted a subset of customers primarily based in the U.K. and Ireland.\"\nConsent phishing is a social engineering attack wherein users are tricked into granting permissions to malicious cloud applications, which can then be weaponized to gain access to legitimate cloud services and sensitive user data.\nThe Windows maker said it became aware of the campaign on December 15, 2022. It has since alerted affected customers via email, with the company noting that the threat actors abused the consent to exfiltrate mailboxes.\nOn top of that, Microsoft said it implemented additional security measures to improve the vetting process associated with the Microsoft Cloud Partner Program (formerly MPN) and minimize the potential for fraudulent behavior in the future.\nThe disclosure coincides with a report released by Proofpoint about how threat actors have successfully exploited Microsoft's \"\nverified publisher\n\" status to infiltrate the cloud environments of organizations.\nWhat's notable about the campaign is that by mimicking popular brands, it was also successful at fooling Microsoft in order to gain the blue verified badge. \"The actor used fraudulent partner accounts to add a verified publisher to OAuth app registrations they created in Azure AD,\" the company explained.\nThese attacks, which were first observed on December 6, 2022, employed lookalike versions of legitimate apps like Zoom to deceive targets into authorizing access and facilitate data theft. Targets included financial, marketing, managers, and senior executives.\nProofpoint noted the malicious OAuth apps had \"far-reaching delegated permissions\" such as reading emails, adjusting mailbox settings, and gaining access to files and other data connected to the user's account.\nIt also said that unlike a previous campaign that compromised existing Microsoft verified publishers to take advantage of OAuth app privileges, the latest attacks are designed to impersonate legitimate publishers to become verified and distribute the rogue apps.\nTwo of the apps in question were named \"Single Sign-on (SSO),\" while the third app was called \"Meeting\" in an attempt to masquerade as video conferencing software. All three apps, created by three different publishers, targeted the same companies and leveraged the same attacker-controlled infrastructure.\n\"The potential impact to organizations includes compromised user accounts, data exfiltration, brand abuse of impersonated organizations, business email compromise (BEC) fraud, and mailbox abuse,\" the enterprise security firm said.\nThe campaign is said to have come to a close on December 27, 2022, a week after Proofpoint informed Microsoft of the attack on December 20 and the apps were disabled.\nThe findings demonstrate the sophistication that has gone into mounting the attack, not to mention bypass Microsoft's security protections and misuse the trust users place in enterprise vendors and service providers.\nThis is not the first time bogus OAuth apps have been used to target Microsoft's cloud services. In January 2022, Proofpoint detailed another threat activity dubbed OiVaVoii that targeted high-level executives to seize control of their accounts.\nThen in September 2022, Microsoft revealed that it dismantled an attack that made use of rogue OAuth applications deployed on compromised cloud tenants to ultimately takeover Exchange servers and distribute spam.\nFound this article interesting? Follow us on Twitter\n\nand LinkedIn to read more exclusive content we post.\nSHARE",
      "snippet": "... notable about the campaign is that by mimicking popular brands, it was also successful at fooling <b>Microsoft</b> in order to gain the blue verified badge.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T05:30:00",
      "provider": {
        "name": "thehackernews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://thehackernews.com/new-images/img/b/R29vZ2xl/AVvXsEi6xx_j9CYuzquVXuuDAM23W3Brj52Kbkfv7J_-dmCr6Mrf4naea1FtHEB2rdQjTutfx7kXnhY50wVTer6hMWkygha53hjqvcEUMf9_03y59ypJVB5r5EC7GFVHx_cw3hc50A0xQApCdA9PTznYvICSi0VpDtGMsDKmNxcYg7Qe1e5R4zWkAePDXzdF/s728-e3650/ms.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "thehackernews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://thehackernews.com/2023/02/hackers-abused-microsofts-verified.html"
      }
    },
    {
      "id": "6836794589128286922",
      "title": "Tech layoffs: PayPal cuts 2,000 jobs as global economy weakens",
      "url": "https://www.bbc.com/news/business-64479649",
      "description": "The online payments platform is the latest technology firm to cut costs as the global economy weakens.",
      "body": "Image source,\nPayPal\nPayPal is shedding around 2,000 jobs, or 7% of its workers, as it becomes the latest big tech firm to cut costs.\nThe online payments company says it was forced to make the decision as it faces \"the challenging macro-economic environment.\"\nPayPal's announcement follows tens of thousands of layoffs by technology giants in the last month alone.\nThis year, Google's parent company Alphabet, Amazon and Microsoft have announced major job cuts.\n\"We must continue to change as our world, our customers, and our competitive landscape evolve,\" PayPal's chief executive Dan Schulman said in a statement.\nAlso on Tuesday, Snap - the parent company of social media platform Snapchat - warned that revenue for the three months to the end of March could fall by as much as 10%.\n\"We anticipate that the operating environment will remain challenging, as we expect the headwinds we have faced over the past year to persist throughout Q1,\" the company told investors.\nAfter the announcement Snap's shares fell by almost 15% in extended trade in New York.\nWhat is behind the big tech companies' job cuts?\nAt the start of this year, Amazon announced it planned to cut more than 18,000 jobs because of \"the uncertain economy\" and rapid hiring during the pandemic.\nAlso this month, Alphabet said it would shed 12,000 jobs, while Microsoft said up to 10,000 employees would lose their jobs.\nLast week, Swedish music-streaming giant Spotify said it would cut 6% of its about 10,000 employees, citing a need to improve efficiency.\nIn another sign of the technology industry slowdown US computer chip maker Advanced Micro Devices (AMD) on Tuesday reported a 98% fall in net income for the last three months of 2022.\nThe company also said it expects revenue to drop by as much 10% in the current quarter.\nHowever, the figures were better than many investors had expected and AMD's shares rose after the announcement.\nIn Asia on Wednesday, the world's second-biggest memory chip maker SK Hynix posted its largest quarterly loss on record.\nThe South Korean company reported a worse-than-expected 1.7tn won ($1.4bn; 1.1bn) loss for the last three months of 2022, as sales fell by 38%.\nThe firm pointed to falling computer chip prices and joined rival technology giants as it warned that it expects an industry-wide downturn to worsen in the coming months, before recovering later in the year.\nIt came after rival Samsung Electronics on Tuesday reported its lowest quarterly profit in eight years.\nYou may also be interested in:\nMedia caption,",
      "snippet": "This year, Google's parent company Alphabet, Amazon and <b>Microsoft</b> have announced major job cuts. \"We must continue to change as our world, our ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T05:24:26",
      "provider": {
        "name": "bbc",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://ichef.bbci.co.uk/news/1024/branded_news/184A/production/_128481260_paypalcapture.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "bbc",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.bbc.com/news/business-64479649"
      }
    },
    {
      "id": "1007416391650559204",
      "title": "Excel gets PivotTable detail display for web, Power Automate for Windows and Mac",
      "url": "https://mspoweruser.com/microsoft-excel-january-2023-update/",
      "description": "Excels January 2023 Update introduced a handful of new features to Microsofts spreadsheet product. The main highlight of the update is the PivotTable S",
      "body": "January 2023 Update\nintroduced a handful of new features to Microsofts spreadsheet product. The main highlight of the update is the PivotTable Show Details feature for Excel for the web. Other additions include the Power Automate tab for Excel for Windows and Mac and some new features for Insiders to test.\nExcel for the webs new feature is the result of users feedback, according to Microsoft. The new PivotTable Show Details option allows users to view the source data for a PivotTable value cell. It is a handy function that helps users understand how the values in a PivotTable are calculated.\nPT Show Details\nFor example, if you see an unexpected value in your PivotTable, you can use Show Details to confirm whether the source data used to calculate that value is as expected or if there is an issue with the underlying data, Microsoft explains.\nPivotTable Show Details option is accessible through a double-click or a right-click, but theres also a dedicated button for it from the PivotTable tab of the ribbon.\nAutomate tasks in Excel Desktop\nMeanwhile, Excel for Windows and Mac will both get the same access to the\nPower Automate\ntab starting today. The new tab offers options for creating and modifying scripts that allow the automation of repetitive tasks using Office Scripts. Users can connect different Microsoft apps like Microsoft Teams or SharePoint to build workflows, schedule Office Script, and more.\nValue Preview Tooltips\nRecord Actions\nAside from Power Automate, Excel for Windows and Mac will also deliver two capabilities to Insiders today. These include the ability to record worksheet actions using Office Scripts and check your formula with value preview tooltips. For the former, this update means users will no longer need to use JavaScript and TypeScript via the Office Scripts Code Editor to automate repetitive worksheet tasks. Meanwhile, value preview tooltips allow the evaluation of any selected part of the formula by showing the current value of the parameter highlighted.",
      "snippet": "Excel for the webs new feature is the result of users feedback, according to <b>Microsoft</b>.\nThe new PivotTable Show Details option allows users to view the source data for a PivotTable value cell.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T05:19:15",
      "provider": {
        "name": "mspoweruser",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mspoweruser.com/wp-content/uploads/2022/08/Excel-Image.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mspoweruser",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://mspoweruser.com/microsoft-excel-january-2023-update/"
      }
    },
    {
      "id": "2491592960740044601",
      "title": "AP Top Business News at 1:26 p.m. EST  WAVY.com",
      "url": "https://www.wavy.com/news/business/ap-ap-top-business-news-at-1208-a-m-est-2/",
      "description": "Google has the next move as Microsoft embraces OpenAI buzz",
      "body": "Norfolk SPCA to experience extended wait times due\nFormer ABC journalist charged in child porn case\nGroundhog Day 2023: How to watch live from  FBI finds no classified documents at Bidens Rehoboth\nSentara Family Medicine doctor shares advice to stay\nTyre Nichols funeral: Livestream and updates\nVDOT completes work at I-64, I-264 Interchange\nWatch live: Witness testimony continues in Alex Murdaugh",
      "snippet": "Google has the next move as <b>Microsoft</b> embraces OpenAI buzz. Norfolk SPCA to experience extended wait times due Former ABC journalist charged in child ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-01T05:12:09",
      "provider": {
        "name": "wavy",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.wavy.com/wp-content/uploads/sites/3/2019/04/wavy_digitalbrand-min.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wavy",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wavy.com/news/business/ap-ap-top-business-news-at-1208-a-m-est-2/"
      }
    },
    {
      "id": "6290662632274733519",
      "title": "The Microsoft Studio Behind Halo Franchise Is All But Starting From Scratch",
      "url": "https://tech.hindustantimes.com/tech/news/the-microsoft-studio-behind-halo-franchise-is-all-but-starting-from-scratch-71675191916524.html",
      "description": "Microsoft Corp. says its going to keep making new games in the popular Halo franchise at its prized 343 Industries studio  despite rumors to the contrary.",
      "body": "Microsoft Corp. says its going to keep making new games in the popular Halo franchise at its prized 343 Industries studio  despite rumors to the contrary. But after a leadership overhaul, mass layoffs and a host of big changes, the outfit is all but starting from scratch.The Redmond, Washington-based 343 Industries released its latest game, Halo Infinite, in December 2021 to widespread critical acclaim. It was seen as a redemption story for a title that suffered multiple delays, endless development problems and a merry-go-round of creative leads. But in the months that followed, fans turned against the game, complaining about a thin road map and the slow rollout of features that had been expected on day one. At the same time, 343 was seemingly losing staff by the week and went through a major leadership change last fall that led some employees to brace for a reorganization.  The ax fell in mid-January when Microsoft announced mass layoffs and 343 Industries was hit hard. While Microsoft declined to provide specific figures, at least 95 people at the company have lost their jobs, according to a spreadsheet of affected employees reviewed by Bloomberg. The list named dozens of veterans including top directors and contractors, upon which the studio heavily relies. Those temporary employees were given just a few days warning before their contracts came to an end, according to people familiar with the process, asking not to be identified because they werent authorized to speak publicly.    The cuts led to rumors that 343 would farm out development of the Halo series to other game companies. Matt Booty, head of Microsofts Xbox Game Studios, said in an interview that 343 will continue as the internal developer for Halo and as the home of Halo. Internally, Booty has assured 343 staff that even as they work with outside partners and outsourcing houses, they will remain in charge. Questions remain, however, about the fate of the Halo franchise as the studio is hollowed out and makes big changes to how it develops games.    Chief among them is a pivot to a new gaming engine, the suite of tools and technology used to make video games. The studios own engine, known publicly as Slipspace, has been one of the biggest points of contention over the past two decades. Based largely on old code from the 1990s and early 2000s, its buggy and difficult to use and has been the source of headaches for some developers on Halo Infinite, people familiar with the development said. Several multiplayer modes that are nearly finished, such as Extraction and Assault, both popular in previous Halo games, have yet to be released in part because of issues involving the engine, they said.  At several points over the past decade, management at 343 debated switching to Epic Games Inc.s popular Unreal Engine. But it wasnt until late last year, when previous studio head Bonnie Ross and engine lead David Berger departed and Pierre Hintze took over, that the firm finally decided to pivot to Unreal. This switch will start with a new game code-named Tatanka, according to people familiar with the plans. That project, which 343 is developing alongside the Austin, Texas-based game studio Certain Affinity, started off as a battle royale but may evolve in different directions, the people said. Future games in the series will also explore using the Unreal Engine, which may make development easier, although internal skeptics are worried that the switch may have a negative impact on the way Halo games feel to play. A Microsoft spokesman declined to comment on issues with the engine or on the companys plans to pivot to Unreal.  Since Halo Infinite was released, fans had assumed that in addition to new multiplayer modes, 343 was working on new content for the story. But that wasnt the case, according to the people familiar with the situation. Developers were making prototypes in the Unreal Engine and pitching ideas for new Halo games rather than working on new missions for Halo Infinite. Many of those developers were laid off this month and the company isnt actively working on new story content, the people said. A Microsoft spokesman declined to comment.In the eyes of some observers and former 343 employees, the reorganization was a long time coming. The studio, which was founded in 2007 to inherit Halo after Microsoft parted ways with original developer Bungie, has struggled through many challenges, including the release of several polarizing games. Patrick Wren, a former 343 designer, said on Twitter that the job cuts and the state of the Halo franchise overall are the result of incompetent leadership up top during Halo Infinites development that led to massive stress on those working hard to make Halo the best it can be.  Microsoft once promised that Halo Infinite would be the start of the next ten years for Halo, but its recent moves point to a shorter-term vision. In an email to staff following the layoffs, Hintze wrote that the current plan for 343 is to support a robust live offering for Halo Infinite and its Forge level creator and greenlighting our new tech stack for future Halo games while also bringing Halo to more players through more platforms than ever before.  s",
      "snippet": "<b>Microsoft</b> Corp. says its going to keep making new games in the popular Halo franchise at its prized 343 Industries studio despite rumors to the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T04:12:13",
      "provider": {
        "name": "hindustantimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.hindustantimes.com/tech/img/2023/02/01/1600x900/halo_infinite_1672383213882_1675224534924_1675224534924.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hindustantimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://tech.hindustantimes.com/tech/news/the-microsoft-studio-behind-halo-franchise-is-all-but-starting-from-scratch-71675191916524.html"
      }
    },
    {
      "id": "36972118275881533",
      "title": "Ted Cruz Goes After Woke Microsoft Over Xbox Power Saving Settings Update",
      "url": "https://www.techdirt.com/2023/01/31/ted-cruz-goes-after-woke-microsoft-over-xbox-power-saving-settings-update/",
      "description": "If you haven't been living under a rock for the past couple of years, you will be familiar with the concept of the anti-\"woke\" culture war the Republican Party grows and farms for its own purposes. This isn't to say there aren't real cultural conflicts we need to work out as a country, but that",
      "body": "Timothy Geigner\nIf you havent been living under a rock for the past couple of years, you will be familiar with the concept of the anti-woke culture war the Republican Party grows and farms for its own purposes. This isnt to say there arent real cultural conflicts we need to work out as a country, but that doesnt change the simple fact that much of what you hear about in the press is specifically cultivated by one party or another to generate headlines and outrage for the purposes of votes and campaign contributions.\nAnd if youre looking for an avatar for this sort of un-principled outrage manufacturing, Ted Cruz would be one of the first names I would bring up. Cruz claims to be a strict constitutionalist, while also threatening companies for exercising their free speech rights. In most of the cases, Cruz is railing against the woke in favor of shit-peddling lie-factories like OAN, claiming that a company choosing what to do within its own private purview is somehow censorship in favor of wokeism.\nAnd it gets really dumb at times. You may have heard recently that the GOP was out there claiming that the White House was going to be coming to collect not your guns (this time), but your gas-powered ovens/stoves. It wasnt really true. What actually happened was a consumer safety group within the government pointed out that there were a lot of health risks with these ovens and that the group might seek to lower future production of them in favor of safer electric ovens. No jackbooted thugs were going to go house to house and haul away your grandmothers gas stove.\nBut then came Cruz also going after Microsoft. Why Microsoft? Well, because Microsoft had embraced wokeism, according to Cruz, by updating its standard Xbox power settings to be more power efficient. Yes. Yes, really.\nHeres what Microsofts Xbox update actually does: It will cut down on power usage by up to a factor of 20 by changing the default setting of Xbox consoles from sleep to shut down.\nwave of stories from Fox News\nand the like. According to them, not only was Xbox going woke by making these environmentally friendly changes, butFox and Friendshosts Ainsley Earhardt and Jimmy Failla suggested Microsoft was trying to recruit your kids into climate politics.\nThe open question appears to be: if this is wokeism, which its not, then that doesnt explain what in the world is wrong with any of this. What, specifically, is Cruz objecting to here? The end customer is barely going to notice any difference other than a slightly longer boot time. The only other differences he or she might notice is a lower electricity bill, a longer-lasting Xbox console, and maybe the air outside is just a little bit less polluted. Where is there a problem to rail against here?\nBut the idea behind a manufactured culture war is to make good use of the echo chamber, which is exactly what happened next.\nBut again, whats the point of video games? Its for kids to be kids, Faila suggested in a\nTuesdayFox and Friendssegment\nabout Microsofts Xbox plans. Now you sit down and pick up a controller and theyre like by the way, the world is on fire, AHH. You know what I mean? You just want to play the game!\nAnd you can. That hasnt changed. The console doesnt tell you the world is on fire. The console doesnt open to a splash screen requiring you to donate to Black Lives Matter before you start your game. It just you know starts up and plays your game.\nSo please, whatever your political leanings, dont fall for this stuff. Cruz knows better, but hes trying to take advantage of you. Dont let him.\nFiled Under: energy, energy saving, power saving, ted cruz, woke,",
      "snippet": "But then came Cruz also going after <b>Microsoft</b>. Why <b>Microsoft</b>? Well, because <b>Microsoft</b> had embraced wokeism, according to Cruz, by updating its ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T04:08:26",
      "provider": {
        "name": "techdirt",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.techdirt.com/wp-content/themes/techdirt/assets/images/td-rect-logo-white.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "techdirt",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.techdirt.com/2023/01/31/ted-cruz-goes-after-woke-microsoft-over-xbox-power-saving-settings-update/"
      }
    },
    {
      "id": "1138468454046643123",
      "title": "Microsoft studio behind halo faces a reboot on years of turmoil",
      "url": "https://indianexpress.com/article/technology/microsoft-studio-behind-halo-faces-a-reboot-on-years-of-turmoil-8416603/",
      "description": "The cuts led to rumors that 343 would farm out development of the Halo series to other game companies. Matt Booty, head of Microsofts Xbox Game Studios, said in an interview that 343 will continue as the internal developer for Halo and as the home of Halo.",
      "body": "Microsoft Corp. says its going to keep making new games in the popular Halo franchise at its prized 343 Industries studio  despite rumors to the contrary. But after a leadership overhaul, mass layoffs and a host of big changes, the outfit is all but starting from scratch. The Redmond, Washington-based 343 Industries released its latest game, Halo Infinite, in December 2021 to widespread critical acclaim. It was seen as a redemption story for a title that suffered multiple delays, endless development problems and a merry-go-round of creative leads. But in the months that followed, fans turned against the game, complaining about a thin road map and the slow rollout of features that had been expected on day one. At the same time, 343 was seemingly losing staff by the week and went through a major leadership change last fall that led some employees to brace for a reorganization. The ax fell in mid-January when Microsoft announced mass layoffs and 343 Industries was hit hard. While Microsoft declined to provide specific figures, at least 95 people at the company have lost their jobs, according to a spreadsheet of affected employees reviewed by Bloomberg. The list named dozens of veterans including top directors and contractors, upon which the studio heavily relies. Those temporary employees were given just a few days warning before their contracts came to an end, according to people familiar with the process, asking not to be identified because they werent authorized to speak publicly. The cuts led to rumors that 343 would farm out development of the Halo series to other game companies. Matt Booty, head of Microsofts Xbox Game Studios, said in an interview that 343 will continue as the internal developer for Halo and as the home of Halo. Internally, Booty has assured 343 staff that even as they work with outside partners and outsourcing houses, they will remain in charge. Questions remain, however, about the fate of the Halo franchise as the studio is hollowed out and makes big changes to how it develops games. Chief among them is a pivot to a new gaming engine, the suite of tools and technology used to make video games. The studios own engine, known publicly as Slipspace, has been one of the biggest points of contention over the past two decades. Based largely on old code from the 1990s and early 2000s, its buggy and difficult to use and has been the source of headaches for some developers on Halo Infinite, people familiar with the development said. Several multiplayer modes that are nearly finished, such as Extraction and Assault, both popular in previous Halo games, have yet to be released in part because of issues involving the engine, they said. At several points over the past decade, management at 343 debated switching to Epic Games Inc.s popular Unreal Engine. But it wasnt until late last year, when previous studio head Bonnie Ross and engine lead David Berger departed and Pierre Hintze took over, that the firm finally decided to pivot to Unreal. This switch will start with a new game code-named Tatanka, according to people familiar with the plans. That project, which 343 is developing alongside the Austin, Texas-based game studio Certain Affinity, started off as a battle royale but may evolve in different directions, the people said. Future games in the series will also explore using the Unreal Engine, which may make development easier, although internal skeptics are worried that the switch may have a negative impact on the way Halo games feel to play. A Microsoft spokesman declined to comment on issues with the engine or on the companys plans to pivot to Unreal. Since Halo Infinite was released, fans had assumed that in addition to new multiplayer modes, 343 was working on new content for the story. But that wasnt the case, according to the people familiar with the situation. Developers were making prototypes in the Unreal Engine and pitching ideas for new Halo games rather than working on new missions for Halo Infinite. Many of those developers were laid off this month and the company isnt actively working on new story content, the people said. A Microsoft spokesman declined to comment. In the eyes of some observers and former 343 employees, the reorganization was a long time coming. The studio, which was founded in 2007 to inherit Halo after Microsoft parted ways with original developer Bungie, has struggled through many challenges, including the release of several polarizing games. Patrick Wren, a former 343 designer, said on Twitter that the job cuts and the state of the Halo franchise overall are the result of incompetent leadership up top during Halo Infinites development that led to massive stress on those working hard to make Halo the best it can be. Microsoft once promised that Halo Infinite would be the start of the next ten years for Halo, but its recent moves point to a shorter-term vision. In an email to staff following the layoffs, Hintze wrote that the current plan for 343 is to support a robust live offering for Halo Infinite and its Forge level creator and greenlighting our new tech stack for future Halo games while also bringing Halo to more players through more platforms than ever before.",
      "snippet": "<b>Microsoft</b> Corp. says its going to keep making new games in the popular Halo franchise at its prized 343 Industries studio despite rumors to the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T03:03:36",
      "provider": {
        "name": "indianexpress",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.indianexpress.com/2023/02/microsoft-helo.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indianexpress",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://indianexpress.com/article/technology/microsoft-studio-behind-halo-faces-a-reboot-on-years-of-turmoil-8416603/"
      }
    },
    {
      "id": "6254251070040737755",
      "title": "Windows 10 licenses are no longer available on Microsoft website today, January 31",
      "url": "https://mspoweruser.com/january-31-windows-10-licenses-are-no-longer-available-on-microsoft-website/",
      "description": "It's official: Microsoft is no longer offering Windows 10 product keys on its product pages, even if it is just January 31.  Microsoft informed its customers",
      "body": "Windows 11\nproduct page.\nThis means bad news for individuals hoping to get their last-minute shopping to build a Windows 10 PC. Fortunately, Windows 10 licenses will still be offered by third-party retailers, though the availability of the said product wouldnt forever be ample.\nOn the other hand, while the product will no longer be offered on the Microsoft website, Windows 10 users will still be able to use their OS, as the EOS date of Windows 10 PCs is in 2025.\nWindows 10 will remain supported with security updates that help protect your PC from viruses, spyware, and other malware until October 14, 2025, Microsoft\nassures\n.\nMicrosofts move to cut Windows 10 downloads on its sites came as it continuously pushes more users to embrace its newest OS, Windows 11. Currently, Windows 10 still has the biggest",
      "snippet": "It's official: <b>Microsoft</b> is no longer offering Windows 10 product keys on its product pages, even if it is just January 31. <b>Microsoft</b> informed its ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T03:02:12",
      "provider": {
        "name": "mspoweruser",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mspoweruser.com/wp-content/uploads/2023/02/windows-10-logo.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mspoweruser",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://mspoweruser.com/january-31-windows-10-licenses-are-no-longer-available-on-microsoft-website/"
      }
    },
    {
      "id": "7182354869983535078",
      "title": "Your Digital Self: ChatGPT is challenging Googles control over internet search setting up an epic clash of AI titans",
      "url": "https://forextv.com/market-news/your-digital-self-chatgpt-is-challenging-googles-control-over-internet-search-setting-up-an-epic-clash-of-ai-titans/",
      "description": "Googles Sparrow faces a risky and expensive battle with ChatGPT and Microsoft for AI dominance . Read Full Story",
      "body": "Google's Sparrow faces a risky and expensive battle with ChatGPT and Microsoft for AI dominance .\r\nRead Full Story",
      "snippet": "... expensive battle with ChatGPT and <b>Microsoft</b> for AI dominance . Google's Sparrow ... and expensive battle with ChatGPT and <b>Microsoft</b> for AI dominance.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T02:18:00",
      "provider": {
        "name": "forextv",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "forextv",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://forextv.com/market-news/your-digital-self-chatgpt-is-challenging-googles-control-over-internet-search-setting-up-an-epic-clash-of-ai-titans/"
      }
    },
    {
      "id": "9084607988287664427",
      "title": "Microsoft officially announces Xbox Series X, Series S price hike in Japan",
      "url": "https://mspoweruser.com/microsoft-officially-announces-xbox-series-x-series-s-price-hike-in-japan/",
      "description": "Microsoft is set to increase the price of its Xbox Series X and Series S consoles in Japan on February 17. While the hike announcement is currently limited to t",
      "body": "Xbox\nMicrosoft is set to increase the price of its Xbox Series X and Series S consoles in Japan on February 17. While the hike announcement is currently limited to the country, it might be a hint that the same will happen to other western markets in the coming weeks. (via\nGematsu\n)\nThis hike will put the Xbox Series X price, which currently costs 54,978 yen, to 59,978 yen. That translates to $422 to $460, which means a $38 increase. Meanwhile, the Xbox Series S will increase from 32,278 yen to 37,978 yen or $248 to $292, an additional $44.\nMicrosoft Japan already informed the customers about the price increase of the said consoles.\nAfter carefully evaluating the market condition in Japan, we have decided to change the suggested retail price of Xbox consoles in the country, Microsoft Japan explained. We regularly evaluate the impact of local pricing to maintain reasonable consistency across regions. This price revision affects our customers and was a difficult decision to make, but going forward we will continue to provide the ultimate Xbox experience that our customers expect.\nThe news is no surprise since Xbox Lead Phil Spencer himself\nadmitted\nit in October, expressing the companys need to look at the return on our business, the cost of the business.\nWeve held price on consoles, and held price on games, and our subscription. I dont think well be able to do that forever. Spencer said at that time. I do think that at some point, well have to raise some prices on certain things, but going into this holiday, we thought it was really important to maintain the prices that we have because consumers, right now, are more uncertain than they have been in a long time.\nPrior to this, Microsoft had already\nconfirmed\nhigher prices on its first-party games, causing the titles like Forza Motorsport, Redfall, and Starfield to charge $69.99 instead of the usual $59.99.\nWeve held on price increases until after the holidays so families can enjoy the gift of gaming. Starting in 2023 our new, built for next-gen, full-priced games, including Forza Motorsport, Redfall, and Starfield, will launch at $69.99 USD on all platforms, said Microsoft, explaining the decision. This price reflects the content, scale, and technical complexity of these titles. As with all games developed by our teams at Xbox, they will also be available with Game Pass the same day they launch.",
      "snippet": "<b>Microsoft</b> is set to increase the price of its Xbox Series X and Series S consoles in Japan on February 17. While the hike announcement is currently ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T02:06:38",
      "provider": {
        "name": "mspoweruser",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mspoweruser.com/wp-content/uploads/2023/02/xbox-japanflag.webp",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mspoweruser",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://mspoweruser.com/microsoft-officially-announces-xbox-series-x-series-s-price-hike-in-japan/"
      }
    },
    {
      "id": "8112211754367492145",
      "title": "Microsoft Survey: professionals approve AI, automation in their work tools",
      "url": "https://mspoweruser.com/microsoft-survey-professionals-approve-ai-automation-in-their-work-tools/",
      "description": "Microsoft is heavily investing in artificial intelligence now, and it is not a secret, given its multi-billion investment in ChatGPT-creator OpenAI. And to dig",
      "body": "survey\n, which shows 85% of workers want collaboration tools integrated with more automation capabilities.\nThe survey was conducted on 2,700 employees and 1,800 business decision makers (BDMs) in the United States, the United Kingdom, and Japan. The survey highlights respondents views regarding digital transformation, wherein 87% of employees said the need for it is more important now than ever before.\nAccording to the results, 89% of participants with access to automation and AI-powered tools feel more fulfilled because they can spend time on work that truly matters. In relation to that, 89% or 9 in 10 individuals said they wish they could apply AI solutions to even more tasks and activities.\nSpecifically, 9 in 10 or 85% of the respondents said they would want more automation capabilities in their collaboration tools, as 77% or 3 out of 4 respondents expressed their desire for low-code or no-code tools or platforms. As mentioned by Microsoft, the latter figure reflects the result of its 2022 Low-Code Trend Report, wherein 80% of respondents said low-code tools allowed them to be self-sufficient in addressing tasks instead of relying on developers.\nThe survey findings are clear: people want digital productivity tools that allow them to cut out the busywork so they can focus on the real tasks at hand, Microsoft concluded. They also want a say in how these tools are selected and implemented. Perhaps most of all, they want tools that are intuitive and easy to use, and that allow them to collaborate seamlessly and work efficientlywherever work happens to be.\nThe survey was released as the Redmond company continues to invest in AI technology. Last week, Microsoft\nconfirmed\nthe third phase of its multiyear, multibillion dollar investment in OpenAI, which should allow it to further benefit from the power of artificial intelligence to improve its products and services. Earlier this month, reports about the companys plan to integrate OpenAIs ChatGPT tech into",
      "snippet": "<b>Microsoft</b> is heavily investing in artificial intelligence now, and it is not a secret, given its multi-billion investment in ChatGPT-creator ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T02:01:40",
      "provider": {
        "name": "mspoweruser",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mspoweruser.com/wp-content/uploads/2023/01/ai-revised2.gif",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mspoweruser",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://mspoweruser.com/microsoft-survey-professionals-approve-ai-automation-in-their-work-tools/"
      }
    },
    {
      "id": "225723839919729863",
      "title": "Microsoft appoints Miki Tsusaka as New President of Microsoft Japan",
      "url": "https://finance.yahoo.com/news/microsoft-appoints-miki-tsusaka-president-010000627.html",
      "description": "Microsoft is pleased to announce that Miki Tsusaka has been appointed as the new President of Microsoft Japan, effective today. Tsusaka will lead Microsoft...",
      "body": "The item, which is six by eight millimeters in size, may have been caught in the tires of passing vehicles and taken off track to where teams are searching.\n2d ago\nMoneyWise\nEarly retirement is a dream for many  that can turn into a nightmare.\n10h ago\nWhy Phillips 66 Stock Is Slumping Today\nShares of Phillips 66 (NYSE: PSX) fell more than 5% by 12:30 p.m. ET on Tuesday.  Weighing on the refining company's stock price were its lackluster fourth-quarter results.  Adjusted pre-tax income from its chemicals segment declined from $135 million in the third quarter to $52 million in the fourth quarter.\n8h ago\nApple's (AAPL) first-quarter fiscal 2023 earnings are likely to have suffered from disruptions at its China partner Foxconn's factory in Zhengzhou, as well as the shrinking demand for iPhone.\n9h ago\nFortune\nRyan Olohan was told there were \"obviously too many white guys\" on his management team.\n1d ago\nSeeking at Least 7% Dividend Yield? Analysts Suggest 2 Dividend Stocks to Buy\nInflation made the headlines through most of last year, for all the worst reasons: it ran far too high, peaked above 9% in June, and the inflationary pressures pushed down hard on stock markets. The Fed jacked interest rates up their highest level in over a decade, risking recession to fight the rise in prices. Today, inflation is still in the headlines, although the tone has shifted. The annualized rate is trending downward; the December number came in at 6.5% year-over-year. While this is good\n1d ago\nThe iconic money manager with a penchant for aggressive growth aims to close out January with a bang.\n10h ago\nCostco Gets Ready to Raise its Membership Prices\nCostco  has a tremendously loyal customer base with an over 90% membership renewal rate worldwide and an even higher rate in the United States (92.5%) in its most recent quarter.  Currently, Costco charges $60 for a Gold Star membership and $120 for an Executive membership.  Executive members have been rising in importance for the company.\n1d ago\nMarketWatch\nAmazon.com Inc. is expected to reveal its first unprofitable year since 2014 this week  and expectations for the year aren't headed in a positive direction.\n6h ago\nMarketWatch\nIm paying my financial adviser 1%, but the only communications I get are  invoices. So I want to regain sole control of my accounts  without having to talk to him about it. Is this possible?\nQuestion: Eight years ago I hired a financial advisor because the rounds of layoffs at work were coming more regularly, and I wanted to know if my savings were enough for me to retire.  The financial advisor began managing some of my accounts for me for a fee of 1%.\n9h ago\nThe Federal Reserve is expected to slow its pace of interest rate increases for the second-straight meeting on Wednesday, raising its benchmark interest rate another 0.25%.\n12h ago\nGeelys Lotus Going Public via SPAC at $5.4 Billion Valuation\n(Bloomberg) -- Lotus Technology, the electric-car maker owned by Chinas Zhejiang Geely Holding Group Co., agreed to merge with a blank-check company in a transaction that values the combined entity at about $5.4 billion.Most Read from BloombergSony Slashes PlayStation VR2 Headset Output After Pre-Orders DisappointPutins War in Ukraine Pushes Ex-Soviet States Toward New AlliesBrexit Is Costing the UK 100 Billion a Year in Lost OutputMicrosoft Studio Behind Halo Faces a Reboot on Years of Turmo\n4h ago",
      "snippet": "Tsusaka will lead <b>Microsoft</b>.\nLotus Technology, the electric-car maker owned by Chinas Zhejiang Geely Holding Group Co., agreed to merge with a blank-check company in a transaction that values the combined entity at about $5.4 billion.Most Read from BloombergSony Slashes PlayStation VR2 Headset Output After Pre-Orders DisappointPutins War in Ukraine Pushes Ex-Soviet States Toward New AlliesBrexit Is Costing the UK 100 Billion a Year in Lost Output<b>Microsoft</b> Studio Behind Halo Faces a Reboot on Years of Turmo 4h ago.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-01T01:00:00",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.zenfs.com/en/prnewswire.com/af0961ef4f4295536d5165ff3d30ed94",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://finance.yahoo.com/news/microsoft-appoints-miki-tsusaka-president-010000627.html"
      }
    },
    {
      "id": "266347716207808716",
      "title": "Microsoft is pulling many beloved games off the Xbox 360 store on February 7th",
      "url": "https://www.theverge.com/2023/1/31/23580498/microsoft-xbox-360-store-removals",
      "description": "Microsoft will be removing a bunch of beloved games from the Xbox 360 Marketplace on February 7th, according to a support page on the Xbox website. After that date, you wont be able to buy them.",
      "body": "Microsoft will be removing a bunch of beloved games from the Xbox 360 Marketplace on February 7th, according to a support page on the Xbox website (via Wario64), meaning you wont be able to buy them after that date.\n\nIts not all bad news. If youve already bought a game thats getting pulled, you can still download it after February 7th. Games being removed that are available on Xbox One and Xbox Series X / S stores will remain purchasable on those platforms.\n\nBut that does mean digital games only available on the Xbox 360 Marketplace will be unavailable for purchase in just a week. Users on Resetera have figured out which games fall into that category and will be going away for good, and the list includes some well-known titles like Jet Set Radio, Left 4 Dead and Left 4 Dead 2, Spelunky, and The Orange Box.\n\nThe games leaving the Xbox 360 Marketplace varies based on your region, and you can see which titles are being pulled by checking Microsofts site. Heres the full list for the US.\n\nWhen asked about the removals, Microsoft shared these statements from Xbox global product marketing manager Bree Adams with The Verge:\n\n> Beginning on February 7, 2023, a limited set of games, add-ons, and in-game content will no longer be purchasable in select markets via the Xbox 360 Store. These titles will no longer be purchasable on the Xbox 360 Store only, and titles that are available to be purchased on the Xbox One and Xbox Series X|S Stores will remain purchasable. You will still be able to play discs or previously downloaded games on your Xbox 360 and modern consoles if they are backwards compatible titles. For more information on the games impacted in your region, visithere.\n> Impacted Xbox 360 titles purchased before February 7, 2023 will be available to redownload via your previously purchased content through the Xbox 360 Download Historyhere.\n\nUnfortunately, losing the ability to purchase older digital video games is becoming something of a regular occurrence. Nintendo will be closing the eShop on Wii U and 3DS in less than two months. Microsoft has previously delisted several Forza titles. And in late 2021, Sony made it much harder to shop on the PS3 and Vita stores.\n\nWhile its disappointing that you dont have much time to make a choice about buying these disappearing Xbox 360 titles, at least we know when theyll be going away. So if youve been wavering on finally picking up The Orange Box on Xbox, make sure you get it before February 7th.",
      "snippet": "<b>Microsoft</b> will be removing a bunch of beloved games from the Xbox 360 Marketplace on February 7th, according to a support page on the Xbox ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:54:10.304",
      "provider": {
        "name": "theverge",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/QAtUXm_Fwld5N7pAbAI856EhoU0=/0x0:1024x576/1200x628/filters:focal(455x296:456x297)/cdn.vox-cdn.com/uploads/chorus_asset/file/24400463/0000001867.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theverge",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.theverge.com/2023/1/31/23580498/microsoft-xbox-360-store-removals"
      }
    },
    {
      "id": "5376147817956137098",
      "title": "It looks like the date for Microsoft Build 2023 has just leaked",
      "url": "https://www.windowscentral.com/microsoft/it-looks-like-the-date-for-microsoft-build-2023-has-just-leaked",
      "description": "Microsoft's annual Build conference for Windows, Azure, and Microsoft 365 developers is yet to receive an official release date, but a quick peek at the Microsoft Build websites page source has reveal",
      "body": "What you need to know\nDates for Microsoft's annual Build developer conference have leaked ahead of announcement.\nViewing the page source of the Microsoft Build website reveals the dates May 23-25.\nLast year's Build conference was held on May 24-26 in Seattle and online.\nMicrosoft's annual Build conference for Windows, Azure, and Microsoft 365 developers is yet to receive an official event date, though the event itself has been confirmed to be taking place at some point this year. Now, a quick peek at the Microsoft Build website's page source has revealed the potential date.\n, the date \"May 23-25, 2023\" can be seen when checking the page source on the Microsoft Build website, giving us a solid reason to think that's the date Microsoft Build 2023 will be held.\nThe current live version of the\nMicrosoft Build website\n(opens in new tab)\nwas just recently updated to say the following: \"Thank you for your interest in Microsoft Build.We're getting ready to launch registration - check back soon!\" This just suggest that Microsoft is almost ready to announce dates for the event.\nOf course, the dates spotted in the page source could simply be a placeholder until Microsoft has an actual date locked in, but considering last year's Build conference took place on May 24-26, we think May 23-25 for Build 2023 is a likely candidate. This would have the event run from Tuesday to Thursday.\nIf you check the page source for https://t.co/vDigeHYISm Then MS Build 2023 will take place between May 23rd and 25th https://t.co/qftdq3kGba pic.twitter.com/RKY8aTiZix\nJanuary 31, 2023\nSee more\nIt's currently unclear if Build 2023 will be a hybrid digital and in-person event like last year, or if the company plans to return to an all-digital event for this year. In-person attendance was limited in 2022, with many opting to tune into the event digitally instead.\nMicrosoft Build is where Microsoft often announces new features for developers, including updates to the Windows App SDK, Microsoft 365, and more. Unfortunately, Microsoft rarely talks about new Windows features at Build these days, though that doesn't mean they couldn't start doing so now we know Windows 11 is being developed on a \"continuous innovation\" release schedule.\nWindows Central Newsletter",
      "snippet": "Viewing the page source of the <b>Microsoft</b> Build website reveals the dates May 23-25. Last year's Build conference was held on May 24-26 in Seattle and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:31:50",
      "provider": {
        "name": "windowscentral",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/kqFbMopXBE5TgEyN7XE8xT.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "windowscentral",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.windowscentral.com/microsoft/it-looks-like-the-date-for-microsoft-build-2023-has-just-leaked"
      }
    },
    {
      "id": "745969299580103645",
      "title": "Xbox Game Pass Getting One of 2023's Biggest Annualized Releases",
      "url": "https://comicbook.com/gaming/news/xbox-game-pass-gamepass-games-mlb-the-show-23/",
      "description": "Xbox Game Pass subscribers can now look forward to getting one of the biggest annualized releases of 2023 on the first day of its launch. Any given calendar year, video game fans can come to expect new versions of games like NBA 2K, Madden, FIFA, and more often than not, Call of Duty. And while [...]",
      "body": "confirmed\nthat the latest edition of The Show will be coming to Xbox Game Pass upon release. This marks the third year in a row that MLB The Show has landed on Xbox Game Pass at launch, which clearly indicates that this is something Microsoft is looking to continue in perpetuity with the series.\nDespite still being a franchise that is developed and published within PlayStation Studios, Xbox has had the inside track on MLB The Show in recent years thanks to its availability on Game Pass. When MLB The Show first made the jump to Xbox platforms back in 2021, fans were shocked to see that Microsoft had scored a Game Pass deal for a PlayStation product. Now, this has largely become expected to see take place.\nAs for what MLB The Show 23 will have in store that's new this time around, well, we still don't really know. Gameplay footage from the title hasn't been shown off just yet. Instead, all that San Diego Studio has confirmed is that Miami Marlins outfielder Jazz Chisholm Jr. will be donning the box art this year and that the game itself will arrive on March 28th.\nRelated:",
      "snippet": "... landed on Xbox Game Pass at launch, which clearly indicates that this is something <b>Microsoft</b> is looking to continue in perpetuity with the series.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:04:29",
      "provider": {
        "name": "comicbook",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://sportshub.cbsistatic.com/i/2022/07/01/164cf003-4774-4cd4-95c4-a31047c63594/xbox-game-pass.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "comicbook",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://comicbook.com/gaming/news/xbox-game-pass-gamepass-games-mlb-the-show-23/"
      }
    },
    {
      "id": "187258082110744087",
      "title": "This day in search marketing history: February 1",
      "url": "https://searchengineland.com/search-marketing-history-february-1-392489",
      "description": "Bing accused  of copying Google's search results, plus: Microsoft tries to buy Yahoo, about this result, fake locksmith issues and more.",
      "body": "This day in search marketing history: February 1\nThis day in search marketing history: February 1\nBing accused  of copying Google's search results, plus: Microsoft tries to buy Yahoo, about this result, fake locksmith issues and more.\non February 1, 2023 at 12:30 am | Reading time: 10 minutes\nGoogle accuses Bing of copying its search results\nIn 2011, the headline Google: Bing Is Cheating, Copying Our Search Results appeared first on Search Engine Land.\nAs Danny Sullivan reported: Google has run a sting operation that it says proves Bing has been watching what people search for on Google, the sites they select from Googles results, then uses that information to improve Bings own search listings.\nThe story actually began in May 2010, when Google noticed that Bing was returning the same sites as Google when someone would enter unusual misspellings. By October 2010, the results for Google and Bing had a much greater overlap than in previous months.Ultimately, Google created a honeypot page to show up at the top of 100 synthetic searches (queries that few people, if anyone, would ever enter into Google).\nThis story got picked up by dozens of media outlets as both companies got into a public war of words and blog posts.\nGoogle called Bings search results a cheap imitation.\nMeanwhile, Bing called the sting operation a ",
      "snippet": "... copying Google's search results, plus: <b>Microsoft</b> tries to buy Yahoo, about ... copying Google's search results, plus: <b>Microsoft</b> tries to buy Yahoo, about ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:00:00",
      "provider": {
        "name": "searchengineland",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://searchengineland.com/wp-content/seloads/2023/01/this-day-in-search-marketing-history-february-1-search-engine-land.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "searchengineland",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://searchengineland.com/search-marketing-history-february-1-392489"
      }
    },
    {
      "id": "7004231677078100246",
      "title": "Why you might not be done with your January Microsoft security patches",
      "url": "https://www.csoonline.com/article/3686692/why-you-might-not-be-done-with-your-january-microsoft-security-patches.html",
      "description": "Microsoft released a flurry of security patches and updates in January, so it would be easy to overlook these two.",
      "body": "(CC0)\nThe January patching window for your firm has probably come and gone. But has it? While January included a huge release of patches, several releases in other months have provided more than one headache for the patch management community. These are the patches and updates you need to evaluate if you havent already done so.\nBitLocker Security Feature Bypass Vulnerability\nIn January, additional information came out about CVE-2022-41099, the BitLocker Security Feature Bypass Vulnerability. If youve already deployed the November or later security updates to your network and have done nothing else, you arent done with the evaluation of this update.\nFirst, you need to determine your risk level. For this attack to be successful, the attacker needs physical access to your computer. There is much less risk for devices that have physical security and are locked or stored securely. If you have disabled the Windows Recovery Environment (WindRE) partition because you have alternative means to recover and reimage your devices, you are also not at risk. If you are somewhere in the middle youll need to determine if you need to take action.\nPatching is not enough. You must also apply the applicable Windows security update to your WinRE. Besides disabling the recovery partition, you could also use a GitHub script to update the WinRE for this vulnerability and ensure it is patched appropriately. Additional discussions describe the potential for additional attack sequences, but it appears at this point to be an attack sequence that leads us back to theoretical attacks rather than proven attack sequences as well as remembering the long-standing Immutable Law of Security #3: If a bad actor has unrestricted physical access to your computer, it's not your computer anymore.\nKerberos hardening updates\nMany administrators are still evaluating the impact of the November Kerberos hardening updates. Any patch installed on your domain controller that includes the November or later updates will have potential impact on your domain. To be proactive the following is recommended:\nFirst, determine if these updates will impact your domain. A PowerShell script is available to detect potential authentication issues that may occur in an Active Directory (AD) domain after installing these updates. As noted, Run the script in PowerShell with domain administrator privileges from a machine with AD RSAT tools installed, such as on a domain controller. The script will output any detected compatibility issues found in the domain related to changes made for CVE-2022-37966.\nAs noted in a Microsoft blog, the November updates caused issues with authentication, and Microsoft released an out-of-band update to fix the issue. Many patching administrators skipped over both the November and December updates waiting for issues to shake out.\nNext, if you cant remember the last time your organization changed the password to the Kerberos account (Krbtgt account), then you are long overdue to run this script to do so. There are various modes for the script, and its recommended to run it in this order:\nMode 1: Informational mode (no changes at all)\nMode 8: Create TEST KrbTgt accounts\nMode 2: Simulation mode (temporary canary object created, no password reset)\nMode 3: Simulation mode -- Use KrbTgt TEST/BOGUS accounts (password will be reset once)\nMode 4: Real reset mode -- Use KrbTgt PROD/REAL accounts (password will be reset once)\nMode 9: Cleanup TEST KrbTgt accounts (could be skipped to reuse accounts the next time)\nIts recommended to change the Krbtgt password twice, waiting 24 hours between each change before changing it the second time. This is also the recommended process if you have a compromised Active Directory. Its also recommended to reset all administrator and service account passwords twice.\nIf you only reset the password once:\nAfter first reset, the new KRBTGT password replicates to all the DCs in the domain.\nAll new tickets will use the new password (KRB1).\nOld tickets issued by old KRBTGT password (KRBOLD) should continue to work as password history is 2.\nPost old tickets expiry they should renew tickets with new KRBTGT password (KRB1).\nPresent KRBTGT passwords will be KRB1 and KRBOLD.\nWhen you reset the password twice, wait for 24 hours to pass:\nAfter second reset new KRBTGT password replicates to all the DCs in the domain.\nAll new tickets will use the new password (KRB2).\nOld tickets issued by old KRBTGT password (KRB1) should continue to work as password history is 2.\nPresent KRBTGT passwords will be KRB1 and KRB2.\nPost old tickets expiry they should renew tickets with new KRBTGT password (KRB2).\nOld KRBTGT password (KTB old) not valid anymore as password history is of 2.\nThese Kerberos updates are only in audit mode now and will be enforced later. The December 13 updates have added auditing events. If you are not seeing any such events in your event logs, you should be able to implement the hardening mode in advance by setting the KrbtgtFullPacSignature registry setting or waiting for the enforcement phases. As Microsoft notes, in July 2023 the default setting will be enforced.\nYou want to look for events now before the new settings are enforced. To do so, open the system event log and filter as follows:\nSusan Bradley\nWhile not enforced at this time, the impact on legacy systems should be investigated. You may need to have your team open support cases to discuss the impact and options with Microsoft. After this patch is enforced, all legacy operating systems will fail to authenticate via Kerberos.\nThe impact of these two patching-related issues is not immediate. You have time for your team to investigate. Dont wait too long or expect Microsoft to roll back the impact on these two patches. Both are certain to create more work for your BitLocker and AD teams.\nNext read this",
      "snippet": "<b>Microsoft</b> released a flurry of security patches and updates in January, so it would be easy to overlook these two. (CC0) The January patching window ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:00:00",
      "provider": {
        "name": "csoonline",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.idgesg.net/images/article/2020/01/cso_microsoft_windows_7_security_patches_updates_by_tookapic_and_garik_barseghyan_aka_insspirito_2400x1600-100827635-large.jpg?auto=webp&quality=85,70",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "csoonline",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.csoonline.com/article/3686692/why-you-might-not-be-done-with-your-january-microsoft-security-patches.html"
      }
    },
    {
      "id": "3334769060728232157",
      "title": "Report: Microsoft Bings ChatGPT feature to be faster and richer with GPT-4",
      "url": "https://searchengineland.com/report-microsoft-bings-chatgpt-feature-to-be-faster-and-richer-with-gpt-4-392565",
      "description": "As reported earlier, we are now learning more about Microsoft's plans to incorporate ChatGPT into Bing Search.",
      "body": "Report: Microsoft Bings ChatGPT feature to be faster and richer with GPT-4\nReport: Microsoft Bings ChatGPT feature to be faster and richer with GPT-4\nAs reported earlier, we are now learning more about Microsoft's plans to incorporate ChatGPT into Bing Search.\nBarry Schwartz\non February 1, 2023 at 4:19 pm | Reading time: 3 minutes\nAs reported earlier, we are now learning more about Microsofts plans to incorporate ChatGPT into Bing Search. Reed Albergotti said that it is not just ChatGPT from OpenAI that is being added to Bing Search but a faster and richer version named GPT-4.\nThe report. The report says, The most interesting improvement in the latest version described by sources is GPT-4s speed. Right now, it can take a while  sometimes minutes in my experience  for ChatGPT to answer.\nCurrently, ChatGPT, which runs off GPT-3.5, feels slow and can take minutes to output the result. The replies generated through GPT-4 reportedly sound more human and are more detailed, the report says.\nGPT-4. GPT-4, which stands for Generative Pre-trained Transformer 4, is a neural network created by OpenAI. It is the next version of GPT-3.5, which is currently used by ChatGPT.\nAs a reminder, OpenAI introduced ChatGPT in November 2022. It is built on OpenAIs GPT-3.5 family of large language models, and is fine-tuned with both supervised and reinforcement learning techniques.\nChatGPT uses content across the web from before 2021 to teach itself how to answer questions, but when it comes to recent and trending topics, it has difficulty. You can learn more about how it technically works in",
      "snippet": "Report: <b>Microsoft</b> Bings ChatGPT feature to be faster and richer with GPT-4 Report: <b>Microsoft</b> Bings ChatGPT feature to be faster and richer with GPT-4 ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:00:00",
      "provider": {
        "name": "searchengineland",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://searchengineland.com/wp-content/seloads/2019/08/robots-on-laptops-ss-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "searchengineland",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://searchengineland.com/report-microsoft-bings-chatgpt-feature-to-be-faster-and-richer-with-gpt-4-392565"
      }
    },
    {
      "id": "329371181962670066",
      "title": "Why Microsoft Stock Topped the Market Today",
      "url": "http://fool.com/investing/2023/02/01/why-microsoft-stock-topped-the-market-today/",
      "description": "The company's high-profile artificial-intelligence partner made an important announcement.",
      "body": "A smart push into artificial intelligence (AI) was benefiting Microsoft\n(\n1.99%\n)\nand its shareholders on Wednesday. A business the tech company has placed a bet on announced a move aimed at capitalizing on its famous innovation, and investors were guardedly optimistic about that development.\nSo what\nArguably the most high-profile AI application on the scene today, ChatGPT is going commercial. OpenAI, the platform's developer, announced on its official blog that it's launching a pilot subscription plan called ChatGPT plus. Users who pay $20 per month will receive general and unfettered access to ChatGPT, even at peak times. OpenAI also promises faster response times and priority access to new features and upgrades in the system.\nChatGPT plus is now open for customers located in the U.S. OpenAI added that it will start inviting individuals on the service's waitlist in the coming weeks. It didn't get more specific about timing.\n\"We love our free users and will continue to offer free access to ChatGPT,\" it added. \"By offering this subscription pricing, we will be able to help support free access availability to as many people as possible.\"\nNow what\nAll this directly affects Microsoft, even if it hasn't yet had a significant impact. The tech giant is a key investor in OpenAI, having provided three rounds of investment into its business. The company has been coy about how much it's spent and whether this gives it an ownership stake of any meaningful size.\nRegardless, it's clear that AI is one of Microsoft's many ambitions. By being directly invested in OpenAI, it's backing a prize horse in the race.",
      "snippet": "A smart push into artificial intelligence (AI) was benefiting <b>Microsoft</b> ( 1.99% ) and its shareholders on Wednesday. A business the tech company has ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:00:00",
      "provider": {
        "name": "fool",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://g.foolcdn.com/editorial/images/719007/person-using-a-laptop-and-tablet-simultaneously.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fool",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://fool.com/investing/2023/02/01/why-microsoft-stock-topped-the-market-today/"
      }
    },
    {
      "id": "3945566154400202516",
      "title": "Microsoft Is Making Massive Investments in AI and ChatGPT and Shares Could Be Really Cheap for Long-Term Buyers",
      "url": "http://fool.com/investing/2023/02/01/microsoft-is-making-massive-investments-in-ai-and/",
      "description": "These three semiconductor investors are back to discuss Microsoft's latest earnings.",
      "body": "Microsoft Is Making Massive Investments in AI and ChatGPT, and Shares Could Be Really Cheap for Long-Term Buyers\nBy\nJose Najarro, Nicholas Rossolillo, and Billy Duberstein\nFeb 1, 2023 at 10:00AM\nYoure reading a free article with opinions that may differ from The Motley Fools Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more.",
      "snippet": "<b>Microsoft</b> Is Making Massive Investments in AI and ChatGPT, and Shares Could Be Really Cheap for Long-Term Buyers By Jose Najarro, Nicholas ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:00:00",
      "provider": {
        "name": "fool",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://g.foolcdn.com/editorial/images/718733/copy-of-jose-najarro-66.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fool",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://fool.com/investing/2023/02/01/microsoft-is-making-massive-investments-in-ai-and/"
      }
    },
    {
      "id": "6924616323481065523",
      "title": "Microsoft",
      "url": "https://en.wikipedia.org/wiki/Microsoft",
      "description": "Microsoft Corporation (, abbreviated as MS) is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\".",
      "body": "",
      "snippet": "<b>Microsoft</b> Corporation (, abbreviated as MS) is an American multinational technology company with headquarters in Redmond, Washington. It develops, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "0001-01-01T00:00:00",
      "provider": {
        "name": "wikipedia",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wikipedia",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://en.wikipedia.org/wiki/Microsoft"
      }
    }
  ]
}
