{
  "_type": "news",
  "didUMean": "",
  "totalCount": 192,
  "relatedSearch": [],
  "value": [
    {
      "id": "2310960889904330644",
      "title": "The EU warns Microsoft in writing about the purchase of Activision",
      "url": "https://playcrazygame.com/the-eu-warns-microsoft-in-writing-about-the-purchase-of-activision/",
      "description": "Microsoft and its adventure to buy Activision has already been a year old, since it was last January",
      "body": "Leave a comment\n9 Views\nMicrosoft and its adventure to buy Activision has already been a year old, since it was last January 2022 when it announced the acquisition agreement.  What is considered the most expensive deal for the company and the video game industry has yet to close, due to opposition from the FTC and regulators.  The company has not moved forward in this purchase agreement for a long time and the news that we bring is that the EU just sent to Microsoft his list of concerns about the deal to buy Activision Blizzard.\nIn mid-January 2022, Microsoft shocked the world by announcing that they were going to buy Activision Blizzard and King.  If this deal went through, it would have some of the most successful video game studios in its possession.  And it is that, they would become part of Microsoft sagas of games such as call of duty, Overwatch, Devil, WoW either Candy Crush.  Microsoft planned to close the deal as soon as summer 2023 at the latest, but is in too much trouble to meet this date.\nMicrosoft receives a letter with EU concerns about Activision\nThe history of Microsoft and Activision Blizzard is long and extensive, but we can summarize that to this day, the agreement is still standing and Microsoft has not managed to make changes.  It continues to have enemies galore, where we would position the American FTC as the most problematic of all.  This was the one that blocked the deal and made the desperate decision to sue the company to prevent the EU from negotiating with it.  Not that Europe is really allied with Microsoft, but we do know that Europe was willing to have talks with the company about the deal.\nEverything seemed to be going well and it could be an opportunity for Microsoft, but there is one player that we have ignored so far, Sony.  And it is that, a few days ago, the PlayStation CEO stayed with the boss EU antitrust to talk about the Activision deal.  We do not expect anything good from here and now we bring news, well Microsoft has received a letter from the EU.  In this they have declared their concerns regarding the Activision Blizzard purchase agreement.\nThe deadline to make decisions is April 11\nIt was last Tuesday when Microsoft received the letter from the EU and although the content is not known of it, if we know that time is pressing.  And it is that, the antitrust investigation against the software giant will end soon and a deadline has been set to make decisions, the next April 11.  With this list of EU concerns, we can only wonder what it contains, since it may be that among them is a path to follow and that allows the purchase from Activision by Microsoft.\nSo that, the European Commission has not yet decided to block the acquisition of the company, although it does request a series of changes, conditions and solutions from Microsoft.  In the event that these are not met, of course he will be in charge of prohibiting the agreement.  Although for the purchase to finally be completed, Microsoft needs the approval from 16 jurisdictionsso this is still far from over.",
      "snippet": "<b>Microsoft</b> and its adventure to buy Activision has ... was last January. Leave a comment 9 Views <b>Microsoft</b> and its adventure to buy Activision has already ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T18:17:17",
      "provider": {
        "name": "playcrazygame",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://elchapuzasinformatico.com/wp-content/uploads/2023/02/Microsoft-Activision-UE-preocupaciones.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "playcrazygame",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://playcrazygame.com/the-eu-warns-microsoft-in-writing-about-the-purchase-of-activision/"
      }
    },
    {
      "id": "8479492222963365686",
      "title": "Gears Of War 6 is next game from The Coalition as two games cancelled",
      "url": "https://metro.co.uk/2023/02/02/gears-of-war-6-is-next-game-from-the-coalition-as-two-games-cancelled-18213630/",
      "description": "New rumours suggest that Gears 6 is already underway at developer The Coalition, and that Wolverine could be out in 2024.",
      "body": "Gears Tactics  it wont be the last Gears game (pic: Microsoft)\n\n\n\nNew rumours suggest that Gears 6 is already underway at developer The Coalition, and that Wolverine could be out in 2024.\n\n\n\nTheres been a lot of talk about Halo in the last few weeks but theres hardly been a word spoken about Gears Of War since the release of Gears 5 in 2019 and strategy spin-off Gears Tactics in 2020.\n\n\n\nAlthough they also helped out with The Matrix Awakens tech demo, and Halo Infinite, Gears Tactics was the last full game by Canadian developer The Coalition, and while its been natural to assume theyd also be working on Gears 6 theres never been any confirmation.\n\n\n\nThere still isnt, but insider Jeff Grubb claims that is now their next game, but only because two other projects they were working on got cancelled.\n\n\n\nIts not clear what these other projects were but back in 2021 one of the studios lead designers said they were working on a new IP. Theres also been long-standing rumours of a Gears Of War remaster collection, which matches with the idea The Collations other game was a smaller project.\n\n\n\nThe cancellations are supposedly a consequence of the recent mass layoffs at Microsoft and while Grubb claims that The Coalition was only affected a little bit it seems as if Microsoft is tightening its belt anyway.\n\n\n\nThe studio is now going to move on fully to Gears 6, said Grubb in a Twitch stream. I say now, it has likely moved on to Gears 6 in full over the course of the last year, but definitely, that will be their next game.\n\n\n\n\n\n\n\nIn the same podcast, Grubb also talked about Insomniacs Wolverine game, stating that it will be a hard R  a reference to American age ratings for movies and implying the game will be extremely gory.\n\n\n\nThats been suggested before but there continues to be confusion as to when the game will be released, with some sources claiming its years away and others suggesting it will be much sooner.\n\n\n\nAccording to Grubb it could be out as early as autumn 2024, although it might easily slip into 2025. Given how secretive Sony has been with Spider-Man 2 though that doesnt guarantee itll be shown this year.\n\n\n\n\n\n\n\n\n\nEmail gamecentral@metro.co.uk, leave a comment below, and follow us on Twitter.\n\n\n\n\t\n\t\n\tMORE : Insomniacs Wolverine game is a 2023 release says Microsoft?\n\t\n\t\n\n\n\n\t\n\t\n\tMORE : Gears Of War remaster collection rumoured for June reveal and 2022 release\n\t\n\t\n\n\n\n\t\n\t\n\tMORE : Gears Of War 6 developer working on new IP but not Star Wars claims insider\n\t\n\t\n\n\n\nFollow Metro Gaming on Twitter and email us at gamecentral@metro.co.uk\n\n\n\nFor more stories like this,check our Gaming page.",
      "snippet": "... of the recent mass layoffs at <b>Microsoft</b> and while Grubb claims that The ... a little bit it seems as if <b>Microsoft</b> is tightening its belt anyway.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:48:43",
      "provider": {
        "name": "metro",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://metro.co.uk/wp-content/uploads/2020/04/ss_5b509d4daecd5a75a5307b1f9734749c264cafdd.1920x1080-34d2.jpg?quality=90&strip=all",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "metro",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://metro.co.uk/2023/02/02/gears-of-war-6-is-next-game-from-the-coalition-as-two-games-cancelled-18213630/"
      }
    },
    {
      "id": "5411949581894845634",
      "title": "Why Generative AI Like ChatGPT Will Be the Defining Tech of This Year",
      "url": "https://www.businessinsider.com/why-generative-ai-chatgpt-the-defining-tech-of-this-year-2023-1",
      "description": "Microsoft's huge OpenAI deal shows that ChatGPT is setting the pace in tech this year, and everyone else will have to keep up.",
      "body": "Access your favorite topics in a personalized feed while you're on the go.\ndownload the app\nEmail address\nBy clicking Sign up, you agree to receive marketing emails from Insider                                  as well as other partner offers and accept our                                  Terms of Service and                                  Privacy Policy.\nChatGPT has taken the tech world by storm in just a few short months.\nThe viral success of the chatbot, made by OpenAI, has caused a huge ripple across the tech industry.\nVenture capitalists are betting big on startups\nthat are getting in on the craze, even as Google moves quickly to address the threat that ChatGPT poses to its core search business. In 2022, investors put at least $1.37 billion into generative AI startups, usually at the seed stage. That's almost as much as what was invested in the market in the previous five years combined, according to PitchBook.\nBut the surest sign yet that ChatGPT is setting the pace and defining the tech industry for at least the next year is OpenAI's blockbuster, $10 billion partnership with Microsoft to bring the AI into products like the Bing search engine and Microsoft Office. Indeed, Microsoft is wasting no time, already launching an OpenAI-powered chat transcription and task-suggestion service for its Microsoft Teams app.\n\"Microsoft is set to work alongside OpenAI to create a game-changing technology fully integrated into MSFT over the next decade,\" Wedbush analyst Dan Ives wrote in a note to clients. \"Nadella is not going to repeat the same mistakes and we believe this strategic investment is a smart poker move in this AI arms race that is taking place globally.\"\nWhich is to say that while it remains to be seen how exactly this technology will transform our lives in the coming months, experts are convinced that ChatGPT and technology like it is here to stay  not some passing fad.\n\"We predict we're on the brink of the next platform shift: The knowledge and information economy will be defined by artificial intelligence,\" VCs at Bessemer Venture Partners wrote in a recent blog post.\nWhy this iteration of ChatGPT made generative AI so popular right now\nIt's important to note that nothing about ChatGPT or generative AI is especially new or novel. As Facebook's lead AI scientist Yann LeCun noted recently, \"It's nothing revolutionary, although that's the way it's perceived in the public. It's just that it's well put together, it's nicely done.\"\nIn other words, OpenAI's real innovation was taking AI technology that was already out there and making it something that was easy and accessible to anybody.\n\"The way they've created the user interface and the way that they've exposed the technology in such a useful way and allowing it to be casual or formal  there's a lot of engineering that they did that is really special that has allowed the technology to really shine,\" said Matt Mead, the CTO at tech modernization firm SPR.\nAs the underlying technology becomes more accessible to developers, we'll see a host of new tools come up that change the way we work, search for information, and interact with services like healthcare, the experts said. Combined with the increasing availability of computing power, and developments in AI itself, there's a new generation of startups just poised to be born.\n\"As we've been able to improve the architecture, prices of chips and compute are decreasing and getting more efficient over time, we're able to build models with much more data and there's a confluence of vectors of progress that's all happening at the same time,\" said Talia Goldberg, a partner at Bessemer Venture Partners.\nMicrosoft's partnership with OpenAI is just the beginning of what's possible with generative AI\nMicrosoft's partnership with OpenAI offers some hints about where the technology can go from here. For one, it is poised to disrupt is the search experience.\nRight now when we search for information in Google we get multiple options back and can pick what we think is the most accurate. However, when you ask ChatGPT something, it comes back with a specific answer. Microsoft hasn't been able to break Google's lead in search, but with the AI technology its Bing search engine could actually compete.\nIt's something VCs are watching closely as they choose which companies to invest in, Goldberg said.\nMicrosoft is \"positioned to try and deliver a really radically different and transformative search experience, and compete on a different vector now relative to Google,\" she said. \"and then there's a host of other companies that we think are doing really interesting things.\"\nBeyond search, Microsoft's plans around its investment in OpenAI has experts thinking about how they'll sell this tech beyond integrating the technology across its products like Excel, Azure, and its subsidiary GitHub's AI-powered Copilot programming assistant. Some analysts also see an opportunity to offer it as a cloud service that other companies can buy and use, similar to how cloud infrastructure services are sold.\nThat's one reason why there will be a lot more business uses for generative AI technology than consumer use cases in the near term, said Mark Shmulik, a Bernstein analyst.\nFor example, ChatGPT has the potential to disrupt the way people code and how engineering teams are run because it can take less engineers to write code. ChatGPT for example can generate the basic code that actual engineers use and customize to get to an end product, he said.\nAnother example could be an opportunity to use it in the advertising industry to bypass some of the work done by large expensive ad agencies, Shmulik said.\nUltimately, there's much more we're going to see with this technology, and Microsoft may have gotten ahead with its OpenAI partnership but many other players are catching up, experts said.\n\"Microsoft has been early and very public with their relationship with OpenAI,\" Goldberg said. \"But they will certainly not be the only large player to be involved with the emerging startup ecosystem here.\"\nGot a tip?Contact this reporter via email at\nor Signal at 925-364-4258. (PR pitches by email only, please.)\nSign up for notifications from Insider! Stay up to date with what you want to know.\nSubscribe to push notifications",
      "snippet": "<b>Microsoft</b> hasn't been able to break Google's lead in search, but with the AI technology its Bing search engine could actually compete. It's something ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:39:47",
      "provider": {
        "name": "businessinsider",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.insider.com/63d43770fc18470019552b4d?width=1200&format=jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "businessinsider",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.businessinsider.com/why-generative-ai-chatgpt-the-defining-tech-of-this-year-2023-1"
      }
    },
    {
      "id": "6224424724988412856",
      "title": "Microsoft rolls out ChatGPT powered Teams Premium",
      "url": "https://www.lbcgroup.tv/news/variety/685441/microsoft-rolls-out-chatgpt-powered-teams-premium/en",
      "description": "Microsoft Corp (MSFT.O) on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm. | Lebanon News",
      "body": "min\nMicrosoft rolls out ChatGPT-powered Teams Premium\nMicrosoft Corp (MSFT.O) on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\n\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc's (GOOGL.O) Google.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\n\nChatGPT on Wednesday announced a $20 per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements.\n",
      "snippet": "<b>Microsoft</b> Corp (MSFT.O) on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:08:36",
      "provider": {
        "name": "lbcgroup",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.lbcgroup.tv/uploadImages/DocumentImages/Doc-P-685441-638109511374103227.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "lbcgroup",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.lbcgroup.tv/news/variety/685441/microsoft-rolls-out-chatgpt-powered-teams-premium/en"
      }
    },
    {
      "id": "8116274281369250245",
      "title": "ChatGPT to Become Fastest-Growing App, Estimated to Have Gained 100 Million Monthly Active Users in January: Study",
      "url": "https://www.gadgets360.com/internet/news/chatgpt-openai-fastest-growing-app-estimated-gain-100-million-monthly-users-january-ubs-study-3748007",
      "description": "ChatGPT, the popular chatbot from OpenAI, is estimated to have reached 100 million monthly active users in January, just two months after launch, making it the fastest-growing consumer application in history, according to a UBS study on Wednesday.",
      "body": "OpenAI announced a $20 monthly subscription for ChatGPT Plus\nChatGPT Plus will be available in US for now\nChatGPT beats TikTok, Instagram to become fastest-growing app\nChatGPT, the popular chatbot from OpenAI, is estimated to have reached 100 million monthly active users in January, just two months after launch, making it the fastest-growing consumer application in history, according to a UBS study on Wednesday.\nThe report, citing data from analytics firm Similarweb, said an average of about 13 million unique visitors had used ChatGPT per day in January, more than double the levels of December.\n\"In 20 years following the internet space, we cannot recall a faster ramp in a consumer internet app,\" UBS analysts wrote in the note.\nIt took TikTok about nine months after its global launch to reach 100 million users and Instagram 2 and ahalf years, according to data from Sensor Tower.\nChatGPT can generate articles, essays, jokes and even poetry in response to prompts. OpenAI, a private company backed by Microsoft, made it available to the public for free in late November.\nOn Thursday, OpenAI announced a $20 (nearly Rs. 1,600) monthly subscription, initially for users in the United States only. It would provide a more stable and faster service as well as the opportunity to try new features first, the company said.\nAnalysts believe the viral launch of ChatGPT will give OpenAI a first-mover advantage against other AI companies. The growing usage, while imposing substantial computing cost on OpenAI, has also provided valuable feedback to help train the chatbot's responses.\nThe company said the subscription revenue would help cover the computing cost.\nAvailability of the tool has raised questions about facilitation of academic dishonesty and misinformation.\nLast month, Microsoft announced another multi-billion-dollar investment in OpenAI in the form of cash and provision of cloud computing.\n Thomson Reuters 2023\n\nIs 2023 the year when you should finally buy a foldable phone? We discuss this and more on Orbital, the Gadgets 360 podcast. Orbital is available on Spotify, Gaana, JioSaavn, Google Podcasts, Apple Podcasts, Amazon Music and wherever you get your podcasts.\n",
      "snippet": "OpenAI, a private company backed by <b>Microsoft</b>, made it available to the public for free in late November. On Thursday, OpenAI announced a $20 (nearly ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:58:38",
      "provider": {
        "name": "gadgets360",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.gadgets360cdn.com/large/artificial_intelligence_pixabay_1200_1621239208595.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "gadgets360",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.gadgets360.com/internet/news/chatgpt-openai-fastest-growing-app-estimated-gain-100-million-monthly-users-january-ubs-study-3748007"
      }
    },
    {
      "id": "8315582902779814076",
      "title": "Microsoft Teams Premium gets new features powered by OpenAI's GPT-3.5",
      "url": "https://www.siasat.com/microsoft-teams-premium-gets-new-features-powered-by-openais-gpt-3-5-2517281/",
      "description": "Tech giant Microsoft has introduced new features powered by OpenAI's GPT-3.5, to its Teams Premium, to make meeting artificial intelligence",
      "body": "Microsoft Teams Premium gets new features powered by OpenAIs GPT-3.5\nMicrosoft Teams Premium gets new features powered by OpenAIs GPT-3.5\nMicrosoft also introduced new features for brands, including 'Branded meetings', 'organisation backgrounds' and 'organisation together mode scenes', and much more.\n|  Posted by Mansoor Hameed | \nPublished: 2nd February 2023 8:59 pm IST\nSan Francisco: Tech giant Microsoft has introduced new features powered by OpenAIs GPT-3.5, to its Teams Premium, to make meeting artificial intelligence (AI)-powered.\nThe new features aim to make meetings more intelligent, personalised and protected  whether its one-on-one, large meetings, virtual appointments or webinars, the tech giant said in a blogpost on Wednesday.\nWith a 252 per cent increase in weekly time spent in meetings in the first two years of the pandemic, we needed to find ways to work smarter, not harder.\nWith the intelligent recap feature, users will get automatically generated meeting notes, recommended tasks and personalised highlights.\nThis will help users to save time spent reviewing meeting recordings, and this feature will be available in the second quarter of this year.\nThe AI-generated chapters will divide the meeting into sections, making it easier to pick and choose the content most relevant to users. This is now available for PowerPoint Live meeting recordings.\nIntelligent recap will automatically generate meeting chapters based on the meeting transcript as well, the company said.\nAlso Read",
      "snippet": "Tech giant <b>Microsoft</b> has introduced new ... by OpenAIs GPT-3.5 <b>Microsoft</b> Teams Premium gets ... by OpenAIs GPT-3.5 <b>Microsoft</b> also introduced new features ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:29:15",
      "provider": {
        "name": "siasat",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.siasat.com/wp-content/uploads/2023/02/microsoftTeams.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "siasat",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.siasat.com/microsoft-teams-premium-gets-new-features-powered-by-openais-gpt-3-5-2517281/"
      }
    },
    {
      "id": "7986165551572508313",
      "title": "'Ark 2' release date: Is 'Ark Survival Evolved' coming to the PS5?",
      "url": "https://www.ibtimes.co.uk/ark-2-release-date-ark-survival-evolved-coming-ps5-1712230",
      "description": "\"Ark 2\" is a \"console launch exclusive\" for the Xbox Series X, which means that it will only be available to the current-gen Microsoft console at launch.",
      "body": "\"Ark 2\" is one of the most anticipated releases this year for fans of action-adventure survival games. Interest in the \"Ark Survival Evolved\" has been on the rise since developer Studio Wildcard released a series of trailers that showed Hollywood action star Vin Diesel.ARK 2 release dateStudio Wildcard has not yet officially announced a specific \"Ark 2\" release date. However, the studio already confirmed that it would launch sometime in 2023, which is a bit vague but at least fans have a release window to look forward to.The \"Ark Survival Evolved\" sequel was originally slated for a 2022 release. However, production was delayed due to the COVID-19 pandemic, so the launch window was moved back by a year.'Ark 2' platformsArk will be released for PC, and there's already a Steam page for it though pre-orders are not yet open. Considering that the original \"Ark Survival Evolved\" is available on the Epic Games Store, it won't be surprising that \"Ark 2\" might be released for the platform as well. Still, no confirmation about that option has been made so far, according to Rockpapershotgun.com.\"Ark 2\" is a \"console launch exclusive\" for the Xbox Series X, which means that it will only be available to the current-gen Microsoft console at launch. However, the wording also seems to suggest that the game might be coming to other consoles as well once this exclusivity period expires.This leads to the question PlayStation gamers have been asking  is \"Ark 2\" coming to the PS5 console after the exclusivity period with Microsoft ends? At this point, there is no confirmation from Studio Wildcard, but it is certainly a possibility, considering that the first Ark game became a hit on the PS4 console.'Ark 2' story, charactersWhile \"Ark 2\" will definitely have an \"epic story,\" details are still a bit scarce for now. Hollywood actor Vin Diesel will be portraying Santiago, the main protagonist.Santiago is actually just a clone of Santiago da Costa, a character familiar to seasons Ark players as he is also in the first game, \"Ark Survival Evolved.\" The game's trailers also revealed that Santiago has a daughter Meeka, voiced by Moana's Auli'i Cravalho, so fans can expect another dad-and-kid adventure epic with a big-name cast.",
      "snippet": "... 2\" is a \"console launch exclusive\" for the Xbox Series X, which means that it will only be available to the current-gen <b>Microsoft</b> console at launch.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:03:56",
      "provider": {
        "name": "ibtimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://d.ibtimes.co.uk/en/full/1703498/gamer.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "ibtimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.ibtimes.co.uk/ark-2-release-date-ark-survival-evolved-coming-ps5-1712230"
      }
    },
    {
      "id": "8342662818751272832",
      "title": "Cybersecurity Leaders Launch First Attack Matrix for Software Supply Chain Security",
      "url": "https://www.darkreading.com/attacks-breaches/cybersecurity-leaders-launch-first-attack-matrix-for-software-supply-chain-security",
      "description": "Current and former cybersecurity leaders from Microsoft, Google, GitLab, Check Point, OWASP, Fortinet and others have already joined the open framework initiative, which is being led by OX Security.",
      "body": "TEL AVIV, Israel,Feb. 1, 2023/PRNewswire/ --OX Security, the first end-to-end software supply chain security solution, today announced the launch ofOSC&R (Open Software Supply Chain Attack Reference),the first and only open framework for understanding and evaluating existing threats to entire software supply chain security.The founding consortium of cybersecurity leaders behind OSC&R include:David Cross, former Microsoft and Google cloud security executive; Neatsun Ziv, Co-Founder and CEO of OX Security;Lior Arzi, Co-Founder and CPO at OX Security; Hiroki Suezawa, Senior Security Engineer at GitLab;Eyal Paz, Head of Research at OX Security;Phil Quade, former CISO at Fortinet; Dr.Chenxi Wang, former OWASP Global Board member;Shai Sivan, CISO at Kaltura;Naor Penso, Head of Product Security at FICO; andRoy Feintuch, former Cloud CTO at Check Point Technologies.Discussions with hundreds of industry leaders revealed that there was a very concrete need for a MITRE-like framework that would allow experts to better understand and measure supply chain risk, a process that until now could only be based on intuition and experience. OSC&R is designed to provide a common language and structure for understanding and analyzing the tactics, techniques, and procedures (TTPs) used by adversaries to compromise the security of software supply chains.\"Trying to talk about supply chain security without a common understanding of what constitutes the software supply chain isn't productive,\" said Neatsun Ziv, who served as Check Point's VP of Cyber Security before founding OX. \"Without an agreed-upon definition of the software supply chain, security strategies are often siloed.\"OSC&R is now ready to be used by security teams to evaluate existing defenses and define which threats need to be prioritized, how existing coverage addresses those threats, as well as to help track behaviors of attacker groups.\"OSC&R helps security teams build their security strategy with confidence,\" said Hiroki Suezawa, Senior Security Engineer at Gitlab. \"We wanted to give the security community a single point of reference to proactively assess their own strategies for securing their software supply chains and to compare solutions,\" he continued.The OSC&R framework will update as new tactics and techniques emerge and evolve. It will also assist red-teaming activities by helping set the scope required for a pentest or a red team exercise, serving as a scorecard both during and after the test. The framework will also now be open for other cybersecurity leaders and practitioners to contribute to OSC&R.\"I believe the OSC&R framework will help organizations reduce their attack surface,\" saidNaor Penso, Head of Product Security at FICO. \"I am proud to take part in a project that can have such a major impact on the future security landscape, and to share our knowledge and expertise.\"The OSC&R framework is now online:https://pbom.dev/About OX SecurityOX Securitybelieves that security should be an integral part of the software development process, not an afterthought. Founded by Neatsun Ziv andLior Arzi, who previously led Check Point's Security Group, OX is the first end-to-end software supply chain security solution. OX provides DevSecOps teams with the automation, visibility, and risk insights they need to bring security and integrity to every step of the supply chain, from the earliest planning stages until deployment to production.SOURCE Ox Security",
      "snippet": "Current and former cybersecurity leaders from <b>Microsoft</b>, Google, GitLab, Check Point, OWASP, Fortinet and others have already joined the open ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T14:50:00",
      "provider": {
        "name": "darkreading",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://beta.darkreading.com/images/og-image.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "darkreading",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.darkreading.com/attacks-breaches/cybersecurity-leaders-launch-first-attack-matrix-for-software-supply-chain-security"
      }
    },
    {
      "id": "8580992697812028407",
      "title": "How to refund a game on Xbox Series X|S & Xbox One",
      "url": "https://www.dexerto.com/tech/how-to-refund-a-game-on-xbox-series-xs-xbox-one-2049656/",
      "description": "Wondering how to refund a game on Xbox? We've got your back. Here's how to do get a refund from Microsoft, and what you need to do to get that cash back.",
      "body": "Wondering how to refund a game on Xbox? We've got your back. Here's how to do get a refund from Microsoft, and what you need to do to get that cash back.\n\n\n\nAmong all the store owners, there's nothing more difficult than getting a refund from console manufacturers. Sony, Microsoft, and Nintendo were dragged along with the rest of the industry to provide some method of refund. \n\n\n\nThankfully, unlike the other two, Microsoft and the Xbox refund process is pretty simple. The only issue here is that Microsoft isn't very open with its requirements. \n\n\n\nRequirements\n\n\n\nAs we're suspecting they're similar to the enforcement set on Steam by various government bodies around the world, here's what you need to know about Xbox refunds:\n\n\n\n\nMust be under the 14 days since purchase\n\n\n\nMust have a non-significant amount of time played\n\n\n\n\nThe first is fine, but the \"non-significant amount of time\" is the sticking point. On Steam, it is no more than two hours of game time, so let's stick with that. \n\n\n\nHow to refund games on Xbox\n\n\n\nHead to Microsoft's dedicated page first. On this page, you will need to sign into your Xbox account. It will display a list of your eligible games to refund. \n\n\n\nDLC and in-game purchases might not be eligible for a refund. \n\n\n\nClick through any on-screen instructions, and you'll be able to track your refund through this page.\n\n\n\nRefund not available on Xbox\n\n\n\nIf your game isn't available in the list, it means it doesn't match the requirements set by Microsoft. If this is the case, there's not much else to do. Those EULA and various agreements you clicked through is your sticking point here. \n\n\n\nTo get through them, you'd have to begin contacting Microsoft to sort out your situation, however, we don't think this would result in much change.\n\n\n\nGetting money back for digital purchases is a headache and we can't offer much more advice outside of this. \n\n\n\nRefund Fortnite V-Bucks on Xbox\n\n\n\nOn the chance you have a child that has bought multiple Fortnite things, you might need to go through Epic Games to sort that side of things out. \n\n\n\nThe FTC did rule on Fortnite refunds, so it might be worth reading up on that too.",
      "snippet": "Here's how to do get a refund from <b>Microsoft</b>, and what you need to do to get that cash back. Wondering how to refund a game on Xbox? We've got your ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:25:29",
      "provider": {
        "name": "dexerto",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://editors.dexerto.com/wp-content/uploads/2023/02/02/xbox-refund.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "dexerto",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.dexerto.com/tech/how-to-refund-a-game-on-xbox-series-xs-xbox-one-2049656/"
      }
    },
    {
      "id": "1701062414281509667",
      "title": "Buoyant Ventures debuts $76M climate fund backed by Microsoft",
      "url": "https://www.axios.com/pro/climate-deals/2023/02/02/buoyant-ventures-francetic-climate-fund-microsoft",
      "description": "The firm will focus on early-stage climate software startups",
      "body": "Illustration: Shoshana Gordon/Axios\nExit Content Preview\nBuoyant Ventures, a Chicago-based firm launched by Energize Ventures co-founder Amy Francetic, unveiled its first fund at $76 million.\nWhy it matters: The female-owned debut venture fund will be investing in early-stage climate software startups. Microsoft's Climate Innovation Fund is among the LPs.\nWhat's happening: Francetic launched the firm with Allison Myers, formerly of Accenture, in December 2020.\nIn addition to Microsoft, LPs include Xcel Energy, Bank of America, NiSource, WovenEarth Ventures, and the Office of the Illinois State Treasurer.\nZoom in: The fund has already made nine investments so far.\nThey include Raptor Maps, a software developer for tracking the solar energy lifecycle, FloodFlash, a parametric flood insurance provider, and ReelData, a software provider for land-based aquaculture.\nOf note: Buoyant had initially aimed to raise $100 million.\nFrancetic said LPs started pulling back venture investments when recession fears surfaced last year.\n\"That made us really proud that we got to $76. And because weve been investing since we did our first close [in May 2021], we felt we had to turn our attention from building this portfolio to these companies.\"\nState of play: Women remain underrepresented in venture capital  both in terms of who's deciding where the money goes and which founders receive it.\nWomen held 16.4% of decision-maker roles at U.S. venture firms last year,",
      "snippet": "In addition to <b>Microsoft</b>, LPs include Xcel Energy, Bank of America, NiSource, WovenEarth Ventures, and the Office of the Illinois State ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:11:07.791",
      "provider": {
        "name": "axios",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.axios.com/u6vXDmk5oVrkRYotvZheE5vwgwc=/0x0:1920x1080/1366x768/2023/02/02/1675343275298.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "axios",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.axios.com/pro/climate-deals/2023/02/02/buoyant-ventures-francetic-climate-fund-microsoft"
      }
    },
    {
      "id": "3339047721068560271",
      "title": "Microsoft Teams Premium now includes OpenAI",
      "url": "https://www.dexerto.com/tech/microsoft-teams-premium-now-includes-openai-2050326/",
      "description": "Microsoft Teams Premium tier now includes the powerful OpenAI GPT-3.5 to help with new and existing features of the software.",
      "body": "Microsoft Teams Premium tier now includes the powerful OpenAI GPT-3.5 to help with new and existing features of the software.\n\n\n\nMicrosoft's investment and usage of OpenAI's GPT-3.5 AI language model have already come to fruition. Much like the company's quick dominance of collaborative work software with the introduction of Teams in 2020, it hasn't taken long for the Seattle conglomerate to get AI into Teams. \n\n\n\nImplementing AI into this type of software isn't a first though, as Notion recently got its own AI model into its productivity app. However, Microsoft's multibillion-dollar investment means that Teams will be getting access to one of the best AI language models online right now. \n\n\n\nMicrosoft has mentioned that some of the features might not arrive until later in 2023, so don't expect everything yet. \n\n\n\nTeams Premium AI features\n\n\n\nThe inclusion brings updates to existing and new options in Teams Premium. This includes a new recap feature, which will make meeting notes for you, regardless of your attendance. \n\n\n\nThings that were free, are now being moved into the paid tier. Options like AI-translated captions will now be forced behind the introductory fee of $7 a month, and $10 from June 30. \n\n\n\nAI software isn't just being pushed by Microsoft, as Google and their Teams competitor are apparently working quickly to implement their own into the search engine giant's products. While Google's AI appears to be more focused on general use, it currently uses machine learning in Google Docs to help finish sentences. \n\n\n\nOne report has indicated that it will be able to generate music from a text prompt.\n\n\n\nOpenAI's ChatGPT and Dalle 2, which can construct images from a prompt, now have their own subscription fees as well.\n\n\n\nThe race to be first for artificial intelligence might start at Microsoft Teams Premium, but it won't end there, as multiple companies are vying for AI in their products going forward.",
      "snippet": "<b>Microsoft</b> Teams Premium tier now includes the powerful OpenAI GPT-3.5 to help with new and existing features of the software. <b>Microsoft</b> Teams Premium ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:03:26",
      "provider": {
        "name": "dexerto",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://editors.dexerto.com/wp-content/uploads/2023/02/02/teams-ai.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "dexerto",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.dexerto.com/tech/microsoft-teams-premium-now-includes-openai-2050326/"
      }
    },
    {
      "id": "5179612999367195164",
      "title": "Microsoft Teams: Microsoft rolls out ChatGPT-powered Teams Premium, ET BrandEquity",
      "url": "https://brandequity.economictimes.indiatimes.com/news/digital/microsoft-rolls-out-chatgpt-powered-teams-premium/97551813",
      "description": "Microsoft Teams:  Microsoft Corp rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot,  OpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.",
      "body": "",
      "snippet": "<b>Microsoft</b> Teams: <b>Microsoft</b> Corp rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T13:10:00",
      "provider": {
        "name": "indiatimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://etimg.etb2bimg.com/thumb/msid-97551813,imgsize-21496,width-1200,height=765,overlay-etbrandequity/digital/microsoft-rolls-out-chatgpt-powered-teams-premium.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indiatimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://brandequity.economictimes.indiatimes.com/news/digital/microsoft-rolls-out-chatgpt-powered-teams-premium/97551813"
      }
    },
    {
      "id": "4567981588119896730",
      "title": "Microsoft Reportedly Working on Adding Improved ChatGPT Version Based on GPT-4 to Bing to Compete With Google",
      "url": "https://www.gadgets360.com/internet/news/chatgpt-microsoft-bing-search-integration-gpt4-google-dominance-3747371",
      "description": "Microsoft is reportedly planning to integrate OpenAI&#039;s ChatGPT chatbot into its search engine Bing. The tech giant recently announced a multi-million-dollar investment into OpenAI, the parent company of ChatGPT.",
      "body": "ChatGPT was launched for public testing last November\nGPT-4 is expected to be much faster than the current model\nMicrosoft recently announced a multi-million-dollar investment in OpenAI\nChatGPT, OpenAI's natural language processing (NLP) based chatbot, has taken the internet by storm ever since it was made available for public testing in November last year. The generative AI model is expected to take a massive leap with the introduction of GPT-4, which will succeed the currently utilised GPT-3 autoregressive language model. The update is reportedly being integrated into Microsoft's applications, with the tech giant's search engine, Bing, among the platforms that are set to benefit from the development.\nMicrosoft\nrecently announced a multi-million-dollar investment in ChatGPT's parent firm, OpenAI, in a move that could help it overtake Alphabet's Google as the most preferred search engine in the world. The tech giant has already announced integration of the ChatGPT chatbot into its workplace instant messaging platform, Microsoft Teams, through a premium subscription model priced at $7 (roughly Rs. 600).\nAccording to a Semafor report, the upcoming GPT-4 system could be integrated into Microsoft's search engine, Bing. GPT stands for generative pre-trained transformer, or the ability of an AI-model to parse through humungous data sets, and generate comprehensive answers to queries in a way that mimics human language.\nBaidu Working on a ChatGPT-Style AI Chatbot, Will Launch Soon\nThe most important upgrade that GPT-4 will bring over GPT-3, is the speed at which it can respond to queries, as per the report. This is being done through improved input datasets, algorithms, parameterisation, and alignment, rather than just making the language model larger and vaster. The majority of work is reportedly being done on the server side, through optimisation tweaks that make the system more efficient, accurate, and faster.\nChatGPT, is currently free for all users to test as part of an ongoing public beta. On Wednesday, OpenAI also launched a pilot subscription model  ChatGPT Plus  priced at $20 per month (roughly Rs. 1,650). This is mostly due to the fact that running the system does come at a cost, with each search costing OpenAI a couple of cents according to CEO Sam Altman.\nThe process is currently powered by supercomputers co-developed by Microsoft and OpenAI that has 285,000 CPU cores and 10,000 GPUs which have a 400Gbps network connectivity speed, as per the report.\nChatGPT's Creator Releases 'Imperfect' Tool to Identify AI-Generated Text\nWith the source code that ChatGPT is built on open for all, developers have been rushing to get their hands on Nvidia's latest graphics processor, the H100 Tensor Core GPU, which is best suited to run systems like those used in GPT. Nvidia's H100 Tensor Core GPU costs $30,000 (roughly Rs.25,00,00) which makes this a rather expensive affair, to say the least.\nTherefore, much of the race towards domination of the search engine market could be led by AI-powered generative models like GPT, and by the innovation on the server side of these models, in particular.\nBeware ChatGPT Trying to Teach Your Kids Math  or Anything\nGoogle has enjoyed the pole position ever since it beat Yahoo several years ago, to become the world's most preferred search engine. It remains to be seen if Microsoft's Bing will end up challenging and overthrowing Google as the world's most popular and widely used search engine.\n5G is now available both on Android and iPhone in India. But is it any good? We discuss this on Orbital, the Gadgets 360 podcast. Orbital is available on Spotify, Gaana, JioSaavn, Google Podcasts, Apple Podcasts, Amazon Music and wherever you get your podcasts.\nAffiliate links may be automatically generated - see our ethics statement for details.",
      "snippet": "<b>Microsoft</b> is reportedly planning to integrate OpenAI&#039. s ChatGPT chatbot into its search engine Bing.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T13:01:46",
      "provider": {
        "name": "gadgets360",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.gadgets360cdn.com/large/chatgpt_openai_reuters_1670485718798.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "gadgets360",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.gadgets360.com/internet/news/chatgpt-microsoft-bing-search-integration-gpt4-google-dominance-3747371"
      }
    },
    {
      "id": "333687491700687110",
      "title": "Microsoft Packs Teams Premium Full of AI for $10/Month",
      "url": "https://www.pcmag.com/news/microsoft-packs-teams-premium-full-of-ai-for-10month",
      "description": "Meeting notes, task lists, timeline markers, speaker markers, and live translations are all handled automatically by artificial intelligence if you're willing to pay.",
      "body": "Microsoft rolled out Teams Premium late yesterday, which offers a range of AI-powered meeting features in return for $10 per user per month.Microsoft believes some of its customers will pay for more advanced meeting capabilities than are currently available in Teams. With that in mind, Teams Premium introduces a number of new features that rely heavily on the use of artificial intelligence.Using OpenAI's GPT-3.5, the same language model used for ChatGPT, Microsoft is turning a number of meeting-related tasks into automatic processes under the heading of \"intelligent recap.\" Teams Premium subscribers will get automatically-generated meeting notes, recommended tasks, and personalized highlights created for them as part of the service.\n    \n        \n    \nAI-generated chapters will automatically divide any meeting up using the meeting transcript to allow for easier navigation. Personalized timeline markers will show when you joined a meeting (so it's easy to see what you missed), highlights when your name gets mentioned, and when a screen was shared. Speaker timeline markers are also planned, which will show when different people spoke and intelligently organize those markers based on \"who you work most closely with,\" e.g. your manager.Premium subscribers can also look forward to AI-generated notes written by GPT-3.5, AI-generated tasks suggesting what needs to be done following each meeting, and live translation for captions. Translations are performed in real-time using AI and 40 spoken languages are supported. There's also the ability to use branding logos and colors, organization backgrounds, customized meeting templates (e.g. client call, brainstorming meeting, help desk call), virtual appointments for contacting customers, and easy webinar hosting.Microsoft is also introducing \"advanced meeting protection\" for Teams Premium. Subscribers will be able to use watermarks and limit who can record meetings, enable end-to-end encryption while also disabling specific features for sensitive meetings, and take advantage of sensitivity labels using Microsoft Purview.  Microsoft Teams Premium offers a 30-day free trial and then costs $10 per user per month. However, anyone subscribing before July 1 this year will only pay $7 per user per month. It's also worth pointing out that a user must have an existing Microsoft 365 or Office 365 license before they can subscribe to Teams Premium.\n    \n        \n        \n            window.videoEmbeds = window.videoEmbeds || [];\n            window.videoEmbeds.push({\n                elemId: 'video-container-360OeLXDlV',\n                data: {\"slug\":\"360OeLXDlV\",\"url\":\"https:\\/\\/vdist.aws.mashable.com\\/cms\\/2022\\/10\\/6f932234-6943-009c\\/mp4\\/1080.mp4\",\"transcoded_urls\":[\"https:\\/\\/vdist.aws.mashable.com\\/cms\\/2022\\/10\\/6f932234-6943-009c\\/hls.m3u8\",\"https:\\/\\/vdist.aws.mashable.com\\/cms\\/2022\\/10\\/6f932234-6943-009c\\/dash.mpd\",\"https:\\/\\/vdist.aws.mashable.com\\/cms\\/2022\\/10\\/6f932234-6943-009c\\/mp4\\/1080.mp4\",\"https:\\/\\/vdist.aws.mashable.com\\/cms\\/2022\\/10\\/6f932234-6943-009c\\/mp4\\/720.mp4\",\"https:\\/\\/vdist.aws.mashable.com\\/cms\\/2022\\/10\\/6f932234-6943-009c\\/mp4\\/480.mp4\"],\"title\":\"Microsoft Surface Pro 9 Gets More Powerful Processing, But Not Much Else\",\"thumbnail_url\":\"https:\\/\\/vdist.aws.mashable.com\\/cms\\/2022\\/10\\/6f932234-6943-009c\\/thumb\\/00001.jpg\"}\n            });\n        \n    \n            \n             Microsoft Surface Pro 9 Gets More Powerful Processing, But Not Much Else\n        \n    ",
      "snippet": "... OpenAI's GPT-3.5, the same language model used for ChatGPT, <b>Microsoft</b> is turning a number of meeting-related tasks into automatic processes ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:38:31",
      "provider": {
        "name": "pcmag",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.pcmag.com/imagery/articles/028ObcnP1l5bryXTUuLKzlN-1.fit_lim.size_1200x630.v1675339772.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pcmag",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.pcmag.com/news/microsoft-packs-teams-premium-full-of-ai-for-10month"
      }
    },
    {
      "id": "2964646856263719049",
      "title": "Microsoft launches \"premium tools in Teams based on ChatGPT",
      "url": "https://pledgetimes.com/microsoft-launches-premium-tools-in-teams-based-on-chatgpt-istoe-money/",
      "description": "BENGALURU, India (Reuters) - Microsoft Corp on Wednesday launched a premium offering of its Teams communications app based on ChatGPT",
      "body": "BENGALURU, India (Reuters)  Microsoft Corp on Wednesday launched a premium offering of its Teams communications app based on ChatGPT and aimed at simplifying meetings.\nThe service will cost $7 a month in June before rising to $10 in July, Microsoft said.\nChatGPT, created by OpenAI, will automatically generate meeting notes, recommend tasks, and help create meeting templates for Teams users.\nMicrosoft, which announced a multibillion-dollar investment in OpenAI earlier this month, said it intends to add ChatGPT technology to all of its products, setting the stage for more competition from Google.\nOpenAI on Wednesday announced a $20-a-month subscription plan for ChatGPT that will allow users to receive faster responses and priority access to new features and improvements in the tool.\n#Microsoft #launches #premium #tools #Teams #based #ChatGPT #ISTO #MONEY",
      "snippet": "<b>Microsoft</b> Corp on Wednesday launched a premium ... app based on ChatGPT. BENGALURU, India (Reuters) <b>Microsoft</b> Corp on Wednesday launched a premium ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:35:31",
      "provider": {
        "name": "pledgetimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.istoedinheiro.com.br/wp-content/uploads/sites/17/2021/04/dinheiro-facebook.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pledgetimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://pledgetimes.com/microsoft-launches-premium-tools-in-teams-based-on-chatgpt-istoe-money/"
      }
    },
    {
      "id": "4797419311670073997",
      "title": "Microsoft Unveils New Spotify Phone Link Widgets for Windows 11",
      "url": "https://www.latestly.com/technology/microsoft-unveils-new-spotify-phone-link-widgets-for-windows-11-4789032.html",
      "description": "Tech giant Microsoft has unveiled new Spotify and Phone Link widgets for Windows 11 which are now available in the latest 'Windows 11 Insider Preview Build 25290' to the Dev Channel.",
      "body": "San Francisco, February 2 : Tech giant Microsoft has unveiled new Spotify and Phone Link widgets for Windows 11 which are now available in the latest 'Windows 11 Insider Preview Build 25290' to the Dev Channel.Samsung Galaxy S23 Ultra, Samsung Galaxy S23 Plus and Samsung Galaxy S23: Price in India and Specification of Samsung Galaxy S23 Series. To access the new widgets, Insiders in the Dev Channel can go to the widgets collection in the Microsoft Store and update to the latest version of the applications, the tech giant said in a blogpost on Wednesday.Apple May Launch New Watch Ultra With Larger 2.1-Inch Display in 2024. Then they have to open the widgets board and navigate to the widgets picker by clicking the plus button at the top-right of the board to pin their widgets. The company also mentioned that with the release of 'Windows App SDK 1.2' developers can now create widgets for their applications. &quot;Users can access these experiences on their Windows 11 widgets board in current Dev Channel Insider Preview builds,&quot; it added. Meanwhile, last month, the tech giant had released a new Windows 11 preview build for Insiders in the Dev Channel, which included an updated version of Task Manager with a new feature for tinkerers, developers, and troubleshooters.",
      "snippet": "Tech giant <b>Microsoft</b> has unveiled new Spotify and Phone Link widgets for Windows 11 which are now available in the latest 'Windows 11 Insider Preview ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:32:59",
      "provider": {
        "name": "latestly",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://st1.latestly.com/wp-content/uploads/2023/02/resize-5.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "latestly",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.latestly.com/technology/microsoft-unveils-new-spotify-phone-link-widgets-for-windows-11-4789032.html"
      }
    },
    {
      "id": "2612932329258209393",
      "title": "Ericsson Microsoft Intel claim slicing breakthrough",
      "url": "https://www.mobileworldlive.com/featured-content/devices-home-banner/ericsson-microsoft-intel-claim-slicing-breakthrough/",
      "description": "Ericsson, Intel and Microsoft teamed to demonstrate end-to-end standalone 5G network slicing capabilities on a mobile-connected laptop PC.",
      "body": "Ericsson, Microsoft, Intel claim slicing breakthrough\n02 FEB 2023\nEricsson, Intel and Microsoft teamed to demonstrate end-to-end standalone (SA) 5G network slicing capabilities on a mobile-connected laptop PC, a trial the trio hailed for demonstrating the potential of the approach on non-smartphone devices.\nThe trial was conducted at the Ericsson Lab in Sweden, employing multiple network slices on a laptop for consumer and enterprise use cases including gaming and collaboration applications.\nIn a statement, the companies explained multiple network slices were enabled by a feature enabling mobile devices to automatically tap the best connection for a specific application.\nThe trial used Ericssons 5G core and a combination of its network slicing technologies, along with Intels processors and Microsofts Windows 11 operating system.\nEricsson, Microsoft and Intel cited GSMA figures predicting the enterprise network slicing market would be worth $300 billion by 2025.\nExpanding the range of devices for network slicing to include laptops will allow new business segments to create a variety of use cases for consumer and enterprises, Sibel Tombaz, head of product line 5G RAN at Ericsson, explained.\nTombaz added the joint demonstration showed how collaboration can open new possibilities.\nThe trial will be showcased at Ericssons stand during MWC23 Barcelona later this month.",
      "snippet": "... Intel and <b>Microsoft</b> teamed to ... laptop PC. Ericsson, <b>Microsoft</b>, Intel claim slicing ... Ericsson, Intel and <b>Microsoft</b> teamed to demonstrate ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:29:38",
      "provider": {
        "name": "mobileworldlive",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.mobileworldlive.com/wp-content/uploads/2023/02/MWL_Laptop_VR_650.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mobileworldlive",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.mobileworldlive.com/featured-content/devices-home-banner/ericsson-microsoft-intel-claim-slicing-breakthrough/"
      }
    },
    {
      "id": "884424306489570129",
      "title": "Microsoft Teams Premium is getting a GPT boost via OpenAI",
      "url": "https://www.zdnet.com/home-and-office/work-life/microsoft-teams-premium-is-getting-a-gpt-boost-via-openai/",
      "description": "Teams Premium's forthcoming intelligence recap feature will be powered by OpenAI's GPT-3.5 large language models.",
      "body": "What is ChatGPT and why does it matter? Here's everything you need to know\n\"Teams Premium brings the latest technologies, including Large Language Models powered by OpenAI's GPT-3.5, to make meetings more intelligent, personalized, and protectedwhether it's one-on-one, large meetings, virtual appointments, or webinars,\" Microsoft says in an announcement.\nMicrosoft is offering an introductory discount price of $7 per month for the Teams Premium subscription. The price is available for the entire term of the initial subscription (except for some month-to-month and some three-year annual billed monthly subscriptions). The offer ends on June 30, 2023, when it returns to the standard $10 per month per user, as it's been promoted since launching in preview last October.\nMicrosoft 365 and Office 365 licenses, such as E3 and E5, are a requisite to the Teams Premium subscription. Microsoft's recent survey of 4,500 workers found a strong demand for AI tools to automate mundane tasks, so it might be Teams users pressuring employers to purchase the subscription.\nAlso:\nHow to get started using ChatGPT\nMicrosoft says Teams Premium obviates the need for third-party add-on products that some professionals buy to enhance webinars, virtual appointments, and meeting intelligence.\nIntelligent recap has so far been the headline description for the AI features of Teams Premium, but Microsoft has now detailed more capabilities that public experimentation with ChatGPT online has demonstrated, from answering complex questions to writing essays, solving coding questions, and generating questions a university professor would use.\nTeams Premium's AI-generated chapters divides PowerPoint Live meeting recordings into sections. For Teams itself, intelligent recap does this job based on meeting transcripts.\nPersonalized timeline markers help with catching up on missed meeting minutes by marking out when the user joined or left. It will also eventually mark where the user's name was mentioned, when a screen was shared, who spoke at a meeting, and when the user spoke during a meeting.\nGPT-3.5 also underpins Teams Premium AI-generated notes, which creates key points and takeaways captured during a meeting. The idea is that users can focus on the meeting rather than taking notes.\nAs Microsoft has previously stated, intelligent recap capabilities won't be available until the second quarter of 2023.\nMicrosoft's\n$10 billion investment in OpenAI\nhas helped revamp its messaging around workers wanting AI in products, including Microsoft 365/Office 365, Azure, and GitHub's Codex-powered pair programming tool, Copilot. Microsoft chief Satya Nadella said last month that Microsoft will \"incorporate AI in every layer of the stack\" across productivity and consumer services.\nMicrosoft is reportedly testing ChatGPT to answer some Bing questions to challenge Google in search. Google is also reportedly testing in-house answers to ChatGPT for Google Search.\nMore AI features in Teams Premium that will be available in mid-February include live translations, branded meetings, organization backgrounds, organization together mode scenes, and meeting template for IT admins. Other features include advanced meeting protection, watermarking content to deter leaks, and limits on who can record.\nAlso:\nWhat is ChatGPT and why does it matter? Here's everything you need to know\nTeams Virtual Appointments has been in preview since October and enables external attendees to join a branded virtual lobby room via a message.\nMicrosoft this month reported it had seen \"strong interest\" in Teams Premium. The company is looking at subscriptions like this to boost revenues as cloud revenues growth (including Azure and Office 365) slows and Windows OEM revenues decline. This shift comes as Teams user number growth slows, too.\nTeams now has 280 million monthly active users, up from 270 million monthly active users it reported in January 2022. Thanks to the pandemic, Teams user numbers more than tripled between 2020 and 2021, growing from 44 million daily active users in March 2020 to",
      "snippet": "... personalized, and protectedwhether it's one-on-one, large meetings, virtual appointments, or webinars,\" <b>Microsoft</b> says in an announcement.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:10:18",
      "provider": {
        "name": "zdnet",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.zdnet.com/a/img/resize/857b697f93f785a05462707303227b4840dde191/2023/02/02/30b9c599-de80-480b-8847-b149a89b9c50/online-meeting.jpg?auto=webp&amp;fit=crop&amp;height=675&amp;width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "zdnet",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.zdnet.com/home-and-office/work-life/microsoft-teams-premium-is-getting-a-gpt-boost-via-openai/"
      }
    },
    {
      "id": "2528272817240356254",
      "title": "Microsoft brings \"highly anticipated\" Transcribe feature to Word for Windows",
      "url": "https://mspoweruser.com/microsoft-brings-highly-anticipated-transcribe-feature-to-word-for-windows/",
      "description": "Microsoft 365 premium subscription charges users a monthly fee; despite that, it does not offer all the features you can find in Microsoft 365 apps on the web.",
      "body": "Microsoft 365\nMicrosoft 365 premium subscription charges users a monthly fee; despite that, it does not offer all the features you can find in Microsoft 365 apps on the web. However, Microsoft is working to bridge the gap by adding new features that are highly anticipated. Its efforts have come to fruition in the form of the Transcribe feature finally rolling out to Word for Windows.\nMicrosoft Word for Windows is now finally capable of converting speech to a text transcript with each speaker individually separated. This was limited to Word for the web and the OneNote app until Microsoft announced it for the Word Windows client a couple of days back.\nWith the Transcribe feature, you can revisit parts of the recording by playing back the timestamped audio and edit the transcription to make corrections. You can also save the full transcript as a Word document or insert snippets of it into existing documents. This feature can benefit users in conversations, interviews, or meetings.\nYou can transcribe your speech by recording directly in Word or uploading an audio file. For those who have not tried it on Word for the web, you can follow the below steps to transcribe your speech:\nNavigate to Home > Dictate > Transcribe.\nSelect the Start recording button in Transcribe pane.\nStart talking or recording, but make sure the incoming audio is clear.\nOnce finished, you can click the Save and transcribe now button to save your recording to OneDrive.\nIf you want to transcribe a pre-recorded audio file using Word for Windows, follow the below steps:\nNavigate to Home > Dictate > Transcribe.\nSelect the Upload audio button i\nn the Transcribe pane\nNote: The uploaded audio file should be in .wav/ .mp4/ .m4a/ .mp3 formats.\nChoose an existing audio file from the file picker, and then click the Open button.\nTranscribe feature works with more than 80 languages across different parts of the world. It is currently being rolled out for Microsoft 365 Beta Channel users running Version 2302 (Build 16107.20000) or later.\n{\"email\":\"Email address invalid\",\"url\":\"Website address invalid\",\"required\":\"Required field missing\"}\nSearch",
      "snippet": "<b>Microsoft</b> 365 premium subscription charges users a monthly fee. despite ... not offer all the features you can find in <b>Microsoft</b> 365 apps on the web.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:00:10",
      "provider": {
        "name": "mspoweruser",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mspoweruser.com/wp-content/uploads/2023/02/Microsoft-365.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mspoweruser",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://mspoweruser.com/microsoft-brings-highly-anticipated-transcribe-feature-to-word-for-windows/"
      }
    },
    {
      "id": "4666877633780688678",
      "title": "Microsoft details threat actors techniques for deploying ransomware",
      "url": "https://www.itworldcanada.com/post/microsoft-details-threat-actors-techniques-for-deploying-ransomware",
      "description": "Last year, over 100 threat actors carried out ransomware attacks, and the number of active ransomware families used in attacks surpassed 50, with Microsoft security teams tracking each and every one of them.",
      "body": "Print\nLast year, over 100 threat actors carried out ransomware attacks, and the number of active ransomware families used in attacks surpassed 50, with Microsoft security teams tracking each and every one of them.\nMicrosoft claims that while threat actors continue to rely on phishing for initial access, they have become more reliant on other techniques. The use of malvertising to surface links leading to various first-stage malware that eventually deliver ransomware or other payloads is one of the most common.\nIn 2022, the most popular ransomware payloads were LockBit Black, BlackCat/ALPHV, Vice Society, Black Basta, Play, and Royal, says Microsoft. It goes on to say that the threat actor DEV-0569, uses malicious ads to distribute Batloader, which then delivers post-exploitation tooling associated with DEV-0846, resulting in the deployment of Royal ransomware.\nHowever, Microsoft stated that defense strategies should prioritize activity chains prior to deployment rather than payloads themselves, in light of the persistent targeting of unpatched servers and devices to facilitate attacks.\nSuch a technique was observed in the exploitation of Exchange Servers vulnerable to recently patched flaws by DEV-0671 and DEV-0882 in order to enable the deployment of the Cuba and Play ransomware. It used newly patched vulnerabilities, including those in Exchange Server, to deploy the Play and Cuba ransomware, highlighting the importance of applying security patches as soon as possible.\nIn conclusion, Microsoft says; Even as they evolve, ransomware attacks continue to rely on common security weaknesses that allow them to succeed. Get insights and guidance for defending against ransomware attacks.\nThe sources for this piece include an article in BleepingComputer.\nTags",
      "snippet": "... and the number of active ransomware families used in attacks surpassed 50, with <b>Microsoft</b> security teams tracking each and every one of them.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:51:28",
      "provider": {
        "name": "itworldcanada",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "itworldcanada",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.itworldcanada.com/post/microsoft-details-threat-actors-techniques-for-deploying-ransomware"
      }
    },
    {
      "id": "608052410704051873",
      "title": "Inside ChatGPT's Breakout Moment And The Race To Put AI To Work",
      "url": "https://www.forbes.com/sites/alexkonrad/2023/02/02/inside-chatggpts-breakout-moment-and-the-race-for-the-future-of-ai/",
      "description": "Forbes spoke to OpenAIs Sam Altman and Greg Brockman  and more than 60 other leaders, from Bill Gates to Fei-Fei Li  about the new wave of AI hype, driven by the viral popularity of ChatGPT and Stable Diffusion. Heres why AI is about to change how you work, like it or not.",
      "body": "Kenrick Cai\nIN\nan unremarkable conference room inside OpenAIs office, insulated from the mid-January rain pelting San Francisco, company president Greg Brockman surveys the energy levels of the team overseeing the companys new artificial intelligence model, ChatGPT. How are we doing between everythings on fire and everyones burned out to everyones just back from the holidays and everythings good? Whats the spectrum? he asks.\nI would say the holidays came at just the right time, replies one lieutenant. Thats an understatement. Within five days of ChatGPTs November launch, 1 million users overloaded its servers with trivia questions, poetry prompts and recipe requests. (Forbes estimates its now 5 millionplus.) Open-AI quietly routed some of the load to its training supercomputer, thousands of interconnected graphics processing units (GPUs) custom-built with allies Microsoft and Nvidia, while long-term work on its next models, like the highly anticipated GPT-4, took a back seat.\nAs the group huddles, ChatGPTs at-capacity servers still turn away users. The previous day, it went down for two hours. Yet amid the fatigue, this roomful of employees, all in their twenties and early thirties, clearly relish their roles in a historic moment. AI is going to be debated as the hottest topic of 2023. And you know what? Thats appropriate, says Bill Gates, the person most responsible for a similar previous paradigm shiftone known as software. This is every bit as important as the PC, as the internet.\nThe markets agree. Valued at $29 billion following a reported $10 billion investment commitment from Microsoft, OpenAIspecifically, Brockman, 34, and his boss, CEO Sam Altman, 37serves as the poster child for something extraordinary. But its hardly alone. In image generation, Amazon quietly backs Stability AI (recent value: $1 billion), whose brash CEO, Emad Mostaque, 39, aspires to be the Amazon Web Services of the category. Hugging Face ($2 billion) supplies tools for giants like Intel and Meta to build and run competitive models themselves. Below the generative AI providers in this budding tech stack, Scale AI ($7.3 billion) and others provide picks-and-shovels infrastructure; above them, an ecosystem of applications develops, funneling the AI into specialized software that could fundamentally alter jobs for lawyers, salespeople, doctorspretty much everyone.\nIs there hype? Plenty. The reported valuation for OpenAI, aggressively forecasting 2023 revenue of $200 million (compared to expected revenue of about $30 million last year, according to part of a past investor presentation observed by Forbes), would imply a forward 145 price-to-sales multiple, compared to a more typical 10x or 20x. (OpenAI declined to comment on its financials except to say that the investment was multiyear and multibillion.) No matter that AI insurgents arent pure disruptorsAmazon, Google, Microsoft, Nvidia and others already profit by providing the cloud infrastructure underpinning much of the category. Google in particular, with its enormous resources and decade-plus of machine learning research, is the elephant in the room, says investor Mike Volpi at Index Ventures.\nSocietal challenges? Those too. Theres potential for bias and discrimination in the models, not to mention misuse by bad actors. Legal spats are emerging over the ownership of AI-generated work and the actual data used to teach them. Then theres the ultimate goal that some, such as Open-AIs leaders, envision: a conscious, self-improving artificial general intelligence that could reimagine capitalism (Altmans hope)or threaten humanity (others fear, including Elon Musks).\nTodays AI-based image generators arent self aware. But Forbes asked OpenAIs DALL-E and Stability AIs Stable Diffusion  to attempt to visualize themselves, using an identical prompt: an artistic portrait of the artificial intelligence called X, created by the artificial intelligence X. These were the authors favorites of the resulting self-portrait attempts.\nDreamStudio / DALL-E\nOpenAI CEO Sam Altman declined to be photographed for this story. Heres how his generative AI tool DALL-E imagined Sam Altman on the cover of Forbes Magazine  in this generated image, proudly presenting it himself.\nDALL-E\nBut in speaking with more than 60 researchers, investors and entrepreneurs in the category, its clear that this AI gold rush also has something other recent crazes have lacked: practical, even boring, business substance. The race to embed tools in company workflows, large and small, is already on. Calls to AI-based code snippets, or APIs, soared tenfold in 2022, with more acceleration in December, according to provider RapidAPI. A recent Cowen study of 100-plus enterprise software buyers found that AI has emerged as the top spending priority among emerging technologies. Chat-GPT and Open-AIs models are coming to Microsofts massive-footprint suite of products such as Outlook and Word, with most business software makers poised to follow suit quickly.\nA quarter-century after IBMs Deep Blue program defeated chess grandmaster Garry Kasparov, the shift to artificial intelligence is finally here. Its an exciting time, the press-shy Altman tells Forbes, but my hope is that its still extremely early.\nNew York Citys Public School System banned Chatgpt, and a Wharton Professor who tested the program gave it a B on his final exam.\nT\nhis AI tipping point also has roots in London, the headquarters for Mostaques Stability. In August, hot on the heels of the beta launch of OpenAIs image model, DALL-E, Mostaque released Stable Diffusion, which allows anyone to instantly spin a line of text into a piece of art, or turn a dull selfie into a dramatic self-portrait. Unlike OpenAIs proprietary model, Stability doesnt own Stable Diffusion, which is open-source. But its become the biggest driving force and profit-maker behind the project so far. On any given day, 10 million people use Stable Diffusionmore than any other model.\nTHINK BIGGER | At his $2 billion startups January offsite in France, Clem Delangue, Hugging Faces cofounder and  CEO, had one directive for his  150 employees: Be more ambitious. Sometimes when an industry gets bigger, the speed of evolution goes down. Here its evolving really, really fast. I think theres potential for multiple $100 billion companies.\nLevon Biss for Forbes\nSuch rapid adoption proved a turning point. Previously, AI had existed in three realms. The first was academic: A seminal paper demonstrating the power of neural networks, a key underpinning of GPT and other large language models (so named because they can scan, translate and generate text) was published more than a decade ago. The second was demonstrative: Deep Blue created an arms race of stunts, with Alphabets DeepMind unit ultimately creating juggernauts in chess and the ancient board game Go. The third was incremental: apps like Gmail, which works without AI but is better with featur",
      "snippet": "... of interconnected graphics processing units (GPUs) custom-built with allies <b>Microsoft</b> and Nvidia, while long-term work on its next models, like ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:30:00",
      "provider": {
        "name": "forbes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imageio.forbes.com/specials-images/imageserve/63dad04282278ab367e6ed8a/0x0.jpg?format=jpg&crop=1920,1080,x0,y0,safe&width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "forbes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.forbes.com/sites/alexkonrad/2023/02/02/inside-chatggpts-breakout-moment-and-the-race-for-the-future-of-ai/"
      }
    },
    {
      "id": "6203083036252399785",
      "title": "Six Things You Didnt Know About ChatGPT, Stable Diffusion And The Future Of Generative AI",
      "url": "https://www.forbes.com/sites/kenrickcai/2023/02/02/things-you-didnt-know-chatgpt-stable-diffusion-generative-ai/",
      "description": "Forbes spoke to 60 entrepreneurs and researchers in the AI space to understand whats happening with ChatGPT, OpenAI and the race to dominate a technology that could be as transformative as the internet.",
      "body": "Share to Linkedin\nTodays AI-based image generators arent self aware. But Forbes asked Stability AIs Stable Diffusion (left) and OpenAIs DALL-E (right)  to attempt to visualize themselves, using an identical prompt: an artistic portrait of the artificial intelligence called X, created by the artificial intelligence X. These were the authors favorites of the resulting self-portrait attempts.\nDreamStudio / DALL-E\nA\nrtificial intelligence will be 2023s hottest topic, and one subject to debate. Thats what Microsoft cofounder Bill Gates told Forbes in an exclusive conversation about the suddenly exploding field. More than 60 other AI leaders Forbes interviewed share his anticipation: after decades of research and demonstrative stunts like Deep Blues victory over chess grandmaster Garry Kasparov, the shift to artificial intelligence is finally here.\nPerhaps nothing indicates this better than OpenAI and its conversational robot ChatGPT. Forbes estimates that its already exceeded 5 million users in less than 60 days from launch. Its usage has become rampant in schools  prompting New York City to ban it on public school computers  and its got enough smarts already to get a B grade on a final exam at Wharton. Soon, it will be deployed in Microsofts Office software suite, and tons of other business applications. But OpenAI nearly shelved ChatGPTs release entirely, its leaders, CEO Sam Altman and president Greg Brockman, told Forbes in rare interviews.\nThen, theres Stability AIs open-source image generation model Stable Diffusion, which has been used on pop music videos, Hollywood movies and by more than 10 million people on a daily basis. Stabilitys brash CEO Emad Mostaque predicts the dot-AI bubble is coming. If OpenAI (recently valued at $29 billion) and Stability ($1 billion, off virtually no revenue) are any indication, its already begun. While the experts Forbes spoke to have different views on how the market will play out, one thing is for sure: soon, AI will be affecting the way that you work, like it or not.\nHere are six things you probably didnt know about ChatGPT, Stable Diffusion and the future of generative AI. For more, read\nForbes new magazine feature on the dawn of the work-ready AI era.\n1. Big Techs last generation of billionaire founders are back in the trenches\nBill Gates is excited about AI, and is now spending 10% of his time back at Microsoft meeting with product teams, he said. Hes not alone: at Google, CEO Sundar Pichai reportedly enacted a code red emergency, reorienting the companys work to focus on ways to counteract ChatGPT and similar tools. In turn, hermetic founders Larry Page and Sergey Brin are back. Forbes broke the news that Brin filed a code request on LaMDA, Googles natural language chatbot, in January  his first in years.\n2. ChatGPT almost wasnt releasedespite its viral success, ChatGPT did not impress employees inside OpenAI. None of us were that enamored by it,\nForbes\n. None of us were like, This is really useful. This past fall, Altman and co. decided to shelve the chatbot to concentrate on domain-focused alternatives instead. But in November, after those alternatives failed to catch on internally  and as tools like Stable Diffusion caused the AI ecosystem to explode  OpenAI reversed course. It really lit a fire under OpenAI, said Sequoia investor Pat Grady, whose firm bought shares in OpenAI in 2021.\nGreg Brockman, OpenAI's cofounder and president, said that before ChatGPT's launch, he thought the company would be lucky to get \"one Twitter thread of 10,000 likes.\" Its Discord channel alone gained two million members in two months instead.\nCopyright  2022 Ethan Pines\n3. ChatGPT forced OpenAI to delay development on GPT-4\nInternally, ChatGPTs virality has been a double-edged sword. Its instant popularity  more than 1 million users in its first five days  overloaded the companys servers. In the holiday rush, OpenAI employees had to shift computing from its training supercomputer, used to train new models like the highly anticipated GPT-4, to helping run ChatGPT. Stay tuned for follow-up stories that may include an early warning of when GPT-4 is now expected to launch. One thing to know now: according to billionaire Reid Hoffman, who donated to OpenAIs non-profit early on, its developed a sense of humor.\n4. Stabilitys Faustian bargain\nMostaque has positioned his company Stability as the AI company for the people  building the technology in a fashion unlike what he calls the panopticon approach of Big Tech. But hes quietly struck his own arrangement with a tech giant: an incredibly attractive deal with Amazon, which has so far remained a dark horse in the race for AI. The cloud giant provided Stability with more than 4,000 Nvidia GPUs to power Stabilitys supercomputer, one of the worlds largest, on which Stable Diffusion was subsequently trained. Thats a lot of computing power. A year ago, Stability operated just 32 such GPUs, Mostaque said.\n5. Money laundering in the cloud\nBeneath all this flashy new technology lies a bed of lucrative computing infrastructure used to build all the apps. The costs are getting unwieldy  as indicated by OpenAIs reported $10 billion investment commitment from Microsoft, much of which is expected to be spent on computing costs associated with Microsofts cloud service Azure. (Microsoft and OpenAI have called it a multi-year, multi-billion deal.) There is a lack of transparency, said Clem Delangue, CEO of Hugging Face, which hosts AI models like Stable Diffusion and was recently valued at $2 billion. It leads to situations where we lose track of the real cloud infrastructure cost of a lot of machine learning. Some of these costs appear to be proliferating unchecked  so much so that Delangue coined his own term for it: Cloud money laundering.\n6. AIs end game?\nArtificial general intelligence, or AGI, is a term for an as-yet hypothetical AI that is conscious, self-improving and theoretically capable of outsripping human control (a prospect that has concerned some, like Elon Musk, an initial donor to OpenAI who has since cut ties with the company). Sam Altman believes we likely wont recognize an AGI when it arrives. This end-game is why OpenAI has two unusual setups for a startup unicorn: a capped-profit mechanism by which, after returning a certain amount of profits to shareholders, it would return to non-profit control; and a merge condition by which, should a competitor get close to reaching an AGI, OpenAI would shut down its own work and fold into the more successful project. Altman also thinks that when an AGI comes  for there could be several  it might break capitalism for the better.\nFor more, read",
      "snippet": "Thats what <b>Microsoft</b> cofounder Bill Gates told Forbes in an exclusive conversation about the suddenly exploding field. More than 60 other AI leaders ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:30:00",
      "provider": {
        "name": "forbes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imageio.forbes.com/specials-images/imageserve/63db0033d01da33f8fe6ed8a/0x0.jpg?format=jpg&width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "forbes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.forbes.com/sites/kenrickcai/2023/02/02/things-you-didnt-know-chatgpt-stable-diffusion-generative-ai/"
      }
    },
    {
      "id": "3736755826761083254",
      "title": "Ericsson 5G: Ericsson, Intel, Microsoft successfully demonstrate 5G network slicing capabilities on Windows laptop, Telecom News, ET Telecom",
      "url": "https://telecom.economictimes.indiatimes.com/amp/news/ericsson-intel-microsoft-successfully-demonstrate-5g-network-slicing-capabilities-on-windows-laptop/97552377",
      "description": "Ericsson 5G: The trial used User Equipment Route Selection Policy (URSP), the capability that enables devices to automatically select between different slices according to which application they are using. It also utilized Intel processors, Windows 11 OS, Ericssons Dynamic Network Slicing Selection, Ericssons dual-mode 5G Core, and Ericssons RAN Slicing capabilities to secure end-user service differentiation.",
      "body": "Read on App\nNEW DELHI: Swedish telecom gear maker Ericsson, chipmaker Intel, and Microsoft have jointly successfully demonstrated end-to-end 5G standalone (SA) network slicing capabilities on a Windows laptop for consumer and enterprise applications.\nThis pioneering trial demonstrates the applicability of the technology on devices beyond smartphones, paving the way for new business opportunities for cellular-connected laptops, Ericsson said in a statement.\nIn the interoperability development testing (IoDT), the companies demonstrated the use of multiple network slices on cellular-connected laptop devices for consumers and enterprise use cases such as mobile gaming and collaboration applications.\nThe trial used User Equipment Route Selection Policy (URSP), the capability that enables devices to automatically select between different slices according to which application they are using. It also utilized Intel processors, Windows 11 OS, Ericssons Dynamic Network Slicing Selection, Ericssons dual-mode 5G Core, and Ericssons RAN Slicing capabilities to secure end-user service differentiation.\nThe inclusion of Windows 11 laptops among other devices, that can be used for commercializing 5G network slicing indicates that the ecosystem is maturing, Ericsson claimed in the statement.\nNetwork slicing capabilities will benefit consumer and enterprise segments by defining specific Service Level Agreement per slice for existing and emerging Windows applications and use cases, such as real-time enterprise applications like Microsoft Teams and Office365, game/media streaming, and emerging AI and augmented reality/extended reality (AR/XR) applications, as per the telecom gear maker.\nLondon-based telco body GSMA estimates that the market for network slicing alone in the enterprise segment is projected at $300 billion by 2025.\nExpanding the range of devices for network slicing to include laptops will allow new business segments to create a variety of use cases for consumer and enterprises. We have shown, together with Intel and Microsoft, how ecosystem collaboration can open new possibilities, said Sibel Tombaz, Head of Product Line 5G RAN at Ericsson.\nWe are thrilled to showcase our cutting-edge technology and its ability to deliver fast, dependable and secure 5G connectivity on Windows 11. Partnering with Intel and Ericsson only further solidifies our commitment to innovation and openness in our platform, said Ian LeGrow, Microsoft Corporate Vice-President of Core OS Innovation.\nFollow and connect with us on Twitter, Facebook, Linkedin,",
      "snippet": "... Swedish telecom gear maker Ericsson, chipmaker Intel, and <b>Microsoft</b> have jointly successfully demonstrated end-to-end 5G standalone (SA) network ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T10:51:00",
      "provider": {
        "name": "indiatimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://etimg.etb2bimg.com/thumb/msid-97552377,imgsize-307322,width-1200,height-628,overlay-ettelecom/ericsson-intel-microsoft-successfully-demonstrate-5g-network-slicing-capabilities-on-windows-laptop.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indiatimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://telecom.economictimes.indiatimes.com/amp/news/ericsson-intel-microsoft-successfully-demonstrate-5g-network-slicing-capabilities-on-windows-laptop/97552377"
      }
    },
    {
      "id": "5643074838234157411",
      "title": "Marry or Not? Desi Woman's Query on 'Upcoming' Husband Fired by Microsoft is Viral",
      "url": "https://www.news18.com/buzz/should-i-marry-desi-womans-query-on-future-husband-getting-laid-off-by-microsoft-is-viral-6976357.html",
      "description": "Indian woman asks if she should marry 'upcoming' husband who got fired from Microsoft and there can be no correct answer.",
      "body": "Google News\nBig tech layoffs continued into January 2023. Approximately 106,950 techies lost their jobs in the past month, India Today reported citing tech layoff tracker Trueup.io. As per IANS, more than 1,600 tech employees were being laid off per day on average in 2023 globally, including in India. Microsoft laid off 10,000 employees last month, as per the tracker.\nAn Indian woman found herself in a strange predicament due to the layoffs at Microsoft and its not what you would expect. Taking to social media, she asked, Upcoming husband got laid off in Microsoft layoffs, should I still marry him? [sic]\"\nIt was an arranged marriage planned for this month. The woman in question said that her family was aware of her fianc (upcoming husband\") being laid off.\n\nMass Layoff Memes Crowd Twitter as Tech Companies Across the World on Firing Spree\n'Prejudice': Shark Tank India Pitcher Called 'B****' Online, Co-Founder Husband Praised\nits an arranged marriage kaha ki hypocrisy, the whole thing is supposed to take place because of weird sexist reasons. if she doesnt marry shes just followinf the logic that both of their families are using anyway shashupash (@shashumashu)\nFebruary 1, 2023\nAmong companies who laid off sizeable chunks of their staff are ShareChat, Ola, Skit.ai, Dunzo and more. A whopping 91 companies have laid off more than 24,000 tech employees in the first 15 days of January.\nIn 2022, over 1,000 companies laid off 154,336 workers, as per the data by layoffs tracking site Layoffs.fyi.\nThe mass tech layoffs of 2022 are continuing into the new year. The sacking episodes have gained speed amid global economic meltdown and recession fears, reported IANS.\nDeeper layoffs are coming in 2023 as most business economists have predicted that their companies will cut payrolls in the coming months.\n(With inputs from IANS)\nRead all the Latest Buzz News here\nAbout the Author",
      "snippet": "... asks if she should marry 'upcoming' husband who got fired from <b>Microsoft</b> and there can be no correct answer. Google News Big tech layoffs continued ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T10:27:07",
      "provider": {
        "name": "news18",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.news18.com/ibnlive/uploads/2023/02/indian-wedding-167533279716x9.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "news18",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.news18.com/buzz/should-i-marry-desi-womans-query-on-future-husband-getting-laid-off-by-microsoft-is-viral-6976357.html"
      }
    },
    {
      "id": "464483216679357580",
      "title": "Microsoft rolls out Teams Premium with OpenAI-powered features",
      "url": "https://www.engadget.com/microsoft-teams-premium-openai-artificial-intelligence-152658424.html?src=rss",
      "description": "Microsoft says Teams Premium uses tech like OpenAIs GPT-3.5 to make meetings 'more intelligent, personalized and protected.'.",
      "body": "Fresh off the heels of news that Microsoft is making a multibillion-dollar investment into OpenAI, its integrating the companys tech into more of its products and services. Microsoft has announced that Teams Premium is now broadly available. The service features large language models powered by OpenAIs GPT-3.5, along with other tech geared toward making meetings \"more intelligent, personalized and protected, Microsoft says.\nTeams Premium offers AI-generated chapters in PowerPoint Live and personalized timeline markers for when you leave and join a meeting.\" Live translations in captions are currently available too. In the coming months, Teams Premium will be able to automatically generate meeting notes with the help of GPT-3.5. Users will have access to AI-generated task and action item suggestions as well. Microsoft will likely expand the Teams Premium AI features over time.\n\nThe company previously introduced the Azure OpenAI Service for developers, along with a tool to help beginners build their own apps and a graphic design app that are both powered by OpenAI tech. Word on the street is that Microsoft is building ChatGPT, OpenAIs astonishingly popular chatbot, into Bing (Google is said to be working on an AI chatbot for Search too.)",
      "snippet": "<b>Microsoft</b> says Teams Premium uses tech like ... off the heels of news that <b>Microsoft</b> is making a multibillion-dollar investment into OpenAI, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T10:26:58",
      "provider": {
        "name": "engadget",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/os/creatr-uploaded-images/2023-02/c6a72050-a30c-11ed-8fed-e59b58ee140e",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "engadget",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.engadget.com/microsoft-teams-premium-openai-artificial-intelligence-152658424.html?src=rss"
      }
    },
    {
      "id": "6240527920594582694",
      "title": "Microsoft unveils Spotify, Phone Link widgets for Windows 11",
      "url": "https://www.siasat.com/microsoft-unveils-spotify-phone-link-widgets-for-windows-11-2516989/",
      "description": "San Francisco: Tech giant Microsoft has unveiled new Spotify and Phone Link widgets for Windows 11 which are now available in the latest 'Windows 11",
      "body": "Microsoft unveils Spotify, Phone Link widgets for Windows 11\nMicrosoft unveils Spotify, Phone Link widgets for Windows 11\n| \nPublished: 2nd February 2023 3:54 pm IST\nSan Francisco: Tech giant Microsoft has unveiled new Spotify and Phone Link widgets for Windows 11 which are now available in the latest Windows 11 Insider Preview Build 25290 to the Dev Channel.\nTo access the new widgets, Insiders in the Dev Channel can go to the widgets collection in the Microsoft Store and update to the latest version of the applications, the tech giant said in a blogpost on Wednesday.\nThen they have to open the widgets board and navigate to the widgets picker by clicking the plus button at the top-right of the board to pin their widgets.\nAlso Read",
      "snippet": "... Francisco: Tech giant <b>Microsoft</b> has unveiled new ... for Windows 11 <b>Microsoft</b> unveils Spotify, Phone ... Francisco: Tech giant <b>Microsoft</b> has unveiled new ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T10:24:11",
      "provider": {
        "name": "siasat",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.siasat.com/wp-content/uploads/2023/02/Windows-Spotify.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "siasat",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.siasat.com/microsoft-unveils-spotify-phone-link-widgets-for-windows-11-2516989/"
      }
    },
    {
      "id": "2424380940950061928",
      "title": "Slowing economy squeezing Microsoft and other tech giants earnings",
      "url": "https://www.investorschronicle.co.uk/news/2023/02/02/slowing-economy-squeezing-microsoft-and-other-tech-giants-earnings/",
      "description": "Big US technology companies are seeing profits fall across the board",
      "body": "Microsofts personal computing sales were down significantly\nAdvertising market continues to weaken\nA quick rebound in tech sector earnings looks even more unlikely after the US giants used December quarter updates to give investors a realistic view of this years trading conditions. Even though Microsofts (US:MSFT) quarterly results beat analyst expectations last week, a gloomy forecast on the earnings call spooked the market. This was soon followed by disastrous results from chipmaker Intel (US:INTC) and some negative guidance from Snap (US:SNAP) that cast further doubts over the US advertising market.\n\nJoin our Community of Smart Investors\nIndependent full-length company analysis\nExpert investment tools and data\nLatest news on pensions, property and economics\nStock screens and investment ideas",
      "snippet": "Big US technology companies are seeing profits fall across the board.\n<b>Microsofts</b> personal computing sales were down significantly Advertising market continues to weaken A quick rebound in tech sector earnings looks even more unlikely after the US giants used December quarter updates to give investors a realistic view of this years trading conditions.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T10:16:46",
      "provider": {
        "name": "investorschronicle",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fs3-eu-west-1.amazonaws.com%2Fic-ez-prod%2Fez%2Fimages%2F6%2F0%2F5%2F9%2F5769506-8-eng-GB%2F395155446.jpg?source=invchron",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "investorschronicle",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.investorschronicle.co.uk/news/2023/02/02/slowing-economy-squeezing-microsoft-and-other-tech-giants-earnings/"
      }
    },
    {
      "id": "8364765213614785892",
      "title": "Discord arrives on PS5 for beta testers today",
      "url": "https://www.theverge.com/2023/2/2/23582581/ps5-discord-voice-chat-support-beta",
      "description": "PS5 owners will be able to join Discord voice calls on their consoles soon. Beta testers get access today in select countries, alongside other software improvements.",
      "body": "Discord integration for PS5.\nImage: Sony\nBeta testers will be able to join Discord voice calls on a PS5 console in the US, Canada, Japan, and UK starting today. The integration allows PS5 owners to join Discord calls by linking accounts and then using the Discord mobile app to transfer calls to the PS5. Sony is also adding Variable Refresh Rate support for 1440p, alongside various dashboard improvements.\nThe Discord voice integration on PS5 appears seems similar to how Microsoft initially launched Discord support on the Xbox. Sony says you have to use the Discord app on your mobile device or computer to get a Discord voice chat going on your PS5 console, which means you wont be able to directly access Discord servers on a PS5 without using a mobile device or your PC to transfer the call.\nHopefully Sony will improve that soon, as Microsoft improved its Discord integration for Xbox in November, allowing Xbox owners join voice channels straight from a console without having to use a phone or PC.\nVRR support at 1440p.\nImage: Sony\nAlongside the Discord support, the PS5 will also get Variable Refresh Rate support for the 1440p resolution. This means compatible HDMI 2.1 displays can enable VRR at 1440p to benefit from smoother visual performance in games.\nSony is also making some improvements to the social aspects of the share screen feature and party chats in the PS5 dashboard, and even adding a new friends who play tile so you can see which friends are currently playing a game.\nSonys new PS5 data transfer tool.\nImage: Sony\nWhile the PS app currently supports auto-upload for screenshots or game clips, youll soon be able to upload game captures manually. Sony is also making it easier to access PS4 saved data on a PS5, meaning new games can load old PS4 saved data. Theres also a new option to move PS5 data and games from one console to another using a local Wi-Fi or LAN connection.\nSony is releasing this new beta software to testers today and well likely see it available on all PS5 consoles in the coming months.\nSign up for the                  newsletter\nVerge Deals",
      "snippet": "The Discord voice integration on PS5 appears seems similar to how <b>Microsoft</b> initially launched Discord support on the Xbox. Sony says you have to use ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:24:46",
      "provider": {
        "name": "theverge",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Bn-Woz0wtNlMnEqpE2aRSjy0CN0=/0x61:1920x1066/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24403409/d982bc8afe68b7e20fed7ffd7620b1df51e50201.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theverge",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.theverge.com/2023/2/2/23582581/ps5-discord-voice-chat-support-beta"
      }
    },
    {
      "id": "8501990753479258664",
      "title": "Microsoft releases PowerToys v0.67.0 with new quick access system tray launcher utility!",
      "url": "https://betanews.com/2023/02/02/microsoft-releases-powertoys-v0-67-0-with-new-quick-access-system-tray-launcher-utility/",
      "description": "Microsoft has updated the PowerToys utility collection, adding the first new module of 2023. Although there have been various updates for PowerToys over the last few months, and we've heard about upcoming new features such as Mouse Jump, it is a while since we've had new toys to play with.",
      "body": "Tweet\nMicrosoft has updated the PowerToys utility collection, adding the first new module of 2023. Although there have been various updates for PowerToys over the last few months, and we've heard about upcoming new features such as Mouse Jump, it is a while since we've had new toys to play with.\nBut this changes with the release of PowerToys v0.67.0 which sees the addition of the quick access system tray launcher which we first heard about late last year. A new taskbar menu provides easy access to your favorite PowerToys tools and settings, without the need to navigate through the main app interface.\nSee also:\nAdvertisement\nThe latest Windows 11 problem sees updates failing with 0x800f0988 and 0x800f0831 errors\nAnnouncing the availability of PowerToys v0.67.0, the development team says: \"In the v0.67 release cycle, we focused on releasing new features and improvements\".\nWith the latest version installed, you'd be forgiven for missing the new tool as there is no reference made to it in the app or in settings. In order to access the new quick access system tray launcher utility, you need to have the PowerToys icon enabled in the system tray; left click this, and the new launcher will pop into view.\nAs you can see from the screenshot above, the menu provides you with easy access to a number of PowerToys components, as well as a quick way to jump to settings. Click the More button and, as shown in the screenshot below, you can enable and disable PowerToys utilities to suit your preferences.\nThis release also includes a number of improvements and fixes.\nThe full changelog for PowerToys v0.67.0 is as follows:\nHighlights\nAll PowerToys registry entries are moved from machine scope (HKLM) to user scope (HKCU).\nQuick access system tray launcher. Thanks",
      "snippet": "<b>Microsoft</b> has updated the PowerToys utility collection, adding the first new module of 2023. Although there have been various updates for PowerToys ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:09:14",
      "provider": {
        "name": "betanews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://betanews.com/wp-content/uploads/2023/02/powertoys_launcher-50x50.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "betanews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://betanews.com/2023/02/02/microsoft-releases-powertoys-v0-67-0-with-new-quick-access-system-tray-launcher-utility/"
      }
    },
    {
      "id": "411884430102980048",
      "title": "Microsoft announces ChatGPT-powered Teams Premium",
      "url": "https://www.thehindubusinessline.com/info-tech/microsoft-announces-chatgpt-powered-teams-premium/article66462342.ece",
      "description": "Microsoft Teams premium will cost $7 per month in June",
      "body": "WhatsApp\nReddit\nMicrosoft has rolled out premium Teams offering powered by ChatGPT to simplify the meeting experience using the AI chatbot, the company announced.\nThe service will cost $7 per month in June and $10 in July, the company said.\nAs per reports, the tech giant has said it aims to add ChatGPTs technology into all its products, setting the stage for more competition with Google.\nWe're bringing the power of large language models, including OpenAI's GPT, to Teams Premium, as we make meetings more intelligent, personalized, and protected.",
      "snippet": "<b>Microsoft</b> Teams premium will cost $7 per month in June. WhatsApp Reddit <b>Microsoft</b> has rolled out premium Teams offering powered by ChatGPT to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:02:47",
      "provider": {
        "name": "thehindubusinessline",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bl-i.thgim.com/public/incoming/9g2af7/article66462338.ece/alternates/LANDSCAPE_1200/Microsoft.JPG",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "thehindubusinessline",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.thehindubusinessline.com/info-tech/microsoft-announces-chatgpt-powered-teams-premium/article66462342.ece"
      }
    },
    {
      "id": "1223646731078335348",
      "title": "Microsoft Teams Premium just got these ChatGPT powered features; it is FREE for now",
      "url": "https://tech.hindustantimes.com/tech/news/microsoft-teams-premium-just-got-these-chatgpt-powered-features-it-is-free-for-now-71675328177722.html",
      "description": "Microsoft has introduced a new ChatGPT-powered premium Teams service. Know what has changed for you.",
      "body": "Your Teams meetings are set to be more intelligent, personalised, and protected, says Microsoft CEO Satya Nadella. This is so because Microsoft has rolled out a new and premium Teams service which is powered by ChatGPT. Nadella took to Twitter to announce, Were bringing the power of large language models, including OpenAIs GPT, to Teams Premium, as we make meetings more intelligent, personalized, and protected.What will change with the arrival of the Premium Teams feature? It is said that OpenAI-owned ChatGPT will help to generate meeting notes, recommend tasks, and also offer live translations during the Teams meetings to make the work more productive and effortless. This will be possible due to the intelligent recap in Teams premium to help you get the information most important to you, even if you miss the meeting. With intelligent recap, you can now save time spent reviewing meeting recordings.  AI-generated chapters divide the meeting into sections so its easy to pick and choose the content most relevant to you. This is available starting February 1 for PowerPoint Live meeting recordings. Intelligent recap will automatically generate meeting chapters based on the meeting transcript as well. Apart from this, personalized timeline markers feature has been also added to Teams which can be only viewed by you when you joined or left a meeting in the recording.  Microsoft says, \"With live translations (for captions) now available in Teams Premium, you get AI-powered real-time translations from 40 spoken languages.Who can get Microsoft Teams PremiumYou can give Microsoft Teams Premium a try for free for 30 days. Your free Microsoft Teams Premium trial will automatically end after 30 days. You buy before July 1, 2023, for just USD7 per user per month. Microsoft says that it is 30 percent off the standard USD10 pricing.s",
      "snippet": "<b>Microsoft</b> has introduced a new ChatGPT-powered premium Teams service. Know what has changed for you.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:01:44",
      "provider": {
        "name": "hindustantimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.hindustantimes.com/tech/img/2023/02/02/1600x900/microsoft_teams_1606900141995_1606900158248_1675328470598_1675328470598.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hindustantimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://tech.hindustantimes.com/tech/news/microsoft-teams-premium-just-got-these-chatgpt-powered-features-it-is-free-for-now-71675328177722.html"
      }
    },
    {
      "id": "2805297250515224212",
      "title": "Six Top Investment Themes for 2023",
      "url": "https://www.sharecafe.com.au/2023/02/02/six-top-investment-themes-for-2023/",
      "description": "With every new year, comes new developments and opportunities - so, from the Metaverse to healthcare innovation, Global X has identified six thematic trends to start off the year.",
      "body": "Six Top Investment Themes for 2023\nBy Global X ETFs Australia |\nWith every new year, comes new developments and opportunities. So, what is in store for 2023? From the Metaverse to healthcare innovation, Global X has identified some of the top thematic trends to start off the year.\n\nMetaverse & Video Games\nVirtual Reality Immerses Itself in 2023\nMeta Platforms will allocate an estimated 20% of its overall costs and expenses in 2023 to Reality Labs, its virtual reality (VR) and augmented reality (AR) and Metaverse business.\n1\nIn Q3 2022, Meta allocated 18% of its spending to Reality Labs.\n2\nThe increased investment reflects the companys commitment to developing immersive technologies despite the economic downturn and market volatility that hit big tech particularly hard in 2022. This approach is in line with the rapid innovation seen in the VR and AR space at CES 2023. Many companies debuted exciting new products that push boundaries, including Sony PlayStations VR2 gaming headset, HTCs Vive XR Elite headset, and Lumus Z-lens technology.\nArtificial Intelligence & Cloud Computing\nChatGPT Enters the Cloud\nMicrosoft is looking to invest $10 billion into OpenAI, which would value the emerging leader in artificial intelligence at $29 billion.\n3\nThe deal includes a provision for Microsoft to acquire a 75% share of OpenAIs profits until the investment is recouped, and ultimately, a 49% stake in the company.\n4\nThis move is seen as a strategic one for Microsoft, as the integration of OpenAIs technology, particularly the natural language processing model ChatGPT, could enhance the companys search engine capabilities and challenge the dominance of market leader Google. Additionally, Microsoft is expanding its partnership with OpenAI by making their Azure OpenAI Service available to the public, enabling Azure cloud customers to use OpenAI tools for cloud applications such as Dall-E AI art generation and the GPT-3.5 language system, and even plans to add access to ChatGPT in the near future.\nElectric Vehicles\nGovernment Pumps in Billions for a Cleaner America\nThe U.S. Department of Energy recently secured a significant $2.5 billion loan to Ultium to support the construction of large-scale electric vehicle (EV) lithium-ion battery cell manufacturing plants.\n5\nThis venture is a collaboration between General Motors and LG-Energy Solution and will involve the construction of state-of-the-art facilities in Ohio, Tennessee, and Michigan, with the possibility of a fourth site in Indiana. The Michigan facility alone is projected to open as early as 2024 and is a key step towards President Bidens goal of achieving 50% of U.S. auto production to be electric or plug-in hybrid electric vehicles by 2030.\n6\nThe commitment to clean transportation extends to the state level, with the California Energy Commission approving a substantial $2.9 billion investment plan to expedite the states goals for electric vehicle charging by 2025.\n7\nThis funding will support the roll-out of thousands of zero-emission trucks, school buses, and transit buses, and is projected to result in the installation of 90,000 EV chargers across the state  significantly surpassing the current number of 80,000.\n8\nCombined with additional funding from utility companies and other programs, these investments are expected to play a pivotal role in California reaching its goal of deploying 250,000 EV chargers by 2025.\nGenomics & Aging Population\nCOVID-19 Victory: Moderna Takes on Cancer\nUtilising the same messenger RNA technology that made their COVID-19 vaccines successful, Moderna created an experimental cancer vaccine that shows promising results in the treatment of melanoma. In a mid-stage trial, the combination of Modernas personalised cancer vaccine and Merck & Co.s highly effective immunotherapy Keytruda resulted in a 44% reduction in the risk of recurrence or death, compared to Keytruda alone.\n9\nSolar Energy & Clean Technology\nSolar Energy Achieves Record Conversion Efficiency\nJinkoSolar, a leading solar module manufacturer, announced a significant development in its N-type monocrystalline silicon tunnel oxide passivated contact (TOPCon) solar cell technology. The company achieved a maximum solar conversion efficiency of 26.4%, surpassing its previous record of 26.1% set in October.\n10\nThe company used advanced techniques such as bulk defect passivation technology, a novel structure polysilicon contact, and metal-silicon interface recombination restraint technology.  Additionally, Canadian Solar announced that its majority-owned subsidiary, CSI Solar Co. Ltd., will begin mass-producing high-efficiency N-type TOPCon solar modules with a power output of up to 690 watts in Q1 2023.\n11\nInternet of Things\nSemiconductors in it For the Long Haul\nThe global market for semiconductor manufacturing equipment is on track to reach a new peak in 2022, with original equipment manufacturers forecasting sales of $108.5 billion, a 6% increase from the previous record of $102.5 billion set in 2021.\n12\nThis marks three consecutive years of record revenue for the industry. However, the market is expected to experience a temporary dip in 2023, contracting to $91.2 billion, before rebounding in 2024 due to strong demand in both front-end and back-end segments.\n13\nAdditionally, the semiconductor ecosystem is experiencing a surge in growth, as companies leverage funding from the CHIPS Act to drive innovation and production, resulting in over 40 new projects, nearly $200 billion in private investments across 16 states, and the creation of 40,000 new jobs in the industry.\n14\nInterested in exploring thematic investing? Discover Global Xs diverse range of ETFs here.\n\nFOOTNOTES\nBloomberg News. (2022, December 19). Facebooks Meta Will Devote 20% of Costs to Metaverse Next Year.\nIbid.\n(2023, January 10). Microsoft reportedly plans to invest $10 billion in creator of buzzy A.I. tool ChatGPT.\nIbid.\n(2022, December 12). U.S. finalises $2.5 billion loan to GM, LG battery joint venture.\nIbid.\nCalifornia Energy Commission. (2022, December 14). CEC Approves $2.9 Billion Investment for Zero-Emission Transportation Infrastructure.\nIbid.\n(2022, December 13). Positive Moderna, Merck cancer vaccine data advances mRNA promise, shares rise.\nPR Newswire. (2022, December 12). JinkoSolars High-efficiency N-Type Monocrystalline Silicon Solar Cell Sets Our New Record with Maximum Conversion Efficiency of 26.4%.\nSeeking Alpha. (2022, December 25). Canadian Solar to Start Mass Production of TOPCon Modules with Power Output up to 690W.\nSEMI Engineering. (2022, December 14). SEMIs Year-End Total Semiconductor Equipment Forecast  OEM Perspective, 2022.\nIbid.\nSemiconductor Industry Association. (2022, December 14). The CHIPS Act Has Already Sparked $200 Billion in Private Investments for U.S. Semiconductor Production.\nSHARE THIS ARTICLE:\nDecember Quarterly Report: Q2 FY2023\nLooking past the rain  theres a rainbow.\nTerraCom released their operating results for the December quarter FY2023 with operating",
      "snippet": "Artificial Intelligence & Cloud Computing ChatGPT Enters the Cloud <b>Microsoft</b> is looking to invest $10 billion into OpenAI, which would value the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:00:59",
      "provider": {
        "name": "sharecafe",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.sharecafe.com.au/wp-content/uploads/2023/02/Internet-of-things.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sharecafe",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sharecafe.com.au/2023/02/02/six-top-investment-themes-for-2023/"
      }
    },
    {
      "id": "4111960527094334373",
      "title": "Microsoft to revamp Teams Rooms on Windows: Improved buttons, UI and more",
      "url": "https://timesofindia.indiatimes.com/gadgets-news/microsoft-to-revamp-teams-rooms-on-windows-improved-buttons-ui-and-more/articleshow/97548721.cms",
      "description": "Microsoft has announced its plans to revamp its video conferencing platform--Teams Room on Windows consoles and front-of-room displays. The new look w",
      "body": "WhatsApp working on Calling shortcut feature for Android: Report\nMicrosoft\nhas announced its plans to revamp its video conferencing platform--Teams Room on Windows consoles and front-of-room displays. The new look will be added to the platform by the end of this quarter,\nMicrosoft Teams Room on\nWindows application running version 4.16. The company plans to make\nTeams Rooms\neasier to use by aligning key elements of the user interface across the Windows and\nAndroid\necosystems.\n\"To make Teams Rooms even easier to use, we're aligning key elements of the user interface across the Windows and Android ecosystems,\" Microsoft said in a blog post.\nThe upcoming update will let users witness the \"vivid new ambient screens\" along with a re-designed calendar on consoles and front-of-room displays.\nRead Also\nAdditionally,\nMicrosoft Teams\nusers will also get improved visual cues throughout the experience that will make it easier and more intuitive to interact with the console.\nOn the calendar, users will be able to scroll down to see the schedule for the entire day.\nThe update will also come with improved buttons on the console which will allow users to access the frequently used features, including a button for 'Meet' to start a new meeting from the room, a button for 'Call' which will allow users to make a call to a phone number or add a person from the directory, and more.\nHere's a detailed list of the upgradation which Microsoft Teams have received with the update:\nMeet: Start a new meeting from the room\nCall: Make a call to a phone number or add a person from directory\nShare: Share local HDMI content\nJoin via ID: Enables this Teams Room to join a Teams meeting using the meeting ID, with\nDirect Guest Join\ninteroperability functionality coming later this year\nMore: Opens the overflow menu\n\"For enhanced customisation, your organisation will have a wider range of ambient screens to choose from than before, with five exciting new themes added to the eight themes currently available,\" the company said.\n\"Users will be able to customise the Front Row view, including visibility of the meeting chat, and choose which meeting component is displayed on the left and right panel,\" it added.\nAlso watch:",
      "snippet": "... will be added to the platform by the end of this quarter, <b>Microsoft</b> Teams Room on Windows application running version 4.16. The company plans to make ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:53:00",
      "provider": {
        "name": "indiatimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-97548697/97548697.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indiatimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://timesofindia.indiatimes.com/gadgets-news/microsoft-to-revamp-teams-rooms-on-windows-improved-buttons-ui-and-more/articleshow/97548721.cms"
      }
    },
    {
      "id": "4916055929814589088",
      "title": "Microsoft supercharges Teams Premium with OpenAI's GPT 3.5 technology",
      "url": "https://www.neowin.net/news/microsoft-supercharges-teams-premium-with-openais-gpt-35-technology/",
      "description": "Microsoft's Teams Premium is now powered by OpenAI's GPT-3.5 technology, which is behind the popular ChatGPT tool. This enables Teams to automatically generate meeting notes and translate captions.",
      "body": "0\ncomments\nJust recently, Microsoft made Teams Premium more widely available to users. Teams Premium is the new version of its popular collaboration program that is designed for enterprises that require more functionalities when conducting webinars and large online gatherings. Aside from new features like custom registration start and end times for webinars and a 1,000-people registration limit, Teams Premium is\nnow also powered by OpenAI's\nGPT 3.5 technology.\nFor those not in the know, GPT, or Generative Pre-trained Transformer, is a machine learning model trained using internet data to generate any type of text. It is the technology behind the wildly popular ChatGPT chatbot, which can answer questions in a conversational manner, and generate code and text.\nAccording to Microsoft, the features in Teams Premium aims to make meetings \"more intelligent, personalized, and protected.\" For instance, it can translate captions in real-time, help create meeting templates, and automatically generate meeting notes, recommended tasks, and personalized highlights.\nWatermarking and encryption in action\nOther notable features in Teams Premium include personalized timeline markers, speaker timeline markers, customized meeting templates, and watermarking to deter leaks. Record capability limiting, branded meetings, sensitivity labels, and end-to-end encryption are also available. Teams Premium will cost $7 per month until June 30 before increasing to $10 in July.\nMicrosoft is heavily investing in OpenAI's GPT technology, with reports even saying that the company is even planning to integrate ChatGPT into its Bing search engine. It even reportedly invested $10 billion in OpenAI.\nTags",
      "snippet": "0 comments Just recently, <b>Microsoft</b> made Teams Premium more widely available to users. Teams Premium is the new version of its popular collaboration ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:46:01",
      "provider": {
        "name": "neowin",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.neowin.com/news/images/uploaded/2021/06/1623452685_microsoft_teams_9_story.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "neowin",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.neowin.net/news/microsoft-supercharges-teams-premium-with-openais-gpt-35-technology/"
      }
    },
    {
      "id": "7931356793664090164",
      "title": "Satya Nadella on how Microsoft Teams Premium is making meetings more intelligent",
      "url": "https://www.moneycontrol.com/news/trends/satya-nadella-on-how-microsoft-teams-premium-is-making-meetings-more-intelligent-9987331.html",
      "description": "Microsoft on Wednesday rolled out a premium Teams service powered by ChatGPT, with CEO Satya Nadella saying it would help make meetings more intelligent, personalised and protected.",
      "body": "/ 08:07 AM IST\nSatya Nadella at the Microsoft Future Ready Leadership Summit in Bengaluru on January 5.\nMicrosoft on Wednesday rolled out a premium Teams service powered by ChatGPT, with CEO Satya Nadella saying it would help make meetings more intelligent, personalised and protected.\nSatya Nadella\nannounced Microsofts new offering in a Twitter post, sharing a link to a blog post by Microsoft Teams VP Nicole Herskowitz.\nWere bringing the power of large language models, including OpenAIs GPT, to Teams Premium, as we make meetings more intelligent, personalized, and protected, Nadella wrote on Twitter.\nWere bringing the power of large language models, including OpenAIs GPT, to Teams Premium, as we make meetings more intelligent, personalized, and protected.",
      "snippet": "<b>Microsoft</b> on Wednesday rolled out a premium Teams service powered by ChatGPT, with CEO Satya Nadella saying it would help make meetings more ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:07:38",
      "provider": {
        "name": "moneycontrol",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.moneycontrol.com/static-mcnews/2023/01/Collage-Maker-05-Jan-2023-11.59-AM-1-770x435.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "moneycontrol",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.moneycontrol.com/news/trends/satya-nadella-on-how-microsoft-teams-premium-is-making-meetings-more-intelligent-9987331.html"
      }
    },
    {
      "id": "2639048199468266370",
      "title": "Microsoft to add ChatGPT in expanded Azure OpenAI Service",
      "url": "https://www.lifestyleasia.com/hk/gear/tech/chatgpt-in-microsoft-azure-openai-service-know-all-about-it/",
      "description": "Microsoft said that it will expand the usage of its Azure OpenAI Service and also include OpenAIs artificial intelligence bot ChatGPT.",
      "body": "What you can expect from ChatGPTs pro version\nMore about ChatGPT and its use on Bing\nChatGPT was released in November 2022 and immediately caught the interest of the general public.\nBloomberg\nreports that ChatGPT gathered its first million users in less than a week of its launch.\nIt is essentially a text-based artificial intelligence chatbot which can do everything from writing computer codes to composing poems.\nThe chatbot is a product of OpenAI, a company co-founded by Elon Musk along with Silicon Valley investor Sam Altman and others.\nThe company released GPT-3 in 2021. GPT 3.5, an updated version of GPT-3, has also been used in the ChatGPT tool. GPT-4, a more advanced version, is in development but its release date has not been announced.\nChatGPT can also be used as a search engine. According to\nSearch Engine Journal\n, Microsoft is planning to incorporate the AI feature into its Bing search engine.\nThe report says that it is expected to be launched by the end of March and would vastly improve the search engine experience of Bing users, giving Microsoft a major edge over Google.\nHero image: Caspar Camille Rubin/@casparrubin/Unplash; Featured image: John Schnobrich/@johnschno/Unsplash\nThis story first appeared on Augustman Malaysia.\nMicrosoft                        Elon Musk                        ChatGPT                        OpenAI\nManas Sen Gupta\nManas enjoys reading detective fiction and writing about anything that interests him. When not doing either of the two, he checks Instagram for the latest posts by travellers. Winter is his favourite season and he can happily eat a bowl of noodles any time of the day.\n\nEntertainment\nFood\nSign up for our newsletters to have the latest stories delivered straight to your inbox every week.\nYes, I agree to the",
      "snippet": "<b>Microsoft</b> said that it will expand the usage of its Azure OpenAI Service and also include OpenAIs artificial intelligence bot ChatGPT. What you can ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:05:08",
      "provider": {
        "name": "lifestyleasia",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.lifestyleasia.com/wp-content/uploads/sites/2/2023/02/02160022/openai-2.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "lifestyleasia",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.lifestyleasia.com/hk/gear/tech/chatgpt-in-microsoft-azure-openai-service-know-all-about-it/"
      }
    },
    {
      "id": "8075785582346970569",
      "title": "Microsoft Brings ChatGPT AI Chatbot To Power Teams Meetings: All Details",
      "url": "https://www.news18.com/news/tech/microsoft-brings-chatgpt-ai-chatbot-to-power-teams-meetings-all-details-6976771.html",
      "description": "Microsoft Corp on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.",
      "body": "(Reuters) &#8211; Microsoft Corp on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT&#39;s technology into all its products, setting the stage for more competition with rival Alphabet Inc&#39;s Google.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\nChatGPT on Wednesday announced a $20 per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements.\n \nRead all the Latest Tech News here",
      "snippet": "<b>Microsoft</b> Corp on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T07:58:06",
      "provider": {
        "name": "news18",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.news18.com/ibnlive/uploads/2023/01/microsoft-4-167463558716x9.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "news18",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.news18.com/news/tech/microsoft-brings-chatgpt-ai-chatbot-to-power-teams-meetings-all-details-6976771.html"
      }
    },
    {
      "id": "387795442915449874",
      "title": "Microsoft's Windows 10 ban followed by new way to get you to upgrade",
      "url": "https://www.express.co.uk/life-style/science-technology/1729575/Microsoft-Windows-10-upgrade-Windows-11",
      "description": "Microsoft clearly doesn't want PC owners using Windows 10 with the US firm ending sales of the software and now targeting users with pop-up adverts for Windows 11.",
      "body": "More info\nIt appears that Microsoft is now on a serious campaign to get everyone moved across to its very latest Windows 11 operating system. Just this week, the US company confirmed that it will no longer offer Windows 10 on its official store meaning anyone who is still using older Windows 7 or Windows 8 software will have to make the jump straight to Windows 11.\nRelated articles\nMicrosoft's Windows 10 ban will prove costly for millions of PC owners\nHowever, even if you are a long-time Windows 10 user it seems that you still won't escape the nudge to upgrade. As spotted by the team at Windows Latest, Microsoft is targeting PCs with full-screen adverts that suddenly pop up in an attempt to get devices switched over to Windows 11.\nScreenshots posted on the Windows-centric site show the message which reads, \"Now unlocked: You're eligible for a free upgrade to Windows 11.\" This is followed by two prominent buttons to either get it now or schedule the 4GB download for later.\nAt first glance, it appears there is no way to stop the upgrade although hidden right at the bottom of the screen is the option to \"Keep Windows 10\".\nAnnoyingly, even when you do tap the \"Keep it\" option, you're then taken through a number of windows which offer advice on why you should make the switch.\nCES 2023: Dave Snelling looks at the newest tech in Las Vegas\nIn fact, there are around four alerts to clear before you're finally taken back to your Windows 10 desktop. This irritating pop-up appears to have launched as part of a recent Microsoft upgrade and it's sure to infuriate anyone whose screen is targeted by them.\nAlthough millions seem happy to stick with Windows 10, that may not be the case for much longer.\nMicrosoft has confirmed that it will end support for this operating system in 2025 which is only two years away and that's bad news for anyone with it installed on their devices.\nTrending\nAs the firm explains on its Windows support pages, \"Once a Microsoft operating system (OS) reaches the end of support, customers will no longer receive technical assistance, software updates, or security fixes.\n\"We recommend upgrading to a version of Windows that is still supported,\" Microsoft said. \"A new device that can run Windows 11 makes for an easy transition and a great experience.\"\nDon't forget, if you want to switch to Windows 11 you'll need to make sure your PC is compatible and includes a fast enough processor and something called a TPM 2.0.\nTPM stands for Trusted Platform Module and is a security feature built into hardware that you'll only find on newer devices.\nFull specs below\nSYSTEM REQUIREMENTS FOR WINDOWS 11\n Processor: 1 gigahertz (GHz) or faster with two or more cores on a compatible 64-bit processor or system on a chip (SoC).\n RAM: 4 gigabytes (GB) or greater.\n Storage: 64 GB* or greater available storage is required to install Windows 11.\n Extra storage space might be required to download updates and enable specific features.\n Graphics card: Compatible with DirectX 12 or later, with a WDDM 2.0 driver.\n System firmware: UEFI, Secure Boot capable.\n TPM: Trusted Platform Module (TPM) version 2.0.\n Display: High definition (720p) display, 9\" or greater monitor, 8 bits per color channel.\n Internet connection: Internet connectivity is necessary to perform updates, and to download and use some features.\nRelated articles",
      "snippet": "<b>Microsoft</b> clearly doesn't want PC owners using Windows 10 with the US firm ending sales of the software and now targeting users with pop-up adverts ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T07:57:00",
      "provider": {
        "name": "express",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.images.express.co.uk/img/dynamic/59/1200x712/4542916.jpg?r=1675326291282",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "express",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.express.co.uk/life-style/science-technology/1729575/Microsoft-Windows-10-upgrade-Windows-11"
      }
    },
    {
      "id": "5557109474728471344",
      "title": "Microsoft Integrates ChatGPT with Teams Premium to Revolutionize Meetings with AI",
      "url": "https://www.timesnownews.com/technology-science/microsoft-integrates-chatgpt-with-teams-premium-to-revolutionize-meetings-with-ai-article-97545855",
      "description": "Microsoft is utilizing AI to revamp its consumer and enterprise products, including Microsoft Teams, to increase efficiency for individuals and teams. Teams Premium will use state-of-the-art technology, including OpenAI's GPT-3.5 language models, to enhance meetings with intelligence, customization, and security.",
      "body": "With the current global economic instability and shifts in work patterns, companies are seeking ways to optimize their IT investments and boost employee motivation to meet business goals. To stay ahead of the curve, companies require solutions that improve productivity, reduce costs, and increase adaptability. This is where artificial intelligence (AI) technology comes into play. Microsoft is utilizing AI to revamp its consumer and enterprise products, including Microsoft Teams, to increase efficiency for individuals and teams. Teams Premium will use state-of-the-art technology, including OpenAI's GPT-3.5 language models, to enhance meetings with intelligence, customization, and security.Due to the pandemic causing a 252% increase in weekly meeting time in the past two years, Teams is incorporating AI throughout the meeting process to make the experience more streamlined. AI integration will eliminate the need for extra time spent on tasks during meetings and offer features such as intelligent recaps, suggested tasks and personalized highlights, and live translations in 40 languages. Teams Premium will also allow for customizable meeting templates and advanced meeting protection.The integration of AI with Teams is expected to lower costs and improve productivity for users, with a 30-day free trial of Teams Premium available. Organizations that purchase Teams Premium before July 1, 2023 will receive a 30% discount, paying $7 per user per month instead of the standard $10 pricing. The use of AI with Teams is poised to revolutionize the way meetings are conducted within organizations.",
      "snippet": "<b>Microsoft</b> is utilizing AI to revamp its consumer and enterprise products, including <b>Microsoft</b> Teams, to increase efficiency for individuals and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T07:50:33",
      "provider": {
        "name": "timesnownews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.tnn.in/thumb/msid-97545855,imgsize-2226778,width-1280,height-720,resizemode-75/97545855.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "timesnownews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.timesnownews.com/technology-science/microsoft-integrates-chatgpt-with-teams-premium-to-revolutionize-meetings-with-ai-article-97545855"
      }
    },
    {
      "id": "4236148690050462233",
      "title": "PlayStation CEO spoke to the EU about Activision",
      "url": "https://playcrazygame.com/playstation-ceo-spoke-to-the-eu-about-activision-2/",
      "description": "We return with a new episode about Microsoft's eternal battle to acquire Activision Blizzard and hav",
      "body": "Leave a comment\n34 Views\nWe return with a new episode about Microsofts eternal battle to acquire Activision Blizzard and have sagas like Call of Duty, World of Warcraft, Overwatch and Candy Crush in their possession.  The Microsoft purchase agreement is going to be one year old and after seeing yesterday the drama that took place between the FTC, Microsoft and the EU, we return to add one more character to this trio.  Now it is the turn of the PlayStation bosswho had an appointment with the antitrust chief of the EU to negotiate the agreement on Microsoft and Activision Blizzard.\nWhen Microsoft announced its acquisition of Activision Blizzard in January 2022 for $68.7 billion, we were all taken by surprise.  We have never seen such a large number to acquire game studios and in fact, it is considered the most expensive purchase agreement for Microsoft.  But really everything makes sense when we know that it takes some of the most important studios in the world.  We have Activision with the Call of Duty franchise that sells millions of copies each time, Blizzard with Diablo, WoW or Overwatch and what to say about King Entertainment, the creators of the famous Candy Crush.  Looking at this repertoire, the US and EU regulators agreed on something, Microsoft would dominate the video game industry if it completes the purchase.\nPlayStation CEO talks to the EU about Microsoft and Activision\nMicrosoft has two main rivals who oppose the purchase of Activision Blizzard, being the US FTC and EU European Commission.  However, we recently saw an unexpected turnaround as European regulators tried to cut a deal with Microsoft.  This walked away from the accusations of monopoly and the opposition he presented to the company without changing his mind.  Well, with this deal, there was a chance to negotiate the purchase of Activision and of course, this reached the ears of the FTC, which intervened suing Microsoft.  So far we have come, but now an old rival returns and one of those who started this whole legal battle, Sony.\nSpecifically, we refer to jim ryanthe CEO of PlayStation, who is now reported to have met with the EUs antitrust chief, Margrethe Vestager.  No details are given about the conversation, except that Jim and Margrethe were talking about the Microsoft and Activision deal.\nOn April 26, the United Kingdom will publish its conclusions on Microsoft\nHow this will affect the badly damaged state of Microsoft, we dont know exactly, but the situation is not looking good.  Lets remember that Sony has been at the foot of the canyon when it comes to defending the Call of Duty franchise.  In fact, this was the one that began by ensuring that if Microsoft acquires Activision Blizzard, the PlayStation users would switch to the rival console, something that has undoubtedly influenced the EU.  All of this just makes one thing clear, Microsoft is surrounded by opposition and we dont see a hole where they can get out.\nWith that said, we are done with the deadlines imposed by the EU to make the final decisions on the deal.  The European Commission will have to decide before the April 11, although we do not rule out that it is brought forward due to what happened with the FTC.  On the other hand, the UK Competition and Markets Authority has delayed the date of its report.  Now it indicates that it will publish its conclusions on its investigation in competition regime next April 26.",
      "snippet": "... of the PlayStation bosswho had an appointment with the antitrust chief of the EU to negotiate the agreement on <b>Microsoft</b> and Activision Blizzard.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T07:26:16",
      "provider": {
        "name": "playcrazygame",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://elchapuzasinformatico.com/wp-content/uploads/2023/01/Jim-Ryan-UE-Microsoft-Activision.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "playcrazygame",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://playcrazygame.com/playstation-ceo-spoke-to-the-eu-about-activision-2/"
      }
    },
    {
      "id": "658003626669577104",
      "title": "OpenAI launches ChatGPT Plus for $20 a month with more features",
      "url": "https://www.siasat.com/openai-launches-chatgpt-plus-for-20-a-month-with-more-features-2516740/",
      "description": "New Delhi: Microsoft-owned OpenAI has launched its paid subscription plan for ChatGPT, its text-generating AI that can write like humans. The new",
      "body": "OpenAI launches ChatGPT Plus for $20 a month with more features\nOpenAI launches ChatGPT Plus for $20 a month with more features\nThe benefits are general access to ChatGPT even during peak times, faster response times and priority access to new features and improvements.\n|  Posted by Minhaj Adnan | \nPublished: 2nd February 2023 12:32 pm IST\nIn summary, ChatGPT is a variant of the GPT language model that is specifically designed for generating human-like text in conversational format. It is trained on a large dataset of text data and uses a transformer architecture to generate text. It is mainly used for creating chatbots, virtual assistants and other conversational AI systems, but can also be used for other NLP tasks such as text completion and question answering.\nNew Delhi: Microsoft-owned OpenAI has launched its paid subscription plan for ChatGPT, its text-generating AI that can write like humans.\nThe new subscription plan, ChatGPT Plus, will be available for $20 a month, and subscribers will receive a number of benefits.\nThe benefits are general access to ChatGPT even during peak times, faster response times and priority access to new features and improvements.\nChatGPT Plus is available to the customers in the United States, and we will begin the process of inviting people from our waitlist over the coming weeks, said the company in a statement late on Wednesday.\nWe plan to expand access and support to additional countries and regions soon. By offering this subscription pricing, we will be able to help support free access availability to as many people as possible, OpenAI added.\nAlso Read",
      "snippet": "New Delhi: <b>Microsoft</b>-owned OpenAI has launched its paid subscription plan for ChatGPT, its text-generating AI that can write like humans.\nOpenAI launches ChatGPT Plus for $20 a month with more features OpenAI launches ChatGPT Plus for $20 a month with more features The benefits are general access to ChatGPT even during peak times, faster response times and priority access to new features and improvements.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T07:02:01",
      "provider": {
        "name": "siasat",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.siasat.com/wp-content/uploads/2023/01/evqvq.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "siasat",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.siasat.com/openai-launches-chatgpt-plus-for-20-a-month-with-more-features-2516740/"
      }
    },
    {
      "id": "2430935268762837827",
      "title": "Microsoft Launches ChatGPT-Powered Teams Premium",
      "url": "https://www.chiangraitimes.com/tech/micros-launche-chatgpt-teams-premi/",
      "description": "(CTN NEWS)  On Wednesday, Microsoft Corp. released a premium Teams messaging service powered by ChatGPT to streamline meetings using the AI chatbot sweeping Silicon Valley. According to Microsoft, the monthly fee for the premium service will be $7 in June and $10 in July. ChatGPT, which OpenAI owns, will allow Teams users to build []",
      "body": "its intention to incorporate ChatGPTs technology into all of its products, paving the way for more competition with rival Alphabet Inc.s Google.\n/ Teams\nmulti-billion dollar investment in OpenAI.\nThe chatbot is at the vanguard of generative AI, where more and more major tech companies are investing their resources. The chatbot can generate prose or poetry on demand.\nOn Wednesday, ChatGPT unveiled a $20 monthly subscription option that will provide users priority access to new features and enhancements and",
      "snippet": "(CTN NEWS) On Wednesday, <b>Microsoft</b> Corp. released a premium Teams messaging service powered by ChatGPT to streamline meetings using the AI chatbot ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:54:57",
      "provider": {
        "name": "chiangraitimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.chiangraitimes.com/wp-content/uploads/2023/02/Microsoft-launches-ChatGPT-power-1000x600.webp",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "chiangraitimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.chiangraitimes.com/tech/micros-launche-chatgpt-teams-premi/"
      }
    },
    {
      "id": "4895820759017776598",
      "title": "Microsoft to improve Bing using OpenAIs GPT-4 in the coming weeks  report",
      "url": "https://mspoweruser.com/microsoft-to-improve-bing-using-openais-gpt-4-in-the-coming-weeks-report/",
      "description": "A new report says that Microsoft will be incorporating GPT-4 into Bing instead of the common ChatGPT version known to everyone. According to the report, the int",
      "body": "earlier in January, saying it would be implemented before the end of March. However, the latest report from\nSemafor\nsays it would be sooner and stresses that the integration will be better. Specifically, Bing will reportedly use GPT-4, the latest version of OpenAIs GPT tech and is currently considered one of the most advanced language models. With this, Bing will be able to produce more detailed and more humanlike responses faster, according to the people with knowledge of the matter.\nThe move reflects Microsofts current attempts to attract more users in the web search engine market dominated by Google. The Redmond company recently",
      "snippet": "A new report says that <b>Microsoft</b> will be incorporating GPT-4 into Bing instead of the common ChatGPT version known to everyone. According to the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:27:15",
      "provider": {
        "name": "mspoweruser",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mspoweruser.com/wp-content/uploads/2023/02/Bing-logo-scaled.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mspoweruser",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://mspoweruser.com/microsoft-to-improve-bing-using-openais-gpt-4-in-the-coming-weeks-report/"
      }
    },
    {
      "id": "5128987491462158763",
      "title": "Microsoft announces Premium Teams with AI and ChatGPT-powered features",
      "url": "https://www.thehindu.com/sci-tech/technology/microsoft-announces-premium-teams-with-ai-and-chatgpt-powered-features/article66461872.ece",
      "description": "Microsoft has announced that it is bringing OpenAIs technology and ChatGPT to Teams Premium",
      "body": "SEE ALL\nFile photo of the ChatGPT logo| Photo Credit: AP\nMicrosoft has announced the upcoming release of a premium Teams experience that uses models based on OpenAIs GPT-3.5, effectively bringing ChatGPT to its video collaboration platform.\n(For insights on emerging themes at the intersection of technology, business, and policy,\nsubscribe\nto our tech newsletter Todays Cache.)\nThe subscription will cost $7 per month for a limited period, before rising to $10 a month, Microsoft said in a blog post published on February 1.\nThe software maker listed a range of new features that will be available with Teams Premium including intelligent recap, AI-generated chapters, timeline markers, AI-generated notes and tasks, and live translations.\nWith intelligent recap in Teams premium, youll get automatically generated meeting notes, recommended tasks, and personalized highlights to help you get the information most important to you, even if you miss the meeting, said Microsoft in its post.\nThese AI-powered features and other improvements to Teams will be rolled out in the coming months.\nWatch | What is ChatGPT?\nMicrosoft said early in 2023 that it would be investing billions of dollars in OpenAI, which offers a range of AI-powered tools.\nThe news comes shortly after OpenAI announced the release of a new classifier it had trained, in order to identify human-written text and AI-written text as fears mount of ChatGPT being used to cheat on assignments and exams. However, OpenAI said that the classifier was not yet entirely reliable.",
      "snippet": "<b>Microsoft</b> has announced that it is bringing OpenAIs ... of the ChatGPT logo| Photo Credit: AP <b>Microsoft</b> has announced the upcoming release of a premium ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:16:56",
      "provider": {
        "name": "thehindu",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://th-i.thgim.com/public/incoming/52octf/article66461874.ece/alternates/LANDSCAPE_1200/ChatGPT_Detecting_Cheats_89846.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "thehindu",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.thehindu.com/sci-tech/technology/microsoft-announces-premium-teams-with-ai-and-chatgpt-powered-features/article66461872.ece"
      }
    },
    {
      "id": "371491004680447189",
      "title": "Microsoft rolls out ChatGPT-powered Teams Premium",
      "url": "https://www.moneycontrol.com/news/world/microsoft-rolls-out-chatgpt-powered-teams-premium-9987061.html",
      "description": "The premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.",
      "body": "/ 06:11 AM IST\nMicrosoft\nMicrosoft Corp on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc's Google.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\nRead More\nChatGPT on Wednesday announced a $20 per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements.\nReuters",
      "snippet": "... in June before increasing to $10 in July, <b>Microsoft</b> said. / 06:11 AM IST <b>Microsoft Microsoft</b> Corp on Wednesday rolled out a premium Teams messaging ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:11:29",
      "provider": {
        "name": "moneycontrol",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.moneycontrol.com/static-mcnews/2021/08/Microsoft_reuters-770x433.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "moneycontrol",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.moneycontrol.com/news/world/microsoft-rolls-out-chatgpt-powered-teams-premium-9987061.html"
      }
    },
    {
      "id": "5369342815159314518",
      "title": "Google has the next move as Microsoft embraces OpenAI buzz",
      "url": "https://www.decaturdaily.com/business/google-has-the-next-move-as-microsoft-embraces-openai-buzz/article_e2eed1fd-7788-5632-94ed-df597515560a.html",
      "description": "NEW YORK  Before the artificial intelligence tool ChatGPT was unleashed into the world, the novelist Robin Sloan was testing a similar AI writing assistant built by researchers at Google.",
      "body": "Copy article link\nSave\nNEW YORK  Before the artificial intelligence tool ChatGPT was unleashed into the world, the novelist Robin Sloan was testing a similar AI writing assistant built by researchers at Google.\nIt didn't take long for Sloan, author of the bestseller \"Mr. Penumbra's 24-Hour Bookstore,\" to realize that the technology was of little use to him.\n\"A lot of the state-of-the-art AI right now is impressive enough to really raise your expectations and make you think, 'Wow, I'm dealing with something really, really capable,'\" Sloan said. \"But then in a thousand little ways, a million little ways, it ends up kind of disappointing you and betraying the fact that it really has no idea what's going on.\"\nAnother company might have released the experiment into the wild anyway, as the startup OpenAI did with its ChatGPT tool late last year. But Google has been more cautious about who gets to play with its AI advancements despite growing pressure for the internet giant to compete more aggressively with rival Microsoft, which is pouring billions of dollars into OpenAI and fusing its technology into Microsoft products.\nThat pressure is starting to take a toll, as Google has asked one of its AI teams to \"prioritize working on a response to ChatGPT,\" according to an internal memo reported this week by CNBC. Google declined to confirm if there was a public chatbot in the works but spokesperson Lily Lin said it continues \"to test our AI technology internally to make sure it's helpful and safe, and we look forward to sharing more experiences externally soon.\"\nSome of the technological breakthroughs driving the red-hot field of generative AI  which can churn out paragraphs of readable text and new images as well as music and video  have been pioneered in Google's vast research arm.\n\"So we have an important stake in this area, but we also have an important stake in not just leading in being able to generate things, but also in dealing with information quality,\" said Zoubin Ghahramani, vice president of research at Google, in a November interview with The Associated Press.\nGhahramani said the company wants to also be measured about what it releases, and how: \"Do we want to make it accessible in a way that people can produce stuff en masse without any controls? The answer to that is no, not at this stage. I don't think it would be responsible for us to be the people driving that.\"\nAnd they weren't. Four weeks after the AP interview, OpenAI released its ChatGPT for free to anyone with an internet connection. Millions of people around the world have now tried it, sparking searing discussions at schools and corporate offices about the future of education and work.\nOpenAI declined to comment on comparisons with Google. But in announcing their extended partnership in January, Microsoft and OpenAI said they are committed to building \"AI systems and products that are trustworthy and safe.\"\nAs a literary assistant, neither ChatGPT nor Google's creative writing version comes close to what a human can do, Sloan said.\nA fictionalized Google was central to the plot of Sloan's popular 2012 novel about a mysterious San Francisco bookstore. That's likely one reason the company invited him along with several other authors to test its experimental Wordcraft Writers Workshop, derived from a powerful AI system known as LaMDA.\nLike other language-learning models, including the GPT line built by OpenAI, Google's LaMDA can generate convincing passages of text and converse with humans based on what it's processed from a trove of online writings and digitized books. Facebook parent Meta and Amazon have also built their own big models, which can improve voice assistants like Alexa, predict the next sentence of an email or translate languages in real time.\nWhen it first announced its LaMDA model in 2021, Google emphasized its versatility but also raised the risks of harmful misuse and the possibility it could mimic and amplify biased, hateful or misleading information.\nSome of the Wordcraft writers found it useful as a research tool  like a faster and more decisive version of a Google search  as they asked for a list of \"rabbit breeds and their magical qualities\" or \"a verb for the thing fireflies do\" or to \"Tell me about Venice in 1700,\" according to Google's paper on the project. But it was less effective as a writer or rewriter, turning out boring sentences riddled with clichs and showing some gender bias.\n\"I believe them  that they're being thoughtful and cautious,\" Sloan said of Google. \"It's just not the model of a reckless technologist who is in a hurry to get this out into the world no matter what.\"\nGoogle's development of these models hasn't been without internal acrimony. First, it ousted some prominent researchers who were examining the risks of the technology. And last year, it fired an engineer who publicly posted a conversation with LaMDA in which the model falsely claimed it had human-like consciousness, with a \"range of both feelings and emotions.\"\nGet Unlimited Access\nAfter the initial selected subscription period your subscription rate will auto renew at $12.00 per month.\nFacebook",
      "snippet": "But in announcing their extended partnership in January, <b>Microsoft</b> and OpenAI said they are committed to building \"AI systems and products that are ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:00:00",
      "provider": {
        "name": "decaturdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bloximages.newyork1.vip.townnews.com/decaturdaily.com/content/tncms/assets/v3/editorial/2/ce/2ce193ed-9590-5509-b325-57961b1858c6/63dadd9fb6840.image.jpg?crop=1763%2C926%2C0%2C124&amp;resize=1200%2C630&amp;order=crop%2Cresize",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "decaturdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.decaturdaily.com/business/google-has-the-next-move-as-microsoft-embraces-openai-buzz/article_e2eed1fd-7788-5632-94ed-df597515560a.html"
      }
    },
    {
      "id": "4773286284830756939",
      "title": "Microsoft announces Elgato Stream Deck plugin integration with Teams",
      "url": "https://mspoweruser.com/elgato-stream-deck-plugin-integration-with-teams/",
      "description": "Teams users can now use Elgato Stream Deck to get instant access to their favorite Teams features and functions.  The Elgato Stream Deck is popular among stre",
      "body": "latest version\nof the Elgato Stream Deck plugin and program the custom keys on the Elgato Stream Deck device for some Teams features.\nBefore you join your meeting or webinar, click on the ellipses within Teams (next to your profile), select settings, choose privacy, and click manage API at the bottom of the menu, Microsoft explains. Toggle on to enable API and generate the API token and copy this API to input into Stream Deck. Within Stream Deck, scroll down to the Microsoft Teams section and drag and drop one of the Teams actions on to a key and paste in the API token. The API token will now automatically be applied with any additional Teams actions you add. Once you join your next meeting or webinar, youll see your new Teams keys light up on your Elgato Stream Deck device and be able to have a more seamless experience with Teams.\nUsing the new plugin, Teams users can program different Teams keys on their Elgato Stream Deck device. These functions include toggles for the camera, mute, record, and background blur. Elgato Stream Deck owners can also program the device to get convenient control access to leave the meeting, raise or lower a hand, and display live reactions, including applause, laugh, like, love, and wow.",
      "snippet": "... ellipses within Teams (next to your profile), select settings, choose privacy, and click manage API at the bottom of the menu, <b>Microsoft</b> explains.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:35:41",
      "provider": {
        "name": "mspoweruser",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mspoweruser.com/wp-content/uploads/2023/02/Screenshot-655.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mspoweruser",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://mspoweruser.com/elgato-stream-deck-plugin-integration-with-teams/"
      }
    },
    {
      "id": "2438669168103034837",
      "title": "Microsoft Launches ChatGPT Powered Premium Teams Service",
      "url": "https://english.jagran.com/technology/microsoft-launches-chatgpt-powered-premium-teams-service-10063474",
      "description": "Meetings on Microsoft Teams is set to become easier as the company has launched a premium messaging service that will be powered by ChatGPT, the AI chabot that has taken the Silicon Valley by storm.",
      "body": "WITH the aim to simplify meetings using Artificial Intelligence, Microsoft Corp launched a premium Teams messaging platform, on Wednesday, that will be powered by ChatGPT, an AI chatbot. ChatGPT has taken the Silicon Valley by storm recently. Users will have to shell out $7 initially in June for this premium service on Teams. From July onwards, the same service will cost users $10 per month, Microsoft informed. ChatGPT, which is owned by a research laboratory in San Francisco - OpenAI, will provide users with automatically generated meeting notes besides recommending tasks, and help create meeting templates. Also Watch: Microsoft, which announced a multi-billion dollar investmentin OpenAI earlier this month, has said it aims to add ChatGPTstechnology into all its products, setting the stage for morecompetition withrival Alphabet Incs Google. The chatbot, which can produce prose or poetry on command,is at the forefront of generative AI, a space where more andmore big tech companies are funneling their resources in. ChatGPT on Wednesday announced a $20 per-month subscriptionplan, which will let subscribers receive access to fasterresponses and priority access to new features and improvements.  (With Reuters inputs)",
      "snippet": "Meetings on <b>Microsoft</b> Teams is set to become easier as the company has launched a premium messaging service that will be powered by ChatGPT, the AI ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:22:00",
      "provider": {
        "name": "jagran",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imgeng.jagran.com/images/2023/feb/ChatGPT Microsoft teams1675315753644.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "jagran",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://english.jagran.com/technology/microsoft-launches-chatgpt-powered-premium-teams-service-10063474"
      }
    },
    {
      "id": "6371687754964097624",
      "title": "Microsoft Rolls Out ChatGPT-Enabled Premium Version of Microsoft Teams",
      "url": "https://zeenews.india.com/technology/microsoft-rolls-out-chatgpt-enabled-premium-version-of-microsoft-teams-2568657.html",
      "description": "Microsoft Corpon Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm. The premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.",
      "body": "February 1, 2023\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users. Microsoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc'sGoogle.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in. ChatGPT on Wednesday announced a $20 per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements.\nLive Tv",
      "snippet": "<b>Microsoft</b> Corpon Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:21:20",
      "provider": {
        "name": "india",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://english.cdn.zeenews.com/sites/default/files/styles/zm_700x400/public/2023/02/02/1148422-zeee-2.jpg?im=Resize=(1280,720)",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "india",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://zeenews.india.com/technology/microsoft-rolls-out-chatgpt-enabled-premium-version-of-microsoft-teams-2568657.html"
      }
    },
    {
      "id": "7386116831207372342",
      "title": "How will Google solve its AI conundrum? The",
      "url": "https://www.irishtimes.com/technology/big-tech/2023/02/02/how-will-google-solve-its-ai-conundrum/",
      "description": "The internet search giant may be hesitant to wield in the AI arms race many of the weapons at its disposal",
      "body": "Madhumita Murgia\nThu Feb  2 2023 - 05:00\nIn the AI arms race that has just broken out in the tech industry, Google, where much of the latest technology was invented, should be well positioned to be one of the big winners.\nThere is just one problem: With politicians and regulators breathing down its neck, and a hugely profitable business model to defend, the internet search giant may be hesitant to wield many of the weapons at its disposal.\nMicrosoft threw down a direct challenge to the search giant last week when it sealed a multibillion-dollar investment in AI research company OpenAI. The move comes less than two months after the release of OpenAIs ChatGPT, a chatbot that answers queries with paragraphs of text or code, suggesting how generative AI might one day replace internet search.\nWith preferential rights to commercialise OpenAIs technology, Microsoft executives have made no secret of their goal of using it to challenge Google, reawakening an old rivalry that has simmered since Google won the search wars a decade ago.\nREAD MORE\nCan I lend half the proceeds of my house sale to a friend without Revenue involvement?\nDeepMind, a London research company that Google bought in 2014, and Google Brain, an advanced research division at its Silicon Valley headquarters, have long given the search company one of the strongest footholds in AI. More recently, Google has broken ground with different variations on the so-called generative AI that underpins ChatGPT, including AI models capable of telling jokes and solving mathematics problems.\n[\nChris Horn: Meet my new online friend: Michael D GPT\n]\nOne of its most advanced language models, known as PaLM, is a general purpose model that is three times larger than GPT, the AI model that underlies ChatGPT, based on the number of parameters on which the models are trained.\nGoogles chatbot LaMDA, or Language Model for Dialogue Applications, can converse with users in natural language, in a similar way to ChatGPT. The companys engineering teams have been working for months to integrate it into a consumer product.\nDespite the technical advances most of the latest technology is still only the subject of research. Googles critics say it is hemmed in by its hugely profitable search business, which discourages it from introducing generative AI into consumer products. Giving direct answers to queries, rather than simply pointing users to suggested links, would result in fewer searches, said Sridhar Ramaswamy, a former top Google executive.\nThat has left Google facing a classic innovators dilemma  a reference to the book by Harvard Business School professor Clayton Christensen that sought to explain why industry leaders often fall prey to fast-moving upstarts. If I was the one running a $150 billion (138bn) business Id be terrified of this thing, Ramaswamy said.\nWe have long been focused on developing and deploying AI to improve peoples lives. We believe that AI is foundational and transformative technology that is incredibly useful for individuals, businesses and communities, Google said. However, the search giant would need to consider the broader societal impacts these innovations can have. Google added that it would announce more experiences externally soon.\nWhile leading to fewer searches and lower revenue, the spread of AI could also cause a jump in Googles costs.\nRamaswamy calculated that, based on OpenAIs pricing, it would cost $120 million to use natural language processing to read all the web pages in a search index and then use this to generate more direct answers to the questions that people enter into a search engine. Analysts at Morgan Stanley estimated that answering a search query using language processing costs about seven times as much as a standard internet search.\n[\nThis has moved the dial on assessment: Rise of AI sparks alarm on college campuses\n]\nThe same considerations could discourage Microsoft from a radical overhaul of its Bing search engine, which generated more than $11 billion of revenue last year. But the software company has said it plans to use OpenAIs technology throughout its products and services, potentially leading to new ways for users to be presented with relevant information while they are inside other applications, thus reducing the need to go to a search engine.\nA number of former and current employees close to Googles AI research teams say the biggest constraints on the companys release of AI have been concern about potential harms and how they would affect Googles reputation, as well as an underestimation of the competition.\nI think they were asleep at the wheel, said one former Google AI scientist, who now runs an AI company. Honestly, everyone underappreciated how language models will disrupt search.\nThese challenges are exacerbated by the political and regulatory concerns caused by Googles growing power, as well as the greater public scrutiny of the industry leader in the adoption of new technologies. According to one former Google executive, the companys leaders grew worried more than a year ago that sudden advances in the capabilities of AI could lead to a wave of public concern about the implications of such a powerful technology in the hands of a company. Last year it appointed former McKinsey executive James Manyika as a senior vice-president to advise on the broader social impacts of its new technology.\nGenerative AI, which is used in services such as ChatGPT, is inherently prone to giving incorrect answers and could be used to produce misinformation, Manyika said. Speaking only days before ChatGPT was released, he added: Thats why were not rushing to put these things out in the way that perhaps people might have expected us to.\n[\nUnthinkable: ChatGPT is creepily smart, weirdly chummy and a window to your extended mind\n]\nHowever, the huge interest stirred up by ChatGPT has intensified the pressure on Google to match OpenAI more quickly. That has left it with the challenge of showing off its AI prowess and integrating it into its services without damaging its brand or provoking a political backlash.\nFor Google its a real problem if they write a sentence with hate speech in it and its near the Google name, said Ramaswamy, a co-founder of search start-up Neeva. Google is held to a higher standard than a start-up that could argue that its service was just an objective summary of content available on the internet, he added.\nThe search company has come under fire before over its handling of AI ethics. In 2020, when two prominent AI researchers left in contentious circumstances after objections to a research paper assessing the risks of language-related AI, a furore erupted around Googles attitude to the ethics and safety of its AI technologies.\nSuch events have left it under greater public scrutiny than organisations such as OpenAI or open-source alternatives such as Stable Diffusion. The latter, which generates images from text descriptions, has had several safety issues, including with ",
      "snippet": "<b>Microsoft</b> threw down a direct challenge to the search giant last week when it sealed a multibillion-dollar investment in AI research company ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:00:03",
      "provider": {
        "name": "irishtimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.irishtimes.com/resizer/eOvQcoOKSRNWXoJd6OWGI7HJsuA=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/MVBUVYMNPHZM2RGC5IVLOR23VE.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "irishtimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.irishtimes.com/technology/big-tech/2023/02/02/how-will-google-solve-its-ai-conundrum/"
      }
    }
  ]
}
