{
  "_type": "news",
  "didUMean": "",
  "totalCount": 158,
  "relatedSearch": [],
  "value": [
    {
      "id": "5070886122705497431",
      "title": "Blinken to meet China's Xi during Beijing visit -Financial Times",
      "url": "https://www.taiwannews.com.tw/en/news/4798820",
      "description": "Blinken to meet China's Xi during Beijing visit -Financial Times | 2023-02-03 11:00:00",
      "body": "REUTERS\n2023/02/03 11:00\nUS Secretary of State Antony Blinken speaks during a press conference at the Waldorf Astoria in Jerusalem, Israel, Tuesday, Jan. 31, 2023. Blinken is ...\nUS Secretary of State Antony Blinken speaks during a press conference at the Waldorf Astoria in Jerusalem, Israel, Tuesday, Jan. 31, 2023. Blinken is wrapping up a two-day visit to Israel and the occupied West Bank with renewed appeals for Israeli-Palestinian calm amid an alarming spike of violence. (Ronaldo Schmeidt/Pool photo via AP)\nU.S. Secretary of State Antony Blinken will meet with China's President Xi Jinping during a visit to Beijing next week, the Financial Times reported on Thursday, citing people familiar with the plans.\nBlinken will discuss Russia's war in Ukraine with Chinese officials during a Feb. 5-6 trip to China, White House national security spokesman John Kirby said on Tuesday.\nU.S.-China relations have been tense over issues like security, Taiwan, trade, the handling of the COVID-19 pandemic and dominance in the Asia Pacific.\nThe United States has warned the Chinese government of consequences should China provide weaponry to Russia for use against Ukraine.",
      "snippet": "Blinken will discuss Russia's war in <b>Ukraine</b> with Chinese officials during a Feb. 5-6 trip to China, White House national security spokesman John ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T11:00:00",
      "provider": {
        "name": "taiwannews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://tnimage.s3.hicloud.net.tw/photos/2023/AP/20230201/8675b79179044c289a6aeb076fc3c5bd.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "taiwannews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.taiwannews.com.tw/en/news/4798820"
      }
    },
    {
      "id": "3567293232973652973",
      "title": "Air raid sirens sound in Kyiv as European leaders visit",
      "url": "http://goulburnpost.com.au/story/8071452/air-raid-sirens-sound-in-kyiv-as-european-leaders-visit",
      "description": "Air raid alerts have sounded across Kyiv as visiting European Union leaders discuss further sanctions on Russia and...",
      "body": "Air raid alerts have sounded across Kyiv as visiting European Union leaders discuss further sanctions on Russia and Ukraine's prospects of joining the European bloc with President Volodymyr Zelenskiy. The head of the EU's executive commission and the chairman of the 27 EU national leaders travelled to Kyiv to demonstrate support for Ukraine as the first anniversary of Russia's February 24, 2022, invasion of its neighbour approaches. \"There will be no let up in our resolve. We will also support you every step of the way on your journey to the EU,\" EU chairman Charles Michel wrote on Twitter on Friday morning under a picture of himself on a central Kyiv square. There were no immediate reports of fresh missile strikes following the air raid warning. Zelenskiy is calling for more punitive measures against Russia by the European Union but new sanctions the bloc is preparing for the anniversary are set to fall short of his government's demands. Kyiv applied to join the bloc days after Russia invaded last year. The EU has embraced the application, although it has rebuffed Ukraine's calls for a fast track to membership while the country is at war. \"The EU will support Ukraine and the Ukrainian people against Russia's ongoing war of aggression for as long as it takes,\" Michel, Zelenskiy and EU executive commission head Ursula von der Leyen will say in a joint statement, a draft of which was seen by Reuters in advance. EU officials have listed multiple entry requirements, from political and economic stability to adopting various EU laws. The process is likely to take years. \"Some may want to speculate about the endgame but the simple truth is that we are not there yet,\" an EU official said. EU officials said subjects discussed on Thursday included more arms, money and energy support for Ukraine, better access for its products in the EU market, tightened sanctions on Moscow and efforts to prosecute Russian war crimes. The German government has approved the delivery of Leopard 1 tanks to Ukraine from stocks and is in talks to buy back 15 Gepard tanks from Qatar to send there, the Sueddeutsche Zeitung newspaper reported on Friday, citing government sources. The Leopard 1s are not as advanced as the Leopard 2s Germany and other countries pledged last week but could be delivered sooner. The EU has demanded more anti-corruption measures from Ukraine, which is perceived as having endemic state graft, saying it must build a credible track record. To that end, Zelenskiy has announced dismissals and investigations of some officials in the past two weeks, pointedly saying that the defence ministry needs to be clean. Authorities were investigating senior military officials in two cases of suspected corruption, officials said on Thursday. Separately, a criminal group suspected of embezzling state funds by selling overpriced eggs and other foodstuffs to defence officials had been arrested, the State Bureau of Investigation said. This week, the authorities raided the homes of one of Ukraine's most prominent billionaires and a former interior minister and announced an investigation into what they called a billion-dollar fraud at the biggest oil company and refinery. The EU-Ukraine summit coincides with an intensification of Russian pressure on Ukrainian forces in eastern battlegrounds and in the northeast and south. Ukraine says Moscow is sending thousands of soldiers and mercenaries to their deaths in human wave attacks for small gains, to appease political masters. Reuters was not able to verify battlefield reports. Australian Associated Press",
      "snippet": "... 27 EU national leaders travelled to Kyiv to demonstrate support for <b>Ukraine</b> as the first anniversary of Russia's February 24, 2022, invasion of its ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T10:15:08",
      "provider": {
        "name": "goulburnpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.goulburnpost.com.au/images/transform/v1/crop/frm/silverstone-feed-data/d05f97a2-4cbf-46ba-946d-68964c0f8fa9.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "goulburnpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://goulburnpost.com.au/story/8071452/air-raid-sirens-sound-in-kyiv-as-european-leaders-visit"
      }
    },
    {
      "id": "2875044437025807858",
      "title": "Ukraine needs more support even though Russia has fought poorly Polish diplomat says",
      "url": "https://radio.wpsu.org/2023-02-03/ukraine-needs-more-support-even-though-russia-has-fought-poorly-polish-diplomat-says",
      "description": "NPR's Steve Inskeep talks to Polish Ambassador to the U.S. Marek Magierowski about Poland's support of Ukraine, and its call for more military aid in the war against Russia.",
      "body": "A Centre County non-profit hopes a new book vending machine will get students excited about reading\nWhat State College area residents told PA House Speaker Mark Rozzis listening group\nPA principals and superintendents are much less diverse than the students they serve, according to a Penn State study\nAfter another eagle dies from lead poisoning, a central PA wildlife rehabilitator urges hunters to use non-lead ammo\nPenn States Lion Ambassadors were accused of hazing. Why isnt it on the hazing report?\nWhy a PA school district decided to arm its officers with semi-automatic rifles\nA behind-the-scenes look at Spotlight PAs analysis of 1 million medical marijuana certifications\nHow anxiety came to dominate the big business of medical marijuana cards in Pennsylvania\nWPSU's weekly newsletter\nSign up to receive the WPSU News Roundup email, a weekly newsletter full of news stories from central & northern Pennsylvania.\nSign Up",
      "snippet": "... to Polish Ambassador to the U.S. Marek Magierowski about Poland's support of <b>Ukraine</b>, and its call for more military aid in the war against Russia.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T10:09:26",
      "provider": {
        "name": "wpsu",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wpsu",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://radio.wpsu.org/2023-02-03/ukraine-needs-more-support-even-though-russia-has-fought-poorly-polish-diplomat-says"
      }
    },
    {
      "id": "6095705237911622375",
      "title": "CIA chief warns against underestimating Xi's ambitions toward Taiwan",
      "url": "https://www.taiwannews.com.tw/en/news/4798831",
      "description": "CIA chief warns against underestimating Xi's ambitions toward Taiwan | 2023-02-03 10:00:00",
      "body": "REUTERS\n2023/02/03 10:00\nCentral Intelligence Agency Director William Burns speaks at the Central Intelligence Agency headquarters in Langley, Va., July 8, 2022.\nCentral Intelligence Agency Director William Burns speaks at the Central Intelligence Agency headquarters in Langley, Va., July 8, 2022.\n(AP photo)\nWASHINGTON, Feb 2 (Reuters) - U.S. Central Intelligence Agency Director William Burns said on Thursday that Chinese President Xi Jinping's ambitions toward Taiwan should not be underestimated, despite him likely being sobered by the performance of Russia's military in Ukraine.\nBurns said that the United States knew \"as a matter of intelligence\" that Xi had ordered his military to be ready to conduct an invasion of self-governed Taiwan by 2027.\n\"Now, that does not mean that he's decided to conduct an invasion in 2027, or any other year, but it's a reminder of the seriousness of his focus and his ambition,\" Burns told an event at Georgetown University in Washington.\n\"Our assessment at CIA is that I wouldn't underestimate President Xi's ambitions with regard to Taiwan,\" he said, adding that the Chinese leader was likely \"surprised and unsettled\" and trying to draw lessons by the \"very poor performance\" of the Russian military and its weapons systems in Ukraine.\nRussia and China signed a \"no limits\" partnership last February shortly before Russian forces invaded Ukraine, and their economic links have boomed as Russia's connections with the West have shriveled.\nThe Russian invasion had fueled concerns in the West of China possibly making a similar move on Taiwan, a democratic island Beijing says is its territory.\nChina has refrained from condemning Russia's operation against Ukraine, but it has been careful not to provide the sort of direct material support which could provoke Western sanctions like those imposed on Moscow.\n\"I think it's a mistake to underestimate the mutual commitment to that partnership, but it's not a friendship totally without limits,\" Burns said.\nAs Burns spoke, news came from U.S. officials that a suspected Chinese spy balloon had been flying over the United States for a few days, and that senior U.S. officials had advised President Joe Biden against shooting it down for fear the debris could pose a safety threat.\nBurn made no mention of the episode but called China the \"biggest geopolitical challenge\" currently faced by the United States.\n\"Competition with China is unique in its scale, and that it really, you know, unfolds over just about every domain, not just military, and ideological, but economic, technological, everything from cyberspace, to space itself as well. It's a global competition in ways that could be even more intense than competition with the Soviets was,\" he said.\nThere was no immediate comment from China's Washington embassy about the remarks from Burns or the balloon flight.\nBurns said the next six months will be \"critical\" for Ukraine, where Moscow has been making incremental gains in recent weeks.\nHe also said Iran's government was increasingly unsettled by affairs within the country, citing the courage of what he described as \"fed up\" Iranian women.\nTweet",
      "snippet": "... Jinping's ambitions toward Taiwan should not be underestimated, despite him likely being sobered by the performance of Russia's military in <b>Ukraine</b>.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T10:00:00",
      "provider": {
        "name": "taiwannews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://tnimage.s3.hicloud.net.tw/photos/2023/02/03/1675388674-63dc6702a0c33.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "taiwannews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.taiwannews.com.tw/en/news/4798831"
      }
    },
    {
      "id": "1401209427778916869",
      "title": "European Union officials hold Kyiv talks in show of support for Ukraine",
      "url": "https://www.thehindu.com/news/international/european-union-officials-hold-kyiv-talks-in-show-of-support-for-ukraine/article66466659.ece",
      "description": "European Commission President Ursula von der Leyen and European Council President Charles Michel, as well as 15 European Commissioners, travelled to the Ukrainian capital for what they described as a summit meeting.",
      "body": "SEE ALL\nEuropean Commission President Ursula von der Leyen attends an EU summit with Ukraines President Volodymyr Zelenskiy and Prime Minister Denys Shmyhal, as Russias attack on Ukraine continues, in Kyiv, Ukraine, on February 2, 2023.| Photo Credit: Reuters\nTop European Union officials were due to meet on February 3 in Kyiv with Ukrainian President Volodymyr Zelenskyy in a show of support for the country as it battles to counter Russias invasion and strives to join the EU as well as NATO.\nEuropean Commission President Ursula von der Leyen and European Council President Charles Michel, as well as 15 European Commissioners, travelled to the Ukrainian capital for what they described as a summit meeting. The last such summit was held in Kyiv in October 2021  a few months before the war started.\nExplained | The next leg of the Russia-Ukraine war\nEU assistance for Ukraine has reached almost 50 billion euros ($55 billion) since the fighting started, according to EU officials.\nThe EU is providing Ukraine with financial- and humanitarian aid, among other things. It also plans to adopt a 10th package of sanctions again Russia in the coming weeks.\nUkraine wants to join the 27-nation bloc, though that could take years and require the adoption of far-reaching reforms. In the meantime, Ms. von der Leyen said on February 2 that the European Commission is willing to let Kyiv join what she called some key European programmes that will bring benefits similar to membership.\nThose programmes were due to be discussed in Fridays meeting, which will also address one of the main obstacles to Ukraines EU membership: endemic corruption.\nMs. Von der Leyen, on her fourth visit to Kyiv since Russias invasion, said on Thursday she was comforted by Ukraines anti-corruption drive. The previous day, Mr. Zelenskyy had taken aim at corrupt officials for the second time in the space of a week. Several high-ranking officials were dismissed.\nMr. Zelenskyy was elected in 2019 on an anti-establishment and anti-corruption platform in a country long gripped by graft. The latest corruption allegations came as Western allies channel billions of dollars to help Kyiv fight Moscows forces.\nLessons from Russias Ukraine war\nUkraines government is keen to get more Western military aid, on top of the tanks pledged last week, as the warring sides are expected to launch new offensives once winter ends. Kyiv is now asking for fighter jets.\nThe U.S is expected to announce on Friday it will send longer-range bombs to Ukraine as part of a new $2.17 billion aid package.",
      "snippet": "The next leg of the Russia-<b>Ukraine</b> war EU assistance for <b>Ukraine</b> has reached almost 50 billion euros ($55 billion) since the fighting started, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:57:56",
      "provider": {
        "name": "thehindu",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://th-i.thgim.com/public/incoming/p5ep7l/article66466721.ece/alternates/LANDSCAPE_1200/2023-02-02T201745Z_769960828_RC2Y2Z989Z2Y_RTRMADP_3_UKRAINE-CRISIS-EU.JPG",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "thehindu",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.thehindu.com/news/international/european-union-officials-hold-kyiv-talks-in-show-of-support-for-ukraine/article66466659.ece"
      }
    },
    {
      "id": "2324366521597865126",
      "title": "EU officials hold Kyiv talks in show of support for Ukraine",
      "url": "https://www.mrt.com/news/article/eu-officials-hold-kyiv-talks-in-show-of-support-17761317.php",
      "description": "KYIV, Ukraine (AP)  Top European Union officials were due to meet Friday in Kyiv with...",
      "body": "KYIV, Ukraine (AP)  Top European Union officials were due to meet Friday in Kyiv with Ukrainian President Volodymyr Zelenskyy in a show of support for the country as it battles to counter Russias invasion and strives to join the EU as well as NATO. European Commission President Ursula von der Leyen and European Council President Charles Michel, as well as 15 European commissioners, traveled to the Ukrainian capital for what they described as a summit meeting. The last such summit was held in Kyiv in October 2021  a few months before the war started. The highly symbolic visit is also the first EU political mission of its kind to a country at war. There will be no let-up in our resolve, Michel said in a tweet on his apparent arrival in Kyiv. We will also support (Ukraine) every step of the way on your journey to the EU. EU assistance for Ukraine has reached almost 50 billion euros ($55 billion) since the fighting started, according to EU officials. The EU is providing Ukraine with financial and humanitarian aid, among other things. It also plans to adopt a 10th package of sanctions again Russia in the coming weeks. The EU has also announced its ramping up its military training mission for Ukraine, from an initial target of pushing 15,000 troops through the schooling to up to 30,000 troops. One focus is to train the crews of tanks that Western countries have offered Ukraine. Ukraine wants to join the 27-nation bloc, and formally submitted its application last June, though that could take years and require the adoption of far-reaching reforms. In the meantime, von der Leyen said Thursday that the European Commission is willing to let Kyiv join what she called some key European programs that will bring benefits similar to membership. Those programs were due to be discussed in Fridays meeting, which will also address one of the main obstacles to Ukraines EU membership: endemic corruption. Von der Leyen, on her fourth visit to Kyiv since Russias invasion, said Thursday she was comforted by Ukraines anti-corruption drive. The previous day, Zelenskyy had taken aim at corrupt officials for the second time in the space of a week. Several high-ranking officials were dismissed. Zelenskyy was elected in 2019 on an anti-establishment and anti-corruption platform in a country long gripped by graft. The latest corruption allegations came as Western allies channel billions of dollars to help Kyiv fight Moscows forces. Ukraines government is keen to get more Western military aid, on top of the tanks pledged last week, as the warring sides are expected to launch new offensives once winter ends. Kyiv is now asking for fighter jets. The U.S is expected to announce Friday it will send longer-range bombs to Ukraine as part of a new $2.17 billion aid package. ___ Follow APs coverage of the war in Ukraine: https://apnews.com/hub/russia-ukraine",
      "snippet": "KYIV, <b>Ukraine</b> (AP) Top European Union officials were due to meet Friday in Kyiv with. KYIV, <b>Ukraine</b> (AP) Top European Union officials were due to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:57:40",
      "provider": {
        "name": "mrt",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.hdnux.com/photos/01/31/30/76/23433090/3/rawImage.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mrt",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.mrt.com/news/article/eu-officials-hold-kyiv-talks-in-show-of-support-17761317.php"
      }
    },
    {
      "id": "2901529384213634092",
      "title": "Air raid sirens sound in Kyiv during visit by European leaders",
      "url": "https://www.brecorder.com/news/40224216/air-raid-sirens-sound-in-kyiv-during-visit-by-european-leaders",
      "description": "KYIV: Air raid alerts sounded across Ukraine on Friday as European Union leaders were in the countrys capital to...",
      "body": "Don't Miss the Latest News\nSubscribing is the best way to get our best stories immediately.\nMaybe later\nAllow Notifications\nHome                                                    Latest                                                    BR Research                                                    Markets                                                    Business & Finance                                                    World                                                    Editorials                                                    Opinion                                                    MENA                                                    Technology                                                    Life & Style                                                    Sports                                                    Perspectives                                                    Pakistan                                                    Supplements                                                    Print\nSearch\nEditor's Picks\n Economic distress in Pakistan                                                 IMF and Pakistan                                                 Car prices increased in 2023                                                 Daily news briefing\nSearch\nHome                    Economic distress in Pakistan                    IMF and Pakistan                    Car prices increased in 2023                    Daily news briefing\nLatest\nMarkets                    Stocks                    Commodities                    Forex                    Mutual Funds                    Energy                    Financial                    Rates                    Paper                    Grains                    Cotton & Textile                    Yarn Prices\nBusiness & Finance                    Interest Rates                    Taxes                    Industry                    Money & Banking                    Companies                    Tenders                    Budgets                    Real Estate\nWorld                    Asia                    USA                    Europe                    China                    Africa                    Middle East                    South Asia\nEditorials",
      "snippet": "KYIV: Air raid alerts sounded across <b>Ukraine</b> on Friday as European Union leaders were in the countrys capital to. Don't Miss the Latest News ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:51:12",
      "provider": {
        "name": "brecorder",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.brecorder.com/large/2023/02/03145027a089fbc.jpg?r=145112",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "brecorder",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.brecorder.com/news/40224216/air-raid-sirens-sound-in-kyiv-during-visit-by-european-leaders"
      }
    },
    {
      "id": "5384106152456672750",
      "title": "Sirens sound across Ukraine",
      "url": "https://pledgetimes.com/sirens-sound-across-ukraine/",
      "description": "Air raid sirens sounded in Kyiv and across Ukraine on Friday, as a summit of European Union leaders with Ukraine's",
      "body": " Air raid sirens sounded in Kyiv and across Ukraine on Friday, as a summit of European Union leaders with Ukraine's president was scheduled to begin in the capital.Ukrainian President Volodymyr Zelensky received senior EU officials who brought to Kyiv pledges to support Ukraine \"whatever it takes\" but did not give the country, which is at war with Russia, quick approval to join the bloc.Zelensky hosted European Council President Charles Michel and European Commission President Ursula von der Leyen, ahead of the first anniversary of the military operation in Ukraine.\"The European Union will support Ukraine and the Ukrainian people whatever it takes,\" the three leaders said in a joint statement, a draft of which was seen by Reuters.        \n        \n        \n  \r\n#Sirens #sound #Ukraine",
      "snippet": "... and across <b>Ukraine</b> on Friday, ... and across <b>Ukraine</b> on Friday, ... to support <b>Ukraine</b> \"whatever it takes\" ... Union will support <b>Ukraine</b> and the Ukrainian ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:47:48",
      "provider": {
        "name": "pledgetimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.alittihad.ae/store/archive/image/2023/2/3/69005c6f-3db0-4d14-811c-6039ee247f3a.jpg?width=600",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pledgetimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://pledgetimes.com/sirens-sound-across-ukraine/"
      }
    },
    {
      "id": "7730557224034438489",
      "title": "Council looks poised to close loss-making Perth Harbour",
      "url": "https://www.dailyrecord.co.uk/news/local-news/council-looks-poised-close-loss-29118188",
      "description": "Councillors have been recommended to next week vote for its closure as a commercial port and support the regeneration for other commercial uses",
      "body": "Perth\nHarbour - which has been operating at a loss - looks set to close as a commercial port.\nA full options appraisal being put before councillors next week recommends the council ends its involvement with the harbour.\nThe recommendation tabled is to end its commercial operations at the harbour and encourage other uses such as recreational use as the \"only viable way forward\".\nPerth and Kinross councillors\nwill decide the fate of the port - which has been operating at a loss - at a meeting of all elected members on Wednesday, February 8.\nIn September 2022 councillors unanimously agreed to a comprehensive review of the harbour following a decline in use.\nRead More\nPKC\nis the Statutory Harbour Authority and a Competent Harbour Authority (Pilotage) for Perth Harbour.\nAs part of this comprehensive review a long list of reasons have been cited for the rapid economic downturn of the harbour in recent years including the war in Ukraine, the pandemic and Brexit.\nThe report states: \"Due to external factors such as COVID 19, the UK EU exit, the war in Ukraine, increased competition, and market changes, as well as local factors such as lack of warehousing capacity, change in local demand due to change in commercial contract/partnering or operations, the long-term downwards trend in shipping at Perth Harbour has been accelerated. The position is further exacerbated by limitations imposed by the tidal window at Perth and cargo load restrictions triggered by recurring natural silting at the basin entrance.\"\nWhile there has been signs of recovery in the dry bulk market, around 80 ships would need to be attracted to use the harbour by 2025/26 to reduce the deficit and 120 to break even.\nThe number of ships is currently estimated at five - based on actuals and projections - with Fair Maid income estimated at 24,000 in 2022/23.\nThe key challenges cited are: pilotage, navigation channel and dredging, Fair Maid repairs, charges, vessel type, storage and market trends and local demand.\nThe business plan update states: \"In that context, the current business plan cannot be achieved as agreed.\"\nThe business plan sought to reduce the operational deficit by 32 per cent from 192,500 in 2020/21 to 131,000 in 2025/26. But the update going before councillors has red-flagged this objective for the reasons mentioned.\nIf councillors vote for the preferred option to close it as a commercial port the Fair Maid tug - which has undergone several repairs to keep it usable - would be sold.\nThe preferred option recommends encouragement be given to other commercial uses of the harbour including renewable energy production/storage and water-based leisure activities such as sailing.\nRead More\nRelated Articles",
      "snippet": "... list of reasons have been cited for the rapid economic downturn of the harbour in recent years including the war in <b>Ukraine</b>, the pandemic and Brexit.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:44:19",
      "provider": {
        "name": "dailyrecord",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i2-prod.dailyrecord.co.uk/incoming/article26168706.ece/ALTERNATES/s1200/1_RWP_PAF_260219PerthHarbour_02JPG.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "dailyrecord",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.dailyrecord.co.uk/news/local-news/council-looks-poised-close-loss-29118188"
      }
    },
    {
      "id": "9012800119636976531",
      "title": "UK Defense Ministry: Russian Wagner Group's supply of convicts for war in Ukraine 'significantly reduced'",
      "url": "https://kyivindependent.com/news-feed/uk-defense-ministry-russian-wagner-groups-supply-of-convicts-for-war-in-ukraine-significantly-reduced",
      "description": "The scale of involvement of Russian prisoners recruited by the state-backed mercenary Wagner Group in the war against Ukraine has \"probably significantly reduced\" compared to its peak between summer and fall 2022, the U.K. Defense Ministry reported on Feb. 3.",
      "body": "11:36 am\nShare\nThe scale of involvement of Russian prisoners recruited by the state-backed mercenary Wagner Group in the war against Ukraine has \"probably significantly reduced\" compared to its peak between summer and fall 2022, the U.K. Defense Ministry reported on Feb. 3.\n\"Significant tensions between Wagner and the Russian Ministry of Defense are playing out in public; competition between factions in the Russian elite is likely to be partially responsible for the reduced supply of convicts,\" reads the ministry's latest intelligence update.\nThe U.K. Defense Ministry refers to the data of the Russian Federal Penal Service (FSIN), which shows that the number of prisoners in Russia fell by 6000 inmates from November 2022 to Jan. 31, 2023, while from September to November last year, the number of inmates decreased by 23,000.\n\"Wagner recruitment was likely a major contributing factor to this drop,\" the ministry wrote.\nAlso, some reports from the Ukrainian military on the ground in the last ten days suggest that Russian forces have been using the \"human waves\" tactic with Wagner convict troops in key sectors less often, according to the intelligence update.\nThe Wagner Group, Russia's most high-profile mercenary group, takes part in the battles in the Bakhmut area, eastern Donetsk Oblast, alongside the Russian military.\nThe U.K. Defense Ministry said on Dec. 19 that the Kremlin-controlled paramilitary organization was using a large number of poorly trained convicts it had recruited to fight against Ukraine.\nIt has been accused of human rights abuses in Ukraine, Syria, Libya, the Central African Republic, Sudan, and Mozambique, including torture and extrajudicial killings.\nUkraine's General Staff reported on Jan. 25 that Wagner Group was also recruiting imprisoned Ukrainian citizens who were forcibly taken to Russian prisons.\nMykhailo Podolyak, an advisor to the President's Office, said on Jan. 15 that 77% of the Russian convicts recruited by the Wagner Group have been killed, injured, or captured by Ukrainian forces.\nThe Kyiv Independent news desk\nWe are here to make sure our readers get quick, essential updates about the events in Ukraine.\nIndependent journalism\nfor an independent Ukraine\nIndependence is an expensive currency. Both Ukraine and its journalists are paying a high price to preserve its independence. Support Ukraine's trusted journalism in its darkest hour.\nSupport us\nWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.\nOK",
      "snippet": "... by the state-backed mercenary Wagner Group in the war against <b>Ukraine</b> has \"probably significantly reduced\" compared to its peak between summer and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:36:44",
      "provider": {
        "name": "kyivindependent",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://api.kyivindependent.com/defaults/default_seo_article_image2.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "kyivindependent",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://kyivindependent.com/news-feed/uk-defense-ministry-russian-wagner-groups-supply-of-convicts-for-war-in-ukraine-significantly-reduced"
      }
    },
    {
      "id": "8336165020241575696",
      "title": "Turkish Foreign Minister Says Country Making Efforts to Extend Grain Deal",
      "url": "https://sputniknews.com/20230203/turkish-foreign-minister-says-country-making-efforts-to-extend-grain-deal-1106945488.html",
      "description": "Turkey is making efforts to extend the grain deal expiring on March 18, Turkish Foreign Minister Mevlut Cavusoglu said on Friday.",
      "body": "/html/head/meta[@name='og:description']/@content\nhttps://cdnn1.img.sputniknews.com/img/07e7/01/07/1106110845_0:169:3043:1880_1920x0_80_0_0_3f0dc9ff8b13b66bbb6b7233d4931068.jpg\nIn July 2022, Russia, Ukraine, Turkey and the United Nations struck a deal to provide a humanitarian maritime corridor for ships with food and fertilizer exports from Ukrainian Black Sea ports. The agreement is part of a larger package deal that also envisions unblocking Russian grain and fertilizer exports. The deal, originally scheduled to expire on November 18, was extended for another 120 days. However, Putin has repeatedly said that most of the ships carrying Ukrainian grain did not make it to the world's poorest countries and ended up in Europe. At the same time, Putin has voiced his concerns that Russian products are not entering the global markets as promised by the agreement.\nrussia\nAfrica\nISTANBUL (Sputnik) - Turkey is making efforts to extend the grain deal expiring on March 18, Turkish Foreign Minister Mevlut Cavusoglu said on Friday.\n\"Turkey is making efforts to ensure that the grain deal proceeds smoothly. Problems still arise at times, in such situations, Mr. President [Recep Tayyip Erdogan] holds telephone talks with [Russian President] Mr. Vladimir Putin and [Ukrainian President] Mr. Volodymyr Zelensky. In mid-March, the second extended term of the grain deal expires. We are working to extend it, maybe for a longer period. We know how important it is for world food security and for countries in need,\" Cavusoglu said during a joint press conference with his Argentine counterpart in Istanbul.\nIn July 2022, Russia, Ukraine, Turkey and the United Nations",
      "snippet": "... In July 2022, Russia, <b>Ukraine</b>, Turkey and the United Nations ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:35:00",
      "provider": {
        "name": "sputniknews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdnn1.img.sputniknews.com/images/sharing/article/eng/1106945488.jpg?11061108281675417058",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sputniknews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://sputniknews.com/20230203/turkish-foreign-minister-says-country-making-efforts-to-extend-grain-deal-1106945488.html"
      }
    },
    {
      "id": "6618094757159470361",
      "title": "Ukraine war: Trump's ally Pompeo says Putin saw 'no risks' with Biden before invading Kyiv",
      "url": "https://www.express.co.uk/news/world/1730133/ukraine-war-mike-pompeo-joe-biden-vladimir-putin-donald-trump-nato",
      "description": "Vladimir Putin believed there were 'no risks' invading Ukraine with Joe Biden at the head of the United States, a former US Secretary of State claimed.",
      "body": "Ukraine: Mike Pompeo asked how Trump would handle crisis\nSUBSCRIBE\nInvalid email\nWe use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time.\nMike Pompeo, former US Secretary of State under Donald Trump's administration, argued Vladimir Putin refrained from invading Europe by \"a single inch\" until Joe Biden became US President.\nRelated articles\nFlagship 3bn HMS Prince of Wales aircraft carrier needs more repairs\nSpeaking to Sky News, Mr Pompeo argued that the Russian President saw the danger of moving against Ukraine as long as Mr Trump was in office, thanks to his administration's military power in the Middle East and Afghanistan.\nAsked whether Donald Trump would have dealt better with the Russian war on Kyiv, he said: \"Putin hasn't changed. I met with him, a bad guy, I looked in his eyes I didn't see a soul. I saw evil.\n\"Make no mistakes about it, he's the bad guy.\n\"What changed in the last decade? In 2014, President Obama allowed Putin to take Crimea, one-fifth of Ukraine. We always think this war started on February 24, now almost a year ago. But it actually started in 2014, then for four years Putin doesn't invade Europe, doesn't invade another single inch.\n\"And then we leave office and he goes at it again. I believe that's not coincidence. I believe that's because we were serious. We built the American military, we had created a situation where NATO members put forward $180 billion more into NATO.\"\nHe added: \"Ask Secretary General Stoltenberg who helped him create the NATO that is doing such a good job supporting Ukraine today. We were that force. Although we didn't make any friends doing it, we were the force that began that trajectory.\nPompeo says Putin saw 'no risks' with Biden\n(Image: Sky News)\nPutin saw a 'lot of risks' with Trump in office, say Pompeo\n(Image: Getty)\n\"I think Putin could see that, he saw what we did in the Middle East and he could see we were serious. He watched us in Afghanistan defending things that matter. I think there was a fundamentally different understanding in the mind of Vladimir Putin.\n\"Deterrence depends on your adversary's perception of risk. And I think he thought there was a lot of risk under our watch. He thought there were no risks doing it when President Biden was in office.\"\nThe comments come as the US has stepped up pressure on Middle East allies to expel the Wagner Group, a military contractor with close ties to\nRussia\n's president, from chaos-stricken Libya and Sudan where it expanded in recent years.\nThe US effort described by officials comes as the Biden administration is making a broad push against the mercenaries.\nREAD MORE:\nAt least eight dead after explosion rips through Russian barracks\nTrending\nThe US has slapped new sanctions on the Wagner Group in recent months over its expanding role in\nRussia\ns war in Ukraine.\nThe group is owned by Russian oligarch Yevgeny Prigozhin, a close ally of Russian President Vladimir Putin. The Pentagon has described it as a surrogate for the Russian Defence Ministry. The Kremlin denies any connection.\nThe Biden administration has been working for months with regional powers Egypt and the United Arab Emirates to pressure military leaders in Sudan and Libya to end their ties with the group, according to more than a dozen Libyan, Sudanese and Egyptian officials. They asked for anonymity to speak freely and because they were not authorised to discuss the issue with the media.\nDON'T MISS:",
      "snippet": "Vladimir Putin believed there were 'no risks' invading <b>Ukraine</b> with Joe Biden at the head of the United States, a former US Secretary of State ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:31:00",
      "provider": {
        "name": "express",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/4545328.jpg?r=1675418832183",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "express",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.express.co.uk/news/world/1730133/ukraine-war-mike-pompeo-joe-biden-vladimir-putin-donald-trump-nato"
      }
    },
    {
      "id": "7633448525646519672",
      "title": "Ukraine Claims 7,516 Civilian Deaths Since Feb. 24, 2022 Russian Invasion",
      "url": "https://www.jewishpress.com/news/global/europe/ukraine/ukraine-claims-7516-civilian-deaths-since-feb-24-2022-russian-invasion/2023/02/03/",
      "description": "On the Russian side, 12,538 soldiers were killed (confirmed by names) as of January 27, 2023.",
      "body": "Photo Credit: Enero201\nChief of Ukraine's Police and Acting Minister of Internal Affairs Igor Klymenko.\nOn February 24, 2022, almost a year ago, Russia invaded Ukraine in a major escalation of the Russo-Ukrainian War which began in 2014 with the occupation of Crimea. According to Chief of Ukraines Police and Acting Minister of Internal Affairs Igor Klymenko, as of today, 7,516 peaceful Ukrainians are considered to have been killed as a result.\nSpeaking at a joint meeting of the Government of Ukraine and the European Commission, Klymenko noted that currently, the National Police alone have opened more than 60,000 criminal proceedings on the facts of crimes committed by Russian servicemen on the territory of Ukraine. As of now, 7,516 civilians have been killed, including 459 children.\nAdvertisement\n11,415 Ukrainian civilians were wounded as of January 22, 2023, according to the United Nations High Commissioner for Human Rights.\nMore than 13,000 Ukrainian soldiers were killed as of December 2, 2022, according to the Guardian, citing the Ukrainian government.\nAccording to Klymenko, more than 152,000 residential buildings, almost 3,200 educational and 1,200 medical institutions, and more than 7,500 critical infrastructure facilities have been damaged or destroyed in Ukraine.\nHe also pointed out that 49 places of incarceration and torture have been identified, where the Russian Federation illegally detained and tortured Ukrainian citizens.\nOn the Russian side, 12,538 soldiers were killed (confirmed by names) as of January 27, 2023, according to the BBC.\nIn the rogue Donetsk Peoples Republic, 4,163 were killed, and 17,329 wounded as of December 16, 2022, according to government reports.\nIn the rouge Luhansk Peoples Republic, more than 1,000 were killed as of November 10, 2022, according to BBC News.\nThe UN claims the war caused the fastest-growing refugee and humanitarian crisis in Europe since World War 2. In the first week of the invasion, the UN reported more than a million refugees had fled Ukraine, a number that rose to more than eight million by January 31, 2023. And, as of May 3, 2022, another eight million are displaced inside Ukraine. Most refugees are women, children, the elderly, and the disabled. Most Ukrainian males aged 18 to 60 were denied exit from their country as part of mandatory military conscription.\nMinister Klymenko told the European Commission: We welcome the adoption of the resolution of the European Parliament on the establishment of a special International Tribunal to investigate and prosecute the crime of aggression against Ukraine.\nHe stressed that all the Russian Federations war crimes have been carefully documented and will someday become the basis for the work of Ukrainian and international tribunals.\nAdvertisement",
      "snippet": "On February 24, 2022, almost a year ago, Russia invaded <b>Ukraine</b> in a major escalation of the Russo-Ukrainian War which began in 2014 with the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:30:26",
      "provider": {
        "name": "jewishpress",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.jewishpress.com/wp-content/uploads/2023/02/Chief-of-Ukraines-Police-and-Acting-Minister-of-Internal-Affairs-Igor-Klymenko.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "jewishpress",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.jewishpress.com/news/global/europe/ukraine/ukraine-claims-7516-civilian-deaths-since-feb-24-2022-russian-invasion/2023/02/03/"
      }
    },
    {
      "id": "1128245394285932376",
      "title": "Europe looks to geothermal energy as gas alternative",
      "url": "https://www.france24.com/en/live-news/20230203-europe-looks-to-geothermal-energy-as-gas-alternative",
      "description": "The heating plant in Munich's southern Sendling neighbourhood has been run for more than a century on gas, often imported from far away.",
      "body": "3 min\nMunich (Germany) (AFP) \nThe heating plant in Munich's southern Sendling neighbourhood has been run for more than a century on gas, often imported from far away.\nAdvertising\nRead more\nBut increasingly, it is the hot waters from deep underground the station that provide the energy.\nTacked on to the side of the original 19th-century red-brick plant is a boxy new geothermal unit surrounded by a tangle of pipes.\nWork on the new installation started in 2016 and it opened in 2021, before Russia launched its assault on Ukraine and shut the pipelines to Europe.\nBut the timely opening of the modern unit -- one of the largest of its kind in Europe -- is a happy coincidence for the city, which like the rest of the country is facing the challenge of making up for lost Russian gas supplies.\n'Perfect location'\nMunich is pouring in one billion euros ($1.1 billion) through 2035 to develop the geothermal energy and make the city's heating carbon neutral.\n\"We're sitting on a gold mine,\" says Christian Peltl, director of geothermal energy at SWR, the operator of the plant in Sendling.\n\"Munich has the perfect geological location\" in a region known for its thermal baths, Peltl says.\nEverywhere in Europe, interest in geothermal projects has grown in recent years as officials search for ways to decarbonise their energy systems.\nThe conflict in Ukraine has reinforced the trend. Moscow's invasion last year brought Russian gas deliveries to Europe to a shuddering halt and triggered an alarming spike in energy costs across Europe.\nAfter a heady peak, prices on the spot market have fallen in recent weeks. But the crisis has underscored the vulnerabilities of the continent in the area of energy.\nThe geothermal heating plant in Munich is one of the largest of its kind in Europe\n Christof STACHE / AFP\nReliable and sustainable geothermal energy seems like the perfect alternative to gas.\nPiping hot thermal waters are pumped up from three kilometres (1.9 miles) below the surface. The heat is transferred into the local network, which connects nearby homes to the plant, while the cooled thermal waters are sent back underground.\n\"There was really a boom in orders since the beginning of the (energy) crisis,\" says Peltl.\nAt the end of 2022, the German government published a plan to increase the production of geothermal energy tenfold by 2030 to 10 terawatt hours (Twh).\nTo reach the ambitious target, Germany, which uses gas for 50 percent of its heating, wants to start \"at least 100 new geothermal projects\".\nAcross the border in France, the government published a plan Thursday to increase the number of deep geothermal energy schemes by 40 percent by 2030.\nIn Hungary, the government issued a decree in October to expand use of the energy source.\nThe Italian government is also gearing up to support expansion, while in Denmark, the largest plant in the country is set to open in Aarhus in 2030, supplying 20 percent of the city's heating.\n'Boom'\nOnce fully operational, the new plant in Munich will be able to supply up to 80,000 local homes with warmth via a sprawling network of pipes.\nThe station is largely automated, with its operation controlled from a room in the older part of the edifice.\nWhile geothermal energy is a boon to those who can access it, \"it is only part of the solution\", says Thomas Gilg, head of the Munich plant.\nGermany wants to to start \"at least 100 new geothermal projects\"\n Christof STACHE / AFP\nNot everywhere is suited to geothermal energy. Above all else, the energy drawn from below the surface has to be used locally.\n\"We must not fool ourselves. With this plant we cannot supply the whole of Munich,\" says Gilg.\nExcavation works to install a plant in Strasbourg, France, were blamed for two minor earthquakes felt in the area at the end of 2020.\nNonetheless, the Sendling plant operators see the potential as \"massive\", according to Peltl.\nAccording to the European Commission, geothermal energy could provide carbon-free heating for \"up to 25 percent\" of residents in the EU.\nburs-fcz/sea/lth",
      "snippet": "... 2016 and it opened in 2021, before Russia launched its assault on <b>Ukraine</b> and shut the pipelines to Europe. But the timely opening of the modern ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:24:29",
      "provider": {
        "name": "france24",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.france24.com/media/display/8f17415e-a3a4-11ed-b518-005056bf30b7/w:1280/p:16x9/d5cacbd776e0a98610270f118b7df513d3a298b4.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "france24",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.france24.com/en/live-news/20230203-europe-looks-to-geothermal-energy-as-gas-alternative"
      }
    },
    {
      "id": "4495895309730990261",
      "title": "Live blog: Air raid sirens across Kiev before EU-Ukraine summit",
      "url": "https://www.trtworld.com/europe/live-blog-air-raid-sirens-across-kiev-before-eu-ukraine-summit-65147",
      "description": "Ukrainian President Zelenskyy urges European leaders visiting Kiev to pile more sanctions on Russia while President Putin evokes a famous WWII victory over Nazis to rally his nation as fighting enters its 345th day.",
      "body": "Friday, February 3, 2023 0848 GMT&nbsp;Air raid alerts have sounded in Kiev and across Ukraine as a summit of European Union and Ukrainian leaders were due to begin in the country&#39;s capital.Ukraine President Volodymyr Zelenskyy was hosting top European Union officials, who were visiting Kiev with promises to support Ukraine &quot;as long as it takes&quot; but denying the country at war with Russia a quick path to joining the Western bloc.Zelenskiyy was hosting EU chairman Charles Michel and the bloc&#39;s chief executive, Ursula von der Leyen, ahead of the one-year anniversary of Moscow&#39;s attack that has devastated cities, killed tens of thousands of people, forced millions from their homes and shaken global food and energy supplies. 0906 GMT &mdash; Russian-backed Crimea authorities nationalise properties of Ukrainian politicians and businessmenMoscow-supported authorities in occupied Crimea said that they had nationalised around 500 properties in the peninsula including some belonging to senior Ukrainian politicians and business figures.In a statement on Telegram, Vladimir Konstantinov, speaker of the Russian-backed Crimean parliament, said that the decree targeted &quot;accomplices of the Kiev regime&quot; and that the nationalised properties included banks and tourist and sport infrastructure.According to a document published on the Kremlin-backed Crimean government website, properties belonging to former Ukrainian prime minister Arseniy Yatsenyuk and businessmen Igor Kolomoisky, Rinat Akhmetov and Serhiy Taruta were among those confiscated.0508 GMT &mdash;&nbsp;Ukraine&rsquo;s allies push IMF to approve $14 bln-$16 bln loanUkraine&#39;s allies are pushing the International Monetary Fund (IMF) to finalise plans for a multibillion-dollar lending programme, the Financial Times reported.&nbsp;IMF representatives are planning to meet Ukrainian officials in mid-February to advance discussions over a loan that could range from $14 billion to $16 billion, the report said, citing officials familiar with the talks.&nbsp;2300 GMT &mdash;&nbsp;CIA chief says next six months will be &#39;critical&#39; for UkraineCIA Director William Burns has said the intelligence agency assesses that China&#39;sPresident Xi Jinping has been a little sobered by the war inUkraine, but that it would be a mistake to underestimate Beijingand Moscow&#39;s commitment to partnership.Burns, speaking at a foreign policy event at GeorgetownUniversity in Washington, DC, also said Xi maintains seriousambitions over Taiwan and warned that conflict over the islandnation would be &quot;deeply unfortunate&quot; for all involved.China, which signed a &quot;no limits&quot; partnership with Russialast year, has refrained from condemning its invasion of Ukraineeven as Western countries, led by the United States, imposedsweeping sanctions against Moscow.But Burns, who travelled to Ukraine recently to meet withthe country&#39;s president, said Xi was likely surprised andunsettled by what he described as the poor performance ofRussia&#39;s military.Burns added that Russia and China&#39;s friendship is nottotally without limits.Speaking on Moscow&#39;s invasion, Burns said the next sixmonths will be &quot;critical&quot; for Ukraine, where Moscow has beenmaking incremental gains in recent weeks. For live updates from Thursday (February 2), click&nbsp;here",
      "snippet": "... alerts have sounded in Kiev and across <b>Ukraine</b> as a summit of European Union and ... who were visiting Kiev with promises to support <b>Ukraine</b> &quot.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-03T09:22:49",
      "provider": {
        "name": "trtworld",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdni0.trtworld.com/w480/h270/q75/149413_20230112T150729Z_817781868_RC2YOY9KLQ4R_RTRMADP_3_UKRAINECRISISFUNERAL_1675415852398.JPG",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "trtworld",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.trtworld.com/europe/live-blog-air-raid-sirens-across-kiev-before-eu-ukraine-summit-65147"
      }
    },
    {
      "id": "3965281700391510186",
      "title": "US think tank believes the window of opportunity to push back Russia has closed for Ukraine",
      "url": "https://www.firstpost.com/world/us-think-tank-believes-the-window-of-opportunity-to-push-back-russia-has-closed-for-ukraine-12097072.html",
      "description": "Russia's withdrawal from Kharkiv and Kherson had given Ukrainian forces an opportunity to drive the Russian forces back, but it soon lost pace and has now turned into a stalemate",
      "body": "February 03, 2023 14:51:29 IST\nUkraine war representational image. AP File Photo\nNew Delhi: The opportunity to seize the initiative on the battlefield created by Russian military flaws and failures which allowed Ukraine to take back some territory has now closed and Ukraine hasnt been able to make the most of it, says US-based think tank Institute for the Study of War.\nUkrainian officials have been warning of a fresh massive Russian offensive in eastern Ukraine for the last few days. Ukraines President Volodymyr Zelenskyy told Fox News he believes that (Russian offensive) has already started or not fully.\nUkraines window of opportunity\nThe war in Ukraine, which started on 24 February 2022, reached a stalemate for Russian forces after they captured Lysychansk in early July 2022. After that the Ukrainian forces aided by the US supplied HIMARS and similar weapons from the EU launched a counter offensive. Russian forces withdrawal from Kharkiv in September followed by withdrawal from Kherson in October had in the recent months made it seem like the Ukrainian forces had one upped the Russian on the ground.\nHowever, the counteroffensive soon again turned into a stalemate. The momentum gained by initial successes was lost and the aim of driving out the retreating Russian forces is still nowhere near being even partially achieved.\nIn the Kherson region, Ukraine took back the Kherson town located on the western bank of the river Dnipro, which divides Kherson in two parts, but there has not been much change in positions on the ground. The Russians who withdrew to the eastern bank are still there. In fact attacking the town from across the river, which has forced most of its residents leave.\nOn the eastern front, except for the rapid advances in Kharkiv because of Russian forces strategic withdrawal, there has not been much to claim for a success for Ukrainian forces.\nFailing to make the most of the opportunity\nThe window of opportunity that the Russian withdrawal provided Ukraine could not be used to launch a wider offensive. The reason behind this failure is the Wests delay in providing Ukrainian forces with the long range weapons they needed to undertake the task, according an analysis by the US based Institute for the Study of war.\nIf the Ukrainian counter-offensive had to make a significant dent, then it would have required Ukraines western allies to send the weapons it is just now agreeing to send way back in June 2022.\nIf the Wests aim had been to shorten the war by speeding Ukraines liberation of occupied territory, the assessment that stocks of Soviet-era weapons held by friendly states were running low should have triggered a fundamental change in the provision of Western aid starting in June 2022, the ISW analysis said.\nRussia, meanwhile, used the time to recalibrate its strategy and launch a renewed offensive in the east, where an intense battle goes on to capture Bakmut, and put more pressure on Ukraine.\nUkraines inability to mount a subsequent counter-offensive in November following the Russian withdrawal from western Kherson Oblast gave Russia time and space to stabilize its lines and put pressure on Ukraine to which Kyiv had to respond, the ISW says.\nRead all the Latest News, Trending News, Cricket News, Bollywood News,",
      "snippet": "... 2023 14:51:29 IST <b>Ukraine</b> war representational image. AP ... failures which allowed <b>Ukraine</b> to take back ... has now closed and <b>Ukraine</b> hasnt been able to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:21:29",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2023/02/Untitled-design-2023-02-02T172117.331.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/world/us-think-tank-believes-the-window-of-opportunity-to-push-back-russia-has-closed-for-ukraine-12097072.html"
      }
    },
    {
      "id": "290169674000647195",
      "title": "Donald Trump Says He Can End Ukraine War 'Immediately' if He Talks to Putin",
      "url": "https://www.newsweek.com/trump-russia-ukraine-end-war-putin-24-hours-1778709",
      "description": "The former leader has again said war would stop \"within 24 hours\" if he spoke about \"the right things\" but it \"has to be done from the office of the president.\"",
      "body": "Donald Trump has repeated his claim that he would be able to end the war quickly between Russia and Ukraine by speaking with Russian President Vladimir Putin.In an interview with Right Side Broadcasting Network, the former U.S. president once again said that the Russian invasion \"would never had started\" if he were still at the White House instead of Joe Biden.Trump added that it would be possible to negotiate an end to the war \"within 24 hours\"another claim he has been repeating recentlyand that he would be able to do it if he were the U.S. leader.\"It should have never ever happened, but it did happen. With that being said, it can be negotiated, I think, within 24 hours,\" Trump said.\"It really has to be done from the office of the president. And you have to get both in a room, and there are things you can say to each one of them, which I won't reveal now, which will guarantee that this war will end immediately.\"Trump described the war in Ukraine as a \"horror\" and said that the total death toll from the conflict is higher than what is being disclosed.\"They're talking about numbers that are nothing by comparison to what the real numbers are,\" Trump said. \"When they knock down those big apartment houses, and when they knock down cities and they say two people died, or three people were hurt, that's not right.\"I think the numbers are far greater. That will be revealed at a later date,\" he added. \"But we have to do something about it. That war has to stop, and it has to stop now, and it's easy to do.\"For nearly a year, Trump has said that the Russian invasion of Ukraine would not have happened if he were still president. He has cited apparent agreements he had with Putin and the lack of respect and fear the Russian president has for Biden.Trump's boast that he could end the war within 24 hours has been repeated on social media. He also made the claim during his talk at the New Hampshire Republican State Committee's annual meeting in Salem on January 28.\"My personality kept us out of war,\" Trump told the crowd.\"And I told you before, [it] would have never happened with Russia. Putin would have never, ever gone in. And, even now, I could solve that in 24 hours. It's so horrible what happened. Those cities are demolished now.\"In a video posted on his Truth Social Account on Wednesday, Trump said: \"If I were president, the Russia-Ukraine war would never have happened, not in a million years.\"But even now, if I were president, I'd be able to negotiate an end to this horrible and rapidly escalating war within 24 hours. You have to say the right things, not the wrong things.\"",
      "snippet": "... he would be able to end the war quickly between Russia and <b>Ukraine</b> by speaking with Russian President Vladimir Putin.In an interview with Right Side ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:16:24",
      "provider": {
        "name": "newsweek",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://d.newsweek.com/en/full/2189786/trump-negotiate-war-putin.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsweek",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsweek.com/trump-russia-ukraine-end-war-putin-24-hours-1778709"
      }
    },
    {
      "id": "2528042427514830961",
      "title": "Hong Kong included in global public screenings of video for Ukraine by artist Anne Imhof during February",
      "url": "https://www.scmp.com/lifestyle/arts-culture/article/3208846/hong-kong-included-global-public-screenings-video-ukraine-artist-anne-imhof-during-february?utm_source=rss_feed",
      "description": "A video created by one of the most influential figures in contemporary art will be shown on the giant LED screen outside Sogo department store in Hong Kong every evening until February 28 as part of a campaign to raise funds for young people affected by the war in Ukraine.",
      "body": "A video created by one of the most influential figures in contemporary art will be shown on the giant LED screen outside Sogo department store in Hong Kong every evening until February 28 as part of a campaign to raise funds for young people affected by the war in Ukraine. The video, Youth , is an excerpt from a new work by German-born Anne Imhof, ranked one of the 25 most influential women in 2022 by the Financial Times and winner of the Golden Lion award at the Venice Biennale in 2017. Youth is a three-minute edit of the 10-minute work, which was filmed on the outskirts of Moscow before Russias invasion of Ukraine on February 24 last year. The camera follows a group of horses grazing in heavy snow outside derelict, abandoned apartment blocks with no visible human presence. The desolate scene is accompanied by a mournful soundtrack of J.S. Bachs Erbarme dich, mein Gott (Have mercy, my God) from his oratorio St Matthew Passion . The same video will be screened in Londons Piccadilly Circus as well as on outdoor screens in Berlin, Milan, Los Angeles, New York, Seoul and Tokyo. A special extended version will show on February 24 to commemorate the first anniversary of the Russian invasion.  It is important to me to have Hong Kong included in the screening. I have never been there and now my art is there before I am, being shown on the biggest screen in Asia, says Imhof, referring to the 19 metre by 72 metre screen, with an area equivalent to five tennis courts, in the heart of bustling Causeway Bay. Dostoevsky out, Warhol in: Ukraine erases Russian past from public spaces Imhof is known for creating scenes through live performance, music, art and installations that are haunting, dystopian and intense. Her work is often seen as capturing the nihilism and helplessness of individuals in the face of capitalism and technology. The premiere of Youth was originally planned for a solo exhibition at Moscows Garage Museum, but was moved to Amsterdams Stedelijk Museum last November after the former cancelled all its shows until the human and political tragedy that is unfolding in Ukraine has ceased. Unfortunately the world around us is one that is very sick, one where living in it isnt easy, especially for the younger generations that grow up in it now, says Imhof. There are aspects of nihilism in her work, which may be why the generations growing up now connect so much with her practice, she says. However, I always connect the nihilism in my work with the hope that things can change. The heaviness of the film, which shows a frozen landscape with empty, stark Soviet architecture, is realistic, Imhof says. The thoughts about a world that is actually unliveable is a realistic depiction of how the world really is. She believes that acknowledging this reality means that there is room to ask: What if there is actually a chance for people living in peace? What if there is actually a state that provides a fair and just system and freedom for its citizens? What if there is hope for all people living together as one? Time to stop the taming of Hong Kong public art The global screenings will take place at 8.23pm local time in each city (or 20:23, which refers to February 23, the eve of the invasion). They are organised by the UK-based Cultural Institute of Radical Contemporary Arts (Circa), which raises money for the arts as well as for The United Nations Central Emergency Response Fund through cultural projects. On February 24, when an extended version of the video will be shown, Imhof will launch a 24-hour fundraiser with Circa, through the United Nations Childrens Fund (Unicef), to raise money for Ukrainian young people affected by the war.",
      "snippet": "... department store in Hong Kong every evening until February 28 as part of a campaign to raise funds for young people affected by the war in <b>Ukraine</b>.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:15:10",
      "provider": {
        "name": "scmp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.i-scmp.com/sites/default/files/styles/1200x800/public/d8/images/canvas/2023/02/02/1e6d2c06-b7e1-4acf-944d-4e6800ba18ba_25a0ff22.jpg?itok=ht2UIk4H&v=1675326000",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "scmp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.scmp.com/lifestyle/arts-culture/article/3208846/hong-kong-included-global-public-screenings-video-ukraine-artist-anne-imhof-during-february?utm_source=rss_feed"
      }
    },
    {
      "id": "7559790946461252356",
      "title": "Air raid sirens in Kyiv before EU-Ukraine summit",
      "url": "https://www.deccanherald.com/international/world-news-politics/air-raid-sirens-in-kyiv-before-eu-ukraine-summit-1187441.html",
      "description": "Air raid sirens rang out in Kyiv and across Ukraine on Friday before the start of a summit bringing together senior Ukrainian officials and EU representatives. The bloc's chief Ursula von der Leyen arrived in Ukraine's capital Kyiv on Thursday with the EU's most senior diplomat, Josep Borrell, for talks on Ukraine's hopes to become an EU member.",
      "body": "Air raid sirens rang out in Kyiv and across Ukraine on Friday before the start of a summit bringing together senior Ukrainian officials and EU representatives.\r\n\r\nThe bloc's chief Ursula von der Leyen arrived in Ukraine's capital Kyiv on Thursday with the EU's most senior diplomat, Josep Borrell, for talks on Ukraine's hopes to become an EU member.",
      "snippet": "Air raid sirens rang out in Kyiv and across <b>Ukraine</b> on Friday before the start of a summit bringing together senior Ukrainian officials and EU ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:11:43",
      "provider": {
        "name": "deccanherald",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/02/03/ukraine-afp-3-1167469-1669900483-1184804-1674731262-1187441-1675415503.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "deccanherald",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.deccanherald.com/international/world-news-politics/air-raid-sirens-in-kyiv-before-eu-ukraine-summit-1187441.html"
      }
    },
    {
      "id": "2614786383850784905",
      "title": "From Leopard tanks to longer-range bombs, NATO scrambles to arm Ukraine",
      "url": "https://www.wionews.com/world/from-leopard-tanks-to-longer-range-bombs-nato-scrambles-to-arm-ukraine-558526",
      "description": "From Leopard tanks to longer-range bombs, NATO scrambles to arm Ukraine",
      "body": "Democrat Ilhan Omar ousted from House Foreign Affairs Committee for her anti-Semitic comments\nUS had been extending defence aid to Ukraine while imposing harsh sanctions on Russia. German government also approved the delivery of Leopard 1 tanks to Ukraine from its industrial stocks and their delivery could happen anytime soon, Munich newspaper Sueddeutsche Zeitung reported on Friday.\nGerman automotive and arms manufacturer Rheinmetall and military technology group Flensburger Fahrzeugbau Gesellschaft (FFG) have expressed their willingness saying if Kyiv is ready, it can recondition the Leopard tanks and send them to Ukraine.\nAlso Read |\nEU Parliament waives immunity from prosecution of two lawmakers in bribery scam probe\nMeanwhile, Berlin is also in talks over purchasing back 15 Gepard tanks from Qatar, which the country purchased to secure World Cup Stadiums, to send to Kyiv.In a statement, German Defence Minister Boris Pistorius said, \"The Gepards have proven themselves very well in the war in Ukraine. If we could get more from partners here, that would definitely help the Ukrainians.\"\nWatch |\nWill 'Operation Miracle' save the ocean's rarest marine mammal?\nAhead of the 24th summit of the European Union and Ukrainian leaders that is due to begin in Kyiv, the US agreed to send longer-range bombs to Ukraine to strengthen Ukraine's offensive.These ground-launched small-diameter bombs are part of a $2.17 billion aid package which is expected to announce Friday.\nMoreover, the UK defence minister on Thursday also said he did not rule out supplying Ukraine with fighter jets while cautioning they would not be a \"magic wand\" in the war.\nWATCH WION LIVE HERE\nYou can now write for wionews.com and be a part of the community. Share your stories and opinions with us here.",
      "snippet": "... House Foreign Affairs Committee for her anti-Semitic comments US had been extending defence aid to <b>Ukraine</b> while imposing harsh sanctions on Russia.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:09:42",
      "provider": {
        "name": "wionews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wionews.com/sites/default/files/styles/medium/public/2023/02/03/329960-untitled-design-2023-02-03t141750925.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wionews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wionews.com/world/from-leopard-tanks-to-longer-range-bombs-nato-scrambles-to-arm-ukraine-558526"
      }
    },
    {
      "id": "6492220484290452933",
      "title": "EU plays down any hopes of fast track membership for Ukraine",
      "url": "https://www.dailymail.co.uk/news/article-11709145/EU-plays-hopes-fast-track-membership-Ukraine.html",
      "description": "The bloc's leaders granted candidate status to Ukraine in June last year, following Russia's invasion in February.But the path to full membership remains long, and could take years",
      "body": "EU chief Ursula von der Leyen set for talks with Zelensky at summit in Kyiv today. She is expected to inform Zelensky his country will not receive special treatment. But Zelensky and Ukraine PM Denis Shmyhal are pressing hard for membership",
      "snippet": "The bloc's leaders granted candidate status to <b>Ukraine</b> in June last year, following Russia's invasion in February.But the path to full membership ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:07:59",
      "provider": {
        "name": "dailymail",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.dailymail.co.uk/1s/2023/02/03/09/67283519-0-image-a-11_1675415131547.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "dailymail",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.dailymail.co.uk/news/article-11709145/EU-plays-hopes-fast-track-membership-Ukraine.html"
      }
    },
    {
      "id": "5019642100109101554",
      "title": "Ukraine war: Air raid sirens in Kyiv as EU-Ukraine summit starts",
      "url": "https://www.bbc.co.uk/news/live/world-europe-64509741",
      "description": "Air raid sirens are heard as President Volodymyr Zelensky hosts a summit for EU leaders in Ukraine's capital.",
      "body": "Johnson looked to foster close ties with Kyiv while in office\nImage caption: Johnson looked to foster close ties with Kyiv while in office\nAs we've been reporting, Ukraine is hoping for a speedy entry to the European Union. One man backing Kyiv is former British prime minister, Boris Johnson.\nEarlier this week, he said that Russian President Vladimir Putin had \"demolished any objections to Ukrainian membership\".\nHe added: \"I believe that, once this war is done, once the Ukrainians have won, then yes they should begin the process of induction both to Nato and to the EU.\"\nWhile in power, Johnson had said there was \"no way\" Ukraine would be quickly able to join Nato - a military alliance of Western nations.\nArticle share tools\nA mixture of symbolism and substance for Kyiv\nJames Waterhouse\nEPA\nCopyright: EPA\nSnow and sirens have set the tone for todays summit between President Zelensky and European Union officials. The latter will remind everyone of the threat Ukraine continues to face.\nIts why Zelensky argues that his country deserves negotiations to start for it to join the bloc of 27 members.  He claims it would also motivate his countrymen as they continue to endure this war.\nWhat he privately knows, is that joining takes years, if not decades.\nThere will be some substance to these meetings. Further Russian sanctions, financial and military support, as well as repairs to Ukraines damaged infrastructure has already been discussed.\nHowever, what Kyiv wants most is membership. Ukraine has politically wanted to join the EU for years. It would bring economic benefits, but also allow the country to lean further to the West, and away from the clutches of Moscow.\nThe presence of EU officials on the ground in a country at war is significant - the West isn't being shy about its support for Ukraine.\nArticle share tools\nZelensky's EU bid to be discussed in Kyiv\nReuters\nCopyright: Reuters\nPresidentVolodymyr Zelenskys hopes of a fast-track entry into the EU are expected to berebuffed at an EU-Ukraine summit in Kyiv today.\nAhead of the meeting, Ukraine's PrimeMinister Denys Shmyhal said Ukraine had set what he called an \"ambitiousgoal\" of joining the EU in two years.\nBut a group of member states havewarned it should be made clear to Kyiv that this will not be possible.\n\"Wewill do it but there are no short-cuts,\" said one diplomat.\nLastJune, Ukraine gained EU candidacy status at record speed, in what Zelensky saidwas a unique and historic moment.\nWhile it is a first step to membership, theprocess typically takes many years with other countries queuing for years.\nAnupdate on Ukraine's progress towards membership is expected in the spring witha more formal assessment to follow later in the year.\nRead more on this from our Brussels Correspondent Jessica Parker\nHello and welcome\nGood morning, and welcome to our live coverage.\nAir raid sirens have been sounded in Kyiv and across Ukraine as European Union officials prepare to meet Ukrainian President Volodymyr Zelensky.\nUkraine is hosting an historic summit as it seeks to speed up its bid to join the European Union.\nThe war-torn country is hopeful, but EU officials say much still needs to be done before Ukraine is in a position to join the bloc.\nToday's summit comes after another large financial package was announced on Thursday, along with another round of sanctions on Russia.\nArticle share tools",
      "snippet": "... Johnson looked to foster close ties with Kyiv while in office As we've been reporting, <b>Ukraine</b> is hoping for a speedy entry to the European Union.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:03:57",
      "provider": {
        "name": "bbc",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://m.files.bbci.co.uk/modules/bbc-morph-news-waf-page-meta/5.3.0/bbc_news_logo.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "bbc",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.bbc.co.uk/news/live/world-europe-64509741"
      }
    },
    {
      "id": "8751629133985919547",
      "title": "WATCH: Jihadis bring down hammer and tongs on Ahmadi mosque in Pakistan's Karachi; 2nd in a month",
      "url": "https://www.firstpost.com/world/watch-jihadis-bring-down-hammer-and-tongs-on-ahmadi-mosque-in-pakistans-karachi-second-in-a-month-12097442.html",
      "description": "Viral videos of the discretion show four men, covering their face and wearing helmets, climbing on the mosque and escaping thereafter",
      "body": "Most Read\nMost Read\nWATCH: Jihadis bring down hammer and tongs on Ahmadi mosque in Pakistan's Karachi; 2nd in a month\nViral videos of the discretion show four men, covering their face and wearing helmets, climbing on the mosque and escaping thereafter\nHollywood action hero Steven Seagal censored for allegedly backing Russia's invasion of Ukraine\nSteven Seagal was made a Russian citizen in 2016 with President Vladimir Putin handing over Seagal his Russian passport\nFrom India's Easternmost Village to near LAC: Modi government paves way for 78-km Arunachal road\nThe Narendra Modi government on 1 February began the process to build a new road from Dong village to Jachep camp in Arunachal Pradesh, inviting bids to construct it within the next three years\nQuad agrees to leverage machine learning, related advanced technologies to enhance cybersecurity\nIn the longer term, the Group committed to leverage machine learning and related advanced technologies to enhance cybersecurity and establish secure channels for Computer Emergency Response Teams and private sector threat information sharing\nNepal could cut funds to provinces and local governments amid falling revenues\nThe economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis\nRelated Articles\nRelated Articles\nIMF team to visit 'cash-strapped' Pakistan to pave way for release of next tranche of its assistance package\nIMF team would be in Islamabad from 31 January to 9 February to hold talks with the officials over the implementation of its conditions attached with the assistance package\nPakistan economic crises set to deepen as IMF downgrades growth rate to 2%\nThe World Economic Outlook (WEO), which was released by the IMF earlier this week, has said that the growth of the global economy is projected to decline from an estimated 3.4% in 2022 to 2.9% this year.  It has then been predicted to improve to 3.1% in 2024\nPakistan imported $1.2 billion worth of cars in just six months despite economic crisis\nThe economy is suffering, but hefty spending on cars and other vehicle imports is raising a lot of questions about the government's policy of halting imports related to the industrial and commercial sectors\nICC rescinds demerit point given to Pindi Cricket Stadium\nThe ICC match referee had rated the Pindi pitch \"below average\" after England won the test match by 74 runs under dimming light on the last day by playing some attacking cricket.\nPakistan economic crisis: 10% cut in govt employees' salary under consideration\nPakistan is grappling with one of the country's worst economic crises in recent years amid dwindling foreign exchange reserves",
      "snippet": "... allegedly backing Russia's invasion of <b>Ukraine</b> Steven Seagal was made a ... further been hit by the <b>Ukraine</b> crisis Related Articles Related Articles IMF ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:00:20",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2023/02/Karachi-Ahmadi-mosque-vandalised.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/world/watch-jihadis-bring-down-hammer-and-tongs-on-ahmadi-mosque-in-pakistans-karachi-second-in-a-month-12097442.html"
      }
    },
    {
      "id": "5534718483397168839",
      "title": "Russian President draws parallel between WWII, Ukraine War",
      "url": "https://www.wionews.com/videos/russian-president-draws-parallel-between-wwii-ukraine-war-558496",
      "description": "Russian president drew parallels between the Soviet Union's fight in World War II and the ongoing Russia-Ukraine conflict. He compared the fighting to Nazi Germany's invasion and hinted that Moscow could use nuclear weapons.",
      "body": "Updated:\nFeb 03, 2023, 02:30 PM IST\nRussian president drew parallels between the Soviet Union's fight in World War II and the ongoing Russia-Ukraine conflict. He compared the fighting to Nazi Germany's invasion and hinted that Moscow could use nuclear weapons.",
      "snippet": "Russian president drew parallels between the Soviet Union's fight in World War II and the ongoing Russia-<b>Ukraine</b> conflict.\nHe compared the fighting to Nazi Germany's invasion and hinted that Moscow could use nuclear weapons.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-03T09:00:01",
      "provider": {
        "name": "wionews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "//cdn.wionews.com/sites/default/files/styles/story_page/public/2023/02/03/0302_WION_AS_putin_1PM-1675414808-00000003.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wionews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wionews.com/videos/russian-president-draws-parallel-between-wwii-ukraine-war-558496"
      }
    },
    {
      "id": "6286639595742159273",
      "title": "Anti-Ukrainian vandalism, harassment rising at Canadian universities, students say",
      "url": "https://www.cbc.ca/news/canada/ottawa/anti-ukrainian-hate-symbols-harassment-university-campuses-1.6733813?cmp=rss",
      "description": "Ukrainian students are facing an increase in anti-Ukrainian hate symbols and harassment on Canadian university campuses, student clubs say.",
      "body": "\nPosted: Feb 03, 2023 4:00 AM EST | Last Updated: 1 hour ago\nAnastasiia Kot, president of the Carleton Ukrainian Students' Club, says frustration among Ukrainian students has been going up.\n(Ben Andrews/CBC)\nUkrainian students are facing an increase in anti-Ukrainian hate symbols and harassment on Canadian university campuses, student clubs say.\nIn an open letter published last Thursday, the Carleton Ukrainian Students' Club described several incidents of anti-Ukrainian harassment that have taken place on the university's campus since September 2022, including multiple reports of hate graffiti, an allegation of verbal harassment and an on-campus panel discussion which the club views as pro-Russian.\nFrustration among Ukrainian students had been \"piling up for a while,\" said president of the club Anastasiia Kot, and Carleton is now one of several universities across the country where Ukrainian students are making those concerns public.\n\"It's anger that such people exist, such people that are members of our community,\" Kot said.\nIn the letter, Carleton's Ukrainian club said it was \"deeply perturbed\" by an increase in hate symbols on campus since the start of the fall term.\nThe letter pointed to three separate incidents of graffiti appearing on campus from September to October 2022. In each, a \"Z\" appeared next to the word \"Russia\" in Cyrillic script. The \"Z\" has\nbecome a symbol of support\nfor the Russian invasion of Ukraine and has appeared on Russian military vehicles.\nHow the letter Z has become a symbol of support for Russia's invasion of Ukraine\nThe club also objected to the hanging of a Russian flag in a dormitory window and detailed one account in which a Carleton student who was wearing a Ukrainian scrunchie on a campus elevator was allegedly told \"all Ukrainians should kill themselves.\"\nThe Ottawa Police Service (OPS) told CBC in an email it had opened an investigation into the Russian flag that was later closed \"due to a lack of evidence.\"\nOPS added it has not opened any further investigations into the issue.\nA Carleton University spokesperson said in an email to CBC that all incidents on campus \"have been and will continue to be taken seriously.\"\n\"The university does not tolerate any form of discrimination or harassment and acknowledges the important role we play in helping students and visitors to our campus feel safe, secure and supported,\" the spokesperson said.\nCarleton did not, however, confirm the number of unique reports of anti-Ukrainian graffiti it has received from students.\nThe university also did not address any of the specific allegations in the Ukrainian club's letter, nor did it say whether it would respond to the club's calls to action.\n'Rising issue' across the country, Ukrainian congress says\nIn its own open letter, the University of Victoria Ukrainian Students' Society alleged that some of its members were verbally accosted on campus and one member's property was defaced with the word \"Nazi.\"\nThe club also said that members of the Young Communist League of Canada, another ratified club at the university, accused Ukrainian students of supporting fascism and antisemitism in a Facebook post.\n\"As a result of the inaction of the UVSS [University of Victoria Student Society] and the university, anti-Ukrainian sentiment has been allowed to fester on campus,\" the club wrote.\nKevin Hall, president and vice-chancellor of the University of Victoria,\ninto the matter last Friday.\nThe Young Communist League did not respond to a request for comment.\nThe Russian flag flies at the country's embassy in Ottawa behind a street sign calling for a free Ukraine, installed on posts adjacent to the road as a gesture of solidarity by the City of Ottawa.\n(Justin Tang/The Canadian Press)\nOrest Zakydalsky, senior policy adviser with the Ukrainian Canadian Congress (UCC), said universities have a \"responsibility to provide a safe environment\" for their students.\n\"To the extent that they are failing to do that  and we see anti-Ukrainian graffiti, anti-Ukrainian attacks, that sort of thing  that is the responsibility of the universities,\" he said.\nZakydalsky added that although the UCC plans to contact universities about anti-Ukrainian harassment, the issue is not restricted to campuses.\n\"Since the full-scale invasion a year ago, our community has seen rising  physical attacks, vandalism, violence,\" he said. \"Across the country, it's been a rising issue.\"\nZakydalsky said the UCC has requested the federal government create a task force to address anti-Ukrainian attacks.\nControversy over panel discussion\nThe Carleton Ukrainian club also denounced a panel discussion held on the university's campus last week titled, The War in Ukraine: What is the Path to Peace?\nIt was organized by the Ottawa Peace Council, an advocacy group that favours disarmament and diplomatic solutions to conflict.",
      "snippet": "... for the Russian invasion of <b>Ukraine</b> and has appeared on Russian military ... of support for Russia's invasion of <b>Ukraine</b> The club also objected to the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T09:00:00",
      "provider": {
        "name": "cbc",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cbc.ca/1.6733853.1675373345!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/anastasiia-kot.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "cbc",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.cbc.ca/news/canada/ottawa/anti-ukrainian-hate-symbols-harassment-university-campuses-1.6733813?cmp=rss"
      }
    },
    {
      "id": "6264170143580832948",
      "title": "Trump calls for restraint in arming Ukraine  RT Russia & Former Soviet Union",
      "url": "https://www.rt.com/news/570894-trump-restraint-ukraine-support/",
      "description": "The US should exercise restraint in sending military aid to Ukraine, and focus instead on promoting diplomacy, Donald Trump has said",
      "body": "Russia & Former Soviet Union\nTrump calls for restraint in arming Ukraine\nThe US should send less military aid to Kiev and instead focus on a diplomatic solution to the conflict, the former president said\nFormer US President Donald Trump addresses the crowd during a 2024 election campaign event in Columbia, South Carolina, on January 28, 2023.\n\nLogan Cyrus / AFP\nThe US should do its best to pave the way for a peace settlement in Ukraine while scaling back the military assistance Washington is sending to Kiev, former President Donald Trump suggested on Thursday.\nDuring an interview with American radio talk show host Hugh Hewitt, Trump was asked whether he believed the US should send F-16 fighter jets to Ukraine to help in its fight with Russia. I think the United States should negotiate peace between these two countries, and I dont think they should be sending very much, the former president stated.\nHowever, he also complained that the US had committed much more resources to prop up Kiev than the EU has. The other thing is Europe has to do much more, because Europe is doing probably just a small fraction of what were doing, he said, explaining that the Ukraine crisis affects Europe more than it affects our country.\nTrump dodged the question when asked whether he wanted to completely cut off aid for Ukraine, stating instead that he wanted to make it so that Ukraine and Russia have to fight for the last day.",
      "snippet": "... in sending military aid to <b>Ukraine</b>, and focus instead on promoting ... Trump calls for restraint in arming <b>Ukraine</b> The US should send less military ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:59:42",
      "provider": {
        "name": "rt",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mf.b37mrtl.ru/files/2023.02/article/63dcc9b285f5403a062e3c09.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "rt",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.rt.com/news/570894-trump-restraint-ukraine-support/"
      }
    },
    {
      "id": "3838165269325430718",
      "title": "India's green energy moves get global platform as PM Modi to inaugurate India Energy Week on Feb 6",
      "url": "https://www.firstpost.com/india/indias-green-energy-moves-get-global-platform-as-pm-modi-to-inaugurate-india-energy-week-on-feb-6-12097472.html",
      "description": "It is for the first time India is organising such event, wherein a record number of CEOs from top energy companies are participating, according to sources",
      "body": "Most Read\nMost Read\nWATCH: Jihadis bring down hammer and tongs on Ahmadi mosque in Pakistan's Karachi; 2nd in a month\nViral videos of the discretion show four men, covering their face and wearing helmets, climbing on the mosque and escaping thereafter\nHollywood action hero Steven Seagal censored for allegedly backing Russia's invasion of Ukraine\nSteven Seagal was made a Russian citizen in 2016 with President Vladimir Putin handing over Seagal his Russian passport\nFrom India's Easternmost Village to near LAC: Modi government paves way for 78-km Arunachal road\nThe Narendra Modi government on 1 February began the process to build a new road from Dong village to Jachep camp in Arunachal Pradesh, inviting bids to construct it within the next three years\nQuad agrees to leverage machine learning, related advanced technologies to enhance cybersecurity\nIn the longer term, the Group committed to leverage machine learning and related advanced technologies to enhance cybersecurity and establish secure channels for Computer Emergency Response Teams and private sector threat information sharing\nNepal could cut funds to provinces and local governments amid falling revenues\nThe economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis\nRelated Articles\nRelated Articles\nRussia: Sergey Lavrov to participate in G20 foreign ministers meeting in India on March 1-2\n\"Our foreign minister will take part in the meeting of G20 foreign ministers in New Delhi on March 1-2,\" Russian Deputy Foreign Minister Andrey Rudenko said\nJaishankar calls naming of islands in Andaman and Nicobar after Param Vir Chakra awardees \"much needed initiative'\nTaking to his Twitter handle, Jaishankar stressed that PM Modi's decision honours those who had made sacrifices to protect the nation\nIndia, Egypt decide to elevate ties to strategic partnership\nAfter his wide-ranging talks with Sisi, PM Modi said the two sides were unanimous in their view that terrorism is the most serious security threat to humanity and that they agreed that concrete measures are needed to end cross-border terrorism\nBudget 2023: 'India's budget will be ray of hope for world,' says PM Modi\nThe prime minister said the Budget, to be presented by Finance Minister Nirmala Sitharaman on Wednesday, will strive to fulfil people's hopes, aspirations and also boost the hopes with which the world is looking at India\nYes, BBC hates India, but know that its India-hate is a money strategy\nWith its public funding drying up fast amid serious stigma of a strong left-liberal bias, the BBC has been trying to break ground into hitherto not-so-seriously explored markets, such as India",
      "snippet": "... allegedly backing Russia's invasion of <b>Ukraine</b> Steven Seagal was made a ... further been hit by the <b>Ukraine</b> crisis Related Articles Related Articles ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:50:13",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2023/02/PM-Modi-Session1.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/india/indias-green-energy-moves-get-global-platform-as-pm-modi-to-inaugurate-india-energy-week-on-feb-6-12097472.html"
      }
    },
    {
      "id": "9194726247652030996",
      "title": "Ukraine War: Kyiv hopes new weaponry can tip the balance in Bakhmut",
      "url": "https://www.euronews.com/2023/02/03/ukraine-war-kyiv-hopes-new-weaponry-can-tip-the-balance-in-bakhmut",
      "description": "The newly elected Czech president, a former NATO general, is calling on Ukraine's allies to do more. And now the question of sending fighter jets has entered the debate.",
      "body": "Share\nAs Russias invasion of Ukraine nears the one-year mark, the few remaining residents of the Ukrainian city of Bakhmut are struggling to survive.\nThere are currently around 7,000 people still living in the city, which has seen the majority of its 75,000 population flee.\nFighting on the frontlines has stalled for many recent weeks  but Kyiv hopes that new military artillery promised by its Western allies will tip the balance in its favour.\nAdvancement from either side is also partly down to the destruction of key infrastructure. On the Kherson front, Ukrainian soldiers train while searching for a way to cross the Dnipro River without suffering excessive casualties.\n\"Everything is because of the river, there are no bridges, it is hard to cross it\" says Sergiy, a soldier, \"during water crossing, 50 per cent of personnel could be lost. We do not want this.\"\nThe newly elected Czech president, Petr Pavel, is calling on Ukraine's allies to do more. \"I think we should be able to provide Ukraine with all the weapons it needs to resume control over its own territory\", the former NATO general said.\nPetr Pavel: Ukraine supporter and military hero who swept to the Czech presidency\nBen Wallace: UK 'not ruling out' sending jets to Ukraine\nThe UK defence minister on Thursday said he did not rule out supplying Ukraine with fighter jets while cautioning they would not be a \"magic wand\" in the war.\nBen Wallace told journalists: \"On the process of jets, I've been pretty clear. One thing I've learned over the last year is don't rule anything in, don't rule anything out.\"\nKyiv has requested American-made F-16 warplanes to help repel the Russian invasion.\nThe United States has ruled out any deliveries of F-16s to Ukraine for now, but other partners including Poland have shown themselves more open to the idea.\n\"It's easy to sort of get carried away and, you know, last week we gave tanks and what next can we promise,\" Wallace said.  \"There are things to promise next and, and you know, I've said in the Chamber of the House of Commons, I'm very open to examining all sorts of systems and not just jets to give Ukraine that assistance. But these things don't always happen overnight.\"\nKyiv Cracks down on corruption\nMeanwhile, Ukrainian authorities are cracking down on corruption within agencies managing funds intended to assist victims of war.\nA number of officials in Odesa have been arrested for defrauding the state of nearly 175,000.\nThe suspects included the former deputy head of the regional military administration, a deputy of the regional council, and a third high-ranking official, police said.\nUkraine has ramped up anti-corruption efforts in recent days ahead of a high-level meeting with EU officials. Ukraine is hoping to join the EU after having its candidacy fast-tracked and is keen to demonstrate its ability to tackle corruption  one of the EUs demands.\nAdditional sources\nCopy/paste the article video embed link below:\nCopy",
      "snippet": "Share As Russias invasion of <b>Ukraine</b> nears the one-year mark, the few remaining residents of the Ukrainian city of Bakhmut are struggling to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:43:51",
      "provider": {
        "name": "euronews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.euronews.com/articles/stories/07/36/94/58/1000x563_cmsv2_c30e8f0c-63f6-5bff-95e9-87672bd165e0-7369458.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "euronews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.euronews.com/2023/02/03/ukraine-war-kyiv-hopes-new-weaponry-can-tip-the-balance-in-bakhmut"
      }
    },
    {
      "id": "8358063399840624697",
      "title": "Why battle tanks from NATO countries for Ukraine may not spark an immediate NATO-Russia confrontation",
      "url": "https://www.moneycontrol.com/news/opinion/why-battle-tanks-from-nato-countries-for-ukraine-may-not-spark-an-immediate-nato-russia-confrontation-9998611.html/amp",
      "description": "The US weapons commitments arent enough to bolster Ukraines strike capabilities and require time, training and maintenance for operationalisation. So Russia could desist from upping the ante",
      "body": "The recent decision of some NATO countries to supply Ukraine with tanks and other higher level equipment raises two questions. First, will this significantly enhance Kyivs capabilities and allow it to snatch back the initiative in the conflict; and second, could this result in escalation that leads to NATOs direct involvement in the war or worse?Germany and the United States announced last week that they would supply their main battle tanks (MBTs) to Ukraine. Germany will provide 14 Leopard 2 tanks, while the US will send 31 Abrams M-1 tanks. Several European countries  Poland, Spain, Netherlands, Norway and Finland  have also said that they will give some Leopard 2 tanks to Kyiv. In addition, the United Kingdom has said it would supply a few Challenger tanks.Too Few For OffensivesAlthough the US tanks are probably the best in the world, the relatively small numbers of the Abrams and Leopards are unlikely to contribute to Ukraine making any significant breakthrough in getting back the initiative in the war with Russia. But they could improve Ukraines ability to resist Russian advances and make it more difficult for Russia to achieve its goals.First, the numbers are insufficient to create a strike force on their own that could pierce Russian defences, even in a region like Kherson where the distance to the regional capital is less than one hundred kilometres from the frontline. An additional complication is that the Abrams consumes about two gallons of jet fuel per mile whether moving or idling. This will require a very efficient fuel supply system to wherever they are deployed.Second, the tanks are unlikely to arrive at the battle front for at least three months if not longer, given the need to train Ukrainian servicemen to use these military machines. Some US veterans have suggested that it will require a crew about a year of training to use the Abrams tank effectively.                Related stories                Global markets seeing short-covering bounce, will gain further strength: Atul SuriNetwork18 Exclusive | Most risks to Indias growth from external factors: CEA NageswaranWorld food prices decline for 10th month running in January, says FAO Third, Ukraine lacks the necessary wherewithal to maintain these tanks operational, even in terms of minor repairs. A US official recently told reporters that the Abrams is complicated, expensive, difficult to maintain and hard to train on. He added that the US felt that we should not be providing the Ukrainians systems they cant repair, they cant sustain, and that they, over the long term, cant afford, because its not helpful.Nuclear Fears RecedeAnother fear is, given Ukraines notoriously corrupt system, that advanced weapons could fall into the wrong hands. In this context, the recent dismissal by Ukrainian President Volodymyr Zelensky of several officials on suspicion of corruption is not an encouraging sign.The US decision to supply tanks is part of a package that includes 59 Bradley Fighting Vehicles, 90 Stryker armoured combat vehicles, and 350 Humvees. There are reports that the US is also considering the supply of longer range rockets. Considered along with the earlier announcement about the supply of Patriot systems, it appears the decision on tanks is an indication of the Wests shift on what it thinks could provoke Russia to escalate the conflict.Till recently the fear of Russias tactical nuclear weapons determined the cautious approach to the kind of military equipment the West supplied to Ukraine. But for some, so far unclear, reason those fears have receded prompting the West to upgrade the kind of weaponry it is providing to Kyiv.While it is difficult to clearly determine what exactly Russia will consider an escalation that crosses its red lines, so far the Russian reaction to the announcements of upgraded weapons supplies has been surprisingly muted.A War Of Attrition?It could indicate that the Russians understand that these platforms are not arriving immediately and hope to favourably change the ground situation before the upgraded weapons are deployed in Ukraine. On the other hand it could imply that the Russian leadership is prepared for the long haul in this war of attrition.Whatever the calculations on both sides  the US-led West or Russia  it should be clear that quantitative and qualitative enhancements of conventional weapons by both sides in Ukraine is not likely to bring an end to the war. Neither is Russia likely to capture Kyiv soon, nor is Ukraine liberating Crimea ever likely.That either side will achieve a clear-cut victory on the battlefield appears today to be remote. Hence, the best way to end the war will be through negotiations. It is difficult to imagine today the contours of any final resolution. But for needless suffering in Ukraine and across the world to end quickly, diplomacy needs to be engaged immediately.Nandan Unnikrishnan is a Distinguished Fellow at Observer Research Foundation. Views are personal and do not represent the stand of this publication.",
      "snippet": "The recent decision of some NATO countries to supply <b>Ukraine</b> with tanks and other higher level equipment raises two questions. First, will this ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-03T08:38:41",
      "provider": {
        "name": "moneycontrol",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.moneycontrol.com/static-mcnews/2022/04/1-50days-of-ukraine-war.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "moneycontrol",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.moneycontrol.com/news/opinion/why-battle-tanks-from-nato-countries-for-ukraine-may-not-spark-an-immediate-nato-russia-confrontation-9998611.html/amp"
      }
    },
    {
      "id": "1004680444228653414",
      "title": "1K Journalists Have Fled Russia Since Ukraine Invasion Report",
      "url": "https://www.themoscowtimes.com/2023/02/03/1k-journalists-have-fled-russia-since-ukraine-invasion-report-a80135",
      "description": "At least 1,000 Russian journalists have fled their country in the nearly 12 months since Moscow invaded Ukraine, according to a newreport on the state of the internet in Russia.",
      "body": "Read more\nTogether with those who have launched their own news channels on social media, the exiled Russian journalists have formed a second Runet free of state censorship, the report said, using a common term for the Russian-language internet.\nIn its report titled Two Runets, Net Freedoms Project listed at least 12 Russian media projects that have been created outside Russia since the country effectively outlawed independent war coverage shortly after invading Ukraine.\nIt was clear that an office and editorial board in Russia were not a prerequisite for a Russian audience and for covering the Russian agenda, the project said.\nIt named YouTube and the Telegram messaging app as the last remaining platforms where Russians retain unrestricted access to independent projects.\nBut the Net Freedoms Project also highlighted issues Russian journalists face in exile, the most pressing of which are financial hardships associated with increased costs and reduced online monetization opportunities.\nTop bloggers revenues could have been reduced by up to 90%, said the project run by lawyers Damir Gainutdinov and Stanislav Seleznyov.\nRead more about:",
      "snippet": "... have fled their country in the nearly 12 months since Moscow invaded <b>Ukraine</b>, according to a newreport on the state of the internet in Russia.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:37:00",
      "provider": {
        "name": "themoscowtimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.themoscowtimes.com/image/og/fb/80135__fb54e1cc410e852bbaca827fc5d831bd.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themoscowtimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themoscowtimes.com/2023/02/03/1k-journalists-have-fled-russia-since-ukraine-invasion-report-a80135"
      }
    },
    {
      "id": "7904961527947017352",
      "title": "Drought Threatens U.S. Wheat Production Despite Acreage Bump",
      "url": "https://www.esmmagazine.com/retail/drought-threatens-u-s-wheat-production-despite-acreage-bump-231914",
      "description": "U.S. farmers expanded plantings of winter wheat by 11% from a year ago to an eight-year peak, encouraged by high prices tied to concerns over food supplies foll...",
      "body": "Share this article\nShare this article\nU.S. farmers expanded plantings of winter wheat by 11% from a year ago to an eight-year peak, encouraged by high prices tied to concerns over food supplies following Russia's invasion of major wheat producer Ukraine, as well as relatively low input costs and expanded crop insurance programs.\nBut even with the added acres, a multi-year drought that has gripped the key Plains wheat belt puts harvest prospects in doubt, especially in states like top producer Kansas and Oklahoma, the No. 3 winter wheat producer last year.\nAn uptick in precipitation in recent days is helpful but won't be enough to revive the crop, experts say.\n'Unlikely To Improve'\nAs a result, U.S. wheat exports, projected at a 51-year low in the marketing year begun June 1, 2022, are unlikely to improve significantly in the next season despite efforts from the Biden administration to increase U.S. food production after the Ukraine war.\nWinter wheat typically represents about two-thirds of U.S. production, with the remainder planted in the spring, and the U.S. has lost market share to other wheat exporters, including Russia, in recent years.\n\"Because the crop was planted so late, and it's stressed due to lack of moisture, we probably are going to see a yield drag,\" said Mike Schulte, executive director of the Oklahoma Wheat Commission.\nThe crop was planted last fall and lies dormant over the winter, awaiting spring rains that will be crucial in determining whether farmers commit to harvest the crop or cut their losses and terminate the wheat to plant something else.\nCondition Ratings\nMonthly condition ratings for winter wheat declined sharply in Oklahoma during January, although ratings inched higher in top producer Kansas, the U.S. Department of Agriculture said on Monday.\nUnusually high wheat prices this fall inspired farmers to expand acres, notably in the Midwest, a secondary wheat-producing region that grows soft red winter wheat variety used to make cookies and snack foods. U.S. soft red wheat acres rose by 20% year-on-year and planting jumped by 45% in Illinois, the No. 8 U.S. winter wheat state by acreage.\n\"We are up on acres because we sold (wheat) last year for $10 to $11 per bushel; we haven't done that in my lifetime,\" said Illinois farmer David Justison, who increased his wheat plantings by about 25% for 2023, to 1,530 acres.\nAs an added incentive, the Biden administration last July expanded the number of U.S. counties where farmers can obtain crop insurance on a second crop planted after wheat  typically soybeans in the Midwest, or sorghum in the western Plains.\nWith the expanded \"double-crop\" coverage options in 1,500 counties, \"Guys might be encouraged to plant a little more wheat,\" said Eric Brammeier, an agent with Illinois-based SC Crop Insurance.\nDrought And Snow\nWhile soft wheat in the Midwest is off to a good start, crops are struggling with drought in the much larger wheat states of the Plains, where farmers grow hard red winter wheat, the largest U.S. wheat class, used to make bread.\nOngoing drought in the Plains actually contributed to the 10% jump in hard red winter wheat plantings for 2023 by freeing up acres where corn or sorghum crops failed last summer, said Lucas Haag, an extension agronomist at Kansas State University.\nSimilarly, Haag, said, if the current drought persists into springtime, Plains farmers might skip planting corn and sorghum altogether in 2023 and wait to plant winter wheat this coming fall, for harvest in 2024.\n\"If we don't get significant moisture ... I think farmers may elect to fallow some of that ground,\" Haag said. \"We could see wheat acres tick up again for the 2024 crop,\" he said.\nSeveral inches of snow fell recently in northwest Kansas, Nebraska and Colorado, providing an insulating blanket against frigid temperatures this week that could have otherwise damaged crops. The dormant wheat will benefit from the moisture in the snow, although the crop will require much more precipitation as it resumes growing in the spring.\nFarmers will be watching to see if the expected departure of the current La Nina weather phenomenon, which tends to exacerbate drought in the Plains, will help.\nSaid Schulte, \"We are certainly going to need moisture if we are going to have any crop at all.\"\nNews by\nBy signing up you are agreeing to our\nTerms & Conditions\nPrivacy Policy\nEnjoy unlimited digital access for 30 days\nGet exclusive access to the latest grocery retail & FMCG news, interviews with industry leading executives, and expert analysis on the trends shaping the sector today\nSubscribe now\nEnjoy unlimited digital access for 30 days\nClaim this offer\nEnjoy unlimited digital access for 30 days\nGet exclusive access to the latest grocery retail & FMCG news, interviews with industry leading executives, and expert analysis on the trends shaping the sector today\nSubscribe now\nEnjoy unlimited digital access for 30 days\nClaim this offer",
      "snippet": "... over food supplies following Russia's invasion of major wheat producer <b>Ukraine</b>, as well as relatively low input costs and expanded crop insurance ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:34:57",
      "provider": {
        "name": "esmmagazine",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://img.resized.co/esmmagazine/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL21lZGlhLm1hZGlzb25wdWJsaWNhdGlvbnMuZXVcXFwvdXBsb2Fkc1xcXC8yMDIyXFxcLzAzXFxcLzE1MDgyMzI1XFxcL3doZWF0LWdkODg0OGJmYzhfMTI4MC0xMDI0eDY4MC5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjkwMCxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvaW1nLnJlc2l6ZWQuY29cXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6IjI5MzVjZmYwNTg1OGJhZmJjZDg3NjBiMjNiMTYwMzAyNDU4NGIwNjIifQ==/wheat-gd8848bfc8-1280-1024x680.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "esmmagazine",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.esmmagazine.com/retail/drought-threatens-u-s-wheat-production-despite-acreage-bump-231914"
      }
    },
    {
      "id": "4070851815430542509",
      "title": "Completely deluded: PM slams Putin over Nazi remarks",
      "url": "https://www.perthnow.com.au/news/completely-deluded-pm-slams-putin-over-nazi-remarks-c-9645161",
      "description": "The Russian President compared his nations invasion of Ukraine to defending against Nazi Germany, as German tanks support Ukraine.",
      "body": "World News\nThe Prime Minister says Vladimir Putin is completely deluded to compare his invasion of Ukraine with Russias defence against Nazi Germany in World War II.\nVladimir Putin made the comments in a speech celebrating the 80th anniversary of the Soviet victory over the Nazis at Stalingrad, now known as Volgograd, in World War Two to take a jab at Germany.\nAnthony Albanese says Putins invasion of the sovereign nation of Ukraine a year ago was illegal and premeditated.\nThere are all sorts of excuses he will come up, but the regime in the region that doesnt support democracy and supports authoritarianism is his own, said Mr Albanese told Sky News on Friday.\nCamera Icon\nPrime Minister Anthony Albanese met with state and territory leaders in Canberra on Friday morning. NCA NewsWire / Gary Ramage\nCredit:\nNews Corp Australia\nIf he wants to look for authoritarianism, then he should look in the mirror. And that's why Australia stands with Ukraine.\nPutin made the speech this week, continuing his frequent characterisation of Ukraine as a hotbed of neo-Nazi beliefs, although Ukrainian President Volodymyr Zelenskyy is of Jewish descent.\nThe ideology of Nazism in its modern form and manifestation again directly threatens the security of our country, said Mr Putin.\nAgain and again we have to repel the aggression of the collective West.\nIts incredible but its a fact: we are again being threatened with German Leopard tanks with crosses on them.\nAustralian Defence Force personnel are training Ukrainian soldiers in England. Australia has also just signed an agreement with France to provide even more military support to the embattled eastern European nation.\nDespite this, Ukraine continues to ask for support in the form of tanks to help fend off Russian attacks.\nAsked about the matter, the Prime Minister said hes open to further support, but noted the support provided already has been substantial.\nThis is a bipartisan issue. The former government also provided support ... before the last election, and they have supported all the measures that were put in place, he said.\nOriginally published as",
      "snippet": "... Minister says Vladimir Putin is completely deluded to compare his invasion of <b>Ukraine</b> with Russias defence against Nazi Germany in World War II.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-03T08:33:02",
      "provider": {
        "name": "perthnow",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.perthnow.com.au/publication/C-9645161/eb5d2a729e47b422c2532a52184aa018f4c18c56-16x9-x0y0w2048h1152.jpg?imwidth=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "perthnow",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.perthnow.com.au/news/completely-deluded-pm-slams-putin-over-nazi-remarks-c-9645161"
      }
    },
    {
      "id": "7613160767728640243",
      "title": "Benjamin Netanyahu meets Emmanuel Macron in Paris, discusses ways to confront Iranian nuclear threat",
      "url": "https://www.firstpost.com/world/benjamin-netanyahu-meets-emmanuel-macron-in-paris-discusses-ways-to-confront-iranian-nuclear-threat-12097352.html",
      "description": "Benjamin Netanyahu and Emmanuel Macron discussed the regional arena and the need to maintain regional stability, especially in Lebanon, and opportunities to expand the circle of peace",
      "body": "Most Read\nMost Read\nWATCH: Jihadis bring down hammer and tongs on Ahmadi mosque in Pakistan's Karachi; 2nd in a month\nViral videos of the discretion show four men, covering their face and wearing helmets, climbing on the mosque and escaping thereafter\nHollywood action hero Steven Seagal censored for allegedly backing Russia's invasion of Ukraine\nSteven Seagal was made a Russian citizen in 2016 with President Vladimir Putin handing over Seagal his Russian passport\nFrom India's Easternmost Village to near LAC: Modi government paves way for 78-km Arunachal road\nThe Narendra Modi government on 1 February began the process to build a new road from Dong village to Jachep camp in Arunachal Pradesh, inviting bids to construct it within the next three years\nQuad agrees to leverage machine learning, related advanced technologies to enhance cybersecurity\nIn the longer term, the Group committed to leverage machine learning and related advanced technologies to enhance cybersecurity and establish secure channels for Computer Emergency Response Teams and private sector threat information sharing\nNepal could cut funds to provinces and local governments amid falling revenues\nThe economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis\nRelated Articles\nRelated Articles\nFrench President Emmanuel Macron says fighter jets for Ukraine 'not excluded\nGerman Chancellor Olaf Scholz agreed on Wednesday to send 14 Leopard 2 tanks to Ukraine and to allow other European countries to send theirs, after weeks of intense debate and mounting pressure from allies\n'Technology cannot grow without democracy': High-tech workers protest against Israeli judicial reform plan\nRoughly 500 high-tech workers briefly left work Tuesday to protest the reforms, arguing the industry would suffer if foreign firms lost confidence in Israel's legal system and democratic principles\nFrench President Emmanuel Macron meets Spanish PM Pedro Snchez to sign friendship treaty\nSnchez and Macron are to sign a Treaty of Friendship and Cooperation between their countries. Both governments consider this a diplomatic bond of the highest order. Spain only has a similar treaty with Portugal; France has them with Germany and Italy\nMacron vows to proceed with pension reform, despite massive nationwide strikes\nHundreds of thousands took to the streets of Paris and other French cities on Thursday against planned pension reforms that would raise the retirement age, on a day of nationwide strikes and protests seen as a major test for Emmanuel Macron and his presidency\nProtests against Macron's pension reforms sweep France, over million workers take to streets\nThe pensions plan, presented by Macron's government last week, would raise the retirement age for most from 62 to 64 and would increase the years of contributions required for a full pension. Almost one public-sector worker in three was on strike against the reforms by midday on Thursday",
      "snippet": "... invasion of <b>Ukraine</b> Steven Seagal ... by the <b>Ukraine</b> crisis Related ... fighter jets for <b>Ukraine</b> 'not excluded German ... 2 tanks to <b>Ukraine</b> and to allow ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:31:24",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2023/02/Netanyahu-and-Macron1.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/world/benjamin-netanyahu-meets-emmanuel-macron-in-paris-discusses-ways-to-confront-iranian-nuclear-threat-12097352.html"
      }
    },
    {
      "id": "2302139387867211294",
      "title": "Best Bets for Things to See and Do in Columbus in February",
      "url": "https://www.columbusmonthly.com/story/lifestyle/around-town/2023/02/01/best-bets-for-things-to-see-and-do-in-columbus-in-february-2023/69860611007/",
      "description": "Lviv National Philharmonic Orchestra of Ukraine, Adam Sandler, SZA and more top choices for the month",
      "body": "denison.edu/series/vail\nFeb. 7 | Adam Sandler\nThe comic star returns to Columbus on the heels of another surprising dramatic performance (Hustle) and ahead of his Mark Twain Prize ceremony in March. At this Nationwide Arena show, expect more goofy charm than gravitas, of courseand perhaps a few tears courtesy of the Chris Farley Song.\nnationwidearena.com\nFeb. 7 | Jamila Minnicks\nGramercy Books, in partnership with the King Arts Complex and Ohio State Universitys Department of History, brings Jamila Minnicks, award-winning author of the novel Moonrise Over New Jessup, to its Bexley bookshop for a conversation with OSU historian and civil rights scholar Hasan Jeffries.\ngramercybooksbexley.com/events\nFeb. 1826 | Home & Garden Show\nThe Columbus Dispatch Spring Home & Garden Show returns to the Ohio Expo Center. The 67th annual extravaganza will include the ever-popular landscaping installations, this year with an enchanted garden theme, as well as an Art Park feature, 250-plus local businesses and more.\ndispatchhomeandgardenshow.com\nFeb. 21 | SZA\nFollowing up on her groundbreaking 2017 debut, CTRL, SZA issued blockbuster sophomore album SOS in December, which landed the singer her first No. 1 album on the Billboard 200 chart and the biggest streaming week ever for an R&B album. Columbus is fortunate to host this pop stars tour kickoff at the Schottenstein Center.\nGive Back\nFeb. 25 | WesterBall 2023\nThe cultural gala, featuring arts and music programming at Otterbein Universitys the Point, raises money for the Arts Council of Westerville and its goal of establishing a cultural arts center in the suburb.\nartscouncilofwesterville.com\nFeb. 27March 6 | Buckeye Cruise for Cancer\nSupporting the Ohio State University James Cancer Hospital, this seven-night cruise begins in San Juan, Puerto Rico, with stops at St. Kitts, St. Lucia and other Caribbean locales.\nONGOING\nThe Period Pantry\nThis nonprofit, which focuses on eradicating period poverty, is looking for volunteers to host online fundraisers, sort menstruation products into supply kits and deliver those kits to people in need.",
      "snippet": "Lviv National Philharmonic Orchestra of <b>Ukraine</b>, Adam Sandler, SZA and more top choices for the month. Adam Sandler The comic star returns to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:30:00",
      "provider": {
        "name": "columbusmonthly",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.gannett-cdn.com/presto/2022/04/04/USAT/b8130fe2-1d3f-4181-8283-7355434db1b6-sza.jpg?crop=3074,1730,x0,y451&width=3074&height=1730&format=pjpg&auto=webp",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "columbusmonthly",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.columbusmonthly.com/story/lifestyle/around-town/2023/02/01/best-bets-for-things-to-see-and-do-in-columbus-in-february-2023/69860611007/"
      }
    },
    {
      "id": "854797454985585389",
      "title": "Russian Imports Rebound as Economy Looks Set for Growth",
      "url": "https://www.newdelhitimes.com/russian-imports-rebound-as-economy-looks-set-for-growth",
      "description": "After struggling through much of 2022 under heavy international sanctions, the Russian economy has rebounded in recent months, as importers found new avenues of trade to bring consumer goods and other products into the country. An International Monetary Fund report issued this week said the Russian economy would likely grow...",
      "body": "February 3, 2023\nShare\nAfter struggling through much of 2022 under heavy international sanctions, the Russian economy has rebounded in recent months, as importers found new avenues of trade to bring consumer goods and other products into the country.\nAn International Monetary Fund report issued this week said the Russian economy would likely grow by 0.3% in 2023, rather than shrinking by 2.3% as it had previously projected.\nThe United States and its allies reacted to Russias invasion of Ukraine in February 2022 with a harsh regime of sanctions and export controls that many expected to collapse the Russian economy. In addition, many international businesses sharply reduced their sales to Russia, while others ceased doing business in the country entirely.\nNew research suggests that alternate supply routes and the ability to substitute goods made in Russia-friendly countries, like China, for Western-made alternatives have brought Russian imports back to prewar levels.\nExperts noted that the need to transship Western products through friendly third countries has driven up the prices Russians pay for many goods. Additionally, in many cases, Russians are being forced to settle for some lower-quality substitutes, especially in the consumer electronics space.\nHowever, the possibility that widespread shortages within Russia will force the Kremlin to give up on its invasion of Ukraine in the near term looks increasingly remote.\nMain goal of sanctions\nWestern sanctions on Russia were aimed primarily at the Russian military and were meant to make it difficult for the Kremlin to access the supplies and equipment, particularly advanced technology like microprocessors, necessary for the war effort in Ukraine.\nThe Russian sanctions are not comprehensive, Jeffrey J. Schott, a senior fellow at the Peterson Institute for International Economics, told VOA. They are designed to impair Russias military capability and make it difficult for the Russian regime to continue its military effort, both because of lack of resources over time, and because of growing civilian discontent.\nRussia has been allowed to continue selling many of its main export goods into the global market, including oil, gas, coal, fertilizers, uranium and food, providing cash to fund imports.\nIn addition to export controls on specific products, the U.S. and its allies levied significant sanctions on the Russian financial sector. This had the effect of complicating many trade-related transactions for products that were not, themselves, subject to sanctions.\nExperts said that much of the rebound in trade volume has been the result of merchants finding viable workarounds that allow them to finance the flow of non-sanctioned goods.\nRebounding imports\nA recent report from the Silverado Policy Accelerator, a Washington nonprofit, found that while Russian imports plummeted in the months immediately after the invasion, the dollar value of imports had rebounded to near pre-war levels by September.\nIn the 12 months beginning in October 2021, exports to Russia from the European Union fell by $4.6 billion, or 52%. The U.S. and the United Kingdom, which had far less trade with Russia to begin with, nevertheless cut their exports to the country by 85% and 89%, respectively.\nAccording to Silverado, the difference was made up by a number of countries that dramatically increased their exports to Russia, including China, Belarus, Turkey, Kazakhstan, Kyrgyzstan, Armenia and Uzbekistan.\nAdditionally, the report found, Exports from many other countries rebounded from their spring 2022 lows, and some post-Soviet states increased their trans-shipments of goods produced by multinational firms that no longer export the goods directly to Russia.\nFor example, the report documents that after Apple and Samsung, two of the worlds largest makers of smartphones, stopped delivering their products to Russia, orders for their products eventually surged in Armenia and Kazakhstan, with the phones being shipped on to Russia.\nLeakage expected\nExperts said that while Russian imports of consumer goods may be approaching prewar levels, the blockade on military goods and advanced technology is still working reasonably well, if not perfectly.\nSchott, of the Peterson Institute, said that sanctions are not waterproof and that all sanctions regimes experience some leakage.\nThe longer sanctions are in place, the more time there is to try to figure out and negotiate workarounds  that happens everywhere, he said. If theres enough economic incentive, people will take risks to profit from sanctions evasion.\nHowever, when it comes to military and high-tech gear, Schott said, Im not sure the leakage is comparable to what has happened in previous cases that have existed over time. I havent seen evidence of extensive violation of the sanctions.\nMeasuring effectiveness\nBryan Early, a professor of political science at the State University of New York at Albany, told VOA that even if some sanctioned products are making it through to Russia, the sanctions appear to have been broadly effective in that they have made it more difficult and expensive for Russia to acquire what it needs to continue to prosecute the war.\nSanctions are never going to be perfect, he said. Your baseline is not, Do they disrupt everything? Its, If the sanctions werent in place, how easily would these transactions be taking place? And how much more cheaply would they be taking place? And how much more reliable would those trade networks actually be?\nEarly referred to U.S. intelligence reports from last year that said Russia had been scavenging microchips from household appliances for use in military equipment.\nIf one of the ways that the Russian government is getting around the multilateral sanctions on semiconductors is by importing additional washing machines through third parties, like Georgia, to use in their military products, yes, thats a sign that sanctions are being evaded, he said.\nBut its also a sign that the sanctions are working very, very well, if the worlds second-largest largest military is importing semiconductors from washing machines through small regional neighbors, he said.\nNew sanctions\nOn Wednesday, in a sign of some sanctions leakage, the U.S. Treasury Department barred trade with 22 individuals and companies that it accused of helping Russias military evade sanctions. The move was part of an ongoing effort to methodically and intensively target sanctions evasion efforts around the globe, close down key backfilling channels, expose facilitators and enablers, and limit Russias access to revenue needed to wage its brutal war in Ukraine, the department said in a press release.\nAmong others, the sanctions targeted Russian arms dealer Igor Zimenkov and his son, Jonatan Zimenkov, as well as several entities the department characterized as front companies that do business with the Zimenkovs.\nRussias desperate attempts to utilize proxies to circumvent U.S. sanctions demonstrate that sanc",
      "snippet": "The United States and its allies reacted to Russias invasion of <b>Ukraine</b> in February 2022 with a harsh regime of sanctions and export controls that ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:30:00",
      "provider": {
        "name": "newdelhitimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/www.newdelhitimes.com/wp-content/uploads/2023/02/06a20000-0aff-0242-cd52-08db057f81a9_w1023_r1_s.webp?fit=1023%2C575&ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newdelhitimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newdelhitimes.com/russian-imports-rebound-as-economy-looks-set-for-growth"
      }
    },
    {
      "id": "5916447791643232404",
      "title": "US to send Ukraine longer-range bombs in latest turnaround",
      "url": "https://kashmirreader.com/2023/02/03/us-to-send-ukraine-longer-range-bombs-in-latest-turnaround/",
      "description": "Washington: After months of agonizing, the U.S has agreed to send longer-range bombs to Ukraine as it prepares to launch a spring offensive to retake territory Russia captured last year, U.S. officials said Thursday, confirming that the new weapons will have roughly double the range of any other offensive weapon provided by America.The U.S. will provide ground-launched small diameter bombs",
      "body": "Print This Post\nWashington: After months of agonizing, the U.S has agreed to send longer-range bombs to Ukraine as it prepares to launch a spring offensive to retake territory Russia captured last year, U.S. officials said Thursday, confirming that the new weapons will have roughly double the range of any other offensive weapon provided by America.\nThe U.S. will provide ground-launched small diameter bombs as part of a\n2.17 billion aid package it is expected to announce Friday, several U.S. officials said. The package also for the first time includes equipment to connect all the different air defense systems Western allies have rushed to the battlefield and integrate them into Kvivs own air defenses, to help them better defend against Russias continued missile attacks.\nFor months, U.S. officials have hesitated to send longer-range systems to Ukraine out of concern that they would be used to target inside Russia, escalating the conflict and drawing the U.S. deeper in. The longer-range bombs are the latest advanced system, such as Abrams tanks and the Patriot missile defense system, that the U.S. has eventually agreed to provide Ukraine after initially saying no. U.S. officials, though, have continued to reject Ukraines requests for fighter jets.\nUkrainian leaders have urgently pressed for longer-range munitions and on Thursday, officials said the U.S. will send an undisclosed number of the ground-launched, small diameter bombs, which have a range of about 95 miles (150 kilometers). The officials spoke on condition of anonymity to discuss details of the aid package not yet made public.\nTo date, the longest-range missile provided by the U.S. is about 50 miles (80 kilometers). The funding in the aid package is for longer-term purchases, so it wasnt clear Thursday how long it will take to get the bomb to the battlefield in Ukraine.\nUkraines defense minister Oleskii Reznikov said Thursday the country is prepared to offer guarantees to its Western partners that their weapons wont be used to strike inside Russian territory, adding that Kyiv needs weapons with the range of up to 300 kilometers (186 miles) to expel the Russian forces.\nIf we could strike at a distance of up to 300 kilometers, the Russian army wouldnt be able to mount a defense and will have to withdraw, Reznikov said at a meeting with EU officials. Ukraine is ready to provide any guarantees that your weapons will not be involved in attacks on the Russian territory. We have enough targets in the occupied areas of Ukraine, and were prepared to coordinate on (these) targets with our partners, the minister said.\nThe U.S. aid package includes\n425 million in ammunition and support equipment that will be pulled from existing Pentagon stockpiles and\n1.75 billion in new funding through the Ukraine Security Assistance Initiative, which is used to purchase new weapons from industry.\nThe USAI, which will pay for the longer-range bombs and the air defense system integration, also funds two HAWK air defense systems, anti-aircraft guns and ammunition, and counter-drone systems.\nSince Russias invasion last February, Western allies have pledged a myriad of air defense systems to Ukraine to bolster Kyivs own Soviet-made S-300 surface-to-air missile defense systems, and the latest aid package aims to provide the capability to integrate them all, which could improve Ukraines ability to protect itself against incoming Russian attacks.\nThe U.S. has pledged medium- to long-range National Advanced Surface-to-Air Missile Systems, or NASAMS, and truck-launched short-range Avenger air defense systems; the Netherlands, Germany and the U.S. are sending Patriot missile defense systems; Germany is sending medium-range IRIS-T air defense systems; and Spain is sending Aspide anti-aircraft air defense systems.\nThe addition of longer-range bombs into the latest aid package was first reported by Reuters.\nUkraine is still seeking F-16 fighter jets, which U.S. President Joe Biden has opposed sending since the beginning of the war. Asked Monday if his administration was considering sending F-16 fighter jets to Ukraine, Biden responded, No.\nOn Tuesday, Ukraines defense minister Oleksii Reznikov was asked if Bidens no to F-16s was the final word.\nAll types of help first passed through the no stage, Reznikov said. Which only means no at todays given moment. The second stage is, Lets talk and study technical possibilities. The third stage is, Lets get your personnel trained. And the fourth stage is the transfer (of equipment). (AP)\nAQS",
      "snippet": "... months of agonizing, the U.S has agreed to send longer-range bombs to <b>Ukraine</b> as it prepares to launch a spring offensive to retake territory Russia ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:27:00",
      "provider": {
        "name": "kashmirreader",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/kashmirreader.com/wp-content/uploads/2019/10/cropped-logoo.jpg?fit=512%2C512&#038;ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "kashmirreader",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://kashmirreader.com/2023/02/03/us-to-send-ukraine-longer-range-bombs-in-latest-turnaround/"
      }
    },
    {
      "id": "5590088397123159861",
      "title": "Ukraine LIVE: Putin's puppet calls for nuclear response after Western tanks sent to Kyiv",
      "url": "https://www.express.co.uk/news/world/1730073/ukraine-live-Vladimir-Putin-nuclear-weapons-tanks-war",
      "description": "Russian state media presenters have increasingly been calling for a nuclear response to the new tranches of more offensive Western weapons support packages to Ukraine.",
      "body": "Ukraine\ns mayor of the city of Enerhodar, in Zaporizhzhia oblast, where the attack took place, reported the death on Telegram.\nRussian state media agency Tass reported quotes from Vladimir Rogov, leader of the pro-Russian We are Together with Russia movement in occupied Ukraine, reporting the incident.\nRogov said: Its loud in Enerhodar. The cause of the explosion that sounded this morning in the city was a car explosion.\nAccording to preliminary data, one person died as a result of the terrorist attack. The fire has now been extinguished. Pyrotechnic teams are checking for the presence of explosives to prevent another explosion.\nDmitri Orlov said on his Telegram: Since the beginning of March last year and until now, Energodar has been a city where the occupiers have been active in criminal activities: they torture and capture people, rob the citys residents and entire businesses.\nBut they put in their pockets a part of what they receive from the Russian Federation to provide for their needs.\nLiving Rashists do not need  witnesses. Therefore, they will continue to carry out similar cleanings. And the first one has already left.\nA car exploded in occupied #Enerhodar.\nAs a result of the explosion one person was killed.",
      "snippet": "... presenters have increasingly been calling for a nuclear response to the new tranches of more offensive Western weapons support packages to <b>Ukraine</b>.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:21:00",
      "provider": {
        "name": "express",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/4545090.jpg?r=1675412846407",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "express",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.express.co.uk/news/world/1730073/ukraine-live-Vladimir-Putin-nuclear-weapons-tanks-war"
      }
    },
    {
      "id": "1340656228781714329",
      "title": "Time running out for wrecker of Tajikistans internet as Rahmon loses temper",
      "url": "https://www.intellinews.com/time-running-out-for-wrecker-of-tajikistan-s-internet-as-rahmon-loses-temper-268893/",
      "description": "Tajikistans leader has slated the usually untouchable head of the state communications service, a man to whom he is related by marriage, for the ...",
      "body": "Turkey accuses West of waging psychological warfare to wreck its tourism industry\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nNews\nBelarus faces new sanctions by the EU and asset seizures by Ukraine\nFeatures\nBelarus Corruption Watch: How one of Lukashenkos 'wallets' evades sanctions\nNews\nTurkey accuses West of waging psychological warfare to wreck its tourism industry\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nbneGREEN\nbneGREEN: Most growth in power generation by 2050 will be solar and wind  BP\nFeatures\nRussian gas pipe flow dips to record low in January\nNews\nUkraine anti-corruption officers raid home of Kolomoisky\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nbneGREEN\nbneGREEN: Most growth in power generation by 2050 will be solar and wind  BP\nNews\nRussian gas pipe flow dips to record low in January\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nNews\nCouncil of Europe harshly criticises Estonian e-residency programme\nData\nRussians view Baltic States as a threat\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nbneGREEN\nbneGREEN: Most growth in power generation by 2050 will be solar and wind  BP\nFeatures\nRussian gas pipe flow dips to record low in January\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nNews\nCroatia to pay $235mn arbitration award to MOL\nTech\nRomanias eMAG building largest logistics hub in CEE, expands credit facility\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nbneGREEN\nbneGREEN: Most growth in power generation by 2050 will be solar and wind  BP\nData\nDownturn mood eases in Polish manufacturing as PMI grows to 47.5 points in January\nbneGREEN\nbneGREEN: Most growth in power generation by 2050 will be solar and wind  BP\nFeatures\nRussian gas pipe flow dips to record low in January\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nFeatures\nRussian gas pipe flow dips to record low in January\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nFeatures\nM&A in Emerging Europe fell by 20% to 32.93bn in 2022\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nFeatures\nRussian gas pipe flow dips to record low in January\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nFeatures\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nFeatures\nGeopolitics overshadows Western Balkan nearshoring ambitions\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nFeatures\nM&A in Emerging Europe fell by 20% to 32.93bn in 2022\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nFeatures\nGeopolitics overshadows Western Balkan nearshoring ambitions\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nFeatures\nM&A in Emerging Europe fell by 20% to 32.93bn in 2022\nNews\nBulgaria starts construction of gas link with Serbia\nFeatures\nRussian gas pipe flow dips to record low in January\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nFeatures\nM&A in Emerging Europe fell by 20% to 32.93bn in 2022\nNews\nCroatia to pay $235mn arbitration award to MOL\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nFeatures\nRussian gas pipe flow dips to record low in January\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nNews\nRaised tempers over Kosovo spark scuffle in Serbian parliament\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nFeatures\nGeopolitics overshadows Western Balkan nearshoring ambitions\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nNews\nRussian foreign minister speaks of Moldova as next Ukraine\nFeatures\nM&A in Emerging Europe fell by 20% to 32.93bn in 2022\nNews\nMoldovan ex-president Dodon accused of trying to flee the country\nNews\nRussian lawmakers warn Moldovas Nato aspirations may lead to its destruction\nFeatures\nGeopolitics overshadows Western Balkan nearshoring ambitions\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nTech\nMontenegro launches cryptocurrency pilot project with US Ripple\nFeatures\nM&A in Emerging Europe fell by 20% to 32.93bn in 2022\nFeatures\nGeopolitics overshadows Western Balkan nearshoring ambitions\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nFeatures\nM&A in Emerging Europe fell by 20% to 32.93bn in 2022\nFeatures\nItaly pushes for investments into Western Balkan strategic sectors\nTech\nRomanias eMAG building largest logistics hub in CEE, expands credit facility\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nbneGREEN\nbneGREEN: Most growth in power generation by 2050 will be solar and wind  BP\nFeatures\nRussian gas pipe flow dips to record low in January\nNews\nRaised tempers over Kosovo spark scuffle in Serbian parliament\nNews\nBulgaria starts construction of gas link with Serbia\nNews\nRBI's 2022 profits soar to 3.6bn, with Russian operations representing more than half\nFeatures\nGeopolitics overshadows Western Balkan nearshoring ambitions\nNews\nTurkey accuses West of waging psychological warfare to wreck its tourism industry\nBlogs\nISTANBUL BLOG: Erdogans talking rate cuts again. There are those who are bored stiff by these joke economics\nTech\nTurkish company chaired by US sanctions-hit official wins Nato intelligence software contracts\nbneGREEN\nEBRD invests record 13.1bn into its region in 2022\nOpinion\nNEMETHY: Key economic and financial drivers to watch in 2023\nFeatures\nMutual FDI in Eurasia has been dominated by Russia, but war and sanctions make the outlook uncertain\nNews\nHawkish Iran helped stop larger Azerbaijani attacks says Armenia\nNews\nUkraines mocking of Iran over drone attack on military factory irks Tehran\nNews\nUkraine official tweets Did warn you after drone attack in Iran\nNews\nGunman storms Azerbaijans Tehran embassy, kills head of security\nData\nKazakh manufacturing PMI signals stable conditions in January\nNews\nOnly Hungary and Russia heading for recession in 2023 as Emerging Europe shows its resilience\nNews\nAnglo-Russian Polymetal looks at switching listing from London to Kazakhstan\nFeatures\nRussia forges ahead with gas ambitions in Uzbekistan, Kazakhstan\nOpinion\nPANNIER: Uzbeks, Kyrgyz cooperating to level unthinkable 10 years ago\n",
      "snippet": "... mocking of Iran over drone attack on military factory irks Tehran News <b>Ukraine</b> official tweets Did warn you after drone attack in Iran News Gunman ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:19:51",
      "provider": {
        "name": "intellinews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "http://d39raawggeifpx.cloudfront.net/styles/16_9_desktop/s3/articleimages/bnePEOPLE_Beg_Sabur_Tajikistan_internet_chief.PNG",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "intellinews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.intellinews.com/time-running-out-for-wrecker-of-tajikistan-s-internet-as-rahmon-loses-temper-268893/"
      }
    },
    {
      "id": "544900484297714092",
      "title": "Poland expects 40 nations to oppose Russian athletes at Olympics",
      "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/poland-expects-40-nations-to-oppose-russian-athletes-at-olympics/articleshow/97575102.cms",
      "description": "More sports News: Polish Sports Minister Kamil Bortniczuk on Thursday said he expected several dozen nations to come out against the inclusion of athletes from Russia a",
      "body": "Sports ministry gets Rs 700 crore-plus boost in Union Budget\nPhoto by Catherine Ivill/Getty Images\nWARSAW: Polish Sports Minister Kamil Bortniczuk on Thursday said he expected several dozen nations to come out against the inclusion of athletes from Russia and Belarus in the 2024\nParis Olympics\n.\n\"I think that next week... a very firm stance on the part of representatives from these 40 countries will see the light of day,\" he told state television.\nThe position will \"very clearly oppose the participation of Russians and Belarusians in the Olympic Games\", he added.\nHe said he believed the countries would notably include members of the European Union and Britain.\nBortniczuk also mentioned the United States, although the White House on Thursday said it would back allowing Russian and Belarusian athletes to compete as neutrals.\nSports ministers from the group have a video call scheduled for February 10, he added.\nThe last few days have seen a growing debate over the 2024 Paris Games.\nUkraine is calling for Russian athletes to be entirely banned over their country's brutal invasion of Ukraine, with Ukrainian athletes among the victims. Russia is pushing for all restrictions to be lifted, saying the Olympics should not be politicised.\nThe International Olympic Committee (IOC) has said it is examining a \"pathway\" for Russians to take part in the summer Games, probably as neutral athletes.\nEarlier Thursday, Bortniczuk and his counterparts from the Baltic states released a joint statement slamming the IOC.\n\"Estonia, Latvia, Lithuania and Poland condemn the efforts of the International Olympic Committee to bring back the athletes of the aggressor countries, Russia and Belarus, into international competitions,\" it said.\nEfforts to include the athletes \"under the veil of neutrality legitimise political decisions and widespread propaganda of these countries also through the use of sport as a distraction from the illegal aggression against Ukraine\".\nStart a Conversation\nFOLLOW US ON SOCIAL MEDIA\nFacebook",
      "snippet": "<b>Ukraine</b> is calling for Russian athletes to be ... banned over their country's brutal invasion of <b>Ukraine</b>, with Ukrainian athletes among the victims.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:17:00",
      "provider": {
        "name": "indiatimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-97575192/97575192.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indiatimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://timesofindia.indiatimes.com/sports/more-sports/others/poland-expects-40-nations-to-oppose-russian-athletes-at-olympics/articleshow/97575102.cms"
      }
    },
    {
      "id": "1359776546569931350",
      "title": "British Prime Minister Rishi Sunak delivers verdict on Arsenal's Premier League title hopes this season",
      "url": "https://www.sportskeeda.com/football/news-british-prime-minister-rishi-sunak-delivers-verdict-arsenal-s-premier-league-title-hopes-season",
      "description": "British Prime Minister Rishi Sunak has backed Arsenal to win the Premier League title this season.",
      "body": "British Prime Minister Rishi Sunak has backed Arsenal to win the Premier League title this season.Mikel Artetas side have emerged as the best team in the Premier League this season. They have played an eye-catching brand of football, scored excellent goals, rarely let their intensity drop, and dug deep to nick scrappy wins when needed. Arsenal have picked up 50 points from 19 Premier League fixtures so far, opening up a five-point lead over second-placed Manchester City with a game in hand.Renowned British broadcaster and Arsenal supporter Piers Morgan recently had the opportunity to interview Prime Minister Sunak on TalkTV. The discussion eventually turned to football, and Morgan asked the Prime Minister to give his verdict on the Gunners Premier League chances.Piers Morgan Uncensored@PiersUncensoredTonight at 8pm only on TalkTVPiers grills Rishi Sunak: Will he send jets to Ukraine? Should Meghan & Harry attend the Coronation? What does love mean to the PM? Will Arsenal win the Premier League? What is a woman...@piersmorgan | @rishisunak | #PMandthePM26442Tonight at 8pm only on TalkTVPiers grills Rishi Sunak: Will he send jets to Ukraine? Should Meghan & Harry attend the Coronation? What does love mean to the PM? Will Arsenal win the Premier League? What is a woman...@piersmorgan | @rishisunak | #PMandthePM https://t.co/F7ZVU3SmUIWhen asked if the north Londoners would win the English top-flight title this season, Sunak replied on Piers Morgan Uncensored:Yes.Artetas side, who slumped to a 1-0 defeat against Manchester City in the FA Cup fourth round on 28 January, will return to Premier League action on Saturday (4 February). They will take on 19th-placed Everton at Goodison Park.Arsenal legend Emmanuel Petit believes Mykhailo Mudryk might not be happy at ChelseaThe Gunners tried their best to sign Mykhailo Mudryk from Shakhtar Donetsk in January but failed to reach an agreement. Chelsea swooped in and prized the Ukrainian away for an 89 million fee.SPORTbible@sportbibleMudryk's former coach tells him he made a mistake joining Chelsea over Arsenal 16834871Mudryk's former coach tells him he made a mistake joining Chelsea over Arsenal  https://t.co/qgaGKRmbsyBefore Chelsea entered the scene, the player had hinted at a switch to north London. Gunners legend Emmanuel Petit has speculated that Mudryks heart still might be at the Emirates Stadium, and that he might not be completely happy at Stamford Bridge.It is still a big gamble for the future. At first he wanted to go to Arsenal, but ended up at Chelsea, so my question is: Is he happy about that? Im not sure, Petit told Betway.But definitely he would add quality to their squad. I hope that he will be successful over at Chelsea.While Artetas men sit at the top of the Premier League table, Chelsea find themselves languishing in 10th place with 29 points from 20 games. It will be interesting to see whether or not Mudryks pace and creativity help Chelsea make a late push for a top-four finish.",
      "snippet": "British Prime Minister Rishi Sunak has backed Arsenal to win the Premier League title this season.\nBritish Prime Minister Rishi Sunak has backed Arsenal to win the Premier League title this season.Mikel Artetas side have emerged as the best team in the Premier League this season.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:09:51",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticg.sportskeeda.com/editor/2023/02/ba659-16754117458288-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/football/news-british-prime-minister-rishi-sunak-delivers-verdict-arsenal-s-premier-league-title-hopes-season"
      }
    },
    {
      "id": "5874964611173909721",
      "title": "SS Rajamouli, Junior NTR pay their respects to legendary filmmaker K Viswanath as he passes away at 92",
      "url": "https://www.firstpost.com/entertainment/ss-rajamouli-junior-ntr-pay-their-respects-to-legendary-filmmaker-k-viswanath-as-he-passes-away-at-92-12096642.html",
      "description": "Ravi Teja wrote that the Sagara Sangamam filmmakers contribution to Telugu Cinema will live on in our memories forever.",
      "body": "Most Read\nMost Read\nWATCH: Jihadis bring down hammer and tongs on Ahmadi mosque in Pakistan's Karachi; 2nd in a month\nViral videos of the discretion show four men, covering their face and wearing helmets, climbing on the mosque and escaping thereafter\nHollywood action hero Steven Seagal censored for allegedly backing Russia's invasion of Ukraine\nSteven Seagal was made a Russian citizen in 2016 with President Vladimir Putin handing over Seagal his Russian passport\nFrom India's Easternmost Village to near LAC: Modi government paves way for 78-km Arunachal road\nThe Narendra Modi government on 1 February began the process to build a new road from Dong village to Jachep camp in Arunachal Pradesh, inviting bids to construct it within the next three years\nQuad agrees to leverage machine learning, related advanced technologies to enhance cybersecurity\nIn the longer term, the Group committed to leverage machine learning and related advanced technologies to enhance cybersecurity and establish secure channels for Computer Emergency Response Teams and private sector threat information sharing\nNepal could cut funds to provinces and local governments amid falling revenues\nThe economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis\nRelated Articles\nRelated Articles\nRepublic Day 2023: From Ek Tu Hi Bharosa to Mere Desh Ki Dharti, five most moving patriotic songs\nSpeaking on the genesis of this song Manoj Kumar said, \"Meri desh ki dharti happened when lyricist Gulshan Bawra and I had  gone to a shrine to pay our respects.\"\nKamal Haasan's deep connection with Waheeda Rehman & Guide\nThe most interesting role of Waheedajis career was Rosy in Guide. The ageless actress advises filmmakers against re-making it. Hollywood would never dream of remaking Gone With The Wind. Likewise, we should not remake Guide or Pyaasa.\nSS Rajamouli on Naatu Naatu's Oscar nomination: Currently doing Naatu Naatu more vigorously than Ram Charan and Jr. NTR\nThe song from RRR has been nominated in the Best Original Song category and recently won the Golden Globe as well. All eyes on March 12 now.\nAlone movie review: Is Mohanlal in a race to give us the worst Mohanlal film yet?\nIt is heart-breaking to see an artiste who has made us laugh and cry and given us food for thought for years, wasting himself. Alone is zero-impact, zero-purpose fare.\nPrince Harry's fake tweet says 'Took time to myself to sit back and listen to Daler Mehndi,' singer reacts\nDaler Mehndi recently shared a tweet to thank Prince Harry for listening to his songs.",
      "snippet": "... allegedly backing Russia's invasion of <b>Ukraine</b> Steven Seagal was made a ... further been hit by the <b>Ukraine</b> crisis Related Articles Related Articles ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:09:28",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2023/02/rajavishwa.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/entertainment/ss-rajamouli-junior-ntr-pay-their-respects-to-legendary-filmmaker-k-viswanath-as-he-passes-away-at-92-12096642.html"
      }
    },
    {
      "id": "4952517011169332188",
      "title": "Nepal could cut funds to provinces and local governments amid falling revenues",
      "url": "https://www.firstpost.com/world/nepal-could-cut-funds-to-provinces-and-local-governments-amid-falling-revenues-12096892.html",
      "description": "The economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis",
      "body": "Most Read\nMost Read\nWATCH: Jihadis bring down hammer and tongs on Ahmadi mosque in Pakistan's Karachi; 2nd in a month\nViral videos of the discretion show four men, covering their face and wearing helmets, climbing on the mosque and escaping thereafter\nHollywood action hero Steven Seagal censored for allegedly backing Russia's invasion of Ukraine\nSteven Seagal was made a Russian citizen in 2016 with President Vladimir Putin handing over Seagal his Russian passport\nFrom India's Easternmost Village to near LAC: Modi government paves way for 78-km Arunachal road\nThe Narendra Modi government on 1 February began the process to build a new road from Dong village to Jachep camp in Arunachal Pradesh, inviting bids to construct it within the next three years\nQuad agrees to leverage machine learning, related advanced technologies to enhance cybersecurity\nIn the longer term, the Group committed to leverage machine learning and related advanced technologies to enhance cybersecurity and establish secure channels for Computer Emergency Response Teams and private sector threat information sharing\nNepal could cut funds to provinces and local governments amid falling revenues\nThe economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis\nRelated Articles\nRelated Articles\nNepal: Dahal's govt under pressure as RSPs claim for home ministry is backed by Oli\nThe coalition government in Nepal is divided over whether the home ministry should be given to the Swatantra Party.\nWhy have constitutional experts ruled out another term for Nepal President Bidya Bhandari?\nBidya Bhandari, the current president of Nepal will be completing her two terms in March this year\nIs discontent growing in ruling coalition in Nepal?\nThe Nagarik Unmukti Party has taken its umbrage a step further by fielding its own candidate for a vacant National Assembly member, challenging the ruling alliances candidate in the process.\nWhat is the dispute in Nepal government over giving home ministry to Swatantra Party?\nPrime Minister Pushpa Kamal Dahal also met UML Chief KP Sharma Oli to discuss the matter\nCPN-UMLs Dev Raj Ghimire elected Speaker of Nepal Parliament\nThere were two candidates in the fray for the post of the Speaker of the Nepal Parliament. Both Dev Raj Ghimire from CPN-UML and his opponent Ishwari Neupane from the Nepali Congress had filed their nominations for the post on Wednesday",
      "snippet": "... recovery following the Covid-19 pandemic has further been hit by the <b>Ukraine</b> crisis. Most Read Most Read WATCH: Jihadis bring down hammer and tongs ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:07:39",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2017/12/Nepal-flag1200.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/world/nepal-could-cut-funds-to-provinces-and-local-governments-amid-falling-revenues-12096892.html"
      }
    },
    {
      "id": "8291033045499441249",
      "title": "80 years on, Russia facing German tanks again: Putin",
      "url": "https://www.oneindia.com/india/80-years-on-russia-facing-german-tanks-again-putin-3519091.html",
      "description": "For Russian President Vladimir Putin, the Ukraine crisis is a reminiscent of the Second World War.",
      "body": "Russian President Vladimir Putins statement came during the 80th anniversary of the conclusion of the Battle of Stalingrad, which is still one of the largest tank wars.New Delhi, Feb 3: For Russian President Vladimir Putin, the Ukraine crisis is a reminiscent of the Second World War. Amidst reports that Germany is offering its Leopard tanks to Ukraine, Putin has shown his concern and drawn attention to the fact that some 80 years ago, his country had faced a similar situation. During the Second World War, Hitlers army had marched to the USSR with heavy tanks. Its another thing that he had lost the war then.While the Ukraine crisis is far from over, new developments are taking place rapidly. Many people worry if it could become a bigger crisis and turn into World War III. Putin drawing parallels from history shows that he still thinks the crisis could take the shape of a World War. nbsp;Putin has been quoted saying that after 80 years his country is again facing German tanks. His statement came during the 80th anniversary of the conclusion of the Battle of Stalingrad which is still one of the largest tank wars. His statement is also an indication that German support to Ukraine has not gone well with Russia and there could be some consequences. Russia is planning a major new offensive, says Ukrainian Defence MinisterWe have the means to respondThe Russian government is well aware of the fact that NATO countries have ganged up against it. Most of the member nations have supplied weapons, tanks and necessary equipment to Ukraine. Issuing a warning against all such nations, Putin said that those who hope to defeat Russia on the battlefield do not understand that a modern war with it will be very different for them.Putin warned the countries supplying war material to Ukraine and said that although Russia is not sending its tanks to their borders, it has the means to respond. He has made it clear to the countries aiding Ukraine that Russias counter would not be limited to armoured hardware. Therefore, everyone should beware of the consequences.Russia will make greater use of its potentialThere are various interpretations of what Putin said but one thing is clear - the Western alliance aiding Ukraine is not being seen favourably by the Russian leadership. Echoing what Putin said, Kremlin spokesperson Dmitry Peskov said that as new weapons are delivered by the collective West, Russia will make greater use of its potential to respond. Putin threatened UK with missile attack, claims Boris JohnsonAs more aid is coming for Ukraine, Russia is feeling threatened. However, Putin has made it clear that his nation has again been threatened by German tanks, but this time too it has an answer to the Germans.",
      "snippet": "... Russian President Vladimir Putin, the <b>Ukraine</b> crisis is a reminiscent of ... Russian President Vladimir Putin, the <b>Ukraine</b> crisis is a reminiscent of the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:07:07",
      "provider": {
        "name": "oneindia",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "[\n  \"https://www.oneindia.com/img/2023/02/vladimir-putin-1675411540.jpg\"\n]",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "oneindia",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.oneindia.com/india/80-years-on-russia-facing-german-tanks-again-putin-3519091.html"
      }
    },
    {
      "id": "2932539414702033187",
      "title": "US: Care home slapped $10,000 fine after dead woman wakes up in funeral parlour",
      "url": "https://www.firstpost.com/world/us-care-home-slapped-10000-fine-after-dead-woman-wakes-up-in-funeral-parlour-12097002.html",
      "description": "She was placed in a body bag with a zipper and transported to the Ankeny Funeral Home & Crematory, when staff members discovered that she was breathing and dialled 911",
      "body": "Most Read\nMost Read\nWATCH: Jihadis bring down hammer and tongs on Ahmadi mosque in Pakistan's Karachi; 2nd in a month\nViral videos of the discretion show four men, covering their face and wearing helmets, climbing on the mosque and escaping thereafter\nHollywood action hero Steven Seagal censored for allegedly backing Russia's invasion of Ukraine\nSteven Seagal was made a Russian citizen in 2016 with President Vladimir Putin handing over Seagal his Russian passport\nFrom India's Easternmost Village to near LAC: Modi government paves way for 78-km Arunachal road\nThe Narendra Modi government on 1 February began the process to build a new road from Dong village to Jachep camp in Arunachal Pradesh, inviting bids to construct it within the next three years\nQuad agrees to leverage machine learning, related advanced technologies to enhance cybersecurity\nIn the longer term, the Group committed to leverage machine learning and related advanced technologies to enhance cybersecurity and establish secure channels for Computer Emergency Response Teams and private sector threat information sharing\nNepal could cut funds to provinces and local governments amid falling revenues\nThe economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis\nRelated Articles\nRelated Articles\nAfter spate of mass shootings in the US, 29-yr-old Korean woman attends high school, sparks major scare\nHyejeong Shin, a resident of New Brunswick, was charged on Tuesday with one count of supplying a fake government document with the aim to verify someone's identity or age, according to the New Brunswick Police Department\nUS: Dog shoots man dead in Kansas\nThe Sumner County Sheriff's office issued a statement to local media stating that \"a canine belonging to the owner of the pickup stepped on the rifle, causing the weapon to discharge\"\nAfter Jerusalem, attack on synagogue surface in US, 1 held in New Jersey\nThe incident reportedly occurred just after three in the morning, in Essex County. The suspect was seen throwing the flaming bottle towards the entrance of the Bloomfield building before running away on foot\nUS: Man, 60 dies in a scuffle broke out between spectators of a Basketball game\nAs smaller physical battles break out, several parents seem to drag the kids away, with some adults on the ground clutching at each other. Who is on the ground and what started the outburst are both unknown\nHistory's biggest cocaine king, who dwarfed Pablo Escobar and rode a donkey in Columbian jungles, pleads guilty\nPablo Escobar couldn't have imagined this reality, said an expert on Clan del Golfo. \"We have more cocaine being produced in Colombia than in the days of Pablo Escobar.\" Governments are at a loss about what to do, he said",
      "snippet": "... allegedly backing Russia's invasion of <b>Ukraine</b> Steven Seagal was made a ... further been hit by the <b>Ukraine</b> crisis Related Articles Related Articles ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-03T08:06:28",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2023/02/Untitled-design-2023-02-03T133554.973.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/world/us-care-home-slapped-10000-fine-after-dead-woman-wakes-up-in-funeral-parlour-12097002.html"
      }
    },
    {
      "id": "4265589576480516841",
      "title": "Goldberg: Ukraines fight makes the U.S. more secure",
      "url": "https://www.pressdemocrat.com/article/opinion/goldberg-ukraines-fight-makes-the-u-s-more-secure/",
      "description": "Some wildly momentous events since Russias invasion of Ukraine mostly redound to the benefit of American national security.",
      "body": "JONAH GOLDBERG IS EDITOR-IN-CHIEF OF THE DISPATCH.\nFebruary 3, 2023, 12:04AM\nThe views and opinions expressed in this commentary are those of the author and dont necessarily reflect The Press Democrat editorial boards perspective. The opinion and news sections operate separately and independently of one another.\nWe are entering the 12th month of a special military operation that was supposed to be over in well under 12 days. The Kremlin even told Russian officers to pack dress uniforms and medals for the intended military parades in Kyiv a few days after the shooting started.\nThings turned out differently. By launching the first land war in Europe since 1945 with the expressed intent to stop both the expansion of NATO eastward and the political and economic migration of Ukraine westward, Vladimir Putins adventure is already well on its way to being remembered as one of the great strategic blunders in living memory.\nJonah Goldberg\nSweden and Finland  which shares more than 800 miles of border with Russia  are applying to the North Atlantic Treaty Organization. The process to admit Ukraine to the European Union is underway, and Ukraines military is rapidly switching to newer, better and NATO-compatible weapons. Germany, which recently agreed to ship tanks to Ukraine, has jettisoned much of its noninterventionist foreign policy and committed to much more robust defense spending. Putins long-standing strategy of using energy to hold Western Europe hostage has largely backfired.\nChina, which made a big show of its no limits partnership with its neighbor, has so far only offered extremely limited support for Russia. Its almost as if the Beijing government is embarrassed by its allys pathetic showing  which appears to have taken the Chinese leaders by surprise.\nIn short, these are wildly momentous events, which mostly redound to the benefit of American national security. But you wouldnt necessarily know that from political debates about Ukraine. Indeed, theres an otherworldly aspect to the whole conversation.\nFor instance, going into the midterms, Rep. Kevin McCarthy, now the House speaker, settled on the talking point that Republicans wouldnt give Ukraine a blank check the way Democrats had. But that wasnt happening.\nAs the Hudson Institutes Luke Coffey noted at the time, most of the dollars allocated for military assistance to Ukraine never leave the United States, he wrote. Funds for military support are not wired to Ukrainian government bank accounts. We send Ukraine weapons  including, eventually, Abrams tanks  and other equipment, and that money goes toward replenishing our stockpiles.\nPresident Joe Biden has handled things fairly well behind the scenes, but his public statements tend to be weighed down by things he wont do  like send tanks and other weapons systems  which he inevitably ends up doing. Hes also very fond of insisting  for more understandable reasons  that we will not be sending American troops to fight in Ukraine. Indeed, the only thing that garners bipartisan support regarding Ukraine is that we shouldnt get into a direct war with Russia, and therefore NATO shouldnt do anything that provokes Putin.\nProvoke him to do what, exactly? Invade Ukraine and target civilians by the millions? Hes doing that already. Not supplying these weapons in a more-timely manner was what was actually provocative. The dithering encouraged Putin to wage a missile and artillery war on Ukrainian population centers in the hope that he could beat Ukraine into submission before the West realized it needed to send the weapons Ukraine needed.\nNo one wants a nuclear war, of course. Which is why Russia keeps threatening one. If the policy is going to be, Russia can do whatever it wants because it has nuclear weapons, then make that argument.\nBut if the strategic goal is for Ukraine to win back its own territory using its own troops, then the tactical imperative is to give Ukraine what it needs to win. Normally, when America sends troops to fight, the refrain from critics is to let the Iraqis or Afghans or whomever fight for their own freedom. Thats what Ukraine is doing.\nMitt Romney was right  and Barack Obama was wrong  in 2012 when he described Russia as our geopolitical foe. Enabling Ukrainians to degrade Russia is in our national interest. And, if the new nationalist Republicans were serious about the sanctity of national borders, theyd recognize that Ukraine is literally the front line of that fight.\nSome seem to think its provocative to let Russia believe NATO is using Ukraine as a proxy for its interests. But that horse left the barn long ago. Thats the official Russian view, blared out constantly on Russia state media. Russian Security Council Secretary Nikolai Patrushev recently declared, The events in Ukraine are not a clash between Moscow and Kyiv  this is a military confrontation between Russia and NATO. Moscow is not dealing with Ukraine  were past that, prime-time Russian TV host Vladimir Solovyov announced last October. Were dealing with the entire NATO bloc, with the might of its military industrial complex.\nIf only that were true.\nJonah Goldberg is editor-in-chief of the Dispatch. From Tribune News Service.\nYou can send letters to the editor to letters@pressdemocrat.com.\nThe views and opinions expressed in this commentary are those of the author and dont necessarily reflect The Press Democrat editorial boards perspective. The opinion and news sections operate separately and independently of one another.\nMost Popular\nThis is a family newspaper, please use a kind and respectful tone.\nNo profanity, hate speech or personal attacks. No off-topic remarks.\nNo disinformation about current events.\nWe will remove any comments  or commenters  that do not follow this commenting policy.",
      "snippet": "Some wildly momentous events since Russias invasion of <b>Ukraine</b> mostly redound to the benefit of American national security. JONAH GOLDBERG IS ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:04:00",
      "provider": {
        "name": "pressdemocrat",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imengine.prod.srp.navigacloud.com?uuid=b90923df-2b4d-5ec1-b848-14e62ffc80cd&amp;type=primary&amp;q=72&amp;width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pressdemocrat",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.pressdemocrat.com/article/opinion/goldberg-ukraines-fight-makes-the-u-s-more-secure/"
      }
    },
    {
      "id": "3191220067405376870",
      "title": "Ukraines allies push IMF to approve $14bn-$16bn loan to strengthen war-torn countrys finances, say reports",
      "url": "https://www.firstpost.com/world/ukraines-allies-push-imf-to-approve-14bn-16bn-loan-to-strengthen-war-torn-countrys-finances-say-reports-12096882.html",
      "description": "The funds representatives are planning to meet Ukrainian officials in Warsaw in mid-February to advance discussions over a loan that could range from $14bn-$16bn, according to reports.",
      "body": "February 03, 2023 13:31:29 IST\nRepresentative Image\nNew Delhi: In order to strengthen the finances of Ukraine amid ongoing conflict with Russia, its western allies are reportedly pushing the International Monetary Fund (IMF) to finalise plans for a multibillion-dollar lending programme.\nThe funds representatives are planning to meet Ukrainian officials in Warsaw in mid-February to advance discussions over a loan that could range from $14bn-$16bn, Financial Times quoted officials familiar with the talks as saying. The goal is to finalise it by the spring.\nIn a statement, IMF said last year that Russias invasion has inflicted terrible human and economic suffering on Ukraine and the country faces a winter of air strikes and rocket attacks against critical infrastructure.\nThe IMFs management approved Ukraines request for Program Monitoring with Board Involvementthe first arrangement of its kindto maintain economic stability and catalyze donor financing.\nHowever, the EU has put forward 18bn in a package agreed upon between its member states in December last year to cover the financing gap. But the bloc and other major partners of Kyiv want international lenders to accelerate their efforts to provide further support.\nThe expectation is that other international donors including other G7 and international financial institutions would cover the rest of the financing need, Valdis Dombrovskis, European Commission executive vice-president told FT, during meetings in Kyiv.\nHe told the FT that an IMF programme for Ukraine would carry a certain signalling effect that can trigger also further donor support. The sooner the loan arrived the better, he added. These are not circumstances in which the IMF would normally lend, so it is a positive step that they are actually working on a proper disbursing programme.\nWe have been supporting Ukraine since the onset of the war and are committed to keeping it going, an IMF spokesperson told the FT. Were engaging closely with the Ukrainian authorities and hopefully move towards a fully-fledged programme as soon as feasible.\nRecently, a provision in the recently signed defence spending bill mandates that the United States work to ease Ukraines debt burden at the International Monetary Fund, which could create tensions at the worlds lender-of-last-resort over one of its biggest borrowers.\nThe National Defense Authorization Act requires American representatives to each global development bank, including the IMF, where the U.S. is the largest stakeholder, to use the voice, vote, and influence  of the U.S. in seeking to assemble a voting bloc of countries that would change each institutions debt service relief policy regarding Ukraine.\nAmong other things, the U.S. is tasked with forcing the IMF to reexamine and potentially end its surcharge policy on Ukrainian loans. Surcharges are added fees on loans imposed on countries that are heavily indebted to the IMF.\nThe U.S. interest in changing the policy comes as it has distributed tens of billions for the Ukrainian military and humanitarian aid since the Russian invasion began in February. Most recently, Ukraine will receive $44.9 billion in aid from the U.S. as part of a $1.7 trillion government-wide spending bill.\nWith inputs from agencies.",
      "snippet": "... Image New Delhi: In order to strengthen the finances of <b>Ukraine</b> amid ongoing conflict with Russia, its western allies are reportedly pushing ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:01:29",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2023/02/FBgOmwNXsAwOhwP-1.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/world/ukraines-allies-push-imf-to-approve-14bn-16bn-loan-to-strengthen-war-torn-countrys-finances-say-reports-12096882.html"
      }
    },
    {
      "id": "8041788062147845077",
      "title": "Russia hits civilian targets anew, EU officials visit Kyiv",
      "url": "https://www.midfloridanewspapers.com/highlands_news-sun/news/russia-hits-civilian-targets-anew-eu-officials-visit-kyiv/article_93a52fe0-a315-11ed-9847-cf654a4f8800.html",
      "description": "KYIV, Ukraine (AP)  Russian missiles hit residential areas in an eastern Ukrainian city Thursday for the second time in 24 hours, while top European Union officials held talks with",
      "body": "Copy article link\nSave\nKYIV, Ukraine (AP)  Russian missiles hit residential areas in an eastern Ukrainian city Thursday for the second time in 24 hours, while top European Union officials held talks with the government in Kyiv as the war with Russia approaches its one-year milestone.\nThe latest strikes in Kramatorsk came as rescue crews searched for survivors in the rubble of an apartment building hit late Wednesday by a Russian missile that killed at least three people and wounded 21 others. At least one more victim was thought to be under the debris, Ukraines presidential office said.\nKramatorsk again shattered by explosions  the Russians made two more rocket strikes, regional governor Pavlo Kyrylenko wrote in a Telegram post.\nHe said at least five civilians were wounded in the latest strikes, which hit residential buildings as well as a childrens clinic and a school in the heart of the city. Kramatorsk Mayor Oleksandr Honcharenko urged residents to stay in shelters.\nKramatorsk is a major hub for the Ukrainian military in the east.\nNo further details of Thursdays attack were immediately available.\nRussia has frequently struck apartment buildings during the war, causing civilian casualties, although the Kremlin has denied targeting residential structures.\nRussian shelling across Ukraine over the previous 24 hours killed at least eight civilians and wounded 29 others, the presidential office said. Along with the victims in Kramatorsk, the toll included four who died when a Russian mortar shell hit a basement where they were sheltering in the northeastern Chernihiv region.\nUkrainian President Volodymyr Zelenskyy met with European Commission President Ursula von der Leyen ahead of what officials described as a summit on Friday. The last such summit was held in Kyiv in October 2021  a few months before the war started on Feb. 24, 2022.\nVon der Leyen praised wartime Ukraines brilliant application for European Union membership, though Brussels officials note that Ukraine joining the 27-nation bloc is still a long way off.\nAhead of possible membership, Von der Leyen said, the Commission is proposing that Kyiv join key European programs  this will give Ukraine benefits close to those of EU membership in many areas.\nEU assistance for Ukraine, she said, has reached 50 billion euros ($55 billion) since the start of Russias war.\nShe said the EU plans to adopt a 10th package of sanctions again Russia before Feb. 24. Von der Leyen also announced that the International Center for the Prosecution of the Crime of Aggression in Ukraine would be set up in The Hague to coordinate the collection of evidence of war crimes.\nVon der Leyen, on her fourth visit to Kyiv since Russias invasion, added that she was comforted by Ukraines anti-corruption drive. Stamping out endemic corruption is a key condition for joining the EU.\nZelenskyy on Wednesday took aim at corrupt officials for the second time in the space of a week. Several high-ranking officials were dismissed.\nZelenskyy was elected in 2019 on an anti-establishment and anti-corruption platform in a country long gripped by graft.\nThe latest corruption allegations came as Western allies are channeling billions of dollars to help Kyiv fight Moscows forces and as the Ukrainian government is introducing reforms so it can potentially join the EU.\nUkraines government is keen to get more Western military aid, on top of the tanks pledged last week, as the warring sides are expected to launch new offensives once winter ends. Kyiv is now asking for fighter jets.\nKyiv expects Russia to attempt something on the Feb. 24 anniversary, Ukrainian Defense Minister Oleksii Reznikov told Frances BFM television. He stressed his governments urgency on getting weapons without delay.\nWe are telling our partners that we too need to be ready as fast as possible, he said in an interview late Wednesday.\nU.S. President Joe Biden has ruled out providing F-16 fighter jets to Ukraine. U.S. Defense Secretary Lloyd Austin said Thursday during a trip to the Philippines that the focus of American aid is to increase Ukraines military capabilities by sending artillery, armor and air defense, and training Ukrainian troops.\nThe U.S. is focused on providing Ukraine the capability that it needs to be effective in its upcoming anticipated counteroffensive in the spring, Austin said.\nAnd so were doing everything we can to get them the capabilities that they need right now to be effective on the battlefield, he said.\nRussian Foreign Minister Sergey Lavrov said that strategy would backfire, by prompting Moscow to ensure that potential Russian targets were out of range.\nThe longer range the weapons supplied to the Kyiv regime, the farther we would need to push them away from the territories that are part of our country, Lavrov said in an interview with Russian state media.\nHe said Moscow would like to see the war end, but noted that the length of the conflict was less important than its desired outcome: to protect Russian territory and people who want to remain part of the Russian culture, reaffirming Moscows declared goal to defend Russian speakers in Ukraine.\nFacebook",
      "snippet": "KYIV, <b>Ukraine</b> (AP) Russian missiles hit residential areas in an eastern Ukrainian city Thursday for the second time in 24 hours, while top European ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T08:00:00",
      "provider": {
        "name": "midfloridanewspapers",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bloximages.newyork1.vip.townnews.com/midfloridanewspapers.com/content/tncms/assets/v3/editorial/a/fc/afcef67e-a315-11ed-8546-2f9ead7edcdb/63dbe34131787.image.jpg?crop=1763%2C926%2C0%2C125&amp;resize=1200%2C630&amp;order=crop%2Cresize",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "midfloridanewspapers",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.midfloridanewspapers.com/highlands_news-sun/news/russia-hits-civilian-targets-anew-eu-officials-visit-kyiv/article_93a52fe0-a315-11ed-9847-cf654a4f8800.html"
      }
    },
    {
      "id": "275810868172667618",
      "title": "Vladimir Putin's 'red line' will be crossed with Moscow attack 'bound to happen'",
      "url": "https://www.dailystar.co.uk/news/world-news/vladimir-putins-red-line-crossed-29121209",
      "description": "Russia President Vladimir Putin has some very big red lines, according to a top mouthpiece and ally, and one of those includes Ukraine directly bombing his Moscow hub",
      "body": "Privacy Notice\nAn attack on Vladimir Putin's Moscow hub is bound to happen, according to a top Kremlin official.\nRussia's former deputy foreign minister, Andrei Fedorov has outlined what he believes to be an inevitable threat that will cross one of of Putin's red lines.\nSpeaking candidly on Russian state TV, Putin's former adviser spoke about what would cause Putin to turn his invasion of Ukraine into a full scale world war.\nREAD MORE: Arctic snow and '120mm' rain storms set to batter UK in less than 10 days time\nHe replied: \"It's a strike on the command centres in Moscow. A strike, not an attempt.\nThe strike that's bound to happen, it's going to be a red line.\nAn attack on Moscow is a 'red line' for Putin\n(Image: Getty Images)\nArctic snow and '120mm' rain storms set to batter UK in less than 10 days time\nAnd he later said that Ukraine might start retaliating directly onto Russia by bombing Russian cities.\nSince the invasion began almost exactly one year ago, Ukraine has been fighting in mainly defensive position  which has appeared to be better than Russia's attack in most cases.\nBut now the strange admissions for Ukraine taking the front foot are slowly starting to creep through on Kremlin-backed television, which has never been allowed before.\nFedorov added: They'll be striking them (Russian cities) to a larger extent.\n(When asked about Moscow) Yes, Moscow.\nUkraine 'could declare war' on Russia\n(Image: Getty Images)\nRussia warns the West that it is developing robot tanks to destroy Brit war machines\nPutin might find it difficult to protect his key cities, however, after it was revealed that he had lost more than 50% of his airborne forces in Ukraine.\nThe Kremlin has never released full figures about losses suffered since starting its invasion into Ukraine nearly 12 months ago.\nHowever, Ukraine has claimed that more than 120k troops have been killed, with more than 400k more suffering injuries so severe that they can no longer fight.\nAndrei Fedorov issued the warnings on Russian state TV\n(Image: Twitter/Gerashchenko_en)",
      "snippet": "... Putin has some very big red lines, according to a top mouthpiece and ally, and one of those includes <b>Ukraine</b> directly bombing his Moscow hub.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T07:59:51",
      "provider": {
        "name": "dailystar",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i2-prod.dailystar.co.uk/incoming/article29121287.ece/ALTERNATES/s1200/0_Russian-President-Vladimir-Putin-Attends-77th-Victory-Day-With-Parade-On-Red-Square.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "dailystar",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.dailystar.co.uk/news/world-news/vladimir-putins-red-line-crossed-29121209"
      }
    },
    {
      "id": "7239374301889858062",
      "title": "Belgian carnival town celebrates again after COVID hiatus",
      "url": "https://kstp.com/associated-press/ap-us-international/belgian-carnival-town-celebrates-again-after-covid-hiatus/",
      "description": "After a COVID-imposed hiatus, artisans are again crafting elaborate costumes and floats for the famed Carnival in the Belgian town of Binche. After the economic struggles of the past two years, and amid the pain from energy bills that went through the roof after Russias war in Ukraine, locals want to make this years festival one for the ages. The earliest records of the Binche Mardi Gras date to the 14th century. Many towns in Belgium hold ebullient carnival processions before Lent. But what makes Binche unique are the Gilles the local men deemed fit to wear the Mardi Gras costumes.",
      "body": "Next\nThere is a real excitement and enthusiasm, said Quentin. People came much earlier to reserve their costumes than in other years.\nThe earliest records of the Binche Mardi Gras, which draws thousands of revelers, date to the 14th century. Many Belgian towns hold ebullient carnival processions before Lent. But what makes Binche unique are the Gilles  local men deemed fit to wear the Mardi Gras costumes.\nUnder rules established by the local folklore defense association, only men from Binche families or resident there for at least five years can wear the Gille costume. Other characters  the Peasant, the Sailor, the Harlequin, the Pierrot or the Gilles Wife  also play a role in the carnival.\nThe UNESCO-listed event starts three days before Lent and reaches its climax on Mardi Gras, when the Gilles  in wax masks sporting green spectacles and thin moustaches  dance in their wooden clogs to the sound of brass instruments and clarinets until the early morning hours. Women can join in, but only men wear the Gille outfit.\nThe carnival is really the soul of the city of Binche, so we have been really sad over the past two years said Patrick Haumont, a town hall staffer who often takes part in the celebrations, dressed in the red, yellow and black attire.\nOver the past three weeks, rehearsals for the main parade have attracted more participants than usual. And at weekends, excitement in the bars filling the towns main square hits unprecedented levels.\nInstead of the one beer you would normally drink, its now five, Haumont said.\nAfter the economic struggles of the pandemic years, and amid pain from energy bills that went through the roof after Russias invasion of Ukraine, the people of Binche want to make this years carnival one for the ages.\nAlthough taking part requires a big financial commitment  renting a Gille costume and a lavish ostrich-feather hat costs around 300 euros ($327)  some 1,000 Gilles are expected to parade through the narrow streets of brick row houses to the beat of the drum and the tinkling bells of their outfits.\nPeople have rented more costumes, more hats. Everybody wants to do it again. We can see that there is a need, Haumont said.\nFor Christian Mostade, an 88-year-old member of the biggest Gilles company, it will be his 38th carnival as a Gille.\nIn normal times, we would be around 140 or 145, he said. This year well be 158. There are old-timers who have not participated for a long time who have returned, and also many new ones.\nCharly Rombaux is among the newcomers. The 35-year-old delivery driver does not want to wear the daunting traditional hat that weighs nearly 4 kilograms (8.8 pounds) for his grand debut as a Gille.\nThe experienced Mostade had the solution pat.\nThe solution is to find three men in your company with the same head size, so you can alternate with the hat on, Mostade said as the two met for the first time this week and quickly engaged in a passionate conversation.\nThat need to get together again in a city where the Carnival creates a unique sense of belonging is a relief for the louageurs  the craftsmen making the costumes and renting them to the Gilles.\nAt some point during the pandemic, as he struggled to make ends meet, Quentin Kersten thought about calling it quits and starting anew as an electrician. His parents had to dip into their savings, forgetting about the trips they envisaged for their retirement days to salvage their business instead.\nIt was a catastrophe, Karl Kersten summed up.\nBut that dark chapter is now closed. Haumont marks his words: For a regular carnival, there is effervescence. But this year, it is just going to be madness.\nCopyright 2023 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.",
      "snippet": "... amid the pain from energy bills that went through the roof after Russias war in <b>Ukraine</b>, locals want to make this years festival one for the ages.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T07:31:31",
      "provider": {
        "name": "kstp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://kstp.com/wp-content/uploads/apimg/2023/02/APTOPIX_Belgium_Carnival_50347.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "kstp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://kstp.com/associated-press/ap-us-international/belgian-carnival-town-celebrates-again-after-covid-hiatus/"
      }
    },
    {
      "id": "3682492808213351446",
      "title": "Nepal: Dahal's govt under pressure as RSPs claim for home ministry is backed by Oli",
      "url": "https://www.firstpost.com/world/nepal-dahals-govt-under-pressure-as-rsps-claim-for-home-ministry-is-backed-by-oli-12096462.html",
      "description": "The coalition government in Nepal is divided over whether the home ministry should be given to the Swatantra Party.",
      "body": "Most Read\nMost Read\nWATCH: Jihadis bring down hammer and tongs on Ahmadi mosque in Pakistan's Karachi; 2nd in a month\nViral videos of the discretion show four men, covering their face and wearing helmets, climbing on the mosque and escaping thereafter\nHollywood action hero Steven Seagal censored for allegedly backing Russia's invasion of Ukraine\nSteven Seagal was made a Russian citizen in 2016 with President Vladimir Putin handing over Seagal his Russian passport\nFrom India's Easternmost Village to near LAC: Modi government paves way for 78-km Arunachal road\nThe Narendra Modi government on 1 February began the process to build a new road from Dong village to Jachep camp in Arunachal Pradesh, inviting bids to construct it within the next three years\nQuad agrees to leverage machine learning, related advanced technologies to enhance cybersecurity\nIn the longer term, the Group committed to leverage machine learning and related advanced technologies to enhance cybersecurity and establish secure channels for Computer Emergency Response Teams and private sector threat information sharing\nNepal could cut funds to provinces and local governments amid falling revenues\nThe economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis\nRelated Articles\nRelated Articles\nNepal could cut funds to provinces and local governments amid falling revenues\nThe economy in Nepal which was on the path of recovery following the Covid-19 pandemic has further been hit by the Ukraine crisis\nWhy have constitutional experts ruled out another term for Nepal President Bidya Bhandari?\nBidya Bhandari, the current president of Nepal will be completing her two terms in March this year\nIs discontent growing in ruling coalition in Nepal?\nThe Nagarik Unmukti Party has taken its umbrage a step further by fielding its own candidate for a vacant National Assembly member, challenging the ruling alliances candidate in the process.\nWhat is the dispute in Nepal government over giving home ministry to Swatantra Party?\nPrime Minister Pushpa Kamal Dahal also met UML Chief KP Sharma Oli to discuss the matter\nCPN-UMLs Dev Raj Ghimire elected Speaker of Nepal Parliament\nThere were two candidates in the fray for the post of the Speaker of the Nepal Parliament. Both Dev Raj Ghimire from CPN-UML and his opponent Ishwari Neupane from the Nepali Congress had filed their nominations for the post on Wednesday",
      "snippet": "... Russia's invasion of <b>Ukraine</b> Steven Seagal was ... hit by the <b>Ukraine</b> crisis Related Articles ... been hit by the <b>Ukraine</b> crisis Why have constitutional ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T07:27:18",
      "provider": {
        "name": "firstpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.firstpost.com/wp-content/uploads/2023/01/Pushpa-Kamal-Dahal.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "firstpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.firstpost.com/world/nepal-dahals-govt-under-pressure-as-rsps-claim-for-home-ministry-is-backed-by-oli-12096462.html"
      }
    }
  ]
}
