[
  {
    "body": "WhatsApp\nPersonally, I wouldnt put money on a web-based mini-game called Dookey Dash reviving much of anything, let alone an entire sub-section of a tiny crypto area. This month, though, Yuga Labs first attempt at a ape ingrained mini-game has made headlines. While the very basic game isnt reinventing the wheel, it is sparking debate and conversation at what may be an advantageous time in the crypto world.\nIf the timing is right and bull market conditions return, might Yugas Dookey Dash mini-game be seen as the tip?\nSoWhat is GameFi anyways?\nIf there is one issue that has been pushed all the way back into the ether during the bad market, it is GameFi. It was one of the biggest subjects of debate within the crypto and NFT groups in early 2022, before the bear market winds changed. Many people thought GameFi was the next big thing, and titles like Axie Infinity were gaining traction.\nAxie Infinity is based on Sky Mavis Ronin Network, an Ethereum-linked sidechain. Axie Infinity Shards/Token, or AXS for short, is the games official cryptocurrency. SLP, the games secondary token, plummeted in February 2022 as part of a larger NFT and cryptocurrency crash, dropping more than 99% of its peak value.\nBy the end of the first quarter, the market had lost steam, and the rest of the year did nothing to help crypto participants. Meanwhile NFT business groing exponentially, GameFi was successfully segregated.\nCould bull market conditions be on the horizon for cryptocurrency? If this is the case, GameFi may be in a good position to build on the momentum it gained just a year ago.\nYuga Labs & the Dookey Dash\nYuga Labs has long voiced a desire to create a larger metaverse with gamified aspects, leveraging assets such as Bored Apes and Mutant Apes. Enter Donkey Dash, the first iteration of these attempts. The title is a simple web-based mini-game that allows Ape and Mutant owners to use their NFT to try to get a high score. The winner is thought to receive a one-of-a-kind Ape.\nFormer esports pros and content makers competing to win have contributed to the excitement. Look no farther than Mongraal, a former Fortnite legend who has won the game on at least two occasions.\nMongraal has roughly a million dollars in official Fortnite earnings and was a fixture in the games most competitive zone. Mongraal has averaged approximately 8,500 viewers on Twitch in recent months, and now he stands to possibly earn more money from a mini-game than he did from years of grinding Fortnite.\nMore important, perhaps, is Mongraals involvement in promoting Dookey Dash to more mainstream gamers, a core pillar of GameFi development that has yet to be seen.\n1st dookiedash"
  },
  {
    "body": "Capital team, and networking opportunities with leading\ncrypto\nventure capital funds.\nFocusing on the priority verticals of DeFi, GameFi, SocialFi and Infrastructure, the second cohort of the Accelerator Program will be accepting applications from this week onwards until the closing date on\n24 March 2023\n. Projects will be carefully selected based on the criteria of market potential, the experience of the leadership team, market fit, and synergies with Cronos chain. The program remains focused on fostering innovation and growth within the\necosystem, the leading Cosmos-built and\nEthereum\nvirtual machine-compatible blockchain, to help propel the widespread adoption of Web3.\nCharlotte Kapoor\nwho recently joined the team as the Head of Innovation Programs at Cronos Labs commented,\n\"Scaling up a startup is no small feat, especially on the frontier of Web3. As such, this program has been designed by industry veterans who understand the potential pain points that projects face, through and through. With this in mind, we have structured the program to provide a comprehensive suite of benefits to guide founders on their journey in the development of Web3 dapps, as they leverage the many opportunities that DeFi and GameFi continue to offer.\" Charlotte brings with her five years of Web3 expertise to grow and support the development of the Accelerator Program.\nKen Timsit\n, Head of Cronos Labs said\n, \"The overwhelming response we received for our inaugural cohort of the Cronos Accelerator Program was a clear signal of our community's continued interest in growing the Cronos ecosystem. Spurred by this, the second cohort will build upon the success of its predecessor to enhance the Cronos ecosystem. Through this Accelerator and Cronos Labs' other initiatives including ecosystem grants, hackathons, and the incubator project, we are invested in the future of the Cronos chain and as a result of these efforts, the number of innovative dapps on Cronos such as D.G. Pals, VVSgotchi, Minted, and Eyeball Pool, continues to rise, helping propel the mainstream adoption of Web3 by providing appealing offerings to everyday users.\"\nIn addition to the mentorship and seed funding opportunities, the Cronos Accelerator Program will also host a Demo Day\nin early\n, where shortlisted participants will pitch their projects to investment partners of the program.\nCronos launched the Accelerator Program in\nJune 2022\n, and its first cohort, comprising nine startups selected from over 300 applicants, commenced the following month featuring partners such as Mechanism Capital,\nCrypto\n.com Capital, OKX Blockdream Ventures, Ubisoft and Longhash Ventures, as well as mentors from Cronos Labs, Spartan Labs, and IOSG Ventures among others. With three to four cohorts each year, the Cronos Accelerator Program aims to provide ongoing support through funding and guidance to the most promising new projects in Web3.\nAbout Cronos Chain\n(cronos.org) is the first EVM-compatible Layer-1 blockchain network built on the Cosmos SDK, supported by\nCrypto\nCrypto\n.org and more than 400 app developers and partners.\nCronos is building an open ecosystem where developers can create their own DeFi and GameFi applications, targeting a base of 80+ million users globally. In\nJune 2022"
  },
  {
    "body": "The monetisation aspect of gaming sector seems to head for a new direction through blockchain. In 2023, it is believed that blockchain gaming trends are expected to head for an upward trend, with non-fungible tokens (NFTs) vouched to back decentralised gaming platforms. According to MarketsandMarkets, a market research company, global blockchain gaming market is expected to reach a $65.7 billion valuation by 2027, at a 70.3% Compound Annual Growth Rate (CAGR). Experts suggest that lack of knowledge around blockchain and NFTs can restrict the sectors development. In 2023, we can expect to see a growth in blockchain gaming trends. One trend that is likely to gain momentum is the use of NFTs in gaming. Additionally, we can expect to see more games that use blockchain-based in-game economies, Rohit Bansal, founder, Super4, an online fantasy gaming platform, told FE Blockchain. Market research indicates that in 2023, decentralised gaming-based regulations will be important for prevention of anti-money laundering (AML) practices and insurance of consumer protection. Insights from World Economic Forum (WEF), an international organisation, mentioned that the introduced Responsible Financial Innovation Act in USA aims to ensure that profit-based GameFi tokens are categorised as security based on regulations. Reportedly, certain countries have launched tax on virtual digital assets transactions, for GameFi users to pay tax during in-app purchases. Also ReadBlockchain 2023: What should investors expect from the decentralised technology For governments, governing bodies and regulatory authorities, they should understand tokenomics and that not every project is the same, and rules and regulations may not apply to each project in that similar mechanism. Rather than targeting decentralised gaming, I think it would be better if the focus is on the blockchain networks and their tokenomics, Yash Pariani, founder and CEO, House of Gaming, a digital gaming metaverse-based platform, stated. From an experts perspective, decentralised gaming platforms such as Enjin, The Sandbox, Decentraland, Axie Infinity, Splinterlands, among others, will be frontrunners in 2023. As stated by Akt.io, a financial service firm, in 2023, in-game decentralised autonomous organisation (DAO) economies are expected to be a growing trend around blockchain gaming landscape. Furthermore, 2023 is proposed to be the year for solving blockchain gamings User Experience (UX) problem. Moreover, future predictions indicate that 2023 will drive mainstream blockchain gaming adoption, for players to have control over their in-game assets. As reported by Newzoo, a gaming data platform, in-game transactions will produce 9.6% revenue growth on a mobile platform in 2023. In 2023, we can expect blockchain games to evolve to become as immersive as the usual computer games we play. Beyond 2023, when the gaming world and the utilisation of the advantages of the blockchain are expected to saturate, gaming companies will want to enhance the experience by bringing in more features enabled by blockchain, Kameshwaran Elangovan, co-founder and CEO, GuardianLink, a decentralised platform, concluded. Also ReadWhat can Web3.0s potential mean for global financial landscape Follow us onTwitter,Facebook,LinkedIn"
  },
  {
    "body": "January 29, 2023, 05:36 GMT\nShare This Article\nInternet City, Dubai--(Newsfile Corp. - January 28, 2023) - LBank Exchange, a global digital asset trading platform, has listed Mashida (MSHD) on January 28, 2023. For all users of LBank Exchange, the MSHD/USDT trading pair is now officially available for trading.\nMashida Listing Banner\nhttps://images.newsfilecorp.com/files/8831/152836_d3b666260407e9ed_001full.jpg\nBuilt on blockchain technology, Mashida (MSHD) is a project that combines GameFi, SocialFi and NFT-Fi, enabling users to interact, play and earn in Web3 world. Its native token MSHD has been listed on LBank Exchange at 12:00 UTC on January 28, 2023, to further expand its global reach and help it achieve its vision.\nIntroducing Mashida\nMashida is a BEP-20 token and a Web3 platform that contains a virtual world and social and game application features that are interconnected, and people can interact virtually, work, play, and meet based on activity and interaction.\nGameFi, SocialFi and NFT-Fi are there major elements of Mashida project. In order to achieve GameFi, Mashida will establish a game and finance platform that can connect free to earn, free to play, and play to earn. And for SocialFi, Mashida will create a Web3 Social Media platform that makes user interactions safer. Furthermore, to integrate NFT with its ecosystem, Mashida uses NFT as profile identities and assets on the platform. it will adopt a dual layer/filter for the dashboard layer, with the first layer being a verified circle of friends and the outermost circle using a supporting profile.\nWith all these elements and features, Mashida provides various services. Users can set their privacy boundaries and connect with their circle of friends, stay in touch, informed, updated without missing the latest info. Users can even monetize their time, work and expertise and be more interactive with requests and offers from the community. Simply put, more interactions generate more earning opportunities and rewards.\nIn addition, users will be able to play games made by Mashida that are controlled by players, with free to play, pay to play, free to earn and play to earn in one experience and fair competition season. Players can earn crypto from interaction and competition from games and earn tokens and loyalty points to spend on exclusive offers of items and service features on the platform.\nAbout MSHD Token\nMSHD is the native token of Mashida project that combines Game-Fi, Social-Fi and NFT-Fi, enabling users to interact, play and earn in Web3 world. It will be required for the buying and selling of NFTs.\nBased on BEP-20, MSHD has a total supply of 10 billion (i.e., 10,000,000,000) tokens, of which 1% is provided for pre-sale, 32% is allocated for liquidity provision, 15% will be used for marketing, 20% is provided for the ecosystem, 15% will be used for product development, 7% is provided for the treasury, and the remaining 10% is allocated to the team.\nMSHD token has been listed on LBank Exchange at 12:00 UTC on January 28, 2023, investors who are interested in the Mashida investment can easily buy and sell MSHD token on LBank Exchange right now.\nLearn More about MSHD Token:\nOfficial Website:"
  }
]