[
  {
    "body": "MSFT\n) results last week were in line across the board, except the Personal Computing segment reported a slight miss on the top line. Notably, Personal Computing missed this quarter and is causing enough uncertainty that the CFO did not provide a fiscal year guide, which is out of character for Microsoft. Azure posted slightly better-than-expected growth of 38% compared to guidance of\n37% -- despite this December quarter beat, Microsoft is forecasting a notable slowdown in Azure to 31% to 30% -- or an 8-point deceleration sequentially.\nWith an eye toward fundamentals, Microsofts report is likely to be a reflection of whats to come. Over this past year, Microsoft was one of the strongest FAAMGs due to its ability to drive down costs for enterprises, yet even this advantage is beginning to erode. According to Satya Nadella on the December quarter earnings call: There is only one law of gravity that I think all of us are subject to, which is inflation-adjusted economic growth.\"\nIn other words, even the best companies and strong growth will slow down the longer inflation remains high. As investors, its not our job to control inflation or the Feds response, rather, we should be seeking out the highest quality companies and determining when they may bottom. Due to the market being forward-looking, the time to do that research is now with the goal of building long-term positions throughout 2023.\nBelow, we discuss the nuances to each companys fundamentals. It can take a lot of data to draw conclusions during a time of market uncertainty. Weve bolded what we think are the most important takeaways.\nRevenue Estimates for the next four quarters\nSeeking Alpha\nApples Q3 revenue grew by 8.1% YoY to $90.15 billion. Its revenue in Q4 is expected to fall 1.53% YoY to $122.05 billion and the analysts have lowered their estimates by 0.83% in the past month. Apples revenue decline will be the first since the March 2019 quarter. The consumer weakness might weigh on the upcoming results along with Covid-related production delays in China.\nApple was the only one among the three companies to beat on the top-line and bottom-line estimates in Q3.\nLooking forward, in Q1, the revenue is expected to grow 0.36% YoY to $97.63 billion and grow 4.5% and 4.7% in the following quarters. This will mark another weak growth quarter for Apple although weve argued in the past, the stock should be viewed as a value stock when we said Apple has been very consistent with its margins and cash flows.\nAmazons Q3 revenue grew by 14.7% YoY to $127.1 billion. The more important news was that Amazon offered weak Q4 guidance of $140 billion to $148 billion, which was well below the analysts' estimate of $155.37 billion at the time of Q3 results, and this led to the stock selling off after the report.\nAnalyst consensus is for revenue growth of 6.03% YoY to $145.70 billion. With that said, pending no more surprises come Thursday, Amazons growth should incrementally improve over the next four quarters.\nAlphabets Q3 revenue grew by 6.1% YoY to $69.09 billion. Analyst consensus expects Q4 revenue growth of 1.54% YoY for revenue of $76.49 billion. The companys CEO Sundar Pichai said in the Q3 earnings call:\nOur financial results for the third quarter reflect healthy fundamental growth in Search and momentum in Cloud. Our reported results reflect the effect of foreign exchange. The growth in our advertising revenues was also impacted by lapping last years elevated growth levels and the challenging macro climate.\nSimilar to Amazon, Alphabet is expected to incrementally improve revenue growth throughout 2023. Due to Azures deceleration, there will be emphasis on both AWS and Google Cloud revenue. Notably, Google Cloud accelerated last quarter while both AWS and Azure decelerated.\nTwitter\nAdjusted EPS estimates for the next four quarters\nSeeking Alpha\nApples bottom line continues to shine with minimal contraction compared to its peers. Although a return to bottom line growth is forecast for Q3 for many of the FAAMG stocks, it will greatly depend on what is stated on the upcoming earnings calls including the fiscal year guides. Microsoft pulling fiscal year guidance with only two quarters left in its fiscal year is a great example of how quickly things can change. As stated, its out of character for Microsoft to not guide for fiscal year, yet due to unique levers that Microsoft can pull, the company expects its operating margins to remain consistent.\nEPS Overview:\nApples Q3 adj. EPS came at $1.29. Analysts expect adj. EPS of $1.96 in the next quarter.\nAmazons adj. EPS came at $0.28 in Q3 and beat estimates by 35.5%. They expect Q4 adj. EPS of $0.17 and have lowered estimates by 12.5% in the past month.\nAlphabets Q3 adj. EPS came at $1.06 and missed estimates by 16%. The analysts expect Q4 adj. EPS to be $1.20.\nApple is the only company on the list that has not announced job cuts.\nPrice Action and Valuation Overview:\nYCharts\nApple stock has the highest return of 84% in the past three years, as can be seen in the above chart for the period from 01/29/2020 till 01/27/2023. Alphabet has a return of 38% and Amazon has a return of 10%.\nYCharts\nYTD Amazon has the highest return of 23%, compared to 12% for Alphabet, and 10% for Apple.\nP/S and P/E Ratio\nYCharts\nApple has a P/S ratio of 5.92, compared to 4.69 for Alphabet, and 2.11 for Amazon. Apple has a five-year average P/S ratio of 5.57, compared to 6.41 for Alphabet, and 3.71 for Amazon.\nYCharts\nAmazon has a P/E ratio of 94.84, compared to 23.40 for Apple, and 19.77 for Alphabet. Amazon has a five-year average P/E ratio of 97.10, compared to 24.05 for Apple, and 30.99 for Alphabet.\nFree Cash Flow Margin"
  },
  {
    "body": "Microsoft on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\r\n\r\nThe premium service will cost $7 (roughly Rs. 600) per month in June before increasing to $10 (roughly Rs. 800) in July, Microsoft said.\r\n\r\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.OpenAI Introduces ChatGPT Plus, a Pilot Subscription Plan, at $20 per Month\r\n\r\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet's Google.\r\n\r\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\r\n\r\nChatGPT on Wednesday announced a $20 (roughly Rs. 1,600) per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements.Beware ChatGPT Trying to Teach Your Kids Math  or Anything\r\n\r\nYesterday, ChatGPT owner OpenAI launched a pilot subscription plan for its popular AI-powered chatbot, called ChatGPT Plus, for $20 (roughly Rs. 1,600) per month. Subscribers will receive access to ChatGPT during peak times, faster responses and priority access to new features and improvements.\r\n\r\nIn a blog post published by OpenAI on Wednesday, the company introduced ChatGPT Plus, which will be initially rolling out only for the customers in the United States. The company will soon extend the access availability through inviting people from its waitlist, probably over the coming weeks. OpenAI will also be rolling out ChatGPT to more regions in the near future.\r\n\r\nEarlier this week, OpenAI also released a software tool to identify text generated by artificial intelligence.\r\n\r\n Thomson Reuters 2023\r\n\r\n\r\nThe Infinix Zero Ultra has a decent set of specifications on paper, but does the phone justify its high asking price? We discuss this and more on Orbital, the Gadgets 360 podcast. Orbital is available on Spotify, Gaana, JioSaavn, Google Podcasts, Apple Podcasts, Amazon Music and wherever you get your podcasts.\r\nAffiliate links may be automatically generated - see our ethics statement for details."
  },
  {
    "body": "Updated: February 02, 2023 10:00 am IST\nMicrosoft said it aims to add ChatGPT's technology into all its products. (File)\nMicrosoft Corp on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm. The premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc's Google.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\nPromoted"
  },
  {
    "body": "rolled out\nTeams Premium on Wednesday. Aside from a bunch of new features, the latest offering sports a more powerful performance, thanks to the power of OpenAIs ChatGPT chatbot. According to Microsoft, it will charge $7 per person monthly as introductory pricing until June 30 and return to its standard $10 per user per month price charge on July 1.\nThe main highlight of the premium service is the use of some intelligent features aimed at making meetings more intelligent, personalized, and protected. Specifically, it offers AI-generated tasks, including live translated captions, automatically generated meeting notes, recommended tasks, and personalized highlights. Other features include watermarking, recording capability limiting, personalized timeline markers, speaker timeline markers, branded meetings, customized meeting templates, and more.\nThe integration of the ChatGPT into Teams Premium is the product of Microsofts investment in the chatbots creator, OpenAI. It started with its $1 billion investment in 2019, with the software giant now having the\nthird phase\nof its investment, which it called a multiyear, multibillion dollar investment. With all this, the Redmond company is expected to inject the technology into all of its products in the future. Recently, the giant confirmed that it would soon bring it to"
  },
  {
    "body": "HSBC (2.3%)\nWhatsApp (2.2%)\nWhat are Brand Phishing Attacks? In a brand phishing attack, criminals try to imitate the official website of a well-known brand by using a similar domain name or URL, and web-page design to the genuine site. The link to the fake website can be sent to targeted individuals by email or text message. A user can be redirected during web browsing, or it may be triggered from a fraudulent mobile application. The fake website often contains a form intended to steal users credentials, payment details or other personal information.\nSpotlight on Yahoo: In Q4 of 2022, 20% of all brand phishing attempts were related to Yahoo. CPR found campaigns that included malicious phishing emails that used Yahoos branding, containing the subject YAHOO AWARD which were sent by senders with user names such as Award Promotion, Award Center, info winning or Award Winning.\nThe content of the email distributed in the campaign informed the victims that they have won prize money worth hundreds of thousands of dollars, in contests organized by Yahoo. The email then asks the recipients to send their personal and bank details, claiming this information was necessary to transfer the winning prize money to their account. In addition, the email contains a warning that the victim must not tell people about winning the prize, because of legal issues.\nMr. Omer Dembinksy, Data Group Manager at Check Point Software\nQuote:\nOmer Dembinksy, Data Group Manager at Check Point Software\n: Last quarter, 20% of all brand phishing attempts were related to Yahoo, placing it at the very top of the list for most imitated brands. Were seeing hackers trying to bait people through awards and prize money to be won. If its too good to be true, it almost always is. In general, the technology sector was the most likely industry to be imitated by brand phishing this past quarter, followed by Shipping and Social Networks. DHL reached second position in Q4 with 16% of all brand phishing attempts, ahead of Microsoft in third place with 11%. DHLs second position could possibly be due to the usual online buying season of Black Friday, Cyber Monday and the lure of online Christmas presents, with hackers using their name for fake deliveries notifications.\nYou can protect yourself from a brand phishing attack by not clicking on suspicious links or attachments and by always checking the URL of the page youre directed to. Look for misspellings and dont volunteer unnecessary information.\nExamples: Instagram, Microsoft, and Adobe\nInstagram: CPR observed a malicious phishing email that was sent from badge@mail-ig[.]com. The email was sent with the subject blue badge form, and the content tries to persuade the victim to click on a malicious link claiming that the victims Instagram account has been reviewed by the Facebook team (the owner of the Instagram brand) and has been deemed eligible for the Blue Badge.\n\nIf you have an interesting Article / Report/case study to share, please get in touch with us at"
  },
  {
    "body": "Phone Link\nwidgets. It will also introduce new treatments to the Start menu, giving users suggested actions for their Windows system.\nLast week, Microsoft introduced a preview for the Messenger widget. The move was a great indication of the software giant embracing more third-party apps in its operating system. With this, it is pleasing that just a week later, it is now introducing two new widget previews for Spotify and Phone Link.\nSpotify and Phone Link widgets\nAs expected, the layouts of both widgets offer easy access to the main functions of the apps. For Spotify, there will be instant buttons for playing some playlists, while the Phone Link widget will display relevant notifications and some of the apps main controls. The new widgets can be pinned by selecting the + sign at the top-right of the board.\nWhile the addition of third-party widgets is a surprise for those outside the Windows Insider program, the idea of having new widgets is no secret for the testers. As Microsoft notes, developers have the freedom to create and release widgets for their apps, thanks to the Windows App SDK 1.2 for developers. With this, it might mean that we are just days away from getting more widget selections for our favorite third-party applications.\nBadging on Windows 11 Start menu\nOn the other hand, aside from new widgets, Microsoft is also testing new treatments for its Start menu in Build 25290. Specifically, Dev Insiders will see badging on their user profile or some options suggesting actions for their systems. The new badging will show two new treatments that will be distributed to different Dev Insiders. The first one features a simple suggestion for baking up files, while the other one comes with some descriptions and additional options.\nThis treatment started in October with"
  },
  {
    "body": "https://str.sg/wthB\nSAN FRANCISCO\n Pinterest is laying off about 150 employees, the latest technology company to cut costs in a turbulent time for an industry that expanded rapidly over the past few years.\nThe digital search company that lets users create online pinboards informed affected employees on Wednesday.\nThe move affected less than 5 per cent of Pinterests total workers, according to a person familiar with the company. Pinterest had about 4,000 employees as at the end of the third quarter. The job cuts came from teams across the San Francisco-based company, although not all were affected to the same degree, the person said.\nWe are making organisational changes to further set us up to deliver against our company priorities and our long-term strategy, a Pinterest spokesman said in a statement. All of the employees who were impacted contributed to Pinterest and as they transition, we are committed to supporting them with separation packages, benefits and other services.\nPinterest joins a range of tech companies that have pared their ranks in recent months. Amazon.com, Microsoft, Meta Platforms and Google parent Alphabet have all announced job cuts in the thousands.\nPinterest was recently the target of activist investors from Elliott Management, and one of the firms managers was added to the companys board. BLOOMBERG\nMore On This Topic"
  },
  {
    "body": "Microsoft-backed AI research and deployment company OpenAI has announced the launch of its pilot subscription plan for its popular AI-powered ChatGPT chatbot. The new subscription plan, called ChatGPT Plus, will be available for $20 per month.\n&#8220;Were launching a pilot subscription plan for ChatGPT, a conversational AI that can chat with you, answer follow-up questions, and challenge incorrect assumptions. ChatGPT Plus is available to customers in the US, and we will begin the process of inviting people from our waitlist over the coming weeks. We plan to expand access and support to additional countries and regions soon,&#8221; the company said on the new tools page.\nAccording to OpenAI subscribers will receive a number of benefits: General access to ChatGPT, even during peak times, Faster response times amd Priority access to new features and improvements\nThe company will continue to offer free access to ChatGPT. By offering this subscription pricing, they will be able to help support free access availability to as many people as possible.\n&#8220;We launched ChatGPT as a research preview so we could learn more about the systems strengths and weaknesses and gather user feedback to help us improve upon its limitations. Since then, millions of people have given us feedback, weve made several important updates and weve seen users find value across a range of professional use-cases, including drafting &amp; editing content, brainstorming ideas, programming help, and learning new topics,&#8221; the website reads.\nIn related news, OpenAI recently launched a new tool called The AI Text Classifier; which can detect AI-generated content. The AI Text Classifier is a fine-tuned GPT model that predicts whether a piece of text was generated by AI from a variety of sources, such as ChatGPT.\nAccording to the company, AI Text Classifiers reliability typically improves as the length of the input text increases. Compared to a previously released classifier, this new tool is significantly more reliable on text from more recent AI systems.\nRead all the Latest Tech News here"
  },
  {
    "body": "Microsoft Corp on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm. The premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said. OpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users. Microsoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc's Google. The chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in. ChatGPT on Wednesday announced a $20 per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements."
  },
  {
    "body": "Microsoft Corp\non Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival"
  },
  {
    "body": "Microsoft Corp\non Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival"
  },
  {
    "body": "Copy URL\nCopied\nThe report, citing Similar Web data, says about 13 million unique visitors used ChatGPT per day in January, more than double the levels in December\nChatGPT, the popular chatbot from OpenAI, is estimated to have reached 100 million monthly active users in January, just two months after launch, making it the fastest-growing consumer application in history, according to a UBS study on Wednesday, February 1.\nThe report, citing data from analytics firm Similar Web, said about 13 million unique visitors used ChatGPT per day in January, more than double the levels in December.\nIn 20 years following the internet space, we cannot recall a faster ramp in a consumer internet app, UBS analysts wrote in the note.\nSimilar Web did not immediately respond to a request to confirm the figures. OpenAI, a private company backed by Microsoft, launched ChatGPT in late November.\nIt took TikTok about nine months after its global launch to add 100 million users and it took Instagram 2-1/2 years, according to data from Sensor Tower.\nChatGPT is currently free to use. The company on Thursday launched a $20 a month subscription that provides more stable and faster service as well as the opportunity to try new features first.\nMust Read\nChatGPT owner launches imperfect tool to detect AI-generated text\nAnalysts believe the viral launch of ChatGPT will give OpenAI a first-mover advantage against other AI companies. The growing usage, while adding up to a substantial amount of computing cost, has also provided valuable feedback to help train the chatbots responses.\nThe tool has also raised questions about academic dishonesty and misinformation.\nLast month, Microsoft announced another\nin the form of cash and cloud credit.  Rappler.com\nAdd a comment"
  },
  {
    "body": "Reuters\nMicrosoft Teams app is seen on the smartphone placed on the keyboard in this illustration taken, July 26, 2021. REUTERS/Dado Ruvic/Illustration\nFeb 1 (Reuters) - Microsoft Corp (MSFT.O) on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc's (GOOGL.O) Google.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\nLatest Updates"
  },
  {
    "body": "music\nand video  have been pioneered in Googles vast research arm.\nSo we have an important stake in this area, but we also have an important stake in not just leading in being able to generate things, but also in dealing with information quality, said Zoubin Ghahramani, vice president of research at Google, in a November interview with The Associated Press.\nGhahramani said the company wants to also be measured about what it releases, and how: Do we want to make it accessible in a way that people can produce stuff en masse without any controls? The answer to that is no, not at this stage. I dont think it would be responsible for us to be the people driving that.\nAnd they werent. Four weeks after the AP interview, OpenAI released its ChatGPT for free to anyone with an internet connection. Millions of people around the world have now tried it, sparking searing discussions at schools and corporate offices about the future of education and work.\nOpenAI declined to comment on comparisons with Google. But in announcing their extended partnership in January, Microsoft and OpenAI said they are committed to building AI systems and products that are trustworthy and safe.\nAs a literary assistant, neither ChatGPT nor Googles creative writing version comes close to what a human can do, Sloan said.\nA fictionalized Google was central to the plot of Sloans popular 2012 novel about a mysterious San Francisco bookstore. Thats likely one reason the company invited him along with several other authors to test its experimental Wordcraft Writers Workshop, derived from a powerful AI system known as LaMDA.\nLike other language-learning models, including the GPT line built by OpenAI, Googles LaMDA can generate convincing passages of text and converse with humans based on what its processed from a trove of online writings and digitized books. Facebook parent Meta and Amazon have also built their own big models, which can improve voice assistants like Alexa, predict the next sentence of an email or translate languages in real time.\nWhen it first announced its LaMDA model in 2021, Google emphasized its versatility but also raised the risks of harmful misuse and the possibility it could mimic and amplify biased, hateful or misleading information.\nSome of the Wordcraft writers found it useful as a research tool  like a faster and more decisive version of a Google search  as they asked for a list of rabbit breeds and their magical qualities or a verb for the thing fireflies do or to Tell me about Venice in 1700, according to Googles paper on the project. But it was less effective as a writer or rewriter, turning out boring sentences riddled with clichs and showing some gender bias.\nI believe them  that theyre being thoughtful and cautious, Sloan said of Google. Its just not the model of a reckless technologist who is in a hurry to get this out into the world no matter what.\nGoogles development of these models hasnt been without internal acrimony. First,\nit ousted\nsome prominent researchers who were examining the risks of the technology. And last year, it fired an engineer who publicly posted a conversation with LaMDA in which the model falsely claimed it had human-like consciousness, with a range of both feelings and emotions.\nWhile ChatGPT and its competitors might never produce acclaimed works of literature, the expectation is they will soon begin to transform other professional tasks  from helping to debug computer code to composing marketing pitches and speeding up the production of a slide presentation.\nThats key to why Microsoft, as a seller of workplace software, is eager to enhance its suite of products with the latest OpenAI tools. The benefits are less clear to Google, which largely depends on the advertising dollars it gets when people search for information online.\nIf you ask the question and get the wrong answer, its not great for a search engine, said Dexter Thillien, a technology analyst for the London-based Economist Intelligence Unit.\nMicrosoft also has a search engine  Bing  but ChatGPTs answers are too inaccurate and outdated, and the cost to run its queries too expensive, for the technology to pose a serious risk to Googles dominant search business, Thillien said.\nGoogle has said that its earlier large language model, named BERT, is already playing a role in answering online searches. Such models can help generate the fact boxes that increasingly appear next to Googles ranked list of web links.\nAsked in November about the hype around AI applications such as OpenAIs image-generator DALL-E, Ghahramani acknowledged, in a playful tone, that its a little bit annoying sometimes because we know that we have developed a lot of these technologies.\nWere not in this to get the likes and the clicks, right? he said, noting that Google has been a leader in publishing AI research that others can build upon.\nLearn how to navigate and strengthen trust in your business with The Trust Factor, a weekly newsletter examining what leaders need to succeed."
  },
  {
    "body": "Email\nLinkedIn\nMicrosoft Corp on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc's Google.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\nChatGPT on Wednesday announced a $20 per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements.\nSource: Reuters"
  },
  {
    "body": "Copy article link\nSave\nNEW YORK  Microsoft Corp. on Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc.'s Google.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\nChatGPT on Wednesday announced a $20 per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements.\nCopy article link"
  },
  {
    "body": "OpenAI brand, picture by Jonathan Raa\nNurPhoto through Getty Photos\nAlarm bells have been going off at Google ever for the reason that intelligent chatbot, ChatGPT, landed on the scene on Nov. 30 and went viral dazzling customers with its capacity to reply queries, write code and create content material intelligently and with a captivating human-like persona.\nHowever for all the astonishing issues ChatGPT can do, its beta model is just not linked to the web, and so whereas it may inform you what to put on to ace an interview, its not but capable of drive commerce to shops the place you should buy the precise outfit.\nEnter the search giants looking for to grow to be first movers.\nCNBC has discovered that Google is testing a chatbot rival known as Apprentice Bard primarily based on Googles LaMDA conversational expertise to supply question-and-answer search. Since December, the corporate has been working below Code Crimson with its chief govt officer Sundar Pichai enlisting founders Larry Web page and Sergey Brin to advise on dashing AI-powered search merchandise to market, in response to The New York Occasions. In January, the corporate started a reorganization with mass layoffs to align with its new priorities.\nThis comes as Microsoft introduced on Jan. 23 its third spherical of funding in ChatGPT-creator OpenAI. In a multi-billion greenback deal, the software program big plans to combine generative AI expertise throughout its Azure cloud platform and scale supercomputing breakthroughs. The corporate can be planning to launch a GPT-4 model of its Bing search engine within the coming weeks, in response to Semafor, which is anticipated to be quicker and extra highly effective than ChatGPT, a GPT-3 mannequin.\nOthers planning to launch AI bot companies subsequent month embody Chinese language web search big Baidu, in response to Reuters, and Silicon Valley-based enterprise software program platform C3.ai which boosted its inventory value on Jan. 31 when it introduced that will probably be unveiling its personal generative AI search instrument on the C3 Rework convention in Boca Raton, Florida on Mar. 7.\nHowever can ChatGPT save 2023?\nWith the Fed persevering with its marketing campaign of elevating rates of interest to calm inflation, many see innovation in generative AI because the silver bullet that may drive progress throughout this era of financial uncertainty.\nAmongst them, Y Combinator president and chief govt officer Garry Tan.\nThe famend Silicon Valley accelerator finest identified for launching a few of the worlds largest tech corporations together with Airbnb, Cruise, and Instacart, additionally incubated ChatGPT-maker OpenAI when it was based as a nonprofit in 2015 with backing by then-YC president Sam Altman, YC cofounder Jessica Livingston, and PayPal alumni Elon Musk, Peter Thiel and Reid Hoffman, amongst others, in response to Vainness Honest.\nTan stated he has seen a flood of ChatGPT-related pitches with finest use instances within the areas of software program programming. YC investments within the house embody coding platform Replit, database interface Outerbase, note-taker Cogram, and content material creator Jasper.ai.\nIts the brand new frontier  like engaged on Fb apps or iOS apps when these platforms have been new, stated Tan. However he cautioned that it might take 5 to 10 years for Google-scale corporations to emerge from this wave, related timing to the arrival of cell as thats how lengthy it tends to take for brand spanking new applied sciences to root.\nMorgan Blumberg, an investor on the enterprise capital agency M13, has additionally seen an inflow of corporations tackling advanced issues using the developments in massive language fashions on picture and voice information.\nNow we have invested in a number of productiveness instruments that use LLM like GPT3 to additional automate and improve each day work. Coding, content material creation, relationship administration, search and information presentation are the subsequent areas during which we see disruptive potential for generative AI, she stated.\nGold rush is on\nFor these looking for to tinker with the mannequin, the corporate has simply launched a $20 subscription model known as ChatGPT Plus which offers entry throughout excessive demand durations with quicker response speeds and precedence entry to new options. The corporate can be persevering with to supply its free model at chat.openai.com which its utilizing to coach the mannequin. Builders can entry OpenAIs APIs at openai.com/api."
  },
  {
    "body": "Microsoft Corp\nMSFT.O\non Wednesday rolled out a premium Teams messaging offering powered by ChatGPT to simplify meetings using the AI chatbot that has taken Silicon Valley by a storm.\nThe premium service will cost $7 per month in June before increasing to $10 in July, Microsoft said.\nOpenAI-owned ChatGPT will generate automatic meeting notes, recommend tasks and help create meeting templates for Teams users.\nMicrosoft, which announced a multi-billion dollar investment in OpenAI earlier this month, has said it aims to add ChatGPT's technology into all its products, setting the stage for more competition with rival Alphabet Inc's\nGOOGL.O\nGoogle.\nThe chatbot, which can produce prose or poetry on command, is at the forefront of generative AI, a space where more and more big tech companies are funneling their resources in.\nChatGPT on Wednesday announced a $20 per-month subscription plan, which will let subscribers receive access to faster responses and priority access to new features and improvements.\n(Reporting by Chavi Mehta in Bengaluru; Editing by Subhranshu Sahu)\n(("
  },
  {
    "body": "Feb 2, 2023 7:28 am PST\nImage: Microsoft\nYoud think that collaborative chatting programs like Slack or Teams wouldnt need too many bells and whistles in order to be effective tools. Microsoft would beg to differ. The new Teams Premium tier not only includes the usual unlimited messages and better organizational tools, its adding exclusive powers enabled by OpenAIs GPT 3.5 language model. The new tier will be $10 per month per user starting on June 30th, but you can get a cheaper preview for $7 until then.\nWhat does the fancy AI do? Its mostly one headline feature, intelligent recap. This tool can watch meetings with Teams video feature and automatically generate meeting notes and recommended tasks, as well as a full transcription of whats spoken in the meeting and by whom. Itll also generate automatic chapter divides for recorded meetings, though at launch it only works if you use PowerPoint Live  which seems like something you could do without resorting to prodigious AI number-crunching.\nPremium users will also be able to apply watermarks to Teams video and select which participants can record and which cannot, combining with sensitivity labels to create a larger focus on privacy and security. Less notable additions include expanded webinar tools and more robust alerts for meetings.\nAs noted by The Verge, the new Premium tier is also stealing some features away from the previous paid tier ($4 per user per month). Live translations for captions in 40 languages will remain on the bottom tier for the next 60 days, but will then be exclusive to Premium. Company-wide custom backgrounds and virtual appointments are also on the chopping block for less lucrative users.\nGPT-powered additions to Teams are only the latest in the companys wave of AI-infused tools. Microsofts Designer program uses extensive AI-generated art for publishing, and the company has been experimenting with ChatGPT in its Bing browser, among other pushes. Seeing all of these AI-powered additions to Microsoft software is a reminder of some of its less people-friendly actions as of late, like hosting an exclusive Sting concert for executives just a few hours before announcing 10,000 job cuts."
  },
  {
    "body": "please click here>>>\nHere are the key points:\nFor the 191 S&P 500 companies that have reported Q4 results, total earnings are up +1.5% from the same period last year on +7.2% higher revenues, with 72.3% beating EPS estimates and 67.5% beating revenue estimates.\nThe proportion of these 191 index members beating both EPS and revenue estimates at 53.4% compares to the average for the preceding 20 quarters of 60.1% (the range is a high of 81.7% and low of 46.6%).\nLooking at 2022 Q4 as a whole, aggregate S&P 500 earnings are currently expected to be down -6.4% on +4.7% higher revenues. Excluding the Energy sectors strong contribution, Q4 earnings for the rest of the index are expected to be down -10.4% on +3.7% higher revenues.\nFor 2023 Q1, S&P 500 earnings are currently expected to be down -7.2% on +2.5% higher revenues. This is down from -4% on January 6th and -2.9% in mid-December 2022.\nLooking at the calendar-year picture, total S&P 500 earnings are on track to be up +4.2% in 2022 and expected to decrease -0.2% in 2023. On an ex-Energy basis, total 2022 index earnings would be down -2.6% (instead of +4.2%, with Energy) while 2023 earnings would be up +1.7% (instead of down -0.2%).\nThe Q4 earnings season continues to show that while growth is moderating and decelerating, it isnt falling off the cliff that many appeared to fear could be in store for us.\nWe earlier cited the example of Microsoft MSFT where cyclical forces appeared to be starting to weigh on the growth trajectory of its cloud business. A number of other cloud players have since confirmed those emerging spending trends from business customers.\nThis is a logical extension of the cumulative effects of Feds extraordinary monetary policy since March 2022 that many in the market hope is getting close to the finish line.\nBusinesses and households are starting to rein in their spending plans and a number of high-profile companies have announced major layoffs. The labor market still remains strong, helping support households purchasing power. But the overall operating landscape has become difficult for all companies. This puts a premium on managements abilities to execute in a tough environment.\nBeyond the Feds role in the macroeconomic slowdown is the post-Covid adjustment in a number of important slices of the economy. One such example of ongoing adjustments is in the semiconductor space where companies struggled to meet surging demand over the last two years and are now faced over-supplied markets.\nIntel INTC is faced with a host of company-specific issues, but the unfavorable supply-demand fundamentals of the chip space isnt helping its broader turnaround efforts. The market gave a thumbs down to the Intel release but appreciated Advanced Micro Devices AMD effort, though both are faced with the same market fundamentals, broadly speaking.\nThe bigger point here isnt to pick on Intel or give undue credit to AMD, but rather to point out the macro forces weighing on growth. It is post-Covid adjustment for Intel, AMD and a host of other companies in different industries on top of cyclical forces resulting from tighter financial conditions.\nAs noted in this space before, GDP growth estimates for the current and coming quarters have been steadily coming down, with full-year 2023 GDP growth now barely in positive territory.\nWe have been pointing out for a while now how estimates for this year have been steadily coming down for months now, in anticipation of this macroeconomic development.\nAs noted earlier, the current aggregate earnings total for the index approximates to an index EPS level of $216.07, down from $242.98 in mid-April, 2022.\nThe Overall Earnings Picture\nEarnings next year are now expected to be down -0.2%. This can hardly be called out-of-sync with a flat or even modestly down economic growth outlook. Dont forget that headline GDP growth numbers are in real or inflation-adjusted terms while S&P 500 earnings discussed here are not.\nAs mentioned earlier, 2023 aggregate earnings estimates on an ex-Energy basis are already down by almost -14% since mid-April 2022. Perhaps we see a bit more downward adjustments to estimates over the coming weeks, after more companies report Q4 results and provide guidance along the lines of what we saw with Microsoft. But we have nevertheless already covered some ground in taking estimates to a fair or appropriate level.\nThis is particularly so if whatever economic downturn lies ahead proves to be more of the garden variety rather than the last two such events. Recency bias forces us to use the last two economic downturns, which were also among the nastiest in recent history, as our reference points. But we need to be cautious against that natural tendency as the economys foundations at present remain unusually strong.\nWhy Havent You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\nhttps://www.zacks.com\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit\nfor information about the performance numbers displayed in this press release.\nZacks Names \"Single Best Pick to Double\"\nFrom thousands of stocks, 5 Zacks experts each have chosen their favorite to skyrocket +100% or more in months to come. From those 5, Director of Research Sheraz Mian hand-picks one to have the most explosive upside of all.\nIts a little-known chemical company thats up 65% over last year, yet still dirt cheap. With unrelenting demand, soaring 2022 earnings estimates, and $1.5 billion for repurchasing shares"
  },
  {
    "body": "Microsoft revises multi-channel advertising approach and discontinues bid modifiers for audience ads\nMicrosoft revises multi-channel advertising approach and discontinues bid modifiers for audience ads\nTogether, Microsoft says their Search and Audience networks can reach over a billion people.\nNicole Farley\non February 2, 2023 at 10:24 am | Reading time: 3 minutes\nMicrosoft has revised its multi-channel strategy, which will be accessible for all advertisers on February 21st. Additionally, the audience ad bid modifier will no longer be visible in your campaign settings.\nMicrosoft says Instead of using positive or negative bid modifiers to manually adjust participation in the audience network, all you need to do is define your goals, and Microsoft Advertising will fully optimize your campaigns across channels. This will help you more easily manage your campaigns and find the best users in every auction to drive a strong ROI.\nDriving new changes. Microsoft conducted research on accounts utilizing both search and audience traffic and showed that advertisers get the best results by combining their efforts on Microsoft Search and the Audience Network. Their findings reveal that people who view a brands ad on both networks visit the website 2.6 times more frequently compared to those who only see the ad on search. Microsoft says this increased website traffic also leads to higher conversion rates, with users converting 6.6 times more frequently. This highlights the importance of utilizing both search and audience together, as reaching the same user through multiple channels can increase engagement and sales.\nEarly testing. Microsoft has been piloting the new multi-channel approach over the past year. After strong beta results, were rolling out this experience to all advertisers. Our results show that accounts already using multi-channel management have seen14% higher conversion rates at 21% lower cost per acquisition (CPA).\nMore Microsoft changes and updates. Microsoft has been making an effort to improve its ad platform significantly. Last year they announced ambitious plans to double the size of its ad business to $20 billion, though no specific timeframe was given.\nBut some brands are still unsure. Their FY23Q2 earnings reported that advertising spend declined slightly more than expected. Mass layoffs also impacted about 5% of its 220,000 workers. But despite a mediocre performance, ad revenue still increased by 5%, and LinkedIn revenue was up 14%.\nIt could be possible that the number of changes and updates Microsoft has made over the last year was enough to increase revenue. With Google continuing to push automation and taking away advertisers control, advertisers could look at Microsoft as a hail Mary.\nDig deeper. You can read the announcement from Microsoft here.\nWhy we care. Microsoft provides innovative tools, channels, and creative options to advertisers. Utilizing both search and audience together could lead to higher performance and drive lift in your campaigns. However, without more widespread adoption of the platform, these advancements may not reach their full potential."
  },
  {
    "body": "COMMENTS\nThe end of third-party Twitter clients\nTwitter unceremoniously shut off access to most third-party apps nine days agoa crude evening failure followed by rushed-out policy changes to suggest, if nothing else, that it was at least        READ THE REST\nGoogle to lay off 12,000 workers\nGoogle is to lay off 12,000 workers, writes CEO Sundar Pichai. we hired for a different economic reality than the one we face today The announcement comes two days after        READ THE REST\nMicrosoft announces 10,000 layoffs, 5% of its workforce\nMicrosoft is \"focusing on our short- and long-term opportunity\", which is to say it's laying off 10,000 people. First, we will align our cost structure with our revenue and where        READ THE REST\nElevate your listening experience with these revolutionary wireless earbuds, now $10 off\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views. Wireless headphones are no longer a        READ THE REST\nRelieve muscle and joint pain with this smart percussion massager for only $59.99\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views. Calling all athletes, workout enthusiasts, and        READ THE REST\nMake static shocks a thing of the past with this sleek $15 anti-static keychain\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views. Cooler temperatures are usually considered a        READ THE REST\nRead the rules you agree to by using this website in our Terms                            of                            Service.\nWe are a participant in the Amazon Services LLC Associates Program, an affiliate advertising                        program                        designed to provide a means for us to earn fees by linking to Amazon.com and affiliated                        sites.\nBoing Boing uses cookies and analytics trackers, and is supported by advertising, merchandise                        sales                        and affiliate links. Read about what we do with the data we gather in our Privacy Policy.\nWho will be eaten first? Our forum rules are detailed in the Community Guidelines.\nBoing Boing is published under a Creative Commons                            license except where otherwise noted."
  },
  {
    "body": "OpenAI logo, photo by Jonathan Raa\nNurPhoto via Getty Images\nAlarm bells have been going off at Google ever since the clever chatbot, ChatGPT, landed on the scene on Nov. 30 and went viral dazzling users with its ability to answer queries, write code and create content intelligently and with a charming human-like personality.\nBut for all of the astonishing things ChatGPT can do, its beta version is not connected to the internet, and so while it can tell you what to wear to ace an interview, its not yet able to drive commerce to stores where you can buy the actual outfit.\nEnter the search giants seeking to become first movers.\nCNBC has learned\nthat Google is testing a chatbot rival called Apprentice Bard based on Googles LaMDA conversational technology to offer question-and-answer search. Since December, the company has been operating under Code Red with its chief executive officer Sundar Pichai enlisting founders Larry Page and Sergey Brin to advise on speeding AI-powered search products to market, according to The New York Times. In January, the company began a reorganization with mass layoffs to align with its new priorities.\nThis comes as Microsoft announced on Jan. 23 its third round of investment in ChatGPT-creator OpenAI. In a multi-billion dollar deal, the software giant plans to integrate generative AI technology across its Azure cloud platform and scale supercomputing breakthroughs. The company is also planning to release a GPT-4 version of its Bing search engine in the coming weeks, according to Semafor, which is expected to be faster and more powerful than ChatGPT, a GPT-3 model.\nOthers planning to release AI bot services next month include Chinese internet search giant Baidu, according to Reuters, and Silicon Valley-based enterprise software platform C3.ai which boosted its stock price on Jan. 31 when it announced that it will be unveiling its own generative AI search tool at the C3 Transform conference in Boca Raton, Florida on Mar. 7.\nMORE FOR YOU\nThe Green Comet Skychart You Need To See It This Weekend Beside A Really Bright Star\nBut can ChatGPT save 2023?\nWith the Fed continuing its campaign of raising interest rates to calm inflation, many see innovation in generative AI as the silver bullet that can drive growth during this period of economic uncertainty.\nAmong them, Y Combinator president and chief executive officer Garry Tan.\nThe renowned Silicon Valley accelerator best known for launching some of the worlds largest tech companies including Airbnb, Cruise, and Instacart, also incubated ChatGPT-maker OpenAI when it was founded as a nonprofit in 2015 with backing by then-YC president Sam Altman, YC cofounder Jessica Livingston, and PayPal alumni Elon Musk, Peter Thiel and Reid Hoffman, among others, according to Vanity Fair.\nTan said he has seen a flood of ChatGPT-related pitches with best use cases in the areas of software programming. YC investments in the space include coding platform Replit, database interface Outerbase, note-taker Cogram, and content creator Jasper.ai.\nIts the new frontier  like working on Facebook apps or iOS apps when those platforms were new, said Tan. But he cautioned that it could take five to 10 years for Google-scale companies to emerge from this wave, similar timing to the advent of mobile as thats how long it tends to take for new technologies to root.\nMorgan Blumberg, an investor at the venture capital firm M13, has also seen an influx of companies tackling complex problems utilizing the advancements in large language models on image and voice data.\nWe have invested in several productivity tools that use LLM like GPT3 to further automate and enhance daily work. Coding, content creation, relationship management, search and data presentation are the next areas in which we see disruptive potential for generative AI, she said.\nGold rush is on\nFor those seeking to tinker with the model, the company has just launched a $20 subscription version called ChatGPT Plus which provides access during high demand periods with faster response speeds and priority access to new features. The company is also continuing to offer its free version at chat.openai.com which it is using to train the model. Developers can access OpenAIs APIs at openai.com/api.\nFollow me on"
  },
  {
    "body": "1\ncomment\nIt is update time for those using PowerToys on Windows 10 and 11. Version 0.67.0 is now available for download with numerous fixes, improvements, and minor changes. The highlight of this release is the availability of the Quick access system tray launcher, which you can see in action below.\nThere's also a good number of fixes included in this release, and perhaps importantly, PowerToys registry settings have been moved from the general machine scope (HKLM) to user scope (HKCU).\nHere are the highlights of the update:\nHighlights\nAll PowerToys registry entries are moved from machine scope (HKLM) to user scope (HKCU).\nQuick access system tray launcher. Thanks"
  },
  {
    "body": "Microsoft said on Tuesday that it has taken steps to disable fake Microsoft Partner Network (MPN) accounts used to build applications OAuth malicious as part of a phishing campaign designed to violate organizations cloud environments and steal email.\nWhat is the OAuth protocol in a nutshell\nFor the uninitiated OAuth is a protocol that was designed for HTTP sites, citing wikipedia allows an authorization server to issue an access token to a third-party client, subject to approval by the user who owns the resource to be accessed.\nBasically you send a signal with this protocol and on the other side someone (or some program) authorizes you to enter.\nHow the abuse of this protocol happened\nThe applications created by these malefactors were then used in a consent phishing campaign, which tricked users into granting permissions to the fraudulent apps, has said US tech giant. This phishing campaign targeted a subset of customers primarily based in the UK and Ireland.\nConsent phishing is an attack social engineering whereby users are tricked into granting permissions to malicious cloud applications, which can then be used as weapons to gain access to legitimate cloud services and sensitive user data.\nNBA: Los Angeles Lakers visit the Boston Celtics this afternoon in the classic of classics in the league\nThe Windows maker said it became aware of the campaign on December 15, 2022 and has since alerted affected customers by email; the company also noted that the perpetrators of these cyberthreats abused consent to filter mailboxes.\nAdditionally, Microsoft said that it has implemented additional security measures to enhance the auditing process associated with the Microsoft Cloud Partner Program (formerly known as MPN) and minimize the potential for fraudulent behavior (exploiting OAuth protocol bugs) in the future.\nDisclosure coincides with a report published by Proofpoint on how bad actors exploited the OAuth protocol bug successfully the status of \nverified publisher\n by Microsoft to infiltrate organizations cloud environments.\nWhat is remarkable about this campaign is that by imitating famous brands, the hackers have also managed to trick Microsoft into getting the verified blue badge. The actor used fraudulent partner accounts to add a verified publisher to OAuth app registrations created in Azure ADexplained the company.\nThese attacks, which first appeared on December 6, 2022, used similar versions of legitimate applications like Zoom to trick targets into authorizing access and facilitate data theft. Targets included finance, marketing, managers and senior executives.\nBasically this OAuth bug is exploited via a fake login\nProofpoint noted that malicious OAuth protocol applications had far-reaching delegated permissions such as reading emails, adjusting mailbox settings, and accessing files and other data linked to the users account .\nHe also stated that, unlike a previous campaign that compromised existing Microsoft verified publishers to exploit OAuth app privileges, the latest attacks are designed to impersonate legitimate publishers to be verified and distribute the unauthorized applications.\nTwo of the applications in question were named Single Sign-on (SSO), while the third application was named Meeting in an attempt to masquerade as video conferencing software; all three applications, created by three different publishers, targeted the same companies and leveraged the same infrastructure controlled by the attackers.\nPotential impact to organizations includes compromised user accounts, data exfiltration, brand abuse of impersonated organizations, corporate email compromise (BEC) fraud, and mailbox abusesaid the corporate security firm."
  },
  {
    "body": "Microsoft is working on major File Explorer upgrades\n, and a part of those upgrades is making tabs more usable and less crippled. As of now, File Explorer suffers from poor performance and missing features, such as the ability to drag a tab to create a new window or move a tab across windows. Customers running Windows 11 build 25290 can now turn on a feature ID responsible for dragging tabs and creating new File Explorer windows.\nBuild 25290 includes a neat new hidden feature letting you drag a tab in File Explorer out of one window to open it in its own new window!\nvivetool /enable /id:39661369\nand unpack the files in a convenient and easy-to-find folder.\nPress Win + X and select Terminal (Admin).\nSwitch Windows Terminal to the Command Prompt profile with the Ctrl + Shift + 2 shortcut or by clicking the arrow-down button at the top of the window.\nNavigate to the folder containing the ViveTool files with the CD command. For example, if you have placed ViveTool in C:\\Vive, type CD C:\\Vive.\nType vivetool /enable /id:39661369 and press Enter.\nRestart your computer.\nYou can disable the ID by replacing /enable with /disable in the command in step 5. You might, at some point, do that since the updated File Explorer is buggy and does not support moving a tab between existing windows (only dragging it out). Perhaps, the best idea is to wait for Microsoft to deliver a more polished experience in the upcoming Windows 11 preview builds.\nTags"
  },
  {
    "body": ", OpenAI expects to bring nearly $200 million in revenue this year and to touch the $1 billion figure by 2024.\nPay more to play more\nT. Schneider/Shutterstock\nIt now seems OpenAI's plans of milking money from ChatGPT begin with a subscription. For $20 per month, a ChatGPT Plus subscription promises access to the AI even during peak hours. Right now, regular users often find themselves waiting out overcrowded ChatGPT servers because of too many concurrent enthusiasts, none of whom are paying customers.\nIn addition to steady access, ChatGPT Plus will also boost the pace at which users get responses to their queries. Furthermore, subscribers will get priority access to new functionalities and upgrades made to the system. ChatGPT Plus has already gone live in the U.S. market, and the company says it will start putting interested parties on the waitlist in the coming weeks. The subscription service will be expanded to more regions soon.\nOn the business side of things, Microsoft has announced some ambitious plans for ChatGPT. Semafor reports that Microsoft will integrate a faster iteration of ChatGPT to improve the in-house Bing search engine in a bid to challenge Google's dominance in the web search game. The company is also pouring billions of dollars into the company (via\n), with the intention of using \"OpenAI's models across our consumer and enterprise products.\"\nRecommended"
  },
  {
    "body": "February 1, 2023\nChatGPT Plus, for $20 per month, will be available exclusively in the U.S., with OpenAI saying in a blog post that it will begin the process of inviting people from our waitlist over the coming weeks. We plan to expand access and support to additional countries and regions soon.\nThe subscription tier will provide a number of benefits, according to a statement from the Edwards, California-based company, including access even during peak times, plus faster response times and priority access to new features and improvements.\nWe love our free users and will continue to offer free access to ChatGPT, the post added. By offering this subscription pricing, we will be able to help support free access availability to as many people as possible.\nAlso Read:\nOpenAIs ChatGPT May Be Rejecting Prompts That Violate Copyright\nThe AI chat bot, which debuted in November, is able to generate text in response to prompts. From being banned in K-12 schools over cheating or plagiarism concerns, to being utilized in the halls of Congress, where a Boston-area Democrat congressman used ChatGPT to write a speech prodding federal lawmakers debate the innovative technology, the chat bot has already seen a fair share of controversy.\nOpenAI called the rollout of its proprietary AI chat bot a research preview from which it would learn about the systems strengths and weaknesses and gather user feedback to help us improve upon its limitations.\nMoving forward, the company said its plans are to refine and expand while teasing that soon it would launch ChatGPT API waitlist and was actively exploring options for lower-cost plans, business plans, and data packs for more availability.\nAlso Read:"
  },
  {
    "body": "1\ncomment\nMicrosoft's Xbox support page currently shows that the Xbox Live gaming online service is having some issues. The specific message states, \"You may have problems joining multiplayer games, or finding other players.\" This is being labeled as a \"major outage\" by the company. So far we don't know why this online matchmaking issue is happening. Microsoft is currently working on the issue, and we will update this post when we have more information. You can also click on the support page above to get the most up-to-date info.\nRight now, the online multiplayer portions of Xbox Live seem to be the only features that are not working. Other Xbox online services, such as cloud gaming, remote play, and social networking, are not being affected by an outage at this time.\nTags"
  },
  {
    "body": "in the Microsoft Store and update to the latest version of the apps, Next open the widgets board and navigate to the widgets picker by clicking the \"+\"button to pin your widgets.\nChanges and improvements in this build include:\n[Start menu]\nBuild 25227\n, Microsoft started trying out a small change to the Start menu where some Insiders saw badging on their user profile notifying them that certain actions need to be taken. Microsoft concluded that initial exploration in November. Starting today, it is starting a new exploration of badging on the Start menu with two new treatments that some Insiders in the Dev Channel will see.\nFixes in this build include:\n[General]\nFixed the issue causing Arm64 devices to fail to resume from sleep/hibernate when running Build 25281 and getting stuck at the OS boot logo.\nFixed an issue where some Insiders may have issues accessing websites and other resources via VPN connections. If you used the workaround documented in\nthis forum post\n, please reverse those changes once you have this new build installed.\nFixed an issue causing some Insiders to experience freezes when using the browser and certain other apps in recent Dev Channel builds.\n[Taskbar & System Tray]\nFixed an explorer.exe crash which could cause the taskbar not to load for some Insiders.\n[Search on the Taskbar]\nThe fixes only apply for Windows Insiders who received one of the different treatments for how search looks on the taskbar that began rolling out to Insiders with\nBuild 25252\n:\nFixed an issue where the search box would randomly disappear sometimes when you clicked it (leaving a blank space on the taskbar).\nFixed an issue where the search box was shifting to the side slightly when you clicked it.\n[Task Manager]\nFixed an issue where the data content area of the Processes page might flash once when theme changes were applied in the Task Manager Settings page.\nFixed an issue where some dialogs did not render in the correct theme when applied from Task Manager Settings page.\nFixed an issue where properties in the Memory section of the Performance page were getting truncated even though there was space to display them.\nReduced the transparency of graph colors in the Performance page, and adjusted the borders, to help make them stand out more.\nFixed a few issues causing Task Manager crashes.\nTyping F in the search box should work again now.\nYou now shouldnt have to make Task Manager be as wide before the navigation pane appears.\nIf text scaling has been increased, the search box shouldnt overlap with the title bar text anymore.\nMade some tweaks to address cases where text in dialogs was getting cut off when text scaling was increased.\nFixes an issue where certain parts of the title bar couldnt be used to drag the window.\n[Windows Spotlight]\nThe following fixes only apply for Windows Insiders who received one of the different treatments of Windows Spotlight that began rolling out to Insiders with\nBuild 25281\n:\nFixed the issue causing some people to not get a consistent refresh of images on a daily basis.\n[Settings]\nFixed an issue where the preview for Sans Serif Collection in Personalization > Fonts was displaying broken glyphs.\n[Other]\nFixed an issue that was preventing Narrator from announcing dropdown lists in Excel.\nFixed an underlying issue which could cause Snipping Tool screenshots to become stretched out and distorted in the last few builds if you had multiple monitors.\nFixed an issue which could cause a bugcheck with SYSTEM_SERVICE_EXCEPTION.\nFixed an issue which could make the Open With dialog crash on launch.\nFixed an issue where the Open File dialog would hang if you clicked it while using an IME after having selected \"Choose an app on your PC\" from the Open With dialog.\nFixed an issue which could cause Group Policy Editor to unexpectedly show \"An error has occurred in the script on this page\" with an invalid character error when editing a group policy.\nIf you have OpenSSH Server set to start at boot (instead of manual), that preference should be remembered across OS upgrades now. Please note, you need to be on a build with this fix before it will take effect with your next upgrade.\nNOTE: Some fixes noted here in Insider Preview builds from the Dev Channel may make their way into the servicing updates for the released version of Windows 11.\nKnown issues in this build include:\n[General]\n[NEW] The Update history page under Settings > Windows Update > Update history is blank for some users after installing Build 25290. This will be fixed via a newer Update Stack Package delivered via Windows Update when available.\n[NEW[ Investigating reports that some Insiders are experiencing repeated bugchecks after upgrading to Build 25284.\n[NEW] Launching Group Policy Editor may show an error about a displayName attribute not being found.\nUsing Windows Hello to sign in with facial recognition may not work on Arm64 PCs. A workaround for this is to use the Hello PIN path.\nSome users are experiencing longer than expected update times installing recent builds. Microsoft is actively investigating this issue.\n[Widgets]\n[NEW] The link for \"Find more widgets\" in the widgets picker currently is broken. This will be fixed and linked to the Store collection\nhere\nin a future update.\nThird-party widgets may occasionally disappear from the widgets board. They can be re-added by clicking refresh or by re-pinning them from the widgets picker.\nThird-party widgets may occasionally get unpinned when the Microsoft account is used to sign-in multiple Windows 11 devices.\nThe undo button on the widget pinned/unpinned toast notification sometimes doesnt work.\n[Taskbar & System Tray]\n[NEW] App icons on the taskbar may appear on the wrong monitor for some Insiders with multiple monitors.\nThe taskbar is sometimes cropped in half when using the tablet-optimized taskbar. You may also see this issue on secondary monitors.\n[Search on the Taskbar]\nThe following known issues only apply for Windows Insiders who received one of the different treatments for how search looks on the taskbar that began rolling out to Insiders with\nBuild 25252\n:\nThere is an issue where you will be unable to change taskbar search box to show as icon only via taskbar settings in some cases. To work around this issue, first change to a different option and then after, you should be able to choose to show as icon only.\n[Windows Spotlight]\nThe following known issues only apply for Windows Insiders who received one of the different treatments of Windows Spotlight that began rolling out to Insiders with\nClicking on a secondary monitor does not dismiss the full screen experience.\nSpotlight wallpaper doesnt show the correct resolution on multiple / mixed resolution monitors."
  },
  {
    "body": "Twitter\nReddit\nAccording to a report by Semafor, Microsofts Bing search engine will incorporate a faster, richer version of ChatGPT called GPT-4 into its product in the coming weeks.\nCiting people familiar with the matter, the source says the latest update of ChatGPT software responds much faster than the current version.\nThe sources also say that GPT-4 offers replies that sound more human and are more detailed.\nThe most interesting improvement in the latest version described by sources is GPT-4s speed. Currently, it can sometimes take quite a while for ChatGPT to answer.\nFurthermore, OpenAI is said to be planning to launch a mobile ChatGPT app and test a new feature in its Dall-E image-generating software.\nIts planned incorporation into Microsoft products will likely set off new competition in internet search: Something that has not happened since Google supplanted Yahoo as the most popular search engine.\nMicrosoft has recently shared plans to deploy specialized supercomputing systems to accelerate OpenAIs AI research and integrate OpenAIs AI systems with its products.\nOther articles in the category: News\nNotability App Gets Pencil Feature\nPopular note-taking app Notability has just introduced a new Pencil feature, bringing the most paper-like sketching experience to digital notetakers. This marks the apps first time releasing a tool that enables users to style their ink strokes, add texture, and change colours after writing without any pixelation. The Pencil tool makes drawing in Notability feel just...\nUsman Qureshi"
  },
  {
    "body": "News\nFebruary 1, 2023\nWhat do I think of him? To quote a fellow Doctor of Philosophy: Instead of admitting he doesnt know, he lies and collects data from his artificially intelligent bottom.\nIt was developed by a previously unknown startup called OpenAI, and today Microsoft is investing $10 billion in it! ChatGPT has taken off  everyone has said what they know about it, so I will also speak. Let me warn you in advance that I have a problem with this invention like Galkiewicz had with Slowacki in Ferdydurke: \"I cannot understand how it delights if it does not delight\". I will try to show why. To be clear too: Im not particularly afraid of ChatGPT. It just bores me. Such a \"guggle\" (after all, it draws handfuls from Google) with an afterburner  an internal editor that does the copy-pasting and cutting-bending for us. Instead of using the 10 texts it finds, it scans and compiles thousands. So \"whats the big deal?\" Whats the hype about?\nBecause the hype is considerable. It took it just five days to cross the one million user barrier  which means it did it 60 times faster than Facebook (although it was a different time when FB took off 18 years ago, even in internet accessibility), but also 15 times faster than Instagram! This dragons entry into the IT agora was announced on 30 November 2022, and by early December had already given rise to headlines in the press (still formulated by human editors): \"As the sophistication of chatbots increases, the debate on artificial intelligence intensifies\". And we can already hear in our heads the jingle of the editor Wooszaskis programme, lets call it this time \"Sensations of the 21st century\".\nThen it was reported regularly about the extraordinary talents of this chatbot. A week ago, for example, \"it turned out that ChatGPT was able to pass MBA exams and an exam giving a licence to practice medicine in the US\". And the next day, \"the ChatGPT bot passed exams at a US law school\"  with what was not a multiple-choice test, but exams involving writing robust dissertations on topics ranging from constitutional law to taxes and torts. One would like to burst ones face behind the crowd in a big \"WOW!\", or possibly shake with fear combined with indignation. However, I suggest you take a break.\nFaster, but not better. Unless in Polish\nWhat a chatbot and artificial intelligence (AI) are and why they are being worked on at all I have already explained in these pages. To reiterate the point: we are trying to create a self-learning computer programme, capable of communicating with humans in the best possible way and mimicking perfectly our courses of thought, information gathering and processing, and storytelling. The fundamental problem that society could have with this is that we have no insight into the guts of this computing machine. Even with a thousand intellectual athletes, it is impossible to verify within the code what this AI has sculpted there and how it got there.\nRead the rest in  TVP Weekly."
  },
  {
    "body": "Douglas County PUD is working replace transmission lines to accommodate an extremely heavy load of power Microsoft will require for its new data center.\n\nThe process will require a $25,000 prepayment to the Bonneville Power Administration for design, material and labor so the Administration can make upgrades at its Valhalla Switchyard.\n\n\"Our transmission lines interconnect with their Valhalla substation, and that needs to be upgraded, and so that would be their responsibility to do that,\" said Douglas County PUD spokesperson Meaghan Vibbert.\n\nBonneville Power is a subsidiary of the U.S. Department of Energy, which supplies power to utilities in the region that dont have hydropower dams.\n\nThe project to compensate for Microsofts demand also includes replacing the transmission lines between Bonneville Power's Valhalla Switchyard in Malaga and the PUD's Rapids Switchyard in Rock Island.\n\nVibbert says they've conducted studies that show Microsoft's level of power use could strain the existing transmission lines.\n\n\"That could cause overloading issues on that line, depending on if other lines were taken out for maintenance, or if there was a system outage, or something like that,\" Vibbert said. \"And so, we're increasing the capacity on that line to better accommodate for those contingencies.\"\n\nDouglas PUD commissioners last month approved staff to start collecting bids for the project, which is being described as \"big.\"\n\nIn addition to new transmission lines, the PUD will install new power poles to handle the extra load.\n\nThe electrical power flowing through the lines is interconnected between Douglas PUD, Chelan PUD, Grant PUD andBonneville Power, in addition to the new load being required for Microsoft.\n\nThe cost for the entire project will be reimbursed by Microsoft as part of its Interconnection and Service Agreement with the Douglas PUD.\n\nThe tech giant has a maximum connected load of 180 MW.\n\nDouglas PUD is not supplying the power because Microsofts heavy demand would absorb a lot of power the PUD normally sells on the open market to generate additional revenue.\n\nThe utility will continue, however, to supply infrastructure and transmission lines for Micrsofts data center, and has assisted in securing a third-party power supplier.\n\nMicrosofts power sales contract went into effect the first week of January.\n"
  },
  {
    "body": "0\nThe worlds largest companies with the most stringent requirements standardize Microsoft solutions for productivity, communication, and sharing. IT managers have long recognized the value to Migrate Exchange 2013 to Office 365 which enhanced the users functionalities. Your company can be managed more effectively with Office 365 instead of individual software packages.\nOffice 365 gives you everything you need to get your work done anytime, anywhere. This cloud service meets your needs for robust security, 24/7 reliability, and user productivity. All at an easy subscription price.\nREAD ALSO\nIs the natural diamond trade slowing down due to the economic downturn, especially with the growth of lab diamonds?\nAt the office, at home, or on the go, Office 365 offers a cost-effective alternative to purchasing and maintaining your own Microsoft Exchange software and servers. With Office 365, youll always have the latest Office version and can create, edit, and share files in real-time from your PC, Mac, and mobile devices. Also, if you choose the right services provider, they can help you with Virtual Desktop Server which makes the accessibility for businesses very flexible. Office 365 combines familiar Microsoft productivity, collaboration, and communication tools to empower employees anywhere, on any device.\nTop five reasons why you should outsource your Office 365 migration to an external provider:\nExperience\nThe quantity of knowledge you have performing cloud migrations will greatly affect how smoothly the migration will go. Internal IT staff generally have much more limited experience doing these migrations than an outside vendor that specializes in this.\nQuality\nThere is a big difference between a full migration where all data, settings, and personalization elements are successfully carried over, and a migration where some of these important characteristics are missing. Seamless transition means no productivity loss. Migrations that require users to re-edit settings negatively impact productivity.\nIT Staff Cost\nAs companies move to Office 365 with their own internal IT staff, those staffs are stranded for other tasks. In this scenario, assume the migration will take him 40 hours, and if he has an IT staff member, that staff member will be unavailable for the equivalent of her week. Also, the additional time required for end-user support is not considered. A conservative estimate is that the IT staff work here eight hours per day, which is more than double, depending on the experience of the IT staff.\nEnd User Employee Cost\nIf there are issues during the migration that lead to user downtime, it can have a significant impact on your business. If you know the value of each employees time, hours of lost productivity for multiple users can mean lost revenue. Productivity loss can be caused by downtime, missing data, or configuration issues.\nRisk Tolerance\nHow important is maximizing uptime to your business? What is your companys managements risk tolerance? By outsourcing your Office 365 migration, you can mitigate the risks described here.\nConclusion:\nMicrosofts cloud-based systems have become highly accessible and very useful for businesses. Even those without prior IT experience can handle projects, workflows, and communication networks with great ease. This makes technology an indispensable asset to companies in the modern world.\nIf you want to ensure your IT needs are taken care of, the best option is to turn to providers like Apps4Rent who have experienced various migration and hosting services like Cloud PC Services. They understand the delicate complexity of such operations and can provide you with the solutions you need."
  },
  {
    "body": "Matt Milano\nFebruary 1, 2023\nMicrosoft is moving full speed ahead in its plans to incorporate ChatGPT in Bing, with a new and improved version rolling out in the coming weeks.\nChatGPT has quickly become the poster child for AI development and has permeated multiple industries. Microsoft is eager to integrate the technology in its Bing search engine in the hopes that conversational AI will help it catch Google.\nAccording to a new report by Semafor, Microsofts plans will come to fruition in the coming weeks, with Bing set to incorporate a new and improved version of ChatGPT based on GTP-4.\nThe outlet says that speed is one of the biggest benefits of the move to GPT-4:\nThe most interesting improvement in the latest version described by sources is GPT-4s speed. Right now, it can take a while  sometimes minutes in my experience  for ChatGPT to answer.\nMicrosoft has invested billions in OpenAI, with its most recent investment coming just last week. At the time of the investment, Microsoft CEO Satya Nadella touted the importance of OpenAIs research.\nWe formed our partnership with OpenAI around a shared ambition to responsibly advance cutting-edge AI research and democratize AI as a new technology platform, said Nadella. In this next phase of our partnership, developers and organizations across industries will have access to the best AI infrastructure, models, and toolchain with Azure to build and run their applications.\nThe biggest beneficiary of OpenAIs development, however, may just be Microsoft itself. Despite being a very capable search engine, Bing has never been able to make much headway against Googles dominance. Google clearly views the possibility of a ChatGPT-enabled Bing as a threat, with the company calling in founders Larry Page and Sergey Brin to help it devise an AI strategy.\nIf Semafors report is correct, we may only have a few weeks to see if ChatGPT upends the search market as much as some believe it will."
  },
  {
    "body": "1\ncomment\nMicrosoft, Apple, Google, Mozilla, and several other companies announced a joint initiative to improve cross-browser interoperability. Dubbed \"Interop 2022,\" the program prioritized specific browser areas that matter the most to web developers, resulting in a better web for everyone regardless of the selected browser. Fast forward to 2023, and now Microsoft and other companies are announcing the Interop 2023 project.\nDevelopers of the most popular desktop and mobile browsers understand that cross-browser development is one of the biggest pain points for web devs, so Interop 2023 will attempt to improve the situation by focusing on the following areas:\nOffscreen Canvas\nMore\nBesides new areas, Interop 2023 will continue improving last-year focus points, such as the CSS subgrid. Mozilla says Interop 2022 has been a significant success, leading every participant to score more than 90 in each area.\nAll the signs are that Interop 2022 was helpful in aligning implementations of the web and ensuring that users are able to retain a free choice of browser without running into compatibility problems. We plan to build on that success with the forthcoming launch of Interop 2023, which we hope will further push the state of the art for web developers and help web browser developers focus on the most important issues to ensure the future of a healthy open web.\nCustomers and developers can track the progress and see how each browser scores in a specific area on the official Interop 2023 dashboard. Stable Chrome, Edge, Firefox, and Safari versions currently have scores below 80, so customers can expect improvements in the outlined areas to come in this year's browser updates.\nTags"
  },
  {
    "body": "(Image credit: Future)\nWhat you need to know\nMicrosoft will integrate a new version of ChatGPT known as GPT-4 in the coming weeks, according to a report by Semafor.\nGPT-4 is said to be significantly faster than the current AI model that powers ChatGPT.\nMicrosoft invested heavily in the maker of ChatGPT, OpenAI, and expanded its partnership with a multi-billion-dollar deal earlier this year.\nMicrosoft's Bing could soon integrate with an upgraded version of ChatGPT known as GPT-4. A report by Semafor provides insight regarding GPT-4, courtesy of the outlet's sources. The new AI tool is said to be significantly faster than GPT-3, which is what currently powers ChatGPT. Speed will be an essential component to any integration of AI into Bing searches.\nChatGPT is a powerful tool that uses artificial intelligence to generate text. The same technology that allows the tool to create content could be used to scour the web for answers to search queries. Since ChatGPT is based on machine learning, it would improve over time as well.\nEarlier this year, Microsoft Chairman and CEO Satya Nadella said that AI will be built into all of Microsoft's products in the future. Bing is an obvious candidate to receive a boost from artificial intelligence, and Microsoft has already taken steps in that direction. DALL-E image generation is now available through Bing in some regions. Previous reports have also indicated that Microsoft would integrate ChatGPT into Bing.\nOpenAI will reportedly launch a ChatGPT mobile app as well. Video generation is also in the works for OpenAI's DALL-E, according to Semafor. That tool is currently capable of generating images, but it would become much more versatile if it gained the ability to create videos.\nMicrosoft and OpenAI denied commenting when asked by Semafor.\nWindows Central take\nArtificial intelligence is arguably the hottest topic in tech right now. While AI has been a buzzword for years, it's now in the fingertips of the general public through tools like ChatGPT and DALL-E. AI is being used to create content, improve video calls, and translate human speech while replicating a speaker's voice. We're finally at a point at which AI isn't just a wish and a dream for future tech.\nBing has sat behind Google since it launched, and it's long been believed that there wasn't much Microsoft could do to close the gap with Google. If Bing is to gain market share, AI functionality could be key. Reportedly, the rapid ascent of ChatGPT's popularity has scared Google into changing its plans. Maybe Microsoft can capitalize on the AI moment that we're in right now.\nWindows Central Newsletter"
  },
  {
    "body": "18\ncomments\nIt appears that Microsoft is getting more aggressive with Windows 11 promos. A Reddit user (the post is now removed) has published a photo of their Windows 10 computer with a full-screen Windows 11 ad offering to upgrade to the latest operating system. And in typical Microsoft fashion, available options are as head-scratching as it gets: two buttons, and both mean \"I agree.\"\nThe ad tries to promote Windows 11 by claiming that the operating system \"is now unlocked\" for the customers, who can get it right now (the highlighted button) and schedule the installation for later (the second button). The only way to reject the offer is to click a small \"Keep Windows 10\" link on a white bar at the bottom of the screen (via\nGhacks\n).\nNeedless to say, Windows 10 users are not happy with Microsoft trying to impose its operating system using tricky banners and optical illusions. Many users are likely to click the first highlighted button without reading the message (not to mention not finding the reject button) just to get to the desktop and do what they need with the computer.\nMicrosoft is clearly trying to speed up the Windows 11 rollout using \"dark patterns\" and misleading tricks. The report interestingly coincides with Microsoft ceasing Windows 10 sales, so more users might feel like they have no choice but to move to Windows 11 (which is incorrect). Luckily, Microsoft has yet to start automatic upgrades to Windows 11, so the chances of you getting the new operating system out of the blue are slim. However, it is safe to say that Microsoft will only increase the pressure on users in attempts to make Windows 11 more popular. According to the latest report from Statcounter, about 18% of all Windows users have upgraded to Windows 11.\nFortunately, there are many ways to prevent such banners from infecting your computer. One could give Microsoft a taste of its own medicine by disabling TPM to render the computer \"incompatible\" with Windows 11 (this potentially increases security risks, so proceed only if you are 100% sure turning off TPM will not break anything on your system). Also, paying attention and reading what your computer tries to say, regardless of how vague the descriptions are, dramatically reduces the chances of getting unplanned upgrades.\nTags"
  },
  {
    "body": "0\ncomments\nBack in December 2022, Microsoft announced a preview of Teams Premium, its new and more expensive SKU of Teams geared towards enterprises who want more functionalities when conducting webinars and large online gatherings. Later, we also found out that Microsoft is actually taking away some existing features from Teams and integrating them exclusively into Team Premium. Today, Teams Premium is generally available along with advanced webinars.\nThe key selling points Microsoft is highlighting within advanced webinars is \"dynamic and richer\" experiences before and during a meeting. In terms of the setup, both Teams Premium and the existing webinars in Office 365 / Microsoft 365 now allow adding event details, co-organizers, presenter bios, brand theming, and custom questions. Registrations can be managed for up to 1,000 attendees and you can view their attendance status as well.\nCustom registration start and end times for webinars can be configured, along with waitlists and approval queues. Organizers will also be able to send automated reminder emails from March 2023 to hype up attendees for an upcoming webinar. Additionally, these are the enhancements for the actual webinar itself:\nOn the day of the webinar, presenters are able to join together with one another and the host in the virtual green room to ensure preparation is seamless. With the virtual green room, presenters have a separate, dedicated space separate from attendees where they can connect and chat real-time, stage content, do a quick briefing, and test run without disturbing attendees. While attendees join and wait for the event to start, theyre greeted with a welcome screen to inform them the event will start shortly and can engage with the presenters and one another through chat and Q&A.\nThat's not all though. Webinar organizers can easily manage what they want the audience to see and even integrate different external media feeds into the webinar using Real-Time Messaging Protocol (RTMP-in).\nAn exclusive feature coming to Teams Premium is also support Microsoft eCDN in Teams Live Events. This will reduce the load on the enterprise network without the need to install anything on endpoints.\nLastly, we have a couple of integrations. The first connects Teams to Meta Workplace Live, and we already know that it's being planned for March. The other is a new plugin for integration within the Elgato Stream Deck, and that is planned for general availability this month.\nAlthough the Teams Premium website on our end still doesn't indicate that the product is generally available, Microsoft claims in its blog post that is, so expect details on the website to change soon. The license is expected to cost $10/month/user, according to the FAQs.\nTags"
  },
  {
    "body": "Phone Link\n(opens in new tab)\nare now rolling out preview versions of their widgets as well. To give them a try, go to the\nwidgets collection\nin the Microsoft Store and update to the latest version of the apps. Then open the widgets board and navigate to the widgets picker by clicking the + button at the top-right of the board to pin your widgets.\nBack in October withBuild 25227, we started trying out a small change to the Start menu where some Insiders saw badging on their user profile notifying them that certain actions need to be taken. We concluded that initial exploration in November. Starting today, we are starting a new exploration of badging on the Start menu with two new treatments that some Insiders in the Dev Channel will see. If you see one of these treatments, give us feedback on what you think.As a reminder, it is normal for us to try out different concepts in the Dev Channel to get feedback.\nWe fixed the issue causing Arm64 devices to fail to resume from sleep/hibernate when running Build 25281 and getting stuck at the OS boot logo.\nFixed an issue where some Insiders may have issues accessing websites and other resources via VPN connections. If you used the workaround documented in\nthis forum post\n, please reverse those changes once you have this new build installed.\nFixed an issue causing some Insiders to experience freezes when using the browser and certain other apps in recent Dev Channel builds.\nFixed an explorer.exe crash which could cause the taskbar not to load for some Insiders.\nFixed an issue where the search box would randomly disappear sometimes when you clicked it (leaving a blank space on the taskbar).\nFixed an issue where the search box was shifting to the side slightly when you clicked it.\nFixed an issue where the data content area of the Processes page might flash once when theme changes were applied in the Task Manager Settings page.\nFixed an issue where some dialogs did not render in the correct theme when applied from Task Manager Settings page.\nFixed an issue where properties in the Memory section of the Performance page were getting truncated even though there was space to display them.\nReduced the transparency of graph colors in the Performance page, and adjusted the borders, to help make them stand out more.\nFixed a few issues causing Task Manager crashes.\nTyping F in the search box should work again now.\nYou now shouldnt have to make Task Manager be as wide before the navigation pane appears.\nIf text scaling has been increased, the search box shouldnt overlap with the title bar text anymore.\nMade some tweaks to address cases where text in dialogs was getting cut off when text scaling was increased.\nFixes an issue where certain parts of the title bar couldnt be used to drag the window.\nWe fixed the issue causing some people to not get a consistent refresh of images on a daily basis.\nFixed an issue where the preview for Sans Serif Collection in Personalization > Fonts was displaying broken glyphs.\nFixed an issue that was preventing Narrator from announcing dropdown lists in Excel.\nFixed an underlying issue which could cause Snipping Tool screenshots to become stretched out and distorted in the last few builds if you had multiple monitors.\nFixed an issue which could cause a bugcheck with SYSTEM_SERVICE_EXCEPTION.\nFixed an issue which could make the Open With dialog crash on launch.\nFixed an issue where the Open File dialog would hang if you clicked it while using an IME after having selected Choose an app on your PC from the Open With dialog.\nFixed an issue which could cause Group Policy Editor to unexpectedly show An error has occurred in the script on this page with an invalid character error when editing a group policy.\nIf you have OpenSSH Server set to start at boot (instead of manual), that preference should be remembered across OS upgrades now. Please note, you need to be on a build with this fix before it will take effect with your next upgrade.\nWindows Central Newsletter"
  },
  {
    "body": "Comments\n(Image credit: Capcom)\nIn December, a lawsuit was filed on behalf of 10 gamers who claimed they \"would be adversely affected by reduced competition\" as a result of Microsoft's planned buyout of Activision Blizzard, and now those random gamers are looking to get Nintendo and PlayStation's biggest bosses to testify.\nThis is the \"gamer's lawsuit\" that you might have heard about at the tail end of 2022, and is completely distinct from the serious FTC lawsuit that was also filed in December. Whether the gamer's lawsuit has any serious merit will, of course, be decided in court, but Microsoft certainly doesn't seem to think so, as the company's lawyers\n(opens in new tab)\nfor the suit to be dismissed entirely.\nThat motion-to-dismiss hearing is scheduled for March 9, but in the meantime, a new filing indicates that the lawyers behind the gamer's lawsuit say they've served subpoenas to a number of witnesses for depositions. Those include Activision Blizzard CEO Bobby Kotick, Nintendo of America CEO Doug Bower, and Sony Interactive Entertainment CEO Jim Ryan. The lawyers want a trial in April (2023, that is) and immediate discovery - which is the legal term for exchanging information like depositions and internal documents.\nI am not a lawyer, and if you want a more detailed breakdown of what's going on here, you should take a look at the\nFOSS Patents blog\n(opens in new tab)\nrun by Florian Mueller, who was formerly an advisor to companies ranging from (appropriately enough) Microsoft to Blizzard. Mueller says that he believes the \"lawyers made a totally overreaching demand by requesting an April trial as well as immediate and unfettered discovery, and I doubt that Judge Corley will consider their positions reasonable.\"\nThis is not a class-action lawsuit - there are only ten plaintiffs, after all - but in\nprevious writing\n(opens in new tab)\nabout this case, Mueller has noted that similar types of suits in the \"class-action business\" have had pretty frivolous objectives. \"You just spend your time, and you can hope that even if your case is going nowhere, a megacorp defendant may at some point be willing to pay you off to go away, even if only because of the 'nuisance value' (the cost of a proper defense) of your lawsuit.\"\nOr, hey, maybe these gamers just really don't want to have to buy an Xbox to play the next Crash Bandicoot. Whatever the case, we might get to see the results play out on YouTube.\nOne key European trade union is in support of Microsoft's Activision-Blizzard acquisition.\nGaming deals, prizes and latest news\nGet the best gaming deals, reviews, product advice, competitions, unmissable gaming news and more!\nContact me with news and offers from other Future brands\nReceive email from us on behalf of our trusted partners or sponsors\nBy submitting your information you agree to the\nSocial Links Navigation\nStaff Writer\nDustin Bailey joined the GamesRadar team as a Staff Writer in May 2022, and is currently based in Missouri. He's been covering games (with occasional dalliances in the worlds of anime and pro wrestling) since 2015, first as a freelancer, then as a news writer at PCGamesN for nearly five years. His love for games was sparked somewhere between Metal Gear Solid 2 and Knights of the Old Republic, and these days you can usually find him splitting his entertainment time between retro gaming, the latest big action-adventure title, or a long haul in American Truck Simulator.\nRecommended"
  },
  {
    "body": "The Witcher 2, Prince of Persia, Knights of the Old Republic 2\n, and\nLost Odyssey\n. If you purchase these from the Xbox 360 store before the February date, you can download the games at any point even after theyre delisted.\nPhysical copies of the games will also still work on any Xbox console that supports 360 discs. If the game has a backward compatible- or enhanced version available on the Xbox One or Xbox Series X|S stores, those will also remain available for purchase after Feb. 7, 2023.\nMicrosoft provided no reason why these games will no longer be available and hasnt yet said whether the eventual plan is to shut down the Xbox 360 store altogether. However, the Xbox 360 is just two years shy of turning 20. Most platform holders shut their legacy servers and stores down after a new console launches, so the fact that the 360 shop is still open at all is something of a surprise.\nWritten by Josh Broadwell on behalf of"
  },
  {
    "body": "Feb. 1, 2023\n1 comment\nMicrosoft has announced a number titles and associated add-on content will be removed from the Xbox 360 Marketplace in a select set of regions per title.\nThe removals will start on February 7. Once purchased, you can always redownload the games or any other previously purchased games from your Xbox 360 Download History.\nAssassin's Creed Liberation HD\nThis will not affect the game if they are currently available on the Xbox One and Xbox Series X/S stores. Only the Xbox 360 Marketplace.\nSpeaking with Gematsu\n, a Microsoft spokesperson assured you will still be able to play discs or previously downloaded games on your Xbox 360 and modern consoles if they are backwards compatible titles.\nBelow is the list of titles which will be removed in the Americas. For you specific region, click here.\nAegis Wing\nCall of Duty: Advanced Warfare\nCall of Duty: Ghosts\nSega Vintage Collection: Alex Kidd & Co.\nSkate 2\nSouth Park: The Stick of Truth\nSpelunky"
  },
  {
    "body": "Serving companies in the cloud, DevOps, cybersecurity, data, and AI space, IOD CEO\nOfir Nachmani\nreferred to the new service as the natural evolution of its expanding partnerships with clients like Microsoft, NetApp, Check Point, and Zoho.\n\"Today's tech audience is more sophisticated than ever. And with tech practitioners now the de facto decision-makers, there's no room for fluff,\" Nachmani noted.\n\"Developer marketing including deep tech content has become a key strategy for every tech vendor. Organizations that are slow to adopt this new mindset will quickly find themselves outrun.\"\nThe challenge for the technology enterprise in particular, Nachmani recounted, is that they have to contend with siloed teams, multiple stakeholders, and a lack of resources, making their tech marketing initiatives difficult to realize and scale. The enterprise R&D members who know the product simply don't have the time to dedicate to content, nor are they the organization's target audience.\nIOD's new offering provides enterprises end-to-end content services. IOD's dedicated production team of strategists; project managers; tech experts, writers, and editors; video producers; and designers work as an extension to the enterprise marketing team to deliver custom content at scale across all enterprise sales and marketing channels.\nWhen Microsoft needed over a dozen technical case studies, IOD delivered within weeks.\n\"IOD's streamlined, transparent process gave us full visibility of the production process. This made it easy to keep track and review the content, and all while satisfying multiple stakeholders. We were impressed by IOD's professionalismthey took full ownership of the content creation and delivered incredibly fast!\"\nAmit Svarzenberg, CTO,\nMicrosoft for Startups\nEnterprise clients rely on IOD's deep tech content to make them thought leaders in their fields.\n\"Working with IOD's DevOps and cloud experts, we were able to produce quality tech content that resonates with our audience and has helped us achieve our goals. We look forward to continuing to grow together and already have plans to extend the partnership to influencer marketing and video creation!\"\nJennis Thomas, Senior Content Manager, Zoho Site 24x7"
  },
  {
    "body": "Comments (0)\n(Image credit: Ubisoft)\nThe Xbox 360 turns 18 this year, and like many 18-year-olds, its going to lose a few things that it once took for granted. On February 7, Microsoft plans to delist more than 40 downloadable Xbox 360 games, including titles from prominent series such as Assassins Creed, Dark Souls, Star Wars and The Witcher. Some of these games will still be available on Xbox One and Xbox Series X consoles, but others may be lost for good.\nThe information comes from Microsofts support section, on a page entitled \nXbox 360 Marketplace update\n(opens in new tab)\n. The page explains that starting on February 7, Microsoft will delist a few dozen titles, varying slightly by region, with PDF attachments explaining which games each region will lose. To list a few examples, the United States PDF cites:\nAssassins Creed IV\nStar Wars: Knights of the Old Republic II\nThe Orange Box\nThe Witcher 2\nTheres some good news  but only some. First off, players who have already purchased these titles and their associated DLC will be able to download and redownload them indefinitely. Second, physical editions for many of these games are widely available, and will still work just fine. Third, users will still be able to purchase these games on newer Xbox consoles, such as the Xbox One and Xbox Series X. (Microsoft did not mention whether they will still be available through the Xbox Marketplaces Web interface, but that seems like a reasonable possibility.)\nThe flip side, however, is that not every Xbox 360 title is backwards compatible with newer Xbox systems. Similarly, not every one of these games had a physical release. As such, some of the games will essentially disappear, including Iron Brigade and Defense Grid. (Side note: Defense Grid is an underrated classic, as is Defense Grid 2.)\nThe situation is not as catastrophic as it could be, as most of the games are either backwards compatible, or have readily available versions on other platforms. But delisting is always bad for game preservation, which represents a growing problem for the medium. Sony and Nintendo have both been cavalier about their back catalogs, and Microsoft joining them continues an unpleasant precedent.\nIn any case, if you want any of the Xbox 360 games on offer, now would be a good time to pick them up. After about a week or so, you wont be able to change your mind.\nToday's best Assassin's Creed 4: Black Flag deals"
  },
  {
    "body": "Feb. 1, 2023\nImage: Getty/Bojan89\nMore than one hundred different cyber criminal gangs are actively conducting ransomware attacks, deploying over 50 different ransomware families in campaigns which see them encrypt networks and demand a ransom payment for the decryption key.\nThe analysis from Microsoft Security Intelligence notes that some of the most prominent\nransomware\nattacks of recent times include Lockbit, BlackCat, Vice Society, and Royal.\nThe attacks are also being helped along by how ransomware groups offer ransomware-as-a-service (RaaS) schemes, enabling cyber criminals who don't develop their own ransomware to get in on the action.\nAccess to RaaS schemes is sold on underground forums, providing aspiring ransomware attackers with all the tools they need to conduct and manage attacks and extort ransom payments. In many cases, the author of the ransomware takes a cut of any ransom payments the attackers receive.\nSome of the most disruptive ransomware attacks have been carried by attackers using affiliate schemes, with high-profile attacks involving the likes of Conti and LockBit ransomware being conducted by affiliates.\nAccording to Microsoft, phishing attacks are the most common means of attackers gaining initial access to networks. \nAlso:\nRansomware has now become a problem for everyone, and not just tech\nTargeting usernames and passwords with phishing emails or brute force attacks provides cyber criminals with access to networks using legitimate credentials which are less likely to arouse suspicion  and it's become easier for cyber criminals to access networks in this way since the rise of hybrid and remote working.\nThe attackers can move around the network, potentially even using the compromised account to conduct phishing attacks against other users, gaining the permissions and control required to compromise as much of the network with ransomware as possible, before eventually triggering the encryption process, locking files and servers and demanding a ransom payment.\nBut while phishing is the most common method used by ransomware gangs to access networks, it isn't the only one.\nFor example, Microsoft warns about the rise of malvertising as the initial stage of attacks, where cyber criminals buy online adverts  commonly to promote false software downloads  which if downloaded and installed, will infect the user with trojan malware which the attackers then use to distribute ransomware. \nCyber criminal affiliates using Royal ransomware have been seen using this technique to deliver the payload.\nhave also become a common means of delivering ransomware. These false warnings which claim your software needs to be updated typically come from malvertising links or drive-by-downloads  downloads which happen in the background without the user knowing.  \nAlso:\nThe real cost of ransomware is even bigger than we realised\nThe aim of the false update alerts is to scare victims into downloading the malware  all while they believe they're doing the right thing to protect their system.\nCyber criminals are also using the tried and tested method of abusing unpatched cybersecurity vulnerabilities to access networks.\n\"Even as they evolve, ransomware attacks continue to rely on common security weaknesses that allow them to succeed,\" said Microsoft, which recommendations that computers and networks should be updated with the latest security patches as a matter of urgency, in order to prevent cyber criminals from exploiting known vulnerabilities to access networks.\nIt's also important that security updates are only downloaded from official sources, to avoid the possibility of a fake software update infecting you with ransomware.\nMeanwhile, organizations can try to prevent phishing attacks by ensuring that accounts are secured with strong, preferably unique, passwords and that accounts are secured with Multi-Factor Authentication (MFA).\nThis additional layer of protection can help to stop attackers from accessing accounts, even if they've gained access to the correct username and password.\nMORE ON CYBERSECURITY"
  },
  {
    "body": "\n  \n  According to a recent article by market analyst firm DFC Intelligence, the economic model of Xbox Game Pass of Microsoft would not sustainable in the long run, while that of Nintendo Switch Online Yup.The article talks in general about the subscription services of Microsoft, Sony and Nintendo and is based on the analysis of the recent financial results of the companies.  The Game Pass saw a growth in users in Q2 of the 2023 fiscal year, but the number of subscribers alone does not allow for a definite picture of its performance.  The problem, according to DFC, is that Microsoft is having to give away too many content to generate revenue.  On the contrary, even if Nintendo Switch Online is not comparable to the Game Pass for content, it seems to have found the right formula for consumers.DFC: \"The problem with Game Pass is that its business model doesn't seem to work. Comparing the amount of subscribers is not correct because the various services have price differences significant.  However, what clearly emerges is how Nintendo's subscription service manages to be a great boost to the overall business of selling hardware and software.  In contrast, the Game Pass wants to be autonomous, where the sale of Xbox hardware is not important.When you do the math, Game Pass produces about three times the current revenues of Nintendo Switch Online and is likely approaching that of PlayStation Plus due to the higher price.  However, Microsoft gives away a lot of content to generate these revenues and the business model does not appear to be sustainable in the long run.\"\n\n      !function(f,b,e,v,n,t,s)\n      {if(f.fbq)return;n=f.fbq=function(){n.callMethod?\n      n.callMethod.apply(n,arguments):n.queue.push(arguments)};\n      if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0';\n      n.queue=[];t=b.createElement(e);t.async=!0;\n      t.src=v;s=b.getElementsByTagName(e)[0];\n      s.parentNode.insertBefore(t,s)}(window, document,'script',\n      'https://connect.facebook.net/en_US/fbevents.js');\n      fbq('init', '1624156791000312');\n      fbq('track', 'PageView');\n      \n    // initialize the library with the API key\n    window.fbAsyncInit = function() {\n      FB.init({\n        appId      : '175982639107667',\n        xfbml      : false,\n        version    : 'v7.0',\n        status     : true,  \n        cookie     : true\n      });\n    };\n    (function(d, s, id){\n      var js, fjs = d.getElementsByTagName(s)[0];\n      if (d.getElementById(id)) {return;}\n      js = d.createElement(s); js.id = id;\n      js.src = \"https://connect.facebook.net/it_IT/sdk.js\";\n      fjs.parentNode.insertBefore(js, fjs);\n    }(document, 'script', 'facebook-jssdk'));\n  \r\n#Xbox #Game #Pass #sustainable #model #Nintendo #Switch #Online #DFC #Intelligence"
  },
  {
    "body": "Print\nThe European Union has issued Microsoft with a formal antitrust warning over its $69 billion bid for Activision-Blizzard, three people close to the matter have told POLITICO.\nIn a so-called statement of objections sent to the U.S. tech giant on Tuesday, EU antitrust enforcers laid out the reasons why the deal could threaten fair competition on the video game market, the sources said.\nThe move comes after the EU launched an in-depth investigation into the deal in November,\nfinding\nthat Microsoft may in the future be incentivized to block access to Activisions popular Call of Duty franchise.\nSuch foreclosure strategies could reduce competition in the markets for the distribution of console and PC video games, leading to higher prices, lower quality and less innovation for console game distributors, which may, in turn, be passed on to consumers, the Commission said at the time.\nIn response to the new charge sheet, Microsoft said it would be committed to finding a path forward for the deal.\nWe are listening carefully to the European Commission's concerns and are confident we can address them, a spokesperson said.\nIn Washington, the U.S. Federal Trade Commission has\nto block the deal over harm it would cause to the video game industry. It argued that Microsoft had a history of buying companies and restricting access to popular titles.\nMicrosoft has"
  },
  {
    "body": "Microsoft to bring new look to Teams Rooms on Windows\nMicrosoft to bring new look to Teams Rooms on Windows\nMoreover, users will get improved visual cues throughout the experience that will make it easier and more intuitive to interact with the console.\n|  Posted by Mansoor Hameed | \nPublished: 1st February 2023 9:31 pm IST\nSan Francisco: Tech giant Microsoft has announced that it will bring a new look to its Teams Rooms on Windows consoles and front-of-room displays, by the end of this quarter.\nTo make Teams Rooms even easier to use, were aligning key elements of the user interface across the Windows and Android ecosystems, the tech giant has said in a blogpost.\nWith the upcoming update, users will first see the vivid new ambient screens and a re-designed calendar on consoles and front-of-room displays.\nMoreover, users will get improved visual cues throughout the experience that will make it easier and more intuitive to interact with the console.\nAlso Read"
  },
  {
    "body": "Print\nInfosec leaders are still behind in cybersecurity basics, leaving their organizations unnecessarily open to attacks, says the vice-president of Microsoft Security.\nCyber attacks arent successful because they are getting more sophisticated, Kelly Bissell told the siberX CISO Forum Canada on Tuesday.\nNinety-eight per cent of attacks are elementary, he said, and take advantage of unpatched devices, a lack of multifactor authentication to protect logins, no privileged access controls, no identity management, and password vulnerabilities.\nThose things are happening every day. I think why were getting more [successful] attacks is because this is one of the industries where crime actually pays.\nSeventy-eight per cent of computing devices have an unpatched vulnerability thats at least nine months old, he added. Were not patching our systems. Were taking the approach, Ill patch these systems if I can. But what youd better do is patch now, even at the risk of breaking an application.\nWe have to re-think our DevSecOps function to be far more resilient in the patching of our environments.\nThe good news is law enforcement agencies around the world are having some success against attackers, he added. He urged CISOs to work with police agencies if their IT environments are compromised.\nThere are a number of things CISOs should do to stiffen their security, he said, including\n move away from best-of-breed solutions to a platform;\n get intelligence feeds;\n move workloads to the cloud;\n invest in artificial intelligence solutions to speed analysis and response;\n make sure data is well protected;\n be brilliant at the basics, particularly having a well-designed Active Directory protection structure;\n get privileged access under control to prevent lateral movement;\n and optimize and simplify your IT architecture.\nOn this last point, Bissell offered proof:\nI was part of an organization a while back that had a ransomware attack on our AD domain. By the way, we had 90 domains. Thank goodness we had the right architecture. The ransomware was contained to one domain structure. If we didnt have the right design, it would have spread to all domains. It would have been devastating. So the architecture of your security environment matters.\nTags"
  }
]