[
  {
    "body": "\n  \n  A half has won the case with ftc extension regarding the acquisition of Within Unlimited, a startup that deals with virtual reality: Bloomberg reports it on the basis of sources familiar with the ruling.  Well, this aspect could represent a concrete advantage for Microsoft.As you certainly remember, last December the FTC decided to take Microsoft to court to block the acquisition of Activision Blizzard, but the principle relating to the possible risks to competition is the same that prompted the commission to sue the company Mark Zuckerberg.In this case, Judge Edward Davila Wednesday morning has denied the FTC's request to block the transaction, however stopping it for a week waiting to understand whether or not the American regulator will decide to appeal.  None of the parties involved made any statements.Were the ruling to result in the FTC refusing to continue, it would undoubtedly be a severe blow to the policy of aversion to big tech carried out by the president Lina Khanas well as an excellent bank for Microsoft.In fact, if the Redmond company were really able to satisfy the requests of the European and English regulatory bodies, as it seems it is determined to do, at that point the FTC would remain the only obstacle to the acquisition of Activision Blizzard: a substantially less insidious obstacle after the defeat with Meta.\n\n      !function(f,b,e,v,n,t,s)\n      {if(f.fbq)return;n=f.fbq=function(){n.callMethod?\n      n.callMethod.apply(n,arguments):n.queue.push(arguments)};\n      if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0';\n      n.queue=[];t=b.createElement(e);t.async=!0;\n      t.src=v;s=b.getElementsByTagName(e)[0];\n      s.parentNode.insertBefore(t,s)}(window, document,'script',\n      'https://connect.facebook.net/en_US/fbevents.js');\n      fbq('init', '1624156791000312');\n      fbq('track', 'PageView');\n      \n    // initialize the library with the API key\n    window.fbAsyncInit = function() {\n      FB.init({\n        appId      : '175982639107667',\n        xfbml      : false,\n        version    : 'v7.0',\n        status     : true,  \n        cookie     : true\n      });\n    };\n    (function(d, s, id){\n      var js, fjs = d.getElementsByTagName(s)[0];\n      if (d.getElementById(id)) {return;}\n      js = d.createElement(s); js.id = id;\n      js.src = \"https://connect.facebook.net/it_IT/sdk.js\";\n      fjs.parentNode.insertBefore(js, fjs);\n    }(document, 'script', 'facebook-jssdk'));\n  \r\n#Meta #wins #FTC #case #virtual #reality #good #Microsoft"
  },
  {
    "body": "GPT-4 is one of the most anticipated technology product releases in years.\nAD\nIts planned incorporation into Microsoft products will likely set off new competition in internet search: Something that has not happened since Google supplanted Yahoo as the most popular search engine.\nThe Information first reported Microsofts plans to use OpenAIs underlying technology.\nNow that OpenAI has released ChatGPT to the public, the technology will likely improve on a faster curve. And having a mobile app, instead of just a web interface, will bring an even broader user base into the service, making the curve steeper.\nThats because the information users input into the system serves as a way to improve the product. Each query serves as a form of feedback.\nFor instance, each ChatGPT answer includes thumbs up and thumbs down buttons. A popup window prompts users to write down the ideal answer, helping the software learn from its mistakes.\nAD\nGPT stands for Generative pre-trained transformer, which is the underlying technology that powers ChatGPT and is characterized by its ability to parse through a vast dataset. For that reason, it is often called a large language model. The latest version of OpenAIs software is called GPT-3.\nThe most interesting improvement in the latest version described by sources is GPT-4s speed. Right now, it can take a while  sometimes minutes in my experience  for ChatGPT to answer.\nOne of the least-appreciated innovations of ChatGPT is what happens on the server every time someone enters a query.\nIn May, 2020, Microsoft announced it had built one of the top five publicly disclosed supercomputers in the world  in partnership and exclusively for OpenAI  that would be used to train extremely large artificial intelligence models.\nIts now clear what possibilities Microsoft and OpenAI saw in this technology that has caused the whole world to take notice.\nAD\nBut running these algorithms, which scour billions of pages of text, is expensive. Each ChatGPT search costs around a couple cents, according to Sam Altman, OpenAIs CEO.\nThe supercomputer Microsoft and OpenAI built had 285,000 CPU cores and 10,000 GPUs, each with 400 gigabits per second of network connectivity.\nThe rush to capitalize on the generative AI craze that OpenAI and Microsoft started has made it hard for some companies to get their hands on Nvidias latest graphics processor, the H100 Tensor Core GPU, that is specifically designed to run transformers like those used in GPT. (I found one for sale online for $30,000.)\nThat shows just how important innovations on the server side will be to AI products rolling out. A big part of improving OpenAI will be figuring out how to run it more quickly and more cost-effectively.\nAll these improvements mean OpenAI is building a moat around its product. Anyone can build software similar to OpenAIs. In fact, the transformers were first invented by Google and were made open source.\nBut only a handful of companies have access to massive supercomputers capable of running billions of parameters.\nAnd now that OpenAI has opened its products up to the public, its getting invaluable real-world feedback that will help keep its products ahead of competitors.\nAs we reported last week, it has also hired contractors - including about 400 computer programmers - around the world, who are working to improve the companys tools that automate software development.\nAD"
  },
  {
    "body": "has confirmed that it will be removing a series of titles from the Xbox 360 Marketplace later this month, meaning players will no longer be able to download the affected games.\nREAD MORE:\nGoldenEye 007 on the Switch proves that sometimes, dead is better\nSharing the news on its official website, Microsoft wrote: A number of game titles and associated add-ons will be removed from the Xbox 360 Marketplace in a select set of regions per title.\nThe list of titles being removed from the UK store includes several Assassins Creed games, Far Cry 2, Mass Effect 2 and Counter Strike: Global Offensive.\nAdvertisement\nCall Of Duty: Advanced Warfare\nand Call Of Duty: Ghosts will also be removed from the UK version of the Xbox 360 Marketplace alongside Left 4 Dead and its sequel, Left 4 Dead 2. Check out the full list of titles here.\nThe removals start on February 7 and after that date, players will no longer be able to purchase affected titles but once purchased, you can always redownload these games or any other previously purchased games from your Xbox 360 Download History.\nThis delisting will not affect the ability to purchase the titles that are available on Xbox One or Xbox Series consoles.\nXbox 360 Kinect. Credit: momo_leif / Alamy Stock Photo\nLast October, Microsoft announced no further Xbox 360 games would be included in its Games For Gold subscription service. We have reached the limit of our ability to bring Xbox 360 games to the catalogue, it said in a statement citing licensing, legal and technical constraints.\nEarlier this month, Microsoft Gaming CEO Phil Spencer\nadmitted that 2022 was too light on games.\nAdvertisement\nOur commitment to our fans is that we need to have a steady release of great games that people can play on our platform, and we didnt do enough of that in 2022, theres no doubt. And fundamentally, thats on me. Im the head of the business, he said before that the company was excited about getting to roll into 2023.\nIn other news, Xbox,"
  },
  {
    "body": "Reddit\nOn Tuesday, Microsoft and cybersecurity firm Proofpoint warned that a threat actor had recently abused Microsofts verified publisher status to launch a campaign involving malicious OAuth applications. The warning stated that organizations using cloud services should be aware of the campaign, especially those in Ireland and the UK. Microsoft has already taken measures to stop the operation and released an article detailing how organizations can protect themselves.\nMicrosoft is referring to the campaign as consent phishing, a type of attack where the threat actor seeks to trick targets into granting permissions. Once the permissions are obtained, the malicious apps gain access to cloud services and user data. The verified publisher status helps lend the threat actors legitimacy and increase their chances of being successful. Microsoft stated that the attackers impersonated legitimate companies when enrolling in its Microsoft Cloud Partner Program.\nRead More:"
  },
  {
    "body": "Halo Infinite\nBungie\nI heard Jason Schreier was going to be doing a what went wrong at 343 piece to figure out what on earth has been up with Halo Infinite lately, and now that its here, of course, hes delivered.\nThe piece details a studio that seems to have few guiding principles as they handle both the next stages of Halo Infinite and the future of the Halo series in general, which 343 has reiterated they are not being removed from, despite recent events.\nThe biggest news in the piece is confirmation that Halo is about to make a grand leap to ditch the core Slipspace engine of the game, and instead move to the more generalized Unreal Engine 5, something that was first reported back in October. The old, sometimes ancient pieces of Slipspace were supposed to be one of the reasons Halo Infinite has moved so slowly, but critics of the switch to Unreal are worried the change may make the game not feel like Halo any more.\nThis switch will happen with the next big project that is not Infinite, Tatanka, the codename for Certain Affinitys upcoming multiplayer standalone game that may be some sort of modified Battle Royale offering.\nHalo Infinite\nNike Extends The Tennis Vapor Franchise With Vapor 11 And Vapor Pro 2\nWhat stood out to me the most, however, was this section, which confirms that 343 has not been working on story content for Halo Infinite, and as of right now, they have absolutely no plans to do so in the future:\nSince Halo Infinite was released, fans had assumed that in addition to new multiplayer modes, 343 was working on new content for the story. But that wasnt the case, according to the people familiar with the situation. Developers were making prototypes in the Unreal Engine and pitching ideas for new Halo games rather than working on new missions for Halo Infinite. Many of those developers were laid off this month and the company isnt actively working on new story content, the people said.\nIt's absolutely bizarre that with the way Halo Infinite was set up, with a clear cliffhanger ending leading into more necessary adventures of Chief and nu-Cortana, that nothing was developed as post-launch story content, and that the entire future of Halo appears to be multiplayer focused as the game chases the live service pipe dream of games like Call of Duty or Apex Legends. But working as a live service is the main thing that Halo Infinite has been explicitly terrible at, and its wild to think that the only new Master Chief content we may get out of Halo in the next few years is the excruciatingly terrible Paramount Plus show.\nComing away from all this, its hard to understand why exactly Microsoft is going to be giving 343 yet another shot at yet another Halo reboot, as clearly something is broken at its core here, likely with either 343 leadership, Microsoft leadership, or both. Its not working, but everyone just refuses to move on. Except players. Theyre the ones moving on.\nFollow me"
  },
  {
    "body": "8\nMicrosoft displays a \"now unlocked\" full screen notification on Windows 10 devices that are eligible for a Windows 11 upgrade. The notification has been displayed for months, but Microsoft modified it recently to increase conversions.\nThe original screen displayed \"now unlocked: you're eligible for a free upgrade to Windows 11\" in big letters on the screen. A short description reassured users that they could continue using the device during the download of the Windows 11 operating system (\"Don't worry -- you'll be able to use your PC while the download runs in the background (it's about 4 GB)\").\nA button \"see what's inside\" was displayed below the information. A bottom toolbar, in white, displayed learn more, keep windows 10, schedule it and get it links. Back then, Get it was the only button on the toolbar, which meant that it stuck out.\nADVERTISEMENT\nNow\n, Windows 10 users are seeing a revised \"now unlocked\" prompt, which is a deceptive design pattern, also known as dark pattern. The title and description remained, but the \"see what's inside\" button is no longer displayed below the text. Microsoft displays the highlighted \"get it\" button there, and a less emphasized \"schedule it\" button next to it.\nThe white toolbar at the bottom appears to be less visible than before. It includes the moved \"see what's inside\" link, and the learn more and \"keep Windows 10\" links. Nothing is highlighted on the toolbar anymore.\nClassic dark pattern design emphasizes certain actions on a screen while deemphasizing others. In the case of the Windows 11 upgrade prompt, the action to get the operating system right then and there is highlighted. The schedule option is less emphasized, but it is probably picked by Windows 10 users who do not want Windows 11 and have not spotted the \"keep Windows 10\" option on the screen.\nThe previous version of the \"now unlocked\" prompt emphasized the get\" button as well, but it was on the toolbar. With eyes on the toolbar, it is likely that more users spotted the keep Windows 10 option on it as well.\nADVERTISEMENT\nWindows 10 users who want to stay on Windows 10 need to locate the \"keep Windows 10\" link when the prompt is displayed on their devices. It is possible that the prompt will be modified again by Microsoft in the coming months to improve conversions even more.\nAnother option that Windows 10 administrators have is to use the freeware InControl to stay on a specific version and block any upgrade prompts to Windows 11.\nNow You: which version of Windows do you run, if any?\nADVERTISEMENT"
  },
  {
    "body": "Project Management - A Researcher's Guide.pdf\n1.    PROJECTMANAGEMENTby Chevonnese Chevers WhyteCARIMAC Research Seminar | 01Feb2023A Researcher's Guide\n2.    STEP BY STEPWhat's the due date?What are the major activities to be done?What are the sub-activities to be done?PROJECT TIMELINE01Estimate the number of days to complete a sub-activityBe RealisticUse Microsoft Excel or Google Spreadsheet templateNUMBER OF DAYS02TrelloAsanaMicrosoft PlannerPROJECT MANAGEMENT APP031 - 2 Activities per dayMicrosoft To DoForest and Writing GroupsTO-DO LIST04Chevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n3.    PROJECTTIMELINEThe due date is not the actual due date.Give yourself a week or some daysBEFORE the actual due date.WHAT'S THE DUE DATE?Chevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023GIVE YOURSELF SOMEWIGGLE ROOM\n4.    PROJECTTIMELINECourses, Reading, Writing, Meetings,Chapter 1, Chapter 2, Chapter 3,Proposal, Ethics Approval, ExecuteResearch, Chapter 4, Chapter 5, Chapter6, Publication(s) etc.LIST ALL THEREQUIREMENTSWHAT ARE THE MAJORACTIVITIES TO BE DONE?Chevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n5.    PROJECTTIMELINECourses - Number of AssignmentsMeetings - Once per week/ monthChapter 1 - Reading, Writing, 1stSupervisor Review, 1st Revision, MoreReading, More Writing, 2nd SupervisorReview, 2nd Revision etc.LIST ALL YOU NEED TO DO TOCOMPLETE THE MAJOR ACTIVITYWHAT ARE THE SUB-ACTIVITIES TO BE DONE?Chevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n6.    NUMBER OF DAYSESTIMATE THE NUMBEROF DAYS TO COMPLETE ASUB-ACTIVITYIt must always be in days: 3 days, 14 days, 30days, 100 days, etc.Chevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n7.    NUMBER OF DAYSBE REALISTICNot how long you would like to take but howlong you will really take to complete the activity.Think about the amount of time you can reallycommit to your research each week.Chevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n8.    NUMBER OF DAYSUSE MICROSOFT EXCELOR GOOGLESPREADSHEET TEMPLATEMicrosoft Date Tracking Gantt Chart template| https://1drv.ms/x/s!ApMA-kIojoyOjWKH1tuf0fPf7I-l?e=V68T84Google Gantt Chart template |https://docs.google.com/spreadsheets/d/1Qe3m15FUyLJHALkgMP9a1UeZh9GDm__vPFGxzp9ncA0/edit?usp=sharingConsider usingChevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n9.    PROJECTMANAGEMENT APPBoard, Lists, Cards, Due Dateshttps://trello.com/b/Fkupdq5VCONVERT YOUR GANTT CHARTTRELLO, ASANA,MICROSOFT PLANNERChevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n10.    TO-DO LISTOnly 1 - 2 tasks (sub-activities) perdayHOW MANY TASKS?Chevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n11.    TO-DO LISTA great tool to track your dailytasksMICROSOFT TO DOChevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n12.    TO-DO LISTForest AppWriting GroupsSTAYING ON TARGETChevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n13.    https://www.indeed.com/career-advice/career-development/how-to-write-research-planhttps://www.uwa.edu.au/students/-/media/Project/UWA/UWA/Students/Docs/STUDYSmarter/HM1-Planning-a-research-project.pdfhttps://college.cengage.com/english/raimes/keys_writers/5e/assets/students/research_schedule.pdfhttps://www.upstateresearch.org/assets/Timeline-Example-1.pdfhttps://ojjdp.ojp.gov/sites/g/files/xyckuh176/files/media/document/sample_resrch_timeln.pdfRESOURCES*Alternative Names: Research Timeline, Research Schedule, Research Planning\n14.    CONTACT MEhttp://chevonnesewhyte.comhttps://www.slideshare.net/ChevonneseWhyte@ChevonneseWhyteANY QUESTIONS?Chevonnese Chevers WhyteProject Management: A Researcher's Guide | CARIMAC Research Seminar | 01Feb2023\n"
  },
  {
    "body": "Feb 1, 2023 08:02 AM EST\n\nCopy Shortlink\nAccording to games industry market research firm DFC Intelligence, Microsofts Xbox Game Pass doesnt appear to be a sustainable long-term business model.\nThats what the research firm writes in a new article about the gaming subscription services from Microsoft, Sony, and Nintendo. The problem with Game Pass, according to the DFC, is Microsoft is giving away too much content in order to generate its revenue. Meanwhile, although not nearly as good as Xbox Game Pass and PlayStation Plus, Nintendo appears to have found the sweet spot with Switch Online when it comes to offering decent value for consumers.\nThe problem with Game Pass is the business model does not appear to work, the research firm writes. Comparing subscriber numbers is not necessarily fair because the services have significantly different prices.  However, what is clear is how well Nintendos subscription service works as an enhancement to the overall business model of selling hardware and software.  In contrast, Game Pass appears to be trying to be its own end where Xbox hardware sales are not important.\nWhen one does the math, Game Pass is making probably three times the revenue Nintendo Switch Online currently generates and probably getting close to matching PlayStation+ revenue because it is priced higher.  However, Microsoft is giving away a lot to generate that revenue and it does not appear to be a sustainable long-term business model.\nThe article then goes on to explain why DFC Intelligence believes that Nintendo Switch Online is compelling for both consumers and Nintendo as a company.\nThe last part of giving away AAA first-party content is the kicker.  Nintendos online service includes extra content for Mario Kart 8 and Animal Crossing: New Horizons.  However, these titles respectively sold 48 million and 40 million units at full retail price.  In other words, these two titles generated more revenue than a year of Game Pass.\nNintendos Switch Online service is believed to work as an enhancement to Nintendos overall business model.\n\"The bottom line is that game subscription services seem to work well as a value-add proposition.  Nintendo has shown that with Nintendo Switch Online.  There are tens of millions of users that will pay $60+ for a game and a cheap mediocre online service.  Taking it to the level of a Game Pass requires not only significantly more expenditure but requires giving up a large established revenue stream.\"\nDo you agree with the DFC? Is Microsofts business model sustainable in the long run and how about Sonys and Nintendos? Hit the comments down below.\nShare this story"
  },
  {
    "body": "DEX\n) management, today announce the integration of ControlUp Real-Time DX DaaS monitoring in Nerdio Manager for Enterprise.\nNerdio Manager for Enterprise adds value on top of Azure Virtual Desktop, Windows 365, and Microsoft Intune by delivering hundreds of features that simplify management, ensure efficient operations, and lower Azure compute and storage costs by up to 80%. ControlUp Real-Time DX collects metrics in real time to help IT teams identify, troubleshoot, and remediate problems before they negatively affect employees digital experience and productivity.\nControlUps mission is to help IT teams make smarter decisions with actionable insights to optimize remote environments and resolve issues faster by fixing and preventing issues easier, said Shay Gadidi, Vice President of Product Management, ControlUp. Our integration with Nerdio improves customers AVD user experience by streamlining troubleshooting, remediation, and automation.\nThe integration is available now in Nerdio Manager for Enterprise version v4.5 and above. It allows for the automated deployment and configuration of ControlUp agents to Azure Virtual Desktop (AVD) desktops directly from the Nerdio Manager for Enterprise console, providing customers with a simple, integrated solution for AVD management and monitoring.\nLeveraging this integration, IT administrators are no longer required to download the ControlUp agent, create machine accounts in their ControlUp environment, or manage machine, folder, and site associations.\nWhen ControlUp Monitor and agent updates become available, Nerdio Manager will automatically inform administrators directly from the Host Pools page, simplifying the administrative experience. The integration and deployment process are supported by Nerdios detailed logging and reporting features. The process of adding Monitors and Agents is fully logged and available for review.\nThis integration provides our joint enterprise customers and partners managing enterprise environments an easy, streamlined path to even greater ROI through the ongoing optimization and maintenance of their AVD environments, said Amol Dalvi, VP, Product, at Nerdio. With ControlUps actionable insights and Nerdios powerful automation and simplified management combined, organizations can truly take their employee experiences and EUC approaches to the next level.\nThe integration can be leveraged by customers with a ControlUp Real-Time DX environment that has at least one ControlUp Monitor hosted in Azure. Those interested in learning more about the integration and joint solutions are encouraged to attend a 30-minute joint webinar occurring February 22nd. To register please visit\n#####\nAbout ControlUp\nControlUp powers the work-from-anywhere world by delivering a Digital Employee Experience (DEX) Management Platform built for IT teams to make remote work more flexible and reliable. Whether your desktops are physical or virtual, your applications are local or SaaS, IT can optimize remote work environments from the datacenter or from the cloud with rich, real-time visibility across the entire digital employee experience. Headquartered in Silicon Valley with R&D in Israel, ControlUp supports over 2,000 customers and counting. Learn more at www.controlup.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.\nAbout Nerdio\nNerdio adds value on top of the powerful capabilities in Azure Virtual Desktop, Windows 365, and Microsoft Intune by delivering hundreds of features that simplify management, ensure efficient operations, and lower Azure compute and storage costs by up to 80% via automation and license optimization. Leveraging Nerdio,MSPs can manage customers cloud environments through streamlined, multi-tenant, workflow-powered technology that allows them to create and grow cloud-based recurring revenues. Enterprise IT professionals can deliver and maintain a wide range of virtual Windows endpoints across hybrid workforces with ease and fine-tune end-user computing (EUC) approaches for maximum effectiveness using powerful monitoring and analytics capabilities.For more information, please visit"
  },
  {
    "body": "Feb. 1, 2023\nImage: Getty Images\nMicrosoft has warned that fraudulent Microsoft Partner Network (MPN) accounts were used in a phishing campaign that featured bogus apps that tricked victims into granting them permissions to access their email accounts.\nThe attackers used the fraudulent MPN accounts to register fake versions of legitimate-sounding apps, such as \"Single Sign On (SSO)\" and \"Meeting\" that were dressed up with convincing visual indicators, including Zoom's older video icon and and Zoom-like URLs, according to security firm Proofpoint.\nAlso:\nPublic Wi-Fi safety tips: Protect yourself against malware and security threats\nThe attackers first impersonated legitimate companies to enroll in the Microsoft Cloud Partner Program or MCCP (formerly known as Microsoft Partner Network or MPN), and then used the accounts to add a verified publisher to OAuth app registrations, which they created in Azure Active Directory (AD).\nMicrosoft classifies the attack as \"consent phishing\" because the attackers use the bogus apps and Azure AD-based OAuth consent prompts (pictured below) to trick targets to grant permissions to the app, for example, to read emails, access contacts, and so on, potentially for an entire year. Also, with verified publisher status, the publisher name gains a blue 'verified' badge that signals Microsoft has verified the publisher of the app.\nMore Microsoft\nMicrosoft makes Tabbed File Explorer, additional Windows 11 22H2 features available in preview\nMicrosoft says in a blogpost that the phishing campaign targeted \"a subset of customers primarily based in the UK and Ireland\". It has also disabled the fraudulent apps and notified affected customers.\nMicrosoft has seen consent phishing incidents increase steadily in recent years, where the technique has been used to target Office 365 customers. Once granted by a victim, OAuth permission tokens are useful because the attacker doesn't require the target's account password, but can still access confidential data. Microsoft recently updated its document about the style of attack.\nProofpoint detected the malicious third-party OAuth apps on December 6 and informed Microsoft on December 20. It notes the phishing campaign ended on December 27. Microsoft became aware of the consent-phishing campaign on December 15.  \nProofpoint highlights consent phishing for OAuth delegated permissions as a powerful tool that can allow the malicious app to act on the user's behalf -- accessing mailbox resources, calendar, and meeting invitations linked to compromised user accounts. \n\"The granted token (refresh token) has a long expiry duration of over a year in most cases. This gave threat actors access to the compromised account's data and the ability to leverage the compromised Microsoft account in subsequent BEC or other attacks,\" it notes.\nAlso:\nCybersecurity staff are struggling. Here's how to support them better\nMicrosoft determined the primary goal in this campaign was to exfiltrate a target organization's email.\n\"Microsoft's investigation determined that once consent was granted by victim users, threat actors used third-party OAuth applications as a primary technique/vector to exfiltrate email. All impacted customers whose users granted consent to these applications have been notified,\" it notes.  \nSo, how did the threat actors get past Microsoft's checks for MPN/MCPP? According to Proofpoint, the actors displayed one name on their fraudulent apps that looked like the name of an existing legitimate publisher. Meanwhile, they hid the actual \"verified publisher\" name, which was different to the displayed name. Proofpoint notes that, in two cases, the actors got verification just one day after they created the malicious application. \nOnce the attacker got a verified publisher ID, they also added links in each app to the \"terms of service\" and \"policy statement\" of the impersonated organization's website. In the past, consent-phishing campaigns have compromised existing MPN verified publishers to abuse OAuth. The new method enhances the credibility of the malicious OAuth apps.\nMicrosoft says it has \"implemented several additional security measures to improve the MCPP vetting process and decrease the risk of similar fraudulent behavior in the future.\"\nImage: Proofpoint"
  },
  {
    "body": "Is Star Wars Jedi: Survivor coming to Xbox Game Pass? Find out everything we know about whether Cals galactic adventure will be playable on Microsofts subscription service.\n\n\n\nStar War Jedi: Survivor aims to continue Cal Kestis adventure and takes place five years after Star Wars Jedi: Fallen Order. The game aims to deliver even more adrenaline-fueled lightsaber combat, while also spanning numerous planets with exciting environments.&nbsp;\n\n\n\nDespite the recent news that Star Wars Jedi: Survivor will be delayed by six weeks, many fans will be wondering whether the game will be available on Xbox Game Pass or if it will ever make its way to the service. Luckily, we have all the answers here.\n\n\n\nSo, if youre looking to explore the galaxy far, far away, and become a Jedi Master, then our handy Game Pass hub has you covered with everything you need to know.\n\n\n\nWill Star Wars Jedi: Survivor come to Xbox Game Pass?\n\n\n\nStar Wars Jedi: Survivor is one of the most eagerly-anticipated 2023 releases.  \n\n\n\nAs of writing, there is no official news on if Star Wars Jedi: Survivor will be coming to Xbox Game Pass. Instead, the game is currently available to purchase on PC, PS5, and Xbox Series X|S.&nbsp;\n\n\n\nWhether the game will release on Xbox Game Pass in the future remains to be seen, but its important to note that Star Wars Jedi: Fallen Order was made available on Game Pass after launch through EA Play.&nbsp;\n\n\n\nWhile this doesnt confirm Star Wars Jedi: Survivor will be available on Game Pass, it would be fair to speculate that the title will follow a similar pattern to its predecessor. However, those that wish to play Jedi Survivor on launch day, will likely want to pre-order the game before release.&nbsp;\n\n\n\nAs always, well be sure to update this article should further news be announced so be sure to bookmark this page and check back regularly. In the meantime, be sure to check out our games page for all the latest news and updates.&nbsp;"
  },
  {
    "body": "Most of the delisted games will thankfully still be available on the Xbox One and Xbox Series X/S stores (pic: Microsoft)\n\n\n\nIt hasnt explained exactly why, but Microsoft has suddenly decided to delist a bunch of old games from the Xbox 360 store.\n\n\n\nDigital preservation remains a hot topic within the games community, so its easy to see why Sonys and Nintendos plans to shut down their respective digital storefronts were met with such backlash.\n\n\n\nIn an age where games can easily become lost to the ether, Xbox has earned brownie points for feverishly pushing backwards compatibility, forcing Sony and Nintendo to do the same. Phil Spencer even called for legalised emulation to ensure older games dont die out.\n\n\n\nHowever, it appears Microsoft has its limits, as its recently said that it will be delisting a bunch of old titles for the original Xbox and Xbox 360 from the Xbox 360 marketplace.\n\n\n\nThe list varies depending on your region but, for us in the UK, exactly 44 games will be removed in less than a weeks time, on Tuesday, February 7.\n\n\n\nThe good news is that most of them will either remain available for purchase on the Xbox One and Xbox Series X/S stores or have already been ported to or remastered for the Xbox One.\n\n\n\nPlus, if youve purchased any of these games, youll still be able to redownload them in the future.\n\n\n\nThe bad news, though, is that some of them  19 to be precise  have only ever been available through the Xbox 360 store. So, once theyre removed, theyre gone forever.\n\n\n\nYou can find the full list below, with the games that wont be accessible through the Xbox One or Xbox Series X/S highlighted.\n\n\n\n\t\t\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\tEvery original Xbox and Xbox 360 game leaving the Xbox 360 Marketplace\t\t\t\nAssassins Creed Brotherhood\nAssassins Creed 3\nAssassins Creed 4\nAssassins Creed Liberation HD\nBlood Of The Werewolf\nBlue Dragon\nBreakdown\nCall Of Duty: Advanced Warfare\nCall Of Duty: Ghosts\nCastle Crashers\nCloning Clyde\nCounter-Strike: Global Offensive\nDark Souls\nDarksiders 2\nDaytona USA\nDefense Grid\nEets: Chowdown\nFar Cry 2\nFinal Fight: Double Impact\nIron Brigade\nJeremy McGraths Offroad\nJet Set Radio\nLeft 4 Dead\nLeft 4 Dead 2\nLimbo\nLost Odyssey\nMass Effect 2\nMonopoly Deal\nMutant Blobs Attack\nN+\nOutpost Kaloki X\nPeggle 2\nPhantom Breaker: Battle Grounds\nPrince Of Persia\nR.U.S.E.\nSega Vintage Collection: Alex Kidd & Co.\nSkate 2\nSouth Park: The Stick Of Truth\nSpelunky\nSplinter Cell Conviction\nStar Wars: Battlefront (2004)\nStar Wars: Knights Of The Old Republic 2\nThe Orange Box\nThe Raven Episode 1\n\n\n\t\t\n\n\n\nMicrosoft has not issued any explanation as to why these specific games are being removed, as there seems no obvious connection between all of them.\n\n\n\nPerhaps its simply a licensing issue and Microsoft doesnt see the point of paying for their inclusion on a console thats almost 20 years old.\n\n\n\n\n\n\n\nHowever, the list seems like a random hodgepodge of titles with nothing really tying them together aside from the Xbox platform. As you can see, some of them are quite famous titles too  so its not just a bunch of obscure indie games.\n\n\n\nIf you intend on buying any of these games before theyre removed, be aware that a decent chunk of them arent backwards compatible with the Xbox One or Xbox Series X/S. So, youll only be able to play them on the Xbox 360.\n\n\n\nDont be surprised if even more games vanish from the Xbox 360 store in the future (pic: Microsoft)\n\n\n\nEmailgamecentral@metro.co.uk, leave a comment below, andfollow us on Twitter.\n\n\n\n\t\n\t\n\tMORE : Nintendo criticised by preservation group for destroying video game history\n\t\n\t\n\n\n\n\t\n\t\n\tMORE : PlayStations new game preservation expert explains what his job actually is\n\t\n\t\n\n\n\n\t\n\t\n\tMORE : Xbox Series X and Xbox Series S price increase announced in Japan\n\t\n\t\n\n\n\nFollow Metro Gaming onTwitterand email us atgamecentral@metro.co.uk\n\n\n\nTo submit Inbox letters and Readers Features more easily, without the need to send an email, just use ourSubmit Stuff page here.\n\n\n\nFor more stories like this,check our Gaming page."
  },
  {
    "body": "Business\nPayPal layoffs: After Google, Microsoft, another tech company plans to fire 2,000 employees\nPresident and CEO Dan Schulman wrote in a release that PayPal is working to address the challenging macroeconomic environment.\nReported By:\n| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Feb 01, 2023, 05:25 PM IST\nPayPal layoffs: After Google, Microsoft, another tech company plans to fire 2,000 employees\nPayPal Holdings Inc. joins the latest layoff trend. PayPal on Tuesday announced plans to fire 2,000 employees or about 7% of its workforce in a press release published by the company on its website.\nDan Schulman, PayPals President and Chief Executive Officer mentioned in the statement that the company is working to address the challenging macroeconomic environment. He claimed that although the business has made strides toward right-sizing its cost structure and concentrating resources on its most important goals, there was still more to be done.\nThis decision is in line with that of Wall Street titans and Big Tech firms, both of which are using layoffs as a cost-cutting measure.\n(Also Read:"
  },
  {
    "body": ") to Australian service members and veterans.\nThe 17-week intensive program is in partnership with Microsoft.\nIt aims to equip veterans with technology specialisation skills to help them overcome the challenges faced in transitioning from military service to civilian employment.\nMSSA Australia offers tech specialisations for two key skill sets, including cloud application development (CAD) or server and cloud administration (SCA).\nThe course also offers a variety of professional development opportunities, including industry mentors and guidance in career planning and skills development.\nAfter the completion of the MSSA, all students will receive an interview with Microsoft or one of its hiring partners, including Fujitsu, Accenture, JP Morgan and Westpac.\nPrograms like the MSSA can mutually meet the needs of veterans and employers  on the one hand, veterans benefit greatly from assistance in transitioning into corporate career paths, and on the other hand, Australian organisations suffering acute skills shortages benefit from a new pool of skilled workers,\"Lumify chief executive officer Jon Long said.\nAccording to the Australian Strategic Policy Institute, the ADF has averaged a separation rate of eight to ten per cent over recent years., which means a loss of 5,000 - 6,000 people per year, with many veterans already trained and highly skilled.\nWe are extremely proud to be delivering this program hand-in-hand with Microsoft, and making a difference to the lives of veterans, while tackling technology skills shortages, Long said.\nAustralian Defence Force veteran of 14 years, Matt Spencer, was a participant of the MSSA program in 2022, and secured a position at Microsoft as a software engineer before he even finished the course.\nUnderstanding how to market yourself on platforms like LinkedIn and write a strong resume is really useful,\"Spencer said.\nIt was a lot to learn in a short time, but having other people on the course going through the same issues really helped, Spencer added.\nThe instructors showed great interest in passing on all their knowledge and the practical activities helped me grasp the theory.\"\n\"One of the most valuable skills I acquired was proficiency in Git, an open-source version control system used for source code management, which can be used in tandem with Azure DevOps, object-orientated programming and the basics of syntax, he continued.\nThere are many transferable skills that veterans may not realise apply to the technology industry, such as self-motivation, working across both individual and team environments and the ability to research effectively,Spencer said,talking about his time in Defence\nIn December 2022, Lumify rebranded from DDLS. In October 2022, Lumify acquired Brisbane-headquartered Nexacu for $19.1 million, providing a portfolio of end-user courses to its enterprise sales infrastructure, and boosting its training pool to more than 30,000 students per year.\nThe same month saw Lumify bring Offensive Security's (OffSec) cybersecurity training offerings to Australia and New Zealand.\nIn May 2022, Lumify joined forces with Aussie online vocational education provider Open Colleges, to help further expand their new online security training into the consumer market.\nGot a news tip for our journalists? Share it with us anonymously here.\nCopyright  CRN Australia.  All rights reserved.\nTags:"
  },
  {
    "body": "An image of a chain link. It symobilizes a website link url.\nCopy Link\nDownload the app\nWelcome to February, readers. We've made it through job-cuts January. I'm Diamond Naga Siu, and it was pretty hard to avoid starting every newsletter with layoffs. But we're likely not out of the woods yet.\nThis week, we have many earnings calls on deck (my brilliant teammates Paayal Zaveri, Asia Martin, and  Emilia David will walk you through them). While the calls are pretty technical and sometimes kind of boring, they're important. They can signal more layoffs and/or give valuable insights into what top executives and investors are thinking.\nMeta (Facebook's parent company) has its call tonight. And many employees will likely have their ears peeled for hints to the future. Multiple workers told my colleague Kali Hays that they're already bracing for more job cuts. Snap employees are similarly prepping themselves for round two of layoffs.\nSpeaking of which, I'm hosting a Reddit AMA on tech layoffs. It's on Thursday, February 2 at 9 a.m. PT/12 p.m. ET. Before that happens though, let's jump into today's tech.\nIf this was forwarded to you, sign up here. Download Insider's app\nMicrosoft CEO Satya Nadella\nAP\n1. Microsoft warned employees against sharing \"sensitive data\" with ChatGPT. Amazon issued similar guidance recently. And now it's Microsoft's turn.\nLeaked internal communications revealed that Microsoft's CTO office told employees that using ChatGPT is fine. But it cautioned against sharing sensitive data in case it's used for future AI training models.\n\"This is new territory for all of us,\" Eugene Kim, who reported the story, told me. \"Companies and employees are all scrambling to find out the exact rules around using ChatGPT for work.\"\nHe added: \"The interesting thing here is that Microsoft is a big partner and investor of OpenAI, the maker of ChatGPT. In theory, Microsoft stands to gain when ChatGPT collects more data and improves its technology. But they also have to make sure their own confidential data doesn't get shared with ChatGPT.\"\nIn other news:\nArif Qazi/Insider;\n2. This is how shopping sites get you to buy more. Companies often tap into people's FOMO and use data to build personal relationships with customers  ultimately convincing them to make more purchases."
  },
  {
    "body": "Todays the day Samsung will announce its latest crop of flagship smartphones, widely expected to be the Galaxy S23 lineup. The Unpacked launch event kicks off at 1PM ET / 10AM PT later today, but if you want to get a handle on everything were expecting Samsung to announce then check out our roundup right here. Heres how to watch it live. \n\nIn other news, well be saying goodbye to an excellent VR game and a collection of classic Xbox 360 titles soon. Meta is shutting down Echo VR, one of the better multiplayer VR titles available for its VR headsets, and Microsoft is pulling a bunch of beloved games  including Jet Set Radio and The Orange Box  from the Xbox 360 Marketplace in a weeks time. When it comes to digitally downloaded and multiplayer games, nothing lasts forever.\n\nBut heres some good news: AMD thinks the PC market should pick up in the second half of this year, even if the total market will shrink by 10 percent throughout the course of 2023. \n\nFor now, heres a silly tweet to start your day:\n\n[Media: https://twitter.com/kendrawcandraw/status/1620222364222115840]\n\nStay tuned, as we continue to update this list with the most important news of today: Wednesday, February 1st, 2023."
  },
  {
    "body": "$60 discount\n(opens in new tab)\nis one thing, but the specs and the value on offer make the Xbox Series S worth getting. 512GB of internal storage and 10GB of memory means you can download plenty of games from the online library and play them with a gaming resolution of 1440p. It also offers 3D audio, a controller, a one year warranty and can play up to 120 frames per second.\nAs mentioned, this deal comes in time for the release of Starfield. From Bethesda studios (responsible for the Elder Scrolls and Fallout game series) comes a new free-to-roam RPG game with space exploration at its core. It's going to be released in the first half of this year and will feature procedurally generated planets to allow for countless quests, vehicles, characters and more to explore. It's definitely one of the top upcoming space games.\nBecause the deal is available on both Microsoft's website and at Walmart, it's always worth checking around in case one is out of stock or the deal expires on one of the sites. Let's not forget you can also play titles including Halo infinite on the Xbox Series S, so when you put together the compact design, the internal storage, the visuals on offer and the price, you get pretty good value for money with this deal.\nIf you're looking for some even more immersive gaming experiences, check out our guides to the best VR headsets and VR headset deals.\nToday's best Microsoft Xbox Series S deals\n(opens in new tab)"
  },
  {
    "body": "0\nXbox 360 owners, be aware. A range of top titles from Microsofts aging console will be removed from sale from the Xbox 360 Marketplace this month, beginning on 7th February.\nThe exact number of games and range of titles affected varies by country, though here in the UK it includes blockbusters such as Mass Effect 2, Dark Souls and various Assassins Creed entries, including Brotherhood, 3 and 4: Black Flag.\nA selection of smaller-sized classics are also impacted, including Limbo, Spelunky, Castle Crashers and Peggle 2. All will be removed from digital sale.\nEurogamer Newscast: What to look forward to in 2023!\nImportantly, its worth noting that these games will not be removed from sale on later Xbox consoles. Youll still be able to purchase and play these games via Xbox backwards compatibility on Xbox One and Xbox Series X/S.\nAdditionally, its worth flagging that although these games may be removed from sale on Xbox 360, you can still continue to play any you have previously purchased and downloaded  or indeed any you have a disc-based copy of."
  },
  {
    "body": "Microsoft 365\nMicrosoft recently released an exhaustive list of features it added to Excel last month. It will also notify us about whats been added in February next month. One of the important capabilities Microsoft is planning to add to Excel is the ability to toggle auto-hide the Ribbon.\nThe Auto-hide Ribbon is already available for desktop users, but from this month, Microsoft will also expand the benefit to web users. In other words, the Microsoft Excel web client will let you automatically set the Ribbon to hide. If you are using Excel online, this feature will help you to focus on the content and the grid, as you can better concentrate on your spreadsheets when the Ribbon is not there.\nOf course, you will be able to bring the Ribbon as and when you need it. You will also be able to expand it. However, if you want the largest amount of screen space when you view your workbook, you can hide all tabs and commands by enabling the Auto-hide Ribbon option. As described by Microsoft in the Microsoft 365 Roadmap page, the ribbon mode can be set from the ribbon switcher control on the bottom right of the Ribbon.\nIt is worth noting that Excel on the web is free for everyone, which means you do not need a premium Microsoft 365 subscription. If you have a Microsoft account, you can use Excel on the web for free, though it will not be as advanced as the one included in the paid subscription.\nMicrosoft has said that it will release the new ribbon mode this month, but the company has a history of delaying features after promising them. While we hope it will arrive this month, do not be surprised to see Microsoft delaying it to a later date.\nDo you use Excel online? If yes, what else do you want Microsoft to add in it in the future? Let us know your thoughts in the comments section."
  },
  {
    "body": "The latest Windows 11 problem sees updates failing with 0x800f0988 and 0x800f0831 errors\nWhile Microsoft is eager for would-be Windows 10 purchasers to admit defeat and jump to Windows 11, there are other options. The maker of the operating system may no longer sell it, but there are plenty of third party companies that do still have licenses available for sale.\nIt is even possible to download Windows 10 from Microsoft and use a Windows 11 product key to activate the older OS.\nSo eager is Microsoft for people to embrace Windows 11 -- even if that means buying a new PC -- the company is using the product page to promote the likes of Best Buy, Amazon, Costco and Walmart as places from which it is possible to buy a Windows 11 compatible PC.\nBut the fact that Microsoft no longer offers Windows 10 for sale marks the end, or at least the beginning of the end, of an era. The operating system will be supported and will receive security updates until October 2025.\nImage credit: realinemedia /"
  },
  {
    "body": "1\ncomment\nA couple of weeks ago, we learned that Microsoft will soon stop selling Windows 10 licenses through its website in its latest push to get people to upgrade to Windows 11 instead. Today that day has finally arrived, and true to its word, the company's Windows 10 purchase pages essentially don't exist.\nIf you try and navigate to the purchase webpage for Windows 10 Home or Windows 10 Pro, you will be redirected to the \"Get Windows 11\" page. There, you'll find that there is only a single license purchase link that only allows you to purchase Windows 11. There is also a list of vendors from where you can buy a Windows 11-compatible PC and there are FAQs for customers who are not tech-savvy too.\nWhile Microsoft is no longer selling Windows 10 licenses through its website, you can still buy these at third-party retailers like Newegg and Amazon. You might also find physical copies of Windows 10 in brick-and-mortar stores.\nThis is pretty much the beginning of the end for Windows 10, seven and a half years after it launched,  as Microsoft continues to pivot strongly towards Windows 11 as the preferred OS. New functionalities are primarily being added to Windows 11 and it's also being pitched as the most secure version of Windows. Regardless, it is important to understand that Windows 10 is supported until October 14, 2025 which means that you are eligible for support and security updates until then.\nTags"
  },
  {
    "body": "0\ncomments\nNear the end of each month, Microsoft publishes a changelog of all the new features it added to Excel and Teams in the four weeks prior. The firm already released a list of capabilities it added to Teams in January 2023 yesterday, and today, it has done the same for Excel.\nStarting with Excel for the web, we have a single feature but one that's been highly requested by customers. It is the ability to view the source data for a value cell in a PivotTable. This is especially useful if you spot a seemingly anomalous value in a PivotTable and want to investigate the underlying data further. Now you can do so by double-clicking the cell or right-clicking it and pressing \"Show Details\". This will open a new sheet with more details about the cell so you can validate the numbers and the calculations.\nComing over to Excel for Windows and Excel for the Mac, we have an identical changelog for both. Office Scripts can now be automated through Power Automate by leveraging a dedicated \"Automate\" tab. This is something we already covered in detail a few weeks ago.\nMeanwhile, for Insiders, there are two new functionalities on Windows and Mac. The first makes automation even easier. Rather than writing Office Scripts through JavaScript or TypeScript, you can simply use the \"Record Actions\" functionality, which does exactly what it says on the tin. You can navigate and perform actions in the UI yourself and the script to mimic your activities will automatically be generated on the backend. The other Insider feature is relatively minor and offers a tooltip to validate your parameters in an Excel formula.\nWhile the changelog certainly isn't as extensive this time around, there are certainly some productivity enhancements that will likely be appreciated by those looking to automate monotonous workbook activities.\nTags"
  },
  {
    "body": "0\ncomments\nDecember 2022's Patch Tuesday (KB5022083) packed a security update for .NET and .NET Framework, changing how Windows Presentation Foundation-based (WPF) applications render XPS documents.\nThis caused many users to experience issues as XPS documents which leverage structural elements like tables and hyperlinks will not display correctly in WPF-based readers. Moreover, some inline images may not display correctly in XPS documents or throw Null reference exceptions in WPF-based readers.\nAlthough Microsoft issued a couple of temporary workarounds involving PowerShell scripts and Windows registry configurations, the company has now rolled out a more permanent fix through an out-of-band (OOB) update.\nThe OOB update is now available for the following platforms:\nWindows 11 version 22H2\nAzure Stack HCI version 22H2\nAzure Stack HCI version 21H2\nWindows 10 version 22H2"
  },
  {
    "body": "View video recordings and attendance reports can now be accessed inside LMS.\nVideo Gallery gets pages or navigation controls below to see other videos of the attendees.\nThe Meeting toolbar has a usability upgrade featuring dedicated buttons for raising hands and switching between view modes.\nThe new Workplace Live app integration allows live streaming of Teams meetings or webinars directly to Meta Workplace Live.\nWebinars\nThe webinar gets a better management experience through a new structure and registration details and settings customization options for specific events. Specifically, the expanded options cover the setup, registration, and reports. This brings new abilities to designate co-organizers, highlight speakers info, set a theme setting for registration page and webinar communications, set registration capacity limits for up to 1,000 attendees, use custom questions for info-collection, view attendee status details, and access existing reporting and analytics in one central location.\nCalling\nTeams now supports group Teams call from a chat with federated colleagues outside the organization.\nTeams Rooms and Devices\nTeams Rooms on Windows now allows starting of a Microsoft Whiteboard in Teams meetings using the in-meeting share content function of meeting room consoles.\nAbility to show or hide chat on the front-of-room display using meeting room consoles when in Gallery, Large Gallery, or Together mode.\nIn-meeting notifications for Teams Rooms on Windows get improvements to help it to be more like the familiar Teams desktop experience.\nCertified Devices+\nPoly CCX350 is added as a Teams-certified device.\nChat and collaboration\nTeams now displays the full chat conversation thread after clicking on search message results.\nManagement\nThe developers can access, edit, or delete event updates on messages in user:bot chats.\nFiles uploaded within the Power Automate portal will now show within the view details window of an approval request within Teams.\nAdmins get the ability to use Intune to decide the types of content a user can view in a notification on their mobile lock screen.\nFrontline workers\nOutlook and Power Apps applications on Android are now in public preview for frontline workers using shared devices.\nGovernment\nTeams calendar now includes scheduling form pop-outs for GCC-High and DoD.\nNew ability to view an attendance report on Microsoft Teams for Android and iOS for Government clouds.\nTeams meeting for DoD gets emojis.\nThere is a new ability in DoD to disable and enable videos for all attendees before or during a Microsoft Teams meeting.\nAutomatic viewing of up to 49 videos (77) in Teams meeting for GCC-High and DoD.\nNew ability for organizers and presenters to manage the audio capabilities of meeting attendees."
  },
  {
    "body": "EasyEquities\nBy Chuck Saletta*\nAI chatbots look like they have the potential to impact all sorts of industries. Here are three players in the space that may be worth a look.\nChatGPTs recent public launch generated a lot of buzz. The chatbots ease of use, wide range of trained topics, and remarkable fluent communication style have people across industries scrambling to figure out how to build similar capabilities into their operations. ChatGPTs potential to disrupt industries is becoming clear  and even highly skilled roles are likely to be impacted by it in one way or another.\nIn a world where the choice may very well be between doing the disrupting or getting disrupted yourself, it makes sense to ask if theres a way to invest in ChatGPT or other technologies like it. ChatGPT itself is a project of OpenAI  which is a company currently managed by a non-profit. As a result of that structure, you cant directly buy shares of OpenAI. Still, its worth assessing the landscape to see what might be available for investors to consider.\n3 ways to get invested in the trend\nFirst, Microsoft (NASDAQ: MSFT) is an investor in OpenAI, which means it will likely directly benefit from anything ChatGPT can monetize. To jumpstart that, Microsoft has launched an OpenAI service as part of its Azure platform, with ChatGPT integration expected to come soon. As a key benefit of being an investor in the company behind ChatGPT, Microsoft is clearly well positioned to be an early adopter and beneficiary of its capability.\nEven before the launch of ChatGPT, Microsoft had already made a name for itself in the chatbot space with its Bot Framework. That platform is generally considered among the best in class when it comes to the ability to create and deploy chatbots for enterprises.\nNext on the list is Alphabet (NASDAQ: GOOGL). Not one thats used to being caught behind a major trend, Alphabet has long been an investor in AI platforms. Its DeepMind business line is the company behind tools that help with scientific tasks like protein folding research. It has also flexed its muscles with AlphaGo, the AI platform that can beat the worlds best players in the classic game of Go.\nStill, the popularity of ChatGPT has taken Alphabet a bit by surprise, and Alphabet now looks like it is working to aggressively incorporate more chatbot like services into its offerings as well. Given its strengths in other aspects of artificial intelligence and DeepMinds recent shift to being a profitable business line, I certainly wouldnt count Alphabet out on this one.\nFinally, what would a tech war be without participation from Amazon (NASDAQ: AMZN)? Amazons Alexa for Business platform offers Alexa as a digital assistant for people at work. Key areas where that platform already excels is in things like joining or coordinating online meetings, calendar management, and conference room scheduling.\nCompanies can also program private skills for their Alexa for Business offerings, enabling them to customize the AI to perform new tasks for them. That, along with its great voice recognition and response technology and continued development by the Alexa team itself, will likely keep Amazons Alexa for Business in the game for quite some time.\nIf you cant beat them, consider buying them\nChatGPT was certainly a breakthrough in the AI chatbot space, and its one that looks like it is poised to launch a revolution across many industries. We may not be able to avoid the disruption thats likely coming our way, but we can put ourselves in the position to potentially profit from it.\nAll three of these companies look like ones that have potential to ultimately be winners from this new technology. Whether any of them deserve a spot in your portfolio is up to you, but if youre interested in investing in the AI chatbot space, theyre certainly worth looking at.\nAt the time of publication, Chuck Saletta owned shares of Microsoft.\nSources  EasyResearch, The Atlantic, OpenAI, The Verge, Learn Microsoft, BotPress, DeepMind, VentureBeat, AWS Amazon, Ed Week\nRead also:"
  },
  {
    "body": "January 31, 2023\nThe support page adds, Once purchased, you can always redownload these games or any other previously purchased games from your Xbox 360 Download History. This means that if you have already bought a game that Microsoft is soon removing, you dont have to worry as the game(s) will still be available for you to download.\nIn India, several popular games will no longer be available on the Xbox 360 Marketplace from February 7, 2023, including South Park: The Stick of Truth, Prince of Persia, LIMBO, Left 4 Dead and Left 4 Dead 2, Assassins Creed IV: Black Flag, and Call of Duty titles such as Call of Duty: Advanced Warfare and Call of Duty: Ghosts.\nSimilarly, in less than two months, Nintendo, too, will close its eShop on the Wii U and 3DS systems, Microsoft itself has removed several Forza titles from its platform, and Sony made it more difficult to purchase games on the PS3 and Vita stores, according to The Verge.\nRead all the Latest Tech News here\nAbout the Author"
  },
  {
    "body": "New Delhi, February 1 :Tech giant Microsoft has announced that it will remove a bunch of beloved games from the Xbox 360 Marketplace on February 7. &quot;A number of game titles and associated add-ons will be removed from the Xbox 360 Marketplace in a select set of regions per title. These removals will start on February 7, 2023,&quot; the company said on an Xbox support page.OnePlus 11R 5G Specifications Officially Revealed by Company Prior to February 7 Launch, Know All Details Here. &quot;Once purchased, you can always redownload these games or any other previously purchased games from your Xbox 360 Download History.&quot; On the support page, the company also provided the list of the games that will be removed based on the users' region. For example, in India, many games including 'Call of Duty: Advanced Warfare', 'Counter-Strike: GO', 'Assassin's Creed IV', 'Star Wars Battlefront' and 'Prince of Persia', will be removed.Apple Says No to Layoffs: Amid Mass Sackings at Tech Companies, Tim Cook Has Not Fired Employees; Here's Why. Meanwhile, last month, as 2022 was coming to an end, the tech giant had revealed its best Xbox games of last year. That list included titles like the racing game 'Forza Horizon 5 Hot Wheels', the action-adventure game 'Sea of Thieves', the survival game 'Grounded', and much more."
  },
  {
    "body": "The United States-based technology giant has announced that it would be removing a few popular game titles from its Xbox 360 gaming consoles Xbox 360 Marketplace from February 7, 2023. This came after the company announced the removal on its official Xbox support page, A selection of game titles and related add-ons will be withdrawn from the Xbox 360 Marketplace in a limited number of locations. These evictions will begin on February 7, 2023, according to the companys Xbox support page. You may always redownload these games, as well as any other titles youve already bought, from your Xbox 360 Download History, it added. Additionally, the company has announced that the removal of the games would be based on the users region and has also provided the list of games that will be removed. Many titles, such as Call of Duty: Advanced Warfare, Counter-Strike: GO, Assassins Creed IV, Star Wars Battlefront, and Prince of Persia, will be deleted from India. Meanwhile, as the year 2022 came to a close, Microsoft revealed its top Xbox games from the previous year. Among the titles on the list were the racing game Forza Horizon 5 Hot Wheels, the action-adventure game Sea of Thieves, the survival game Grounded, and many more. In terms of global layoffs, the company recently laid off over 10,000 employees and joined forces with other technology giants. Despite global economic tensions, the company has laid off approximately 5% of its workforce. Notably, this is one of the biggest job cuts made by the company. We saw customers accelerate their digital spend during the pandemic, and now were seeing them optimise their digital spend to do more with less, says the company. The SEC published a note to employees from CEO Satya Nadella. However, the company made similar layoffs during the year 2015. (With agency inputs)"
  },
  {
    "body": "/\n1\nSure roses are beautiful and candy is sweet, but flowers die and candy gets eaten, leaving nothing behind but memories. This Valentines, why not get your loved one a gift that will not only last but will be used regularly, like this\nMicrosoft Surface\n?\nWere not suggesting that you forgo romantic presents. In fact, we think that if you really want to earn brownie points this February 14\nth\nthat you wrap up this tablet with a red bow and accompany it with an extra little treat to show you havent totally lost the meaning of the day. And since this Microsoft Surface 3 is being offered at such a low price, were sure youre going to have some left over for that extra touch  and even a card!\nBut its refurbished, youre thinking. Isnt that like giving your significant other a used gift? No! In fact, not only are you getting a good-as-new tablet at a fraction of the price, but youre saving a perfectly good device from potentially ending up in the landfill. See, you're showing your love for the earth as well as for your partner (or friend, or family member, or even yourself, if you so choose!)\nSo picture this  the big day arrives and you offer your gift (together with the aforementioned romantic gesture and bow  and make it a big one!) and whoever is opening it is giddy with anticipation. When the MS Surface is revealed, complete with its 2.4GHz speed, 10.8\" full HD display, 2GB of RAM,64GB of storage, 10 hours of battery life, plus so much more, wed be surprised if you werent showered with appreciation.\nThis Valentines Day we are offering this refurbished Microsoft Surface 3, complete with an aftermarket 30-day parts and labor warranty from a third party, for only $159.99 (no coupon necessary) thats more than 70% off the suggested retail price. But hurry! If you want it to arrive before the big day, you must put your order in before the end of the day February 3rd.\nAnd as an added bonus, they will think of you whenever the tablet is booted up. It truly is the gift that keeps on giving.\nPrices subject to change\nBoeing to build braced-wing airliner, shooting for 30% efficiency gain\nMilitary\nDARPA nails latest US hypersonic missile test flight\nSpace\nNASA's rotating detonation rocket engine posts record test results\nLoad More"
  },
  {
    "body": "Ravie Lakshmanan\nEnterprise Security / Authentication\nMicrosoft on Tuesday said it took steps to disable fake Microsoft Partner Network (MPN) accounts that were used for creating malicious OAuth applications as part of a phishing campaign designed to breach organizations' cloud environments and steal email.\n\"The applications created by these fraudulent actors were then used in a consent phishing campaign, which tricked users into granting permissions to the fraudulent apps,\" the tech giant said. \"This phishing campaign targeted a subset of customers primarily based in the U.K. and Ireland.\"\nConsent phishing is a social engineering attack wherein users are tricked into granting permissions to malicious cloud applications, which can then be weaponized to gain access to legitimate cloud services and sensitive user data.\nThe Windows maker said it became aware of the campaign on December 15, 2022. It has since alerted affected customers via email, with the company noting that the threat actors abused the consent to exfiltrate mailboxes.\nOn top of that, Microsoft said it implemented additional security measures to improve the vetting process associated with the Microsoft Cloud Partner Program (formerly MPN) and minimize the potential for fraudulent behavior in the future.\nThe disclosure coincides with a report released by Proofpoint about how threat actors have successfully exploited Microsoft's \"\nverified publisher\n\" status to infiltrate the cloud environments of organizations.\nWhat's notable about the campaign is that by mimicking popular brands, it was also successful at fooling Microsoft in order to gain the blue verified badge. \"The actor used fraudulent partner accounts to add a verified publisher to OAuth app registrations they created in Azure AD,\" the company explained.\nThese attacks, which were first observed on December 6, 2022, employed lookalike versions of legitimate apps like Zoom to deceive targets into authorizing access and facilitate data theft. Targets included financial, marketing, managers, and senior executives.\nProofpoint noted the malicious OAuth apps had \"far-reaching delegated permissions\" such as reading emails, adjusting mailbox settings, and gaining access to files and other data connected to the user's account.\nIt also said that unlike a previous campaign that compromised existing Microsoft verified publishers to take advantage of OAuth app privileges, the latest attacks are designed to impersonate legitimate publishers to become verified and distribute the rogue apps.\nTwo of the apps in question were named \"Single Sign-on (SSO),\" while the third app was called \"Meeting\" in an attempt to masquerade as video conferencing software. All three apps, created by three different publishers, targeted the same companies and leveraged the same attacker-controlled infrastructure.\n\"The potential impact to organizations includes compromised user accounts, data exfiltration, brand abuse of impersonated organizations, business email compromise (BEC) fraud, and mailbox abuse,\" the enterprise security firm said.\nThe campaign is said to have come to a close on December 27, 2022, a week after Proofpoint informed Microsoft of the attack on December 20 and the apps were disabled.\nThe findings demonstrate the sophistication that has gone into mounting the attack, not to mention bypass Microsoft's security protections and misuse the trust users place in enterprise vendors and service providers.\nThis is not the first time bogus OAuth apps have been used to target Microsoft's cloud services. In January 2022, Proofpoint detailed another threat activity dubbed OiVaVoii that targeted high-level executives to seize control of their accounts.\nThen in September 2022, Microsoft revealed that it dismantled an attack that made use of rogue OAuth applications deployed on compromised cloud tenants to ultimately takeover Exchange servers and distribute spam.\nFound this article interesting? Follow us on Twitter\n\nand LinkedIn to read more exclusive content we post.\nSHARE"
  },
  {
    "body": "Image source,\nPayPal\nPayPal is shedding around 2,000 jobs, or 7% of its workers, as it becomes the latest big tech firm to cut costs.\nThe online payments company says it was forced to make the decision as it faces \"the challenging macro-economic environment.\"\nPayPal's announcement follows tens of thousands of layoffs by technology giants in the last month alone.\nThis year, Google's parent company Alphabet, Amazon and Microsoft have announced major job cuts.\n\"We must continue to change as our world, our customers, and our competitive landscape evolve,\" PayPal's chief executive Dan Schulman said in a statement.\nAlso on Tuesday, Snap - the parent company of social media platform Snapchat - warned that revenue for the three months to the end of March could fall by as much as 10%.\n\"We anticipate that the operating environment will remain challenging, as we expect the headwinds we have faced over the past year to persist throughout Q1,\" the company told investors.\nAfter the announcement Snap's shares fell by almost 15% in extended trade in New York.\nWhat is behind the big tech companies' job cuts?\nAt the start of this year, Amazon announced it planned to cut more than 18,000 jobs because of \"the uncertain economy\" and rapid hiring during the pandemic.\nAlso this month, Alphabet said it would shed 12,000 jobs, while Microsoft said up to 10,000 employees would lose their jobs.\nLast week, Swedish music-streaming giant Spotify said it would cut 6% of its about 10,000 employees, citing a need to improve efficiency.\nIn another sign of the technology industry slowdown US computer chip maker Advanced Micro Devices (AMD) on Tuesday reported a 98% fall in net income for the last three months of 2022.\nThe company also said it expects revenue to drop by as much 10% in the current quarter.\nHowever, the figures were better than many investors had expected and AMD's shares rose after the announcement.\nIn Asia on Wednesday, the world's second-biggest memory chip maker SK Hynix posted its largest quarterly loss on record.\nThe South Korean company reported a worse-than-expected 1.7tn won ($1.4bn; 1.1bn) loss for the last three months of 2022, as sales fell by 38%.\nThe firm pointed to falling computer chip prices and joined rival technology giants as it warned that it expects an industry-wide downturn to worsen in the coming months, before recovering later in the year.\nIt came after rival Samsung Electronics on Tuesday reported its lowest quarterly profit in eight years.\nYou may also be interested in:\nMedia caption,"
  },
  {
    "body": "January 2023 Update\nintroduced a handful of new features to Microsofts spreadsheet product. The main highlight of the update is the PivotTable Show Details feature for Excel for the web. Other additions include the Power Automate tab for Excel for Windows and Mac and some new features for Insiders to test.\nExcel for the webs new feature is the result of users feedback, according to Microsoft. The new PivotTable Show Details option allows users to view the source data for a PivotTable value cell. It is a handy function that helps users understand how the values in a PivotTable are calculated.\nPT Show Details\nFor example, if you see an unexpected value in your PivotTable, you can use Show Details to confirm whether the source data used to calculate that value is as expected or if there is an issue with the underlying data, Microsoft explains.\nPivotTable Show Details option is accessible through a double-click or a right-click, but theres also a dedicated button for it from the PivotTable tab of the ribbon.\nAutomate tasks in Excel Desktop\nMeanwhile, Excel for Windows and Mac will both get the same access to the\nPower Automate\ntab starting today. The new tab offers options for creating and modifying scripts that allow the automation of repetitive tasks using Office Scripts. Users can connect different Microsoft apps like Microsoft Teams or SharePoint to build workflows, schedule Office Script, and more.\nValue Preview Tooltips\nRecord Actions\nAside from Power Automate, Excel for Windows and Mac will also deliver two capabilities to Insiders today. These include the ability to record worksheet actions using Office Scripts and check your formula with value preview tooltips. For the former, this update means users will no longer need to use JavaScript and TypeScript via the Office Scripts Code Editor to automate repetitive worksheet tasks. Meanwhile, value preview tooltips allow the evaluation of any selected part of the formula by showing the current value of the parameter highlighted."
  },
  {
    "body": "Norfolk SPCA to experience extended wait times due\nFormer ABC journalist charged in child porn case\nGroundhog Day 2023: How to watch live from  FBI finds no classified documents at Bidens Rehoboth\nSentara Family Medicine doctor shares advice to stay\nTyre Nichols funeral: Livestream and updates\nVDOT completes work at I-64, I-264 Interchange\nWatch live: Witness testimony continues in Alex Murdaugh"
  },
  {
    "body": "Microsoft Corp. says its going to keep making new games in the popular Halo franchise at its prized 343 Industries studio  despite rumors to the contrary. But after a leadership overhaul, mass layoffs and a host of big changes, the outfit is all but starting from scratch.The Redmond, Washington-based 343 Industries released its latest game, Halo Infinite, in December 2021 to widespread critical acclaim. It was seen as a redemption story for a title that suffered multiple delays, endless development problems and a merry-go-round of creative leads. But in the months that followed, fans turned against the game, complaining about a thin road map and the slow rollout of features that had been expected on day one. At the same time, 343 was seemingly losing staff by the week and went through a major leadership change last fall that led some employees to brace for a reorganization.  The ax fell in mid-January when Microsoft announced mass layoffs and 343 Industries was hit hard. While Microsoft declined to provide specific figures, at least 95 people at the company have lost their jobs, according to a spreadsheet of affected employees reviewed by Bloomberg. The list named dozens of veterans including top directors and contractors, upon which the studio heavily relies. Those temporary employees were given just a few days warning before their contracts came to an end, according to people familiar with the process, asking not to be identified because they werent authorized to speak publicly.    The cuts led to rumors that 343 would farm out development of the Halo series to other game companies. Matt Booty, head of Microsofts Xbox Game Studios, said in an interview that 343 will continue as the internal developer for Halo and as the home of Halo. Internally, Booty has assured 343 staff that even as they work with outside partners and outsourcing houses, they will remain in charge. Questions remain, however, about the fate of the Halo franchise as the studio is hollowed out and makes big changes to how it develops games.    Chief among them is a pivot to a new gaming engine, the suite of tools and technology used to make video games. The studios own engine, known publicly as Slipspace, has been one of the biggest points of contention over the past two decades. Based largely on old code from the 1990s and early 2000s, its buggy and difficult to use and has been the source of headaches for some developers on Halo Infinite, people familiar with the development said. Several multiplayer modes that are nearly finished, such as Extraction and Assault, both popular in previous Halo games, have yet to be released in part because of issues involving the engine, they said.  At several points over the past decade, management at 343 debated switching to Epic Games Inc.s popular Unreal Engine. But it wasnt until late last year, when previous studio head Bonnie Ross and engine lead David Berger departed and Pierre Hintze took over, that the firm finally decided to pivot to Unreal. This switch will start with a new game code-named Tatanka, according to people familiar with the plans. That project, which 343 is developing alongside the Austin, Texas-based game studio Certain Affinity, started off as a battle royale but may evolve in different directions, the people said. Future games in the series will also explore using the Unreal Engine, which may make development easier, although internal skeptics are worried that the switch may have a negative impact on the way Halo games feel to play. A Microsoft spokesman declined to comment on issues with the engine or on the companys plans to pivot to Unreal.  Since Halo Infinite was released, fans had assumed that in addition to new multiplayer modes, 343 was working on new content for the story. But that wasnt the case, according to the people familiar with the situation. Developers were making prototypes in the Unreal Engine and pitching ideas for new Halo games rather than working on new missions for Halo Infinite. Many of those developers were laid off this month and the company isnt actively working on new story content, the people said. A Microsoft spokesman declined to comment.In the eyes of some observers and former 343 employees, the reorganization was a long time coming. The studio, which was founded in 2007 to inherit Halo after Microsoft parted ways with original developer Bungie, has struggled through many challenges, including the release of several polarizing games. Patrick Wren, a former 343 designer, said on Twitter that the job cuts and the state of the Halo franchise overall are the result of incompetent leadership up top during Halo Infinites development that led to massive stress on those working hard to make Halo the best it can be.  Microsoft once promised that Halo Infinite would be the start of the next ten years for Halo, but its recent moves point to a shorter-term vision. In an email to staff following the layoffs, Hintze wrote that the current plan for 343 is to support a robust live offering for Halo Infinite and its Forge level creator and greenlighting our new tech stack for future Halo games while also bringing Halo to more players through more platforms than ever before.  s"
  },
  {
    "body": "Timothy Geigner\nIf you havent been living under a rock for the past couple of years, you will be familiar with the concept of the anti-woke culture war the Republican Party grows and farms for its own purposes. This isnt to say there arent real cultural conflicts we need to work out as a country, but that doesnt change the simple fact that much of what you hear about in the press is specifically cultivated by one party or another to generate headlines and outrage for the purposes of votes and campaign contributions.\nAnd if youre looking for an avatar for this sort of un-principled outrage manufacturing, Ted Cruz would be one of the first names I would bring up. Cruz claims to be a strict constitutionalist, while also threatening companies for exercising their free speech rights. In most of the cases, Cruz is railing against the woke in favor of shit-peddling lie-factories like OAN, claiming that a company choosing what to do within its own private purview is somehow censorship in favor of wokeism.\nAnd it gets really dumb at times. You may have heard recently that the GOP was out there claiming that the White House was going to be coming to collect not your guns (this time), but your gas-powered ovens/stoves. It wasnt really true. What actually happened was a consumer safety group within the government pointed out that there were a lot of health risks with these ovens and that the group might seek to lower future production of them in favor of safer electric ovens. No jackbooted thugs were going to go house to house and haul away your grandmothers gas stove.\nBut then came Cruz also going after Microsoft. Why Microsoft? Well, because Microsoft had embraced wokeism, according to Cruz, by updating its standard Xbox power settings to be more power efficient. Yes. Yes, really.\nHeres what Microsofts Xbox update actually does: It will cut down on power usage by up to a factor of 20 by changing the default setting of Xbox consoles from sleep to shut down.\nwave of stories from Fox News\nand the like. According to them, not only was Xbox going woke by making these environmentally friendly changes, butFox and Friendshosts Ainsley Earhardt and Jimmy Failla suggested Microsoft was trying to recruit your kids into climate politics.\nThe open question appears to be: if this is wokeism, which its not, then that doesnt explain what in the world is wrong with any of this. What, specifically, is Cruz objecting to here? The end customer is barely going to notice any difference other than a slightly longer boot time. The only other differences he or she might notice is a lower electricity bill, a longer-lasting Xbox console, and maybe the air outside is just a little bit less polluted. Where is there a problem to rail against here?\nBut the idea behind a manufactured culture war is to make good use of the echo chamber, which is exactly what happened next.\nBut again, whats the point of video games? Its for kids to be kids, Faila suggested in a\nTuesdayFox and Friendssegment\nabout Microsofts Xbox plans. Now you sit down and pick up a controller and theyre like by the way, the world is on fire, AHH. You know what I mean? You just want to play the game!\nAnd you can. That hasnt changed. The console doesnt tell you the world is on fire. The console doesnt open to a splash screen requiring you to donate to Black Lives Matter before you start your game. It just you know starts up and plays your game.\nSo please, whatever your political leanings, dont fall for this stuff. Cruz knows better, but hes trying to take advantage of you. Dont let him.\nFiled Under: energy, energy saving, power saving, ted cruz, woke,"
  },
  {
    "body": "Microsoft Corp. says its going to keep making new games in the popular Halo franchise at its prized 343 Industries studio  despite rumors to the contrary. But after a leadership overhaul, mass layoffs and a host of big changes, the outfit is all but starting from scratch. The Redmond, Washington-based 343 Industries released its latest game, Halo Infinite, in December 2021 to widespread critical acclaim. It was seen as a redemption story for a title that suffered multiple delays, endless development problems and a merry-go-round of creative leads. But in the months that followed, fans turned against the game, complaining about a thin road map and the slow rollout of features that had been expected on day one. At the same time, 343 was seemingly losing staff by the week and went through a major leadership change last fall that led some employees to brace for a reorganization. The ax fell in mid-January when Microsoft announced mass layoffs and 343 Industries was hit hard. While Microsoft declined to provide specific figures, at least 95 people at the company have lost their jobs, according to a spreadsheet of affected employees reviewed by Bloomberg. The list named dozens of veterans including top directors and contractors, upon which the studio heavily relies. Those temporary employees were given just a few days warning before their contracts came to an end, according to people familiar with the process, asking not to be identified because they werent authorized to speak publicly. The cuts led to rumors that 343 would farm out development of the Halo series to other game companies. Matt Booty, head of Microsofts Xbox Game Studios, said in an interview that 343 will continue as the internal developer for Halo and as the home of Halo. Internally, Booty has assured 343 staff that even as they work with outside partners and outsourcing houses, they will remain in charge. Questions remain, however, about the fate of the Halo franchise as the studio is hollowed out and makes big changes to how it develops games. Chief among them is a pivot to a new gaming engine, the suite of tools and technology used to make video games. The studios own engine, known publicly as Slipspace, has been one of the biggest points of contention over the past two decades. Based largely on old code from the 1990s and early 2000s, its buggy and difficult to use and has been the source of headaches for some developers on Halo Infinite, people familiar with the development said. Several multiplayer modes that are nearly finished, such as Extraction and Assault, both popular in previous Halo games, have yet to be released in part because of issues involving the engine, they said. At several points over the past decade, management at 343 debated switching to Epic Games Inc.s popular Unreal Engine. But it wasnt until late last year, when previous studio head Bonnie Ross and engine lead David Berger departed and Pierre Hintze took over, that the firm finally decided to pivot to Unreal. This switch will start with a new game code-named Tatanka, according to people familiar with the plans. That project, which 343 is developing alongside the Austin, Texas-based game studio Certain Affinity, started off as a battle royale but may evolve in different directions, the people said. Future games in the series will also explore using the Unreal Engine, which may make development easier, although internal skeptics are worried that the switch may have a negative impact on the way Halo games feel to play. A Microsoft spokesman declined to comment on issues with the engine or on the companys plans to pivot to Unreal. Since Halo Infinite was released, fans had assumed that in addition to new multiplayer modes, 343 was working on new content for the story. But that wasnt the case, according to the people familiar with the situation. Developers were making prototypes in the Unreal Engine and pitching ideas for new Halo games rather than working on new missions for Halo Infinite. Many of those developers were laid off this month and the company isnt actively working on new story content, the people said. A Microsoft spokesman declined to comment. In the eyes of some observers and former 343 employees, the reorganization was a long time coming. The studio, which was founded in 2007 to inherit Halo after Microsoft parted ways with original developer Bungie, has struggled through many challenges, including the release of several polarizing games. Patrick Wren, a former 343 designer, said on Twitter that the job cuts and the state of the Halo franchise overall are the result of incompetent leadership up top during Halo Infinites development that led to massive stress on those working hard to make Halo the best it can be. Microsoft once promised that Halo Infinite would be the start of the next ten years for Halo, but its recent moves point to a shorter-term vision. In an email to staff following the layoffs, Hintze wrote that the current plan for 343 is to support a robust live offering for Halo Infinite and its Forge level creator and greenlighting our new tech stack for future Halo games while also bringing Halo to more players through more platforms than ever before."
  },
  {
    "body": "Windows 11\nproduct page.\nThis means bad news for individuals hoping to get their last-minute shopping to build a Windows 10 PC. Fortunately, Windows 10 licenses will still be offered by third-party retailers, though the availability of the said product wouldnt forever be ample.\nOn the other hand, while the product will no longer be offered on the Microsoft website, Windows 10 users will still be able to use their OS, as the EOS date of Windows 10 PCs is in 2025.\nWindows 10 will remain supported with security updates that help protect your PC from viruses, spyware, and other malware until October 14, 2025, Microsoft\nassures\n.\nMicrosofts move to cut Windows 10 downloads on its sites came as it continuously pushes more users to embrace its newest OS, Windows 11. Currently, Windows 10 still has the biggest"
  },
  {
    "body": "Google's Sparrow faces a risky and expensive battle with ChatGPT and Microsoft for AI dominance .\r\nRead Full Story"
  },
  {
    "body": "Xbox\nMicrosoft is set to increase the price of its Xbox Series X and Series S consoles in Japan on February 17. While the hike announcement is currently limited to the country, it might be a hint that the same will happen to other western markets in the coming weeks. (via\nGematsu\n)\nThis hike will put the Xbox Series X price, which currently costs 54,978 yen, to 59,978 yen. That translates to $422 to $460, which means a $38 increase. Meanwhile, the Xbox Series S will increase from 32,278 yen to 37,978 yen or $248 to $292, an additional $44.\nMicrosoft Japan already informed the customers about the price increase of the said consoles.\nAfter carefully evaluating the market condition in Japan, we have decided to change the suggested retail price of Xbox consoles in the country, Microsoft Japan explained. We regularly evaluate the impact of local pricing to maintain reasonable consistency across regions. This price revision affects our customers and was a difficult decision to make, but going forward we will continue to provide the ultimate Xbox experience that our customers expect.\nThe news is no surprise since Xbox Lead Phil Spencer himself\nadmitted\nit in October, expressing the companys need to look at the return on our business, the cost of the business.\nWeve held price on consoles, and held price on games, and our subscription. I dont think well be able to do that forever. Spencer said at that time. I do think that at some point, well have to raise some prices on certain things, but going into this holiday, we thought it was really important to maintain the prices that we have because consumers, right now, are more uncertain than they have been in a long time.\nPrior to this, Microsoft had already\nconfirmed\nhigher prices on its first-party games, causing the titles like Forza Motorsport, Redfall, and Starfield to charge $69.99 instead of the usual $59.99.\nWeve held on price increases until after the holidays so families can enjoy the gift of gaming. Starting in 2023 our new, built for next-gen, full-priced games, including Forza Motorsport, Redfall, and Starfield, will launch at $69.99 USD on all platforms, said Microsoft, explaining the decision. This price reflects the content, scale, and technical complexity of these titles. As with all games developed by our teams at Xbox, they will also be available with Game Pass the same day they launch."
  },
  {
    "body": "survey\n, which shows 85% of workers want collaboration tools integrated with more automation capabilities.\nThe survey was conducted on 2,700 employees and 1,800 business decision makers (BDMs) in the United States, the United Kingdom, and Japan. The survey highlights respondents views regarding digital transformation, wherein 87% of employees said the need for it is more important now than ever before.\nAccording to the results, 89% of participants with access to automation and AI-powered tools feel more fulfilled because they can spend time on work that truly matters. In relation to that, 89% or 9 in 10 individuals said they wish they could apply AI solutions to even more tasks and activities.\nSpecifically, 9 in 10 or 85% of the respondents said they would want more automation capabilities in their collaboration tools, as 77% or 3 out of 4 respondents expressed their desire for low-code or no-code tools or platforms. As mentioned by Microsoft, the latter figure reflects the result of its 2022 Low-Code Trend Report, wherein 80% of respondents said low-code tools allowed them to be self-sufficient in addressing tasks instead of relying on developers.\nThe survey findings are clear: people want digital productivity tools that allow them to cut out the busywork so they can focus on the real tasks at hand, Microsoft concluded. They also want a say in how these tools are selected and implemented. Perhaps most of all, they want tools that are intuitive and easy to use, and that allow them to collaborate seamlessly and work efficientlywherever work happens to be.\nThe survey was released as the Redmond company continues to invest in AI technology. Last week, Microsoft\nconfirmed\nthe third phase of its multiyear, multibillion dollar investment in OpenAI, which should allow it to further benefit from the power of artificial intelligence to improve its products and services. Earlier this month, reports about the companys plan to integrate OpenAIs ChatGPT tech into"
  },
  {
    "body": "The item, which is six by eight millimeters in size, may have been caught in the tires of passing vehicles and taken off track to where teams are searching.\n2d ago\nMoneyWise\nEarly retirement is a dream for many  that can turn into a nightmare.\n10h ago\nWhy Phillips 66 Stock Is Slumping Today\nShares of Phillips 66 (NYSE: PSX) fell more than 5% by 12:30 p.m. ET on Tuesday.  Weighing on the refining company's stock price were its lackluster fourth-quarter results.  Adjusted pre-tax income from its chemicals segment declined from $135 million in the third quarter to $52 million in the fourth quarter.\n8h ago\nApple's (AAPL) first-quarter fiscal 2023 earnings are likely to have suffered from disruptions at its China partner Foxconn's factory in Zhengzhou, as well as the shrinking demand for iPhone.\n9h ago\nFortune\nRyan Olohan was told there were \"obviously too many white guys\" on his management team.\n1d ago\nSeeking at Least 7% Dividend Yield? Analysts Suggest 2 Dividend Stocks to Buy\nInflation made the headlines through most of last year, for all the worst reasons: it ran far too high, peaked above 9% in June, and the inflationary pressures pushed down hard on stock markets. The Fed jacked interest rates up their highest level in over a decade, risking recession to fight the rise in prices. Today, inflation is still in the headlines, although the tone has shifted. The annualized rate is trending downward; the December number came in at 6.5% year-over-year. While this is good\n1d ago\nThe iconic money manager with a penchant for aggressive growth aims to close out January with a bang.\n10h ago\nCostco Gets Ready to Raise its Membership Prices\nCostco  has a tremendously loyal customer base with an over 90% membership renewal rate worldwide and an even higher rate in the United States (92.5%) in its most recent quarter.  Currently, Costco charges $60 for a Gold Star membership and $120 for an Executive membership.  Executive members have been rising in importance for the company.\n1d ago\nMarketWatch\nAmazon.com Inc. is expected to reveal its first unprofitable year since 2014 this week  and expectations for the year aren't headed in a positive direction.\n6h ago\nMarketWatch\nIm paying my financial adviser 1%, but the only communications I get are  invoices. So I want to regain sole control of my accounts  without having to talk to him about it. Is this possible?\nQuestion: Eight years ago I hired a financial advisor because the rounds of layoffs at work were coming more regularly, and I wanted to know if my savings were enough for me to retire.  The financial advisor began managing some of my accounts for me for a fee of 1%.\n9h ago\nThe Federal Reserve is expected to slow its pace of interest rate increases for the second-straight meeting on Wednesday, raising its benchmark interest rate another 0.25%.\n12h ago\nGeelys Lotus Going Public via SPAC at $5.4 Billion Valuation\n(Bloomberg) -- Lotus Technology, the electric-car maker owned by Chinas Zhejiang Geely Holding Group Co., agreed to merge with a blank-check company in a transaction that values the combined entity at about $5.4 billion.Most Read from BloombergSony Slashes PlayStation VR2 Headset Output After Pre-Orders DisappointPutins War in Ukraine Pushes Ex-Soviet States Toward New AlliesBrexit Is Costing the UK 100 Billion a Year in Lost OutputMicrosoft Studio Behind Halo Faces a Reboot on Years of Turmo\n4h ago"
  },
  {
    "body": "Microsoft will be removing a bunch of beloved games from the Xbox 360 Marketplace on February 7th, according to a support page on the Xbox website (via Wario64), meaning you wont be able to buy them after that date.\n\nIts not all bad news. If youve already bought a game thats getting pulled, you can still download it after February 7th. Games being removed that are available on Xbox One and Xbox Series X / S stores will remain purchasable on those platforms.\n\nBut that does mean digital games only available on the Xbox 360 Marketplace will be unavailable for purchase in just a week. Users on Resetera have figured out which games fall into that category and will be going away for good, and the list includes some well-known titles like Jet Set Radio, Left 4 Dead and Left 4 Dead 2, Spelunky, and The Orange Box.\n\nThe games leaving the Xbox 360 Marketplace varies based on your region, and you can see which titles are being pulled by checking Microsofts site. Heres the full list for the US.\n\nWhen asked about the removals, Microsoft shared these statements from Xbox global product marketing manager Bree Adams with The Verge:\n\n> Beginning on February 7, 2023, a limited set of games, add-ons, and in-game content will no longer be purchasable in select markets via the Xbox 360 Store. These titles will no longer be purchasable on the Xbox 360 Store only, and titles that are available to be purchased on the Xbox One and Xbox Series X|S Stores will remain purchasable. You will still be able to play discs or previously downloaded games on your Xbox 360 and modern consoles if they are backwards compatible titles. For more information on the games impacted in your region, visithere.\n> Impacted Xbox 360 titles purchased before February 7, 2023 will be available to redownload via your previously purchased content through the Xbox 360 Download Historyhere.\n\nUnfortunately, losing the ability to purchase older digital video games is becoming something of a regular occurrence. Nintendo will be closing the eShop on Wii U and 3DS in less than two months. Microsoft has previously delisted several Forza titles. And in late 2021, Sony made it much harder to shop on the PS3 and Vita stores.\n\nWhile its disappointing that you dont have much time to make a choice about buying these disappearing Xbox 360 titles, at least we know when theyll be going away. So if youve been wavering on finally picking up The Orange Box on Xbox, make sure you get it before February 7th."
  },
  {
    "body": "What you need to know\nDates for Microsoft's annual Build developer conference have leaked ahead of announcement.\nViewing the page source of the Microsoft Build website reveals the dates May 23-25.\nLast year's Build conference was held on May 24-26 in Seattle and online.\nMicrosoft's annual Build conference for Windows, Azure, and Microsoft 365 developers is yet to receive an official event date, though the event itself has been confirmed to be taking place at some point this year. Now, a quick peek at the Microsoft Build website's page source has revealed the potential date.\n, the date \"May 23-25, 2023\" can be seen when checking the page source on the Microsoft Build website, giving us a solid reason to think that's the date Microsoft Build 2023 will be held.\nThe current live version of the\nMicrosoft Build website\n(opens in new tab)\nwas just recently updated to say the following: \"Thank you for your interest in Microsoft Build.We're getting ready to launch registration - check back soon!\" This just suggest that Microsoft is almost ready to announce dates for the event.\nOf course, the dates spotted in the page source could simply be a placeholder until Microsoft has an actual date locked in, but considering last year's Build conference took place on May 24-26, we think May 23-25 for Build 2023 is a likely candidate. This would have the event run from Tuesday to Thursday.\nIf you check the page source for https://t.co/vDigeHYISm Then MS Build 2023 will take place between May 23rd and 25th https://t.co/qftdq3kGba pic.twitter.com/RKY8aTiZix\nJanuary 31, 2023\nSee more\nIt's currently unclear if Build 2023 will be a hybrid digital and in-person event like last year, or if the company plans to return to an all-digital event for this year. In-person attendance was limited in 2022, with many opting to tune into the event digitally instead.\nMicrosoft Build is where Microsoft often announces new features for developers, including updates to the Windows App SDK, Microsoft 365, and more. Unfortunately, Microsoft rarely talks about new Windows features at Build these days, though that doesn't mean they couldn't start doing so now we know Windows 11 is being developed on a \"continuous innovation\" release schedule.\nWindows Central Newsletter"
  },
  {
    "body": "confirmed\nthat the latest edition of The Show will be coming to Xbox Game Pass upon release. This marks the third year in a row that MLB The Show has landed on Xbox Game Pass at launch, which clearly indicates that this is something Microsoft is looking to continue in perpetuity with the series.\nDespite still being a franchise that is developed and published within PlayStation Studios, Xbox has had the inside track on MLB The Show in recent years thanks to its availability on Game Pass. When MLB The Show first made the jump to Xbox platforms back in 2021, fans were shocked to see that Microsoft had scored a Game Pass deal for a PlayStation product. Now, this has largely become expected to see take place.\nAs for what MLB The Show 23 will have in store that's new this time around, well, we still don't really know. Gameplay footage from the title hasn't been shown off just yet. Instead, all that San Diego Studio has confirmed is that Miami Marlins outfielder Jazz Chisholm Jr. will be donning the box art this year and that the game itself will arrive on March 28th.\nRelated:"
  },
  {
    "body": "This day in search marketing history: February 1\nThis day in search marketing history: February 1\nBing accused  of copying Google's search results, plus: Microsoft tries to buy Yahoo, about this result, fake locksmith issues and more.\non February 1, 2023 at 12:30 am | Reading time: 10 minutes\nGoogle accuses Bing of copying its search results\nIn 2011, the headline Google: Bing Is Cheating, Copying Our Search Results appeared first on Search Engine Land.\nAs Danny Sullivan reported: Google has run a sting operation that it says proves Bing has been watching what people search for on Google, the sites they select from Googles results, then uses that information to improve Bings own search listings.\nThe story actually began in May 2010, when Google noticed that Bing was returning the same sites as Google when someone would enter unusual misspellings. By October 2010, the results for Google and Bing had a much greater overlap than in previous months.Ultimately, Google created a honeypot page to show up at the top of 100 synthetic searches (queries that few people, if anyone, would ever enter into Google).\nThis story got picked up by dozens of media outlets as both companies got into a public war of words and blog posts.\nGoogle called Bings search results a cheap imitation.\nMeanwhile, Bing called the sting operation a "
  },
  {
    "body": "(CC0)\nThe January patching window for your firm has probably come and gone. But has it? While January included a huge release of patches, several releases in other months have provided more than one headache for the patch management community. These are the patches and updates you need to evaluate if you havent already done so.\nBitLocker Security Feature Bypass Vulnerability\nIn January, additional information came out about CVE-2022-41099, the BitLocker Security Feature Bypass Vulnerability. If youve already deployed the November or later security updates to your network and have done nothing else, you arent done with the evaluation of this update.\nFirst, you need to determine your risk level. For this attack to be successful, the attacker needs physical access to your computer. There is much less risk for devices that have physical security and are locked or stored securely. If you have disabled the Windows Recovery Environment (WindRE) partition because you have alternative means to recover and reimage your devices, you are also not at risk. If you are somewhere in the middle youll need to determine if you need to take action.\nPatching is not enough. You must also apply the applicable Windows security update to your WinRE. Besides disabling the recovery partition, you could also use a GitHub script to update the WinRE for this vulnerability and ensure it is patched appropriately. Additional discussions describe the potential for additional attack sequences, but it appears at this point to be an attack sequence that leads us back to theoretical attacks rather than proven attack sequences as well as remembering the long-standing Immutable Law of Security #3: If a bad actor has unrestricted physical access to your computer, it's not your computer anymore.\nKerberos hardening updates\nMany administrators are still evaluating the impact of the November Kerberos hardening updates. Any patch installed on your domain controller that includes the November or later updates will have potential impact on your domain. To be proactive the following is recommended:\nFirst, determine if these updates will impact your domain. A PowerShell script is available to detect potential authentication issues that may occur in an Active Directory (AD) domain after installing these updates. As noted, Run the script in PowerShell with domain administrator privileges from a machine with AD RSAT tools installed, such as on a domain controller. The script will output any detected compatibility issues found in the domain related to changes made for CVE-2022-37966.\nAs noted in a Microsoft blog, the November updates caused issues with authentication, and Microsoft released an out-of-band update to fix the issue. Many patching administrators skipped over both the November and December updates waiting for issues to shake out.\nNext, if you cant remember the last time your organization changed the password to the Kerberos account (Krbtgt account), then you are long overdue to run this script to do so. There are various modes for the script, and its recommended to run it in this order:\nMode 1: Informational mode (no changes at all)\nMode 8: Create TEST KrbTgt accounts\nMode 2: Simulation mode (temporary canary object created, no password reset)\nMode 3: Simulation mode -- Use KrbTgt TEST/BOGUS accounts (password will be reset once)\nMode 4: Real reset mode -- Use KrbTgt PROD/REAL accounts (password will be reset once)\nMode 9: Cleanup TEST KrbTgt accounts (could be skipped to reuse accounts the next time)\nIts recommended to change the Krbtgt password twice, waiting 24 hours between each change before changing it the second time. This is also the recommended process if you have a compromised Active Directory. Its also recommended to reset all administrator and service account passwords twice.\nIf you only reset the password once:\nAfter first reset, the new KRBTGT password replicates to all the DCs in the domain.\nAll new tickets will use the new password (KRB1).\nOld tickets issued by old KRBTGT password (KRBOLD) should continue to work as password history is 2.\nPost old tickets expiry they should renew tickets with new KRBTGT password (KRB1).\nPresent KRBTGT passwords will be KRB1 and KRBOLD.\nWhen you reset the password twice, wait for 24 hours to pass:\nAfter second reset new KRBTGT password replicates to all the DCs in the domain.\nAll new tickets will use the new password (KRB2).\nOld tickets issued by old KRBTGT password (KRB1) should continue to work as password history is 2.\nPresent KRBTGT passwords will be KRB1 and KRB2.\nPost old tickets expiry they should renew tickets with new KRBTGT password (KRB2).\nOld KRBTGT password (KTB old) not valid anymore as password history is of 2.\nThese Kerberos updates are only in audit mode now and will be enforced later. The December 13 updates have added auditing events. If you are not seeing any such events in your event logs, you should be able to implement the hardening mode in advance by setting the KrbtgtFullPacSignature registry setting or waiting for the enforcement phases. As Microsoft notes, in July 2023 the default setting will be enforced.\nYou want to look for events now before the new settings are enforced. To do so, open the system event log and filter as follows:\nSusan Bradley\nWhile not enforced at this time, the impact on legacy systems should be investigated. You may need to have your team open support cases to discuss the impact and options with Microsoft. After this patch is enforced, all legacy operating systems will fail to authenticate via Kerberos.\nThe impact of these two patching-related issues is not immediate. You have time for your team to investigate. Dont wait too long or expect Microsoft to roll back the impact on these two patches. Both are certain to create more work for your BitLocker and AD teams.\nNext read this"
  },
  {
    "body": "Report: Microsoft Bings ChatGPT feature to be faster and richer with GPT-4\nReport: Microsoft Bings ChatGPT feature to be faster and richer with GPT-4\nAs reported earlier, we are now learning more about Microsoft's plans to incorporate ChatGPT into Bing Search.\nBarry Schwartz\non February 1, 2023 at 4:19 pm | Reading time: 3 minutes\nAs reported earlier, we are now learning more about Microsofts plans to incorporate ChatGPT into Bing Search. Reed Albergotti said that it is not just ChatGPT from OpenAI that is being added to Bing Search but a faster and richer version named GPT-4.\nThe report. The report says, The most interesting improvement in the latest version described by sources is GPT-4s speed. Right now, it can take a while  sometimes minutes in my experience  for ChatGPT to answer.\nCurrently, ChatGPT, which runs off GPT-3.5, feels slow and can take minutes to output the result. The replies generated through GPT-4 reportedly sound more human and are more detailed, the report says.\nGPT-4. GPT-4, which stands for Generative Pre-trained Transformer 4, is a neural network created by OpenAI. It is the next version of GPT-3.5, which is currently used by ChatGPT.\nAs a reminder, OpenAI introduced ChatGPT in November 2022. It is built on OpenAIs GPT-3.5 family of large language models, and is fine-tuned with both supervised and reinforcement learning techniques.\nChatGPT uses content across the web from before 2021 to teach itself how to answer questions, but when it comes to recent and trending topics, it has difficulty. You can learn more about how it technically works in"
  },
  {
    "body": "A smart push into artificial intelligence (AI) was benefiting Microsoft\n(\n1.99%\n)\nand its shareholders on Wednesday. A business the tech company has placed a bet on announced a move aimed at capitalizing on its famous innovation, and investors were guardedly optimistic about that development.\nSo what\nArguably the most high-profile AI application on the scene today, ChatGPT is going commercial. OpenAI, the platform's developer, announced on its official blog that it's launching a pilot subscription plan called ChatGPT plus. Users who pay $20 per month will receive general and unfettered access to ChatGPT, even at peak times. OpenAI also promises faster response times and priority access to new features and upgrades in the system.\nChatGPT plus is now open for customers located in the U.S. OpenAI added that it will start inviting individuals on the service's waitlist in the coming weeks. It didn't get more specific about timing.\n\"We love our free users and will continue to offer free access to ChatGPT,\" it added. \"By offering this subscription pricing, we will be able to help support free access availability to as many people as possible.\"\nNow what\nAll this directly affects Microsoft, even if it hasn't yet had a significant impact. The tech giant is a key investor in OpenAI, having provided three rounds of investment into its business. The company has been coy about how much it's spent and whether this gives it an ownership stake of any meaningful size.\nRegardless, it's clear that AI is one of Microsoft's many ambitions. By being directly invested in OpenAI, it's backing a prize horse in the race."
  },
  {
    "body": "Microsoft Is Making Massive Investments in AI and ChatGPT, and Shares Could Be Really Cheap for Long-Term Buyers\nBy\nJose Najarro, Nicholas Rossolillo, and Billy Duberstein\nFeb 1, 2023 at 10:00AM\nYoure reading a free article with opinions that may differ from The Motley Fools Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more."
  },
  {
    "body": ""
  }
]