{
  "_type": "news",
  "didUMean": "",
  "totalCount": 156,
  "relatedSearch": [],
  "value": [
    {
      "id": "1216791026307155613",
      "title": "5 best cases that can fit an Nvidia GeForce RTX 4090 FE",
      "url": "https://www.sportskeeda.com/gaming-tech/5-best-cases-can-fit-nvidia-geforce-rtx-4090-fe",
      "description": "The global leader Nvidia launched its latest and greatest graphics card, the RTX 4090, in late 2022. The GeForce RTX 4090 is a beast that can run almost anything on a PC.",
      "body": "The global leader Nvidia launched its latest and greatest graphics card, the RTX 4090, in late 2022. The GeForce RTX 4090 is a beast that can run almost anything on a PC. However, with its powerful performance comes its huge size.If you already have the 4090 or you're planning to purchase it, you'll most likely need a different case to fit it. Most traditional cases are not big enough to fit the RTX 4090. Overall, a good case ensures better cable management, ventilation, and, most importantly, a good-looking setup.Disclaimer: This article is based on the writer's opinion and contains affiliate links for the products mentioned.Ranking cases from Thermaltake, Corsair, and more for Nvidia RTX 40901) Corsair obsidian 1000D ($499) (Best option)The Corsair 1000D features a unique dual-system layout, which allows you to build two systems in one case. This can be very useful for streamers and content creators who must run multiple workstations simultaneously. The case also comes with a built-in power supply cover, which keeps your power supply and cables hidden, providing a clean and organized lookThere is room for 18 fans and radiators up to 480 millimeters inside this case. Also, there is no need to worry about installing radiators, thanks to the sliding trays. This case also allows you to install a complete EATX motherboard, including a mounting tray for the GPU. Additionally, it supports water cooling as well, making it an excellent choice for those looking for a high-end gaming PC case that can handle the RTX 4090.2) Torrent case from Fractal ($220) (Better Airflow)For a giant like the Nvidia RTX 4090, a big case is not enough. Apart from the vast size, it is also important that the GPU gets proper ventilation inside the case. Keeping that in mind, the Torrent case from Fractal might be the most suitable option. It has two 180mm pre-installed fans on the front and three 140mm fans at the bottom to ensure maximum airflow throughout the system.Both sides, top and front, are removable, and it also has support for radiators of up to 420mm, which makes it perfect for liquid cooling builds. With all these features, the Fractal Torrent case is a great choice for those looking for a high-quality, stylish, and versatile case for the RTX 4090.Buy from Amazon.3) Lian Li - O11 Dynamic EVO ($299) (More Flexibility)If you want a more flexible PC case to fit in your brand new Nvidia RTX 4090 GPU, you can go for the Lian Li - O11 Dynamic EVO. This mid-tower case is fully reversible and has plenty of different ways to place the GPU inside. Horizontally, it can fit up to 422mm GPUs, which is plenty enough space for the RTX 4090.Additionally, this case also comes with a verticle kit or mount if you want to adjust the GPU in a different manner. On top of that, it supports three radiators of up to 360mm and a total of 10 fans. The removable I/O panel can also be placed in several sizes for easy accessibility.You can find it on Amazon.4) Thermaltake Core P8 ($289) (Affordable alternative to Obsidian 1000D)Another great option for the Nvidia RTX 4090 is the Thermaltake Core P8, which is 660mm in height, 260mm in width, and 626mm in depth. On the outside, it has fully removable 4mm thick glass windows, and on the inside, it supports 17 fans. You can also fit CPU coolers up to 180mm and EATX motherboards easily.You'll also get all the necessary ports on the front I/O panel for external connectivity, such as Type-C, USB 3.0, and USB 2.0. This could be the best alternative option for the Corsair Obsidian 1000D case, making it a perfect fit for the Nvidia RTX 4090.Make sure to check it out on Amazon.5) Cosmos C700M ($779) (Premium case)The last one on the list is Cosmos C700M by Coolermaster. This might be the most premium and sleekest case on the list for your new Nvidia RTX 4090. Motherboards with eight expansion slots are compatible, including Mini ITX, Micro ATX, and EATX.Also, at the top, there is an I/O panel for all the necessary ports, including fan control and ARGB control button. Lastly, you can fit radiators of up to 420mm for effective cooling. If you want the most premium style and a cool case for your RTX 4090 setup, then you should go with this.Check it out on Amazon.The Nvidia GeForce RTX 4090 FE is a powerful graphics card that requires a spacious and well-ventilated case to ensure optimal performance. The above-mentioned cases are all great choices that can accommodate the 4090 FE and provide solid cooling and next-gen design.",
      "snippet": "The global leader <b>Nvidia</b> launched its latest and greatest graphics card, the RTX 4090, in late 2022. The GeForce RTX 4090 is a beast that can run ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-29T03:58:00",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticg.sportskeeda.com/editor/2023/01/fa71c-16748979649782-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/gaming-tech/5-best-cases-can-fit-nvidia-geforce-rtx-4090-fe"
      }
    },
    {
      "id": "1296780555502306865",
      "title": "Nasdaq Bear Market: 1 Surefire Growth Stock to Buy Before It Starts Soaring",
      "url": "http://fool.com/investing/2023/01/29/nasdaq-bear-market-1-surefire-growth-stock-to-buy/",
      "description": "This industry-leading company has been caught up in the bear market carnage, but it's setting the stage for a massive rebound.",
      "body": "$203.65\nPrice as of January 27, 2023, 4:00 p.m. ET\nYoure reading a free article with opinions that may differ from The Motley Fools Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more.\nLearn More\nThis industry-leading company has been caught up in the bear market carnage, but it's setting the stage for a massive rebound.\nWhen investors look back on 2022, the prevailing attitude will likely be, \"Good riddance!\" Over the past year, each of the major U.S. stock market indexes suffered at the claws of the bear market. The worst performer by a country mile was the Nasdaq Composite, which is still down 29% from its peak in late 2021.\nSeasoned investors will note that corrections and bear markets are all part of the price of admission when investing. Keeping your head while others lose theirs is simple, but it isn't for the faint of heart. The good news is this: For investors with the resources and fortitude to weather the storm, market plunges offer the best opportunity to buy quality companies at a discount. History also shows that every previous sell-off has paved the way for an upcoming bull market.\nOne bear market bargain that's staring investors right in the face is semiconductor pioneer Nvidia\n(\n2.84%\n)\n. Looking at the big picture, it should become clear that investors should be buying this stock before it starts to soar.\nImage source: Getty Images.\nThe elephant in the room\nGiven the events of the past year, it's understandable that fair-weather investors have run for cover. In its fiscal 2023 third quarter (ended Oct. 30, 2022), Nvidia's revenue declined 17% year over year to $5.9 billion. Even more concerning was the profit picture, as earnings per share (EPS) crashed 72% to $0.27.\nLeading the decline was evaporating demand for Nvidia's graphics procession units (GPUs), which are the top choice among gamers. Gaming revenue tumbled 51% year over year as the combination of soaring inflation and rising interest rates weighed on discretionary spending. The rising cost of gas and groceries has taken precedence, putting the upgrade to the latest gaming chip on the back burner.\nIf the macroeconomic cloud had a silver lining, however, it was Nvidia's data center segment. Revenue rose 31% year over year, driven by robust demand from data centers and cloud computing operations.\nSome investors, fearing the worst, headed for the exits, sending Nvidia stock plunging more than 42% from its late-2021 high.\nHowever, staring too closely at the recent results tends to blur the big picture.\nAn important history lesson\nWhile past performance is no guarantee of future results, it can be informative. As recently as its 2023 fiscal first quarter (which ended May 1, 2022) Nvidia was putting up new milestones. The company reported record quarterly revenue that grew 46% year over year to $8.29 billion, while adjusted EPS grew 49% to $1.36.\nThe robust results came on the heels of the company's record fourth quarter and record fiscal 2022, as sales grew 61% to $26.9 billion, resulting in record EPS that grew 123% to $3.85 -- so the results were no anomaly.\nNvidia remains the undisputed leader in the discrete desktop GPU market, with a dominant 88% share in the third quarter, leaving crumbs for its rivals. This shows that Nvidia processors remain the industry standard.\nWhen taken as a whole, the data clearly illustrates that Nvidia is being buffeted by the prevailing macroeconomic headwinds -- not from any failure involving the business. When the rebound begins, which it inevitably will, Nvidia's growth will return to its former glory, led by pent-up demand for its high-end gaming processors.\nImportant data\nEven in the face of the economic downturn, the secular tailwind driving the adoption of cloud computing continues. Nvidia is the partner of choice for all the major cloud providers. Alphabet's Google Cloud, Amazon Web Services, and Microsoft Azure all rely on Nvidia's processors and accelerators, as does Alibaba Cloud, Baidu Cloud, and Tencent Cloud.\nThe need to speed data through the ether will only increase from here. Data centers experienced record adoption in 2021, spurring unprecedented growth last year. The need is so great, in fact, that half of the data centers being built are fully leased before construction is even completed. Furthermore, demand for data center capacity more than tripled year over year during the first half of 2022, led by many of the hyperscale operators listed above.\nThis suggests the table is set for a stunning recovery for Nvidia once the economy recovers.\nLet's talk about price\nThere's an old saying, \"You get what you pay for,\" and Nvidia has never been cheap in terms of traditional valuation metrics.\nThe stock is currently selling for 17 times sales when most experts agree a reasonable price-to-sales ratio is between 1 and 2. That's not to say that Nvidia stock couldn't fall further from here, but calling the bottom is virtually impossible.\nFurthermore, given the company's history of above-average growth and robust future prospects, Nvidia stock is worth every penny.\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet, Amazon.com, Baidu, Microsoft, Nvidia, and Tencent. The Motley Fool has positions in and recommends Alphabet, Amazon.com, Baidu, Microsoft, Nvidia, and Tencent. The Motley Fool has a disclosure policy.\nStocks Mentioned",
      "snippet": "... bargain that's staring investors right in the face is semiconductor pioneer <b>Nvidia</b> ( 2.84% ) . Looking at the big picture, it should become clear ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-29T00:00:00",
      "provider": {
        "name": "fool",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://g.foolcdn.com/editorial/images/717841/two-colleagues-conferring-in-a-server-room.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fool",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://fool.com/investing/2023/01/29/nasdaq-bear-market-1-surefire-growth-stock-to-buy/"
      }
    },
    {
      "id": "963034260704049111",
      "title": "Nvidia RTX 4090 Ti pictured with unique quad-slot design: Features, leaked specs, power draw, and more",
      "url": "https://www.sportskeeda.com/gaming-tech/news-nvidia-rtx-4090-ti-pictured-unique-quad-slot-design-features-leaked-specs-power-draw",
      "description": "More details on the Nvidia GeForce RTX 4090 Ti have surfaced as reputed industry insider and Twitter user MEGAsizeGPU has leaked a photo of the upcoming graphics card.",
      "body": "More details on the Nvidia GeForce RTX 4090 Ti have surfaced as reputed industry insider and Twitter user MEGAsizeGPU has leaked a photo of the upcoming graphics card. Among the many changes to the GTX 4090 Ti are a quad-slot design and a stacked video output port layout, unlike what gamers are used to these days.Twitter leaker kopite7kimi has added further insight into these leaks by confirming that the GPU will indeed be launched with this peculiar design. Moreover, he has confirmed the details of the card's specs.kopite7kimi@kopite7kimiThat's why I told you that the rendered picture of TITAN from MLID is totally fake. This is not a simple enlargement of RTX 4090. Please pay attention to its IO part. twitter.com/VideoCardz/staVideoCardz.com@VideoCardzNVIDIAs quad-slot GeForce RTX 4090Ti/TITAN 800W graphics card has been pictured videocardz.com/newz/nvidias-q896NVIDIAs quad-slot GeForce RTX 4090Ti/TITAN 800W graphics card has been pictured videocardz.com/newz/nvidias-qThat's why I told you that the rendered picture of TITAN from MLID is totally fake. This is not a simple enlargement of RTX 4090. Please pay attention to its IO part. twitter.com/VideoCardz/staWe are yet to get an official release date for the video card. However, the rumors look quite promising. Thus, it is unlikely that Nvidia will completely ditch the project, as was revealed a couple of months ago.More details on the design language and specs of the upcoming RTX 4090 TiThe redesigned rear panel of the upcoming RTX 4090 Ti (Image via MEGAsizeGPU/Twitter)The upcoming 4090 Ti will come with major design overhauls over the current one. According to the leaked picture, the card will occupy four slots in a gaming rig, making it larger than the RTX 4090 FE and most add-in card designs of GPU.The GPU will come with a vertical PCB, a practice that has not been employed by graphics card manufacturers in quite some time.The leaked photo reveals that the 4090 Ti will come with four display output ports like the currently available RTX 40 series graphics cards. The list includes an HDMI and three DisplayPorts. Whether Nvidia will upgrade the DP standard to 2.0 from the 1.4a available in the RTX 4090 is unknown.The backplate of the 4090 Ti (Image via MEGAsizeGPU/Twitter)The leaker also showcased the barebones design of the backplate attached by Torx screws to the body of the GPU.The heatsink of the RTX 4090 Ti FE (Image via Chiphell)Leaker Chiphell gave us a closer look at the heatsink design of the upcoming RTX 4090 Ti. The card looks like an absolute behemoth.Specs of the RTX 4090 Ti GPU@harukaze5719@kopite7kimi for referencePG137 / MLID render / Ada A6000 / RTX 4090 FE312@kopite7kimi for referencePG137 / MLID render / Ada A6000 / RTX 4090 FE https://t.co/UGXyvvPfJsBased on previously leaked specs of the 4090 Ti, \"The Beast\" will be based on an improved AD102 GPU that the 4090 uses. The card will pack 18,176 CUDA cores, 11% more than the current flagship.In addition, it will use a faster 24 Gbps GDDR6X memory. However, the fun fact is that the memory size will be bumped to 48 GB, which seems to be a bold claim.Kopite7kimi also claims that the upcoming GPU will pack a power draw of 800 W. However, provided that the 4090 draws 450 W under peak load, it is unlikely that the refreshed GPU will pack such a high power draw rating.",
      "snippet": "More details on the <b>Nvidia</b> GeForce RTX 4090 Ti have surfaced as reputed industry insider and Twitter user MEGAsizeGPU has leaked a photo of the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T20:13:17",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticg.sportskeeda.com/editor/2023/01/d819e-16749332125176-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/gaming-tech/news-nvidia-rtx-4090-ti-pictured-unique-quad-slot-design-features-leaked-specs-power-draw"
      }
    },
    {
      "id": "7073702228597678460",
      "title": "CV Advisors LLC Cuts Position in NVIDIA Co. (NASDAQ:NVDA)",
      "url": "https://www.themarketsdaily.com/2023/01/28/cv-advisors-llc-cuts-position-in-nvidia-co-nasdaqnvda.html",
      "description": "Read CV Advisors LLC Cuts Position in NVIDIA Co. (NASDAQ:NVDA) at Markets Daily",
      "body": "alerts:\nInsider Buying and Selling\nIn related news, Director Mark A. Stevens sold 120,000 shares of NVIDIA stock in a transaction dated Monday, January 9th. The stock was sold at an average price of $158.84, for a total value of $19,060,800.00. Following the sale, the director now directly owns 1,325,888 shares in the company, valued at approximately $210,604,049.92. The transaction was disclosed in a legal filing with the SEC, which is available at this link. In other news, Director Mark A. Stevens sold 120,000 shares of the businesss stock in a transaction that occurred on Monday, January 9th. The stock was sold at an average price of $158.84, for a total transaction of $19,060,800.00. Following the transaction, the director now directly owns 1,325,888 shares in the company, valued at approximately $210,604,049.92. The sale was disclosed in a legal filing with the SEC, which is available at the SEC website. Also, insider Donald F. Robertson, Jr. sold 2,494 shares of the businesss stock in a transaction that occurred on Thursday, December 15th. The stock was sold at an average price of $167.89, for a total value of $418,717.66. Following the transaction, the insider now owns 56,617 shares in the company, valued at $9,505,428.13. The disclosure for this sale can be found here. In the last three months, insiders have sold 262,060 shares of company stock worth $43,817,257. Insiders own  4.04% of the companys stock.\nAnalysts Set New Price Targets\nSeveral analysts have issued reports on the company. Raymond James dropped their target price on NVIDIA from $210.00 to $190.00 and set a strong-buy rating on the stock in a research report on Thursday, November 17th. Morgan Stanley dropped their target price on NVIDIA from $182.00 to $175.00 and set an equal weight rating on the stock in a research report on Thursday, November 17th. Wedbush increased their target price on NVIDIA from $160.00 to $175.00 and gave the company a neutral rating in a research report on Thursday, November 17th. Cowen raised their price objective on NVIDIA from $200.00 to $220.00 in a research report on Monday, December 12th. Finally, HSBC began coverage on NVIDIA in a research report on Thursday, December 15th. They issued a reduce rating and a $136.00 price objective for the company. Two investment analysts have rated the stock with a sell rating, nine have issued  a hold rating, twenty-three have assigned  a buy rating and one  has given a strong buy rating to the companys stock. According to MarketBeat.com, the stock presently has a consensus rating of Moderate Buy and a consensus target price of $209.23.\nNVIDIA Price Performance\nShares of NVIDIA stock traded up $5.63 on Friday, hitting $203.65. The companys stock had a trading volume of 54,214,198 shares, compared to its average volume of 41,183,388. The company has a debt-to-equity ratio of 0.45, a quick ratio of 2.74 and a current ratio of 3.39. NVIDIA Co. has a 1 year low of $108.13 and a 1 year high of $289.46. The firm has a fifty day moving average price of $163.61 and a 200-day moving average price of $154.35. The company has a market capitalization of $507.09 billion, a price-to-earnings ratio of 86.66, a price-to-earnings-growth ratio of 7.52 and a beta of 1.77.\nNVIDIA (",
      "snippet": "Read CV Advisors LLC Cuts Position in <b>NVIDIA</b> Co. (NASDAQ:NVDA) at Markets Daily. Insider Buying and Selling In related news, Director Mark A.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T18:30:41",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/nvidia-co-logo.jpg?v=20221020142916&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/01/28/cv-advisors-llc-cuts-position-in-nvidia-co-nasdaqnvda.html"
      }
    },
    {
      "id": "8995533641827114807",
      "title": "Xbox has serious cloud competition from NVIDIA's recent GeForce Now upgrades",
      "url": "https://www.windowscentral.com/gaming/xbox/xbox-has-serious-cloud-competition-from-nvidias-recent-geforce-now-upgrades",
      "description": "Xbox Cloud Gaming was always my choice for lag-free streams, but NVIDIA's SuperPOD servers bring RTX 4080 GPUs to challenge my subscription to Microsoft.",
      "body": "My low-latency cloud gaming dream came true, but who do I choose?\n(opens in new tab)\n(opens in new tab)\n(Image credit: Ben Wilson | Windows Central)\nIt's the year of cloud gaming. At least, that's how it feels when you notice how many companies are giving this unique platform serious attention despite Google spectacularly fumbling the bag on Stadia. It's an exciting prospect that spent a long time in obscurity, restricting its infant years to a niche crowd mainly because the most common Internet speeds across the USA and Europe were not up to the task.\nRather than waiting for the infrastructure to catch up with the first revisions of streaming, some vendors have taken significant steps to improve the technology both on the server and client side. The patience of your average gamer is short enough that any hint of severe input delay immediately banishes cloud gaming to the realms of turn-based strategy and casual titles.\nStill, advancements made by NVIDIA in recent years have improved the state of cloud gaming to an astounding level. They offered side-by-side comparisons of its GeForce Now platform against real hardware at CES 2023, reaching mostly indistinguishable levels.\nMicrosoft had similar breakthroughs, and Xbox Game Pass has been my go-to option for a quick game without fear of controller latency, but it might be time to switch to the other team green.\nMicrosoft's faster-than-light cloud\nXbox Cloud Gaming on PC\n(Image credit: Ben Wilson | Windows Central)\nMicrosoft has consistently impressed me with its Xbox Cloud Gaming service since it officially opened the beta in 2019, and it's technically still not out of the testing stages. It's been a buttery smooth experience for the past year, and I'll occasionally go back to games I tried at the inception of xCloud to see if they perform better. Even with my mediocre ISP connection barely supplying me with 125Mb/s downstream, I at least manage a low ping, and I've beaten full Xbox games from my phone while in bed.\nA good 4G connection has even seen me through 30-minute gameplay sessions of Forza Horizon 5 as I waited for trains, never exhibiting enough input lag to affect my (already terrible) driving skills.\nBetween the Xbox app on my desktop PC and playing via Microsoft Edge on mobile devices, there was a period where I barely sat in front of my actual Xbox Series S to play games. I'd become too comfortable staying on the couch in the living room, playing through bursts of whatever had just been added to the Game Pass library.\nThat's where Xbox Cloud Gaming shines: a combination of low input latency and clear video quality with a vast library of AAA games, some available on release day. It's like having access to an instant demo disc for new games, something I miss from my younger days. Spending $70 on a new game I might get bored of after a week just isn't happening, so Microsoft is offering tremendous value for me with Game Pass Ultimate and, so far, the best cloud gaming experience.\nSupercharging NVIDIA's RTX cloud\nNVIDIA GeForce NOW\n(Image credit: Ben Wilson | Windows Central)\nNVIDIA's cloud gaming efforts feel like they've almost always been around, advertised each time I install graphics card drivers or casually mentioned in the background. GeForce Now hasn't suffered from poor reviews, more that it's been outshined by Xbox Cloud Gaming and its gigantic, ever-expanding library. I expected the same issue to remain when I logged in to try out the new NVIDIA SuperPOD servers running RTX 4080 GPUs, but the variety has dramatically improved.\nThe game selection on GeForce Now relates to digital titles you already own, lacking support for only a few popular AAA titles. A prompt appeared upon my recent login, asking me to sync my Steam, Epic Games, and Ubisoft Connect accounts. Now I have at least 75 games carried over, all displayed neatly in one unified library, ready to play at a moment's notice. Some games in my backlog are such storage hogs that they've been previously doomed to stay there forever.\nIt's somewhat of a surreal experience to launch a Steam game within GeForce Now, as you're treated to what essentially works as a virtual desktop. You see an instance of the Steam desktop app with only a single game installed, and everything boots as it should, cloud saves and all.\nNaturally, this PC-centric library has less in common with Xbox Cloud Gaming. Nevertheless, I suddenly have access to my multi-platform games in their superior form, played on a remote RTX 4080 GPU with settings ramped up to ultra presets.\nDeus Ex: Mankind Divided\n(Image credit: Ben Wilson | Windows Central)\nEven more bizarre is playing a game with a mouse and keyboard on GeForce Now, and it's the only time I genuinely notice any latency. To be fair to NVIDIA, the only currently available European server is based in Frankfurt, Germany. Since I'm based towards the northern end of the United Kingdom, it's reasonable to expect minor input lag since the data is literally being sent across the ocean.\nI can honestly say that it's still playable; spending at least a couple of hours on Deus Ex: Mankind Divided before deciding to switch to my Xbox controller, and suddenly the input feels completely fine. It's similar to playing a console through a mid-range USB capture card, where you might notice a small amount of latency, roughly around the 60-100ms mark, but switching to a controller felt more natural.\nSo now, Xbox Cloud Gaming is competing against a remote-controlled PC running most of its games at maximum settings, and the input feels identical. NVIDIA has its Reflex technology, reducing latency on both sides of the cloud and finally matching the ultra-responsive feeling delivered by Microsoft, and I'm feeling torn.\nThere are more games to test on GeForce Now, and I want to install it on more devices before I really commit to a final verdict. Nevertheless, my first impressions of the NVIDIA SuperPOD server upgrades were pretty spectacular. If they can offer consumers the chance to enjoy all the visual enhancements of an RTX 4080 GPU without actually forking out the cash to buy their own, NVIDIA might win me over for good.\nSkipping RTX, find me in the cloud\nMetro Exodus\n(Image credit: Ben Wilson | Windows Central)\nNo matter what kind of enticing technology is announced yearly, I'll always be frugal. It takes a lot for me to part with my hard-earned cash, even when my inner child constantly wants to buy the latest cutting-edge components and play video games all day. It's part of why a\nmid-range underdog is my dream desktop PC build for 2023\n; I'm simply not willing to part ways with the money for a high-end RTX GPU from NVIDIA just to bottleneck the rest of my custom rig.\nMicrosoft sold me on Xbox Cloud Gaming but coming up against PC versions at maximum settings is a tough fight.\nNow I don't have to. This little tease of the cloud-based RTX 4080 SuperPOD servers has left me wondering if we'll eventually opt for streaming games as the first option rather than spending hours downloading giganti",
      "snippet": "Still, advancements made by <b>NVIDIA</b> in recent years have improved the state of cloud gaming to an astounding level. They offered side-by-side ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T18:00:53",
      "provider": {
        "name": "windowscentral",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/QuSoMGqDJSizkSnAsXu6Ug.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "windowscentral",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.windowscentral.com/gaming/xbox/xbox-has-serious-cloud-competition-from-nvidias-recent-geforce-now-upgrades"
      }
    },
    {
      "id": "3573180916276581595",
      "title": "NVIDIA Quad-Slot GeForce RTX 4090Ti / TITAN 800W Graphics Card Pictured",
      "url": "https://www.southsudannewsagency.org/nvidia-quad-slot-geforce-rtx-4090ti-titan-800w-graphics-card-pictured/",
      "description": "NVIDIA's quad-slot RTX 40 800W GPU is picturedHardware leakage MEGAsizeGPU It revealed the upcoming NVIDIA RTX 40 GPU design.NVIDIA RTX 4090Ti / TITAN",
      "body": "NVIDIAs quad-slot RTX 40 800W GPU is pictured\nHardware leakage MEGAsizeGPU It revealed the upcoming NVIDIA RTX 40 GPU design.\nNVIDIA RTX 4090Ti / TITAN 4-slot cooler, Source: MegaSizeGPU\nThe rumored RTX 4090Ti/TITAN will feature a four-slot design and the I/O bracket will have stacked display connectors.  This unusual design would confirm that NVIDIA has or has plans to place the PCB vertically.\nThe leaker claims that the card is RTX 4090 Ti / TITAN, so the final name of this graphics card has not been confirmed.  However, we can see that the PCB board number is PG137.  This board number was previously mentioned for a so-called Beast GPU with a maximum TDP of 800W.\nthe monster\nJuly 25, 2022\nMoreover, the new image clearly shows a golden cooler design, which is usually used by the NVIDIA TITAN series.  The card will use an exceptional design with two stacked display connectors (one HDMI port and three DisplayPort ports), which is in line with previous rumors and leaked imaging.  NVIDIAs flagship RTX 40 Ada GPU features a vertical PCB design as shown below:\nNVIDIA RTX 4090Ti / TITAN 4-slot cooler, Source: Chiphell / MegaSizeGPU\nAccording to the latest rumors, the TITAN ADA graphics card could have up to 18,176 CUDA cores and possibly up to 48GB of memory.  In fact, this may be the first NVIDIA card to launch with 24Gbps GDDR6X modules.\nThe 800W TDP being mentioned is the boards maximum power, which is not comparable to the RTX 4090s 450W TDP, but rather its 600W maximum power.",
      "snippet": "... 800W GPU is pictured Hardware leakage MEGAsizeGPU It revealed the upcoming <b>NVIDIA</b> RTX 40 GPU design. <b>NVIDIA</b> RTX 4090Ti / TITAN 4-slot cooler, Source: ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T17:51:31",
      "provider": {
        "name": "southsudannewsagency",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.videocardz.com/1/2023/01/NVIDIA-TITAN-RTX-4090TI-HERO-3.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "southsudannewsagency",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.southsudannewsagency.org/nvidia-quad-slot-geforce-rtx-4090ti-titan-800w-graphics-card-pictured/"
      }
    },
    {
      "id": "3370751673198855562",
      "title": "NVIDIA Co. (NASDAQ:NVDA) Stake Trimmed by Flputnam Investment Management Co.",
      "url": "https://www.wkrb13.com/2023/01/28/nvidia-co-nasdaqnvda-stake-trimmed-by-flputnam-investment-management-co.html",
      "description": "Read NVIDIA Co. (NASDAQ:NVDA) Stake Trimmed by Flputnam Investment Management Co. at WKRB News",
      "body": "alerts:\nAnalyst Ratings Changes\nSeveral equities research analysts recently commented on the company. Summit Insights raised NVIDIA from a hold rating to a buy rating in a research note on Wednesday, November 16th. Deutsche Bank Aktiengesellschaft boosted their target price on NVIDIA from $150.00 to $170.00 in a report on Wednesday, December 14th. Wedbush boosted their target price on NVIDIA from $160.00 to $175.00 and gave the stock a neutral rating in a report on Thursday, November 17th. Raymond James cut their price target on NVIDIA from $210.00 to $190.00 and set a strong-buy rating for the company in a report on Thursday, November 17th. Finally, Needham & Company LLC upped their price target on NVIDIA from $200.00 to $230.00 and gave the stock a buy rating in a report on Monday, December 19th. Two analysts have rated the stock with a sell rating, nine have issued  a hold rating, twenty-three have assigned  a buy rating and one  has given a strong buy rating to the stock. According to MarketBeat, the stock  has an average rating of Moderate Buy and a consensus target price of $209.23.\nInsider Activity at NVIDIA\nIn related news, CFO Colette Kress sold 10,741 shares of the businesss stock in a transaction that occurred on Thursday, January 26th. The shares were sold at an average price of $200.00, for a total transaction of $2,148,200.00. Following the completion of the transaction, the chief financial officer now owns 536,960 shares in the company, valued at $107,392,000. The sale was disclosed in a filing with the SEC, which can be accessed through the SEC website. In related news, CFO Colette Kress sold 10,741 shares of the businesss stock in a transaction that occurred on Thursday, January 26th. The shares were sold at an average price of $200.00, for a total transaction of $2,148,200.00. Following the completion of the transaction, the chief financial officer now owns 536,960 shares in the company, valued at $107,392,000. The sale was disclosed in a filing with the SEC, which can be accessed through the SEC website. Also, EVP Debora Shoquist sold 23,532 shares of the businesss stock in a transaction that occurred on Friday, January 27th. The shares were sold at an average price of $205.00, for a total transaction of $4,824,060.00. Following the transaction, the executive vice president now owns 162,944 shares of the companys stock, valued at approximately $33,403,520. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 262,060 shares of company stock worth $43,817,257. 4.04% of the stock is currently owned by company insiders.\nNVIDIA Stock Up 2.8 %\nShares of NASDAQ:NVDA opened at $203.65 on Friday. NVIDIA Co. has a one year low of $108.13 and a one year high of $289.46. The company has a 50 day moving average of $163.61 and a 200-day moving average of $154.35. The company has a debt-to-equity ratio of 0.45, a current ratio of 3.39 and a quick ratio of 2.74. The stock has a market cap of $507.09 billion, a price-to-earnings ratio of 86.66, a P/E/G ratio of 7.52 and a beta of 1.77.\nNVIDIA (",
      "snippet": "Read <b>NVIDIA</b> Co. (NASDAQ:NVDA) Stake Trimmed by Flputnam Investment Management Co. at WKRB News. Analyst Ratings Changes Several equities research ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T15:58:42",
      "provider": {
        "name": "wkrb13",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/nvidia-co-logo.jpg?v=20221020142916&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wkrb13",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wkrb13.com/2023/01/28/nvidia-co-nasdaqnvda-stake-trimmed-by-flputnam-investment-management-co.html"
      }
    },
    {
      "id": "1735158416578522267",
      "title": "Nvidia RTX 4060 and RTX 4050 GPUs Could Launch Sooner Than Expected",
      "url": "https://www.tomshardware.com/news/rtx-4060-rtx-4050-desktop-gpus-launch-sooner-than-expected",
      "description": "ECC filings for a desktop RTX 4060 and RTX 4050 have been revealed, suggesting these GPUs are already in development.",
      "body": "Comments (4)\n(Image credit: Nvidia)\nShangke Group has filed an ECC listing with the names of several GeForce GPU models, ranging from the RTX 4090 all the way down to the GTX 700 series. Shangke Group has added the RTX 4060 and RTX 4050 model names to the listing, suggesting Nvidia could release the desktop versions of these cards soon.\nIf the ECC listing can be trusted, Nvidia could release its entire RTX 40 series stack in under a year. This would be very quick by Nvidia's standards, especially in the case of the RTX 30-series, where Nvidia took two years to release its entire product stack, ranging from the RTX 3090 all the way to the RTX 3050 8GB.\nGPU manufacturers use ECC listings to register GPU model names to the government for use at a later date. Generally, these listings are a good indication that a GPU is currently in the development stage. However, this is not guaranteed the GPU manufacturer will use the names included in the listing, so take it with a grain of salt.\nWe have not heard of any rumors regarding an RTX 4050 or RTX 4060 desktop GPU, so performance estimations and GPU specs remain a complete mystery at this time. Only the laptop versions of these GPUs have launched - which you can read about here.\nHowever, based on current rumors of the RTX 4060 Ti and RTX 4070, we shouldn't expect these desktop GPUs to be that fast. The estimated specs of the RTX 4070 show us that the CUDA core count will match the previous generation RTX 3070, while also including a memory reduction from a 256-bit wide bus to 192-bit. The 4060 Ti is even worse, with fewer CUDA cores than its 3060 Ti predecessor and a bus width limited to just 128-bits wide. But at the very least, the 4060 Ti is rumored to have a 160W TDP, so it will be very power efficient.\nIf this says anything, it seems Nvidia is focusing more on saving power than anything else for its mid-range cards, leaving the Ada Lovelace architecture and its higher clock speeds as the only method to increase GPU performance. This leads us to believe we will see the same trend follow the RTX 4060 and RTX 4050. But these are just estimations at this time, and we don't actually know how Ada Lovelace will scale at lower core counts and power limitations.\nWho knows - If Nvidia can pull off 3090 Ti gaming at\n250W\n(opens in new tab)\nas it did with the RTX 4080, the RTX 4050 could turn into a \"GTX 750 Ti\" successor, with really good performance under a 75W envelope.\nBe In the Know",
      "snippet": "... Group has added the RTX 4060 and RTX 4050 model names to the listing, suggesting <b>Nvidia</b> could release the desktop versions of these cards soon.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T15:57:44",
      "provider": {
        "name": "tomshardware",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/mf2rhQLxqvu3LE8wmvRF79.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "tomshardware",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.tomshardware.com/news/rtx-4060-rtx-4050-desktop-gpus-launch-sooner-than-expected"
      }
    },
    {
      "id": "3283218297937293748",
      "title": "GeForce Now: Started updating servers to GeForce RTX 4080",
      "url": "https://pledgetimes.com/geforce-now-started-updating-servers-to-geforce-rtx-4080/",
      "description": "Nvidia has started upgrading the servers of its cloud gaming subscription service, GeForce Nowto introduce the technology of GeForce RTX",
      "body": "\n  \n  Nvidia has started upgrading the servers of its cloud gaming subscription service, GeForce Nowto introduce the technology of GeForce RTX 4080 for Ultimate subscribers.  So from these days it will be possible to experience the joys of the 40 series via the cloud, with all the advantages in terms of game quality.of course theserver update it will be gradual, so someone could receive the news only in the next few days.We read the official message with the announcement sent by Nvidia to the subscribers to GeForce Now:Still thinking about upgrading to Ultimate cloud gaming performance?  The moment has come.\nGeForce RTX 4080-class performance rollout has begun, new features will only be available to Ultimate subscribers.\nSign up for the Ultimate plan today and get ready for the highest resolutions and frame rates from the cloud;  play and compete with up to 240 fps in DSLR-enabled titles.  Ultimate plan subscribers also get exclusive access to the fastest game servers and longest gaming sessions.  Also, for the first time ever, Ultrawide resolutions are supported offering a wider point of view, for a truly immersive gaming experience.\nUpgrade to Ultimate today and your gameplay will automatically update when updated RTX 4080 servers are available in your area, if they aren't already.\n\n      !function(f,b,e,v,n,t,s)\n      {if(f.fbq)return;n=f.fbq=function(){n.callMethod?\n      n.callMethod.apply(n,arguments):n.queue.push(arguments)};\n      if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0';\n      n.queue=[];t=b.createElement(e);t.async=!0;\n      t.src=v;s=b.getElementsByTagName(e)[0];\n      s.parentNode.insertBefore(t,s)}(window, document,'script',\n      'https://connect.facebook.net/en_US/fbevents.js');\n      fbq('init', '1624156791000312');\n      fbq('track', 'PageView');\n      \n    // initialize the library with the API key\n    window.fbAsyncInit = function() {\n      FB.init({\n        appId      : '175982639107667',\n        xfbml      : false,\n        version    : 'v7.0',\n        status     : true,  \n        cookie     : true\n      });\n    };\n    (function(d, s, id){\n      var js, fjs = d.getElementsByTagName(s)[0];\n      if (d.getElementById(id)) {return;}\n      js = d.createElement(s); js.id = id;\n      js.src = \"https://connect.facebook.net/it_IT/sdk.js\";\n      fjs.parentNode.insertBefore(js, fjs);\n    }(document, 'script', 'facebook-jssdk'));\n  \r\n#GeForce #Started #updating #servers #GeForce #RTX",
      "snippet": "<b>Nvidia</b> has started upgrading the servers of its cloud gaming subscription service, GeForce Nowto introduce the technology of GeForce RTX. <b>Nvidia</b> has ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T15:00:00",
      "provider": {
        "name": "pledgetimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://multiplayer.net-cdn.it/thumbs/images/2022/09/20/bandicam_2022-09-20_17-18-45-078_cropped_201_45_749_428_jpeg_1200x0_crop_q85.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pledgetimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://pledgetimes.com/geforce-now-started-updating-servers-to-geforce-rtx-4080/"
      }
    },
    {
      "id": "344921181606121430",
      "title": "Nvidia RTX 4060 and RTX 4050 spotted in the wild, might launch sooner than you expected",
      "url": "https://www.sportskeeda.com/gaming-tech/nvidia-rtx-4060-rtx-4050-spotted-wild-might-launch-sooner-expected",
      "description": "Recent developments suggest that the RTX 4060 and 4050 video cards may arrive sooner than expected.",
      "body": "Recent developments suggest that the RTX 4060 and 4050 video cards may arrive sooner than expected. The cards were spotted in a European Economic Commission (EEC) filing, a body that regulates and ensures economic integration in the European Union, as originally reported by Videocardz.Manufacturers mostly file for an EEC clearance close to the product's launch after finer details have materialized. Without proper trade clearance, AIB manufacturers may not be allowed to sell their products in the EU region.A screenshot of the EEC application for Nvidia GPUs (Image via Videocardz)However, it is worth noting that the 4060 and the 4050 were spotted alongside other applications, including the last-gen RTX 30 series cards, RTX 4090, 4080, and 4070. Thus, the exact release date of the upcoming Ada Lovelace GPUs remains a mystery.More details on the developments surrounding the RTX 4060 and 4050Anthony@TheGalox_2023 MSI gaming laptop lineup pricing Katana 15: i7-12650H, RTX 4060 & 16/512gb: $1199 Pulse 15: i7-13700H, RTX 4060 & 16/1TB: $1499 Raider GE78HX: i9-13980HX, RTX 4080 & 32/2TB: $3299 Titan GT77HX: i9-13980HX, RTX 4090 & 64/2TB: $46997082023 MSI gaming laptop lineup pricing Katana 15: i7-12650H, RTX 4060 & 16/512gb: $1199 Pulse 15: i7-13700H, RTX 4060 & 16/1TB: $1499 Raider GE78HX: i9-13980HX, RTX 4080 & 32/2TB: $3299 Titan GT77HX: i9-13980HX, RTX 4090 & 64/2TB: $4699 https://t.co/sXnxXL55Z4As we established in a recent rumor roundup of the upcoming RTX 4070, Nvidia will launch the lower-end 70-class GPU first. The performance-class and entry-level 4060 and 4050 are expected to hit the market later, preferably around Computex.However, according to a report originally published on Videocardz, Shangke Group, who owns graphics card manufacturers like MaxSun and Soyo, recently filed for trade clearance for practically the entire RTX 40-series lineup.This can have two broad implications.Third-party manufacturers are ready with their designs for the RTX 4060 and 4050 video cards.Partners are aware that Nvidia will launch the GPUs sometime in the future and are filing for a trade clearance of the GPUs all at once, potentially to save money.Another noteworthy point in these filings is that the list does not include RTX 4070 Ti, Nvidia's latest launch. This also hints at the second possibility.If the second case is true, all speculation around the upcoming cards will be practically useless as this development gives no insight into when to expect the graphics cards.LupintheIII@LupintheI@anonym12345198 @VideoCardz It's called RTX 4060 actually... but yeah, that's the reason.6@anonym12345198 @VideoCardz It's called RTX 4060 actually... but yeah, that's the reason. https://t.co/t6HRNrUYTFHowever, if the partners have readied the 4060 and 4050 GPUs, the graphics cards should be launched by Computex 2023.More information on RTX 4060 and RTX 4050The upcoming RTX 4060 and RTX 4050 GPUs are expected to bring the lower barrier of entry into Ada Lovelace further down, thereby allowing budget and entry-level gamers to get access to the new technologies and improvements of RTX 40 series GPUs.According to rumors, the RTX 4060 is expected to be as fast as the 3070 or 3070 Ti.Details on RTX 4050 are thin; however, the graphics card is rumored to be based on a severely cut-down AD107 GPU and uses a 128-bit memory bus.",
      "snippet": "... products in the EU region.A screenshot of the EEC application for <b>Nvidia</b> GPUs (Image via Videocardz)However, it is worth noting that the 4060 and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T14:01:53",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticg.sportskeeda.com/editor/2023/01/ec72f-16749082534072-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/gaming-tech/nvidia-rtx-4060-rtx-4050-spotted-wild-might-launch-sooner-expected"
      }
    },
    {
      "id": "6509626824248137578",
      "title": "NVIDIA GeForce RTX 4060 & RTX 4050 Mainstream Graphics Cards Show Up At EEC",
      "url": "https://wccftech.com/nvidia-geforce-rtx-4060-rtx-4050-mainstream-graphics-cards-show-up-at-eec/",
      "description": "NVIDIA's mainstream GeForce RTX 4060 & RTX 4050 graphics cards have shown up at EEC as they were listed by a Chinese graphics card maker.",
      "body": "NVIDIA GeForce RTX 4060 Ti May Only Be As Fast As The RTX 3070\nWithin the EEC listing, one can find the NVIDIA GeForce RTX 4060 and RTX 4050 mentioned along with the GeForce RTX 4070 (do note that no RTX 4070 Ti or any \"Ti\" card is mentioned in the listing. Now this listing doesn't mean anything but only points out that NVIDIA's partners are aware of the cards being launched at some point. We know that NVIDIA plans to launch its GeForce RTX 4070 as the next product and that would be followed by the RTX 4060 and RTX 4050 if the rumors are to be believed.\nNVIDIA's GeForce RTX 4060 & RTX 4050 graphics cards have been listed at the EEC. (Image Credits: Videocardz)\nAs for what to expect from the NVIDIA GeForce RTX 4060 and RTX 4050, the RTX 4060 Ti is expected to offer a big boost to efficiency with a 160W TGP but the overall performance may not be as good as the high-end parts. The card is said to be close to the GeForce RTX 3070/Ti in performance which is more or less going to be a deciding factor based on its price. So one can expect the GeForce RTX 4060 (Non-Ti) too be closer or slightly slower than an RTX 4060 at around a 130-150W TGP.\nFor the GeForce RTX 4050, this card is expected to feature the AD107 GPU core and would get a 128-bit bus interface but nothing is set in stone for now. One thing is for sure and that's that NVIDIA has to price these two cards, the GeForce RTX 4060 and the RTX 4050, right! Both of these cards will be positioned in the mainstream segment. The RTX 3050 launched at $249 US & the RTX 3060 launched at $329 US so NVIDIA will have to think twice about increasing the prices on these mainstream cards as that can affect their reception in the mass consumer market at launch.\nNVIDIA GeForce RTX 40 Series Graphics Card Lineup (Rumored):\nGraphics Card",
      "snippet": "We know that <b>NVIDIA</b> plans to launch its GeForce RTX 4070 as the next product and that would be followed by the RTX 4060 and RTX 4050 if the rumors ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T11:04:50",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2023/01/NVIDIA-GeForce-RTX-3050-Graphics-Cards-gigapixel-standard-scale-4_00x-Custom-728x513.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/nvidia-geforce-rtx-4060-rtx-4050-mainstream-graphics-cards-show-up-at-eec/"
      }
    },
    {
      "id": "2373518324863772788",
      "title": "CPU-Z Version 2.04 Adds AMD Ryzen 7000 X3D, Intel Core i9-13900KS & More Hardware Support",
      "url": "https://wccftech.com/cpu-z-version-2-04-adds-amd-ryzen-7000-x3d-intel-core-i9-13900ks-more-hardware-support/",
      "description": "CPU-Z has released a new 2.04 update for NVIDIA 4070/4080 Ti GPUs, Intel ADL-N and HX CPUs, and various new AMD Ryzen CPUs.",
      "body": "Jan 28, 2023 05:39 AM EST\n\nCopy Shortlink\nThe new CPU-Z 2.04 update is out, and with the latest release comes support for AMD Ryzen 7000 X3D, Ryzen 7000 Non-X, & Intel's 13th Gen Core mobile HX & ADL-N CPUs. Additionally, CPU-Z will reveal information for AMD Radeon RX 7900 XT and XTX graphics cards, along with NVIDIA's GeForce RTX 4080 and 4070 Ti graphics cards.\nCPU-Z introduces version 2.04 for support of next-gen AMD, Intel, and NVIDIA components\nCPU-Z, the freeware software tool that displays crucial information about some of the more important computer components in your PC system, is updated today to show information for newly released AMD, Intel, and NVIDIA hardware.\nWith CPU-Z, you can see the information about the processor, such as name, number, codename, process, package, and cache levels. The software tool displays the mainboard, chipset, memory size, type, timing, and SPD (or module specifications). What is excellent about CPU-Z is its ability to show the core internal frequency and the memory frequency measurements in real time. It is a widely used tool used by consumers and professionals alike.\nCustom designers of computer components also have their version of the CPU-ID software, such as:\nCooler Master\nNVIDIA RTX 4080 16GB (AD103)\nNVIDIA RTX 4070 Ti (AD104)\nOther notable software tools created by the CPUID team are HWMonitor (which allows for monitoring of voltage, temps, and fan speed), HWMonitor PRO (an extended version of HWMonitor), Perfmonitor 2 (a performance and monitoring tool for processors), and powerMAX (a CPU and GPU burn-in test tool). The group offers the SDK for developers for both CPU-Z and HWMonitor.\nThe current download link is not shown on the official CPUID website at the time of writing. However, this direct link to the download will access the .zip file for easy access.\nNews Sources: VideoCardz,",
      "snippet": "CPU-Z has released a new 2.04 update for <b>NVIDIA</b> 4070/4080 Ti GPUs, Intel ADL-N and HX CPUs, and various new AMD Ryzen CPUs. Jan 28, 2023 05:39 AM EST ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T10:39:00",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2023/01/CPU-Z-2.04-1.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/cpu-z-version-2-04-adds-amd-ryzen-7000-x3d-intel-core-i9-13900ks-more-hardware-support/"
      }
    },
    {
      "id": "7244090622990226511",
      "title": "Intel's 'historic collapse' erases $8 billion from market value",
      "url": "https://www.moneycontrol.com/news/business/markets/intels-historic-collapse-erases-8-billion-from-market-value-9952241.html",
      "description": "Intel shares closed 6.4 percent lower, while rival Advanced Micro Devices and Nvidia ended the session up 0.3 percent and 2.8 percent, respectively. Intel supplier KLA Corp settled 6.9 percent lower after its dismal forecast",
      "body": "Intel says it will take back share from AMD, but some are skeptical\nThe company has been steadily losing market share to rivals like AMD, which has used contract chipmakers such as Taiwan-based TSMC to make chips that outpace Intel's technology.\n\"AMD's Genoa and Bergamo (data center) chips have a strong price-performance advantage compared to Intel's Sapphire Rapids processors, which should drive further AMD share gains,\" said Matt Wegner, analyst at YipitData.\nAnalysts said that puts Intel at a disadvantage even when the data center market bottoms out, expected in the second half of 2022, as the company would have lost even more share by then.\n\"It is now clear why Intel needs to cut so much cost as the company's original plans prove to be fantasy,\" brokerage Bernstein said. \"The magnitude of the deterioration is stunning, and brings potential concern to the company's cash position over time.\"\nIntel, which plans to cut $3 billion in costs this year, generated $7.7 billion in cash from operations in the fourth quarter and paid dividends of $1.5 billion.\nWith capital expenditure estimated to be around $20 billion in 2023, analysts said the company should consider cutting its dividend.\nReuters",
      "snippet": "... closed 6.4 percent lower, while rival Advanced Micro Devices and <b>Nvidia</b> ended the session up 0.3 percent and 2.8 percent, respectively. Intel ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T07:15:01",
      "provider": {
        "name": "moneycontrol",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.moneycontrol.com/static-mcnews/2022/04/Intellect-Design-770x433.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "moneycontrol",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.moneycontrol.com/news/business/markets/intels-historic-collapse-erases-8-billion-from-market-value-9952241.html"
      }
    },
    {
      "id": "6329301900208095423",
      "title": "M. Kulyk & Associates LLC Grows Position in NVIDIA Co. (NASDAQ:NVDA)",
      "url": "https://www.themarketsdaily.com/2023/01/27/m-kulyk-associates-llc-grows-position-in-nvidia-co-nasdaqnvda.html",
      "description": "Read M. Kulyk & Associates LLC Grows Position in NVIDIA Co. (NASDAQ:NVDA) at Markets Daily",
      "body": "alerts:\nInsider Activity\nIn other news, Director John Dabiri sold 293 shares of the businesss stock in a transaction dated Monday, December 19th. The stock was sold at an average price of $165.80, for a total value of $48,579.40. Following the completion of the transaction, the director now owns 2,417 shares of the companys stock, valued at approximately $400,738.60. The sale was disclosed in a legal filing with the SEC, which is accessible through this link. In related news, insider Donald F. Robertson, Jr. sold 2,494 shares of the companys stock in a transaction dated Thursday, December 15th. The stock was sold at an average price of $167.89, for a total value of $418,717.66. Following the completion of the transaction, the insider now owns 56,617 shares of the companys stock, valued at approximately $9,505,428.13. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, Director John Dabiri sold 293 shares of the companys stock in a transaction dated Monday, December 19th. The stock was sold at an average price of $165.80, for a total value of $48,579.40. Following the completion of the transaction, the director now directly owns 2,417 shares of the companys stock, valued at approximately $400,738.60. The disclosure for this sale can be found here. Insiders sold a total of 227,787 shares of company stock valued at $36,844,997 in the last quarter. 4.04% of the stock is currently owned by company insiders.\nAnalyst Ratings Changes\nA number of equities research analysts recently issued reports on the company. Needham & Company LLC raised their price target on NVIDIA from $200.00 to $230.00 and gave the stock a buy rating in a research note on Monday, December 19th. Wedbush lifted their target price on NVIDIA from $160.00 to $175.00 and gave the company a neutral rating in a research report on Thursday, November 17th. Tigress Financial reduced their price target on NVIDIA from $310.00 to $250.00 and set a buy rating for the company in a research report on Thursday, December 8th. Susquehanna Bancshares boosted their price target on NVIDIA from $180.00 to $185.00 and gave the stock a positive rating in a research report on Thursday, November 17th. Finally, Summit Insights raised NVIDIA from a hold rating to a buy rating in a research report on Wednesday, November 16th. Two equities research analysts have rated the stock with a sell rating, nine have issued  a hold rating, twenty-three have issued  a buy rating and one  has given a strong buy rating to the stock. According to data from MarketBeat.com, the company currently has a consensus rating of Moderate Buy and an average target price of $209.23.\nNVIDIA Stock Performance",
      "snippet": "Kulyk & Associates LLC Grows Position in <b>NVIDIA</b> Co. (NASDAQ:NVDA) at Markets Daily. Insider Activity In other news, Director John Dabiri sold 293 ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T22:46:42",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/nvidia-co-logo.jpg?v=20221020142916&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/01/27/m-kulyk-associates-llc-grows-position-in-nvidia-co-nasdaqnvda.html"
      }
    },
    {
      "id": "5530937699157892909",
      "title": "AMD's Marketing Shows Its Older 6000 Series GPUs Offer the Most Value",
      "url": "https://www.extremetech.com/gaming/342689-amds-marketing-shows-its-older-6000-series-gpus-offer-the-most-value",
      "description": "If you want the absolute best-value GPU from AMD, the company says it's the $129 RX 6400, and not any ...",
      "body": "Comments\nThis site may earn affiliate commissions from the links on this page. Terms of use.\nAMD has published a new blog post attempting to convince people of its status as a GPU industry leader. Along the way, it seems to have inadvertently admitted its older GPUs are a better value than the newest models. It reminds us of the oft-used online phrase, An attempt was made.\nThe gist of the blog is boilerplate PR about how AMD Radeon GPUs are the best at every resolution and price point. It notably does not compare its GPUs against Intel or Nvidia with numbers. Anyway, with many AAA titles out currently and more on the way, AMD wants people looking to upgrade to buy an AMD GPU. To help convince them, it provides a handy chart showing the fps-to-dollar ratio for its entire 7000 and 6000 lineups across six games at 1080p: Apex Legends, Valorant, Call of Duty: Modern Warfare 2, The Callisto Protocol, GTA V, and Overwatch 2.\nAll games were tested at Max settings, aside from the entry-level RX 6400, which ran these games at a Medium preset.\nIts in this chart that it shows its 7900 GPUs offering the worst bang-for-the-buck value of its entire product stack.\nIf you just pay attention to the grey bars, youll note how they start out small at the top. They then proceed to get wider and wider, all the way to the bottom as it ticks through the 6000 series. This essentially shows that as you go down the product stack, fps-per-dollar only goes up. It means that every 6000 series GPU offers more fps-per-dollar than its most recent GPUs.\nWere not sure why AMDs marketing team felt compelled to point this out. Perhaps it is just stating the obvious, that its newest GPUs have an early adopter tax built into their pricing. Maybe AMD is still happy to be selling RX 6000 series GPUs. We imagine Nvidia is in the same camp, as it needs to clear out its Ampere GPUs to pave the way for more Ada Lovelace purchases. Still, AMD seems to be faring well so far with its RDNA3 GPUs, vapor chamber issues aside.\nAs we reported previously, the RX 7900 XT is currently the top-selling GPU in Germany. You can insert a David Hasselhoff joke here, but the numbers show its been a success so far.\nWe reached out to AMD to help us understand why its pushing this angle, as it paints its older GPUs in a more favorable light than its newer models. Well update this article if and when we hear back.\nNow Read:",
      "snippet": "It notably does not compare its GPUs against Intel or <b>Nvidia</b> with numbers. Anyway, with many AAA titles out currently and more on the way, AMD wants ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T20:19:45",
      "provider": {
        "name": "extremetech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.extremetech.com/wp-content/uploads/2022/11/1-10-640x360.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "extremetech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.extremetech.com/gaming/342689-amds-marketing-shows-its-older-6000-series-gpus-offer-the-most-value"
      }
    },
    {
      "id": "6128194164044907906",
      "title": "Forspoken reportedly can't run on older AMD GPUs, while it can on Nvidia GPUs",
      "url": "https://www.sportskeeda.com/gaming-tech/news-forspoken-reportedly-run-older-amd-gpus-nvidia-gpus-can",
      "description": "According to a report published on Wccftech on January 27, older AMD GPUs based on the Polaris architecture can't run Forspoken, the latest AAA title in the market.",
      "body": "According to a report published on Wccftech on January 27, older AMD GPUs based on the Polaris architecture can't run Forspoken, the latest AAA title in the market. In contrast, much older Nvidia cards support the game.The main reason for this compatibility issue is due to the lack of DirectX 12_1 support in the AMD video cards. While Nvidia GPUs dating back to 2014 are compatible with this API, many more recent AMD graphics cards are not.Forspoken, in particular, needs at least the DirectX 12_1 feature level to run. This should not be confused with the DirectX 12 Ultimate, which is a more recent version of the API.More details on the Forspoken GPU-support fiascoBoulder Punch@boulderpunch1Imagine how many people this went through and said \"yep, people will love it\".97243Imagine how many people this went through and said \"yep, people will love it\". https://t.co/Mk4Anr1Y1qAs per the Wccftech report, the AMD GPUs that do not support Forspoken include the company's Polaris lineup and GPUs pre-dating it. They were launched in 2017, so there is nothing new per se.AMD used the Polaris architecture for two generations of graphics cards. The list includes the Radeon RX 400 series and the RX 500 lineup. With the new architecture, the company moved away from its aging Graphics Core Next (GCN) formula. Polaris delivers much better value propositions and performance levels.However, among the fundamental issues of the Polaris GPUs were bugged drivers and API readiness. The GPUs came with support for DirectX 12, but it could only run up to the 12_0 feature list. Back in the day, this wasn't a big deal as games were not built to run on the latest APIs either.Fast forward several years, games are being upgraded to utilize the maximum of the latest software technologies, and the RX 400 and RX 500 series of graphics cards are thus left behind.Older Nvidia GPUs can easily run the titleIts worth noting, however, that Nvidia has included support for the DirectX 12_1 feature set since 2014. The Maxwell lineup of GPUs, or the GTX 900 series, supports the API and can run Forspoken.Even if AMD had baked in support for the DirectX 12_1, the Polaris video cards would have been practically useless because Forspoken is not a well-optimized title. Some of the latest GPUs in the market, including the RDNA 3-based RX 7000 series models, are having a hard time with it.In addition, the game has not garnered a lot of attention from gamers either. In our review of the title, we found it to be incredibly easy, the world felt empty, and the title has some of the worst dialog options. Thus, it is unlikely that the lack of support for certain older AMD GPUs will bother many gamers.",
      "snippet": "In contrast, much older <b>Nvidia</b> cards support the game.The main reason for this compatibility issue is due to the lack of DirectX 12_1 support in the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T18:13:56",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticg.sportskeeda.com/editor/2023/01/0c4ed-16748398870544-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/gaming-tech/news-forspoken-reportedly-run-older-amd-gpus-nvidia-gpus-can"
      }
    },
    {
      "id": "1613882366388596762",
      "title": "Is a Correction Looming Ahead for Micron Technology Inc. (MU)",
      "url": "https://newsheater.com/2023/01/27/is-a-correction-looming-ahead-for-micron-technology-inc-mu/",
      "description": "Micron Technology Inc. (NASDAQ:MU) went up by 2.05% from its latest closing price compared to the recent 1-year high of $96.50. The companys stock price has collected 11.43% of gains in the last five trading sessions. Barrons reported on 12/22/22 that Nvidia, AMD, and Lam Research Slide Af",
      "body": "Business\nMicron Technology Inc. (NASDAQ:MU)\nwent up by 2.05% from its latest closing price compared to the recent 1-year high of $96.50. The companys stock price has collected 11.43% of gains in the last five trading sessions. Barrons reported on 12/22/22 that Nvidia, AMD, and Lam Research Slide After Micron Disappoints\nIs It Worth Investing in Micron Technology Inc. (NASDAQ :MU) Right Now?\nMicron Technology Inc. (NASDAQ:MU) scored a price-to-earnings ratio above its average ratio, recording 11.39 x from its present earnings ratio. Plus, the 36-month beta value for MU is at 1.31. Opinions of the stock are interesting as 22 analysts out of 38 who provided ratings for Micron Technology Inc. declared the stock was a buy, while 5 rated the stock as overweight, 9 rated it as hold, and 2 as sell.\n5 Best Growth Stocks To Own For 2023.\nSponsored\nThe average price from analysts is $64.57, which is $1.37 above the current price. MU currently public float of 1.09B and currently shorts hold a 2.30% ratio of that float. Today, the average trading volume of MU was 15.91M shares.\nMUs Market Performance\nMU stocks went up by 11.43% for the week, with a monthly jump of 25.10% and a quarterly performance of 12.40%, while its annual performance rate touched -22.20%. The volatility ratio for the week stands at 2.94% while the volatility levels for the past 30 days are set at 3.16% for Micron Technology Inc. The simple moving average for the period of the last 20 days is 12.70% for MU stocks with a simple moving average of 5.46% for the last 200 days.\nAnalysts Opinion of MU\nUBS, on the other hand, stated in their research note that they expect to see MU reach a price target of $70, previously predicting the price at $75. The rating they have provided for MU stocks is Buy according to the report published on December 22nd, 2022.\nStifel gave a rating of Hold to MU, setting the target price at $52 in the report published on December 22nd of the previous year.\nMU Trading at 12.79% from the 50-Day Moving Average\nAfter a stumble in the market that brought MU to its low price for the period of the last 52 weeks, the company was unable to rebound, for now settling with -34.92% of loss for the given period.\nVolatility was left at 3.16%, however, over the last 30 days, the volatility rate increased by 2.94%, as shares surge +25.55% for the moving average over the last 20 days. Over the last 50 days, in opposition, the stock is trading +0.45% upper at present.\nDuring the last 5 trading sessions, MU rose by +11.43%, which changed the moving average for the period of 200-days by -12.95% in comparison to the 20-day moving average, which settled at $56.36. In addition, Micron Technology Inc. saw 25.65% in overturn over a single year, with a tendency to cut further gains.\nInsider Trading\nReports are indicating that there were more than several insider trading activities at MU starting from Beard Robert P, who sale 3,000 shares at the price of $61.25 back on Jan 23. After this action, Beard Robert P now owns 42,840 shares of Micron Technology Inc., valued at $183,750 using the latest closing price.\nBokan Michael W, the SVP, Worldwide Sales of Micron Technology Inc., sale 16,600 shares at $63.82 during a trade that took place back on Aug 16, which means that Bokan Michael W is holding 119,126 shares at $1,059,450 based on the most recent closing price.\nStock Fundamentals for MU\nCurrent profitability levels for the company are sitting at:\n+31.76 for the present operating margin\n+45.36 for the gross margin\nThe net margin for Micron Technology Inc. stands at +28.24. Equity return is now at value 12.60, with 9.40 for asset returns.\nThe liquidity ratio also appears to be rather interesting for investors as it stands at 2.89.",
      "snippet": "Barrons reported on 12/22/22 that <b>Nvidia</b>, AMD, and Lam Research Slide Af. Business Micron Technology Inc. (NASDAQ:MU) went up by 2.05% from its ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T16:54:00",
      "provider": {
        "name": "newsheater",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://newsheater.com/wp-content/uploads/2020/01/Image-75.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsheater",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://newsheater.com/2023/01/27/is-a-correction-looming-ahead-for-micron-technology-inc-mu/"
      }
    },
    {
      "id": "3468690310739782541",
      "title": "Essex Financial Services Inc. Has $2.30 Million Position in NVIDIA Co. (NASDAQ:NVDA)",
      "url": "https://theenterpriseleader.com/2023/01/27/essex-financial-services-inc-has-2-30-million-position-in-nvidia-co-nasdaqnvda.html",
      "description": "Read Essex Financial Services Inc. Has $2.30 Million Position in NVIDIA Co. (NASDAQ:NVDA) at Enterprise Leader",
      "body": "alerts:\nInsider Activity at NVIDIA\nIn related news, Director Mark A. Stevens sold 120,000 shares of NVIDIA stock in a transaction that occurred on Monday, January 9th. The stock was sold at an average price of $158.84, for a total transaction of $19,060,800.00. Following the transaction, the director now owns 1,325,888 shares of the companys stock, valued at $210,604,049.92. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. In other news, Director Mark A. Stevens sold 120,000 shares of NVIDIA stock in a transaction on Monday, January 9th. The stock was sold at an average price of $158.84, for a total transaction of $19,060,800.00. Following the sale, the director now directly owns 1,325,888 shares in the company, valued at approximately $210,604,049.92. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available at the SEC website. Also, insider Donald F. Robertson, Jr. sold 2,494 shares of the stock in a transaction dated Thursday, December 15th. The shares were sold at an average price of $167.89, for a total transaction of $418,717.66. Following the transaction, the insider now owns 56,617 shares of the companys stock, valued at approximately $9,505,428.13. The disclosure for this sale can be found here. Insiders have sold a total of 227,787 shares of company stock valued at $36,844,997 over the last 90 days. Insiders own  4.04% of the companys stock.\nWall Street Analyst Weigh In\nA number of brokerages have issued reports on NVDA. KeyCorp lowered their target price on NVIDIA from $230.00 to $220.00 and set an overweight rating for the company in a report on Wednesday, January 11th. Cowen increased their target price on NVIDIA from $200.00 to $220.00 in a research report on Monday, December 12th. Truist Financial increased their target price on NVIDIA from $198.00 to $238.00 and gave the company a buy rating in a research report on Monday. Wedbush increased their target price on NVIDIA from $160.00 to $175.00 and gave the company a neutral rating in a research report on Thursday, November 17th. Finally, Morgan Stanley dropped their target price on NVIDIA from $182.00 to $175.00 and set an equal weight rating for the company in a research report on Thursday, November 17th. Two investment analysts have rated the stock with a sell rating, nine have issued  a hold rating, twenty-three have assigned  a buy rating and one  has given a strong buy rating to the company. According to data from MarketBeat, NVIDIA presently has a consensus rating of Moderate Buy and an average target price of $209.23.\nNVIDIA Stock Up 1.1 %",
      "snippet": "... Inc. Has $2.30 Million Position in <b>NVIDIA</b> Co. (NASDAQ:NVDA) at Enterprise Leader. Insider Activity at <b>NVIDIA</b> In related news, Director Mark A.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T15:50:45",
      "provider": {
        "name": "theenterpriseleader",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/nvidia-co-logo.jpg?v=20221020142916&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theenterpriseleader",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://theenterpriseleader.com/2023/01/27/essex-financial-services-inc-has-2-30-million-position-in-nvidia-co-nasdaqnvda.html"
      }
    },
    {
      "id": "1317466241006579056",
      "title": "DLSS 3 Delivers Massive Boosts to Dying Light 2(Next Tuesday), Marvel's Midnight Suns and HITMAN 3",
      "url": "https://wccftech.com/dlss-3-delivers-massive-boosts-to-dying-light-2next-tuesday-marvels-midnight-suns-and-hitman-3/",
      "description": "NVIDIA DLSS 3 is coming early next week to Dying Light 2: Stay Human, and it's already live in Marvel's Midnight Suns and HITMAN: WoA.",
      "body": "Jan 27, 2023 10:17 AM EST\n\nCopy Shortlink\nToday, NVIDIA shared its monthly DLSS 3 update, revealing that Techland's Dying Light 2: Stay Human will receive the Deep Learning Super Sampling Frame Generation update on Tuesday, January 31st.\nNVIDIA also provided benchmark results showing a massive performance difference. With Super Resolution set to Performance Mode at 4K and max settings (ray tracing included), Dying Light 2: Stay Human runs 2.8x faster on a GeForce RTX 4090 GPU compared to native rendering, reaching nearly 187 average frames per second.\nNVIDIA also partnered with Techland to deliver an in-game bonus reward via GeForce Experience. Starting on January 31st, click the notification in GFE and follow the steps to acquire a code youll be able to redeem on Techlands website.\nTwo big games were also updated yesterday with DLSS 3 support. The first is IOI's HITMAN 3, now known as HITMAN World of Assassination. According to NVIDIA, the GeForce RTX 4090 can now deliver an average of 162.9 FPS with Frame Generation and Super Resolution Performance Mode (4K resolution) enabled.\nGeForce RTX 40 Series owners can check out DLSS 3 via the free demo if they don't own the full game.\nFiraxis Games also introduced DLSS 3 to Marvel's Midnight Suns with the free update that went live alongside the Deadpool DLC. The performance boost is slightly lower here, but RTX 4090 can still look forward to an average of 156.9 FPS.\nOn Thursday, February 2nd, two new game releases will be added to the growing list of DLSS 3 games: the cooperative FPS Perish and the sci-fi adventure game Deliver Us Mars, which also support ray traced reflections and shadows.\nThe latter game runs at 180.7 average FPS on a GeForce RTX 4090.\nAs for Perish, the game enjoys a similar boost (2.4x) from native rendering to DLSS 3.\nWe'll have exclusive interviews with the developers of Perish and Deliver Us Mars early next week.\nShare this story",
      "snippet": "<b>NVIDIA</b> DLSS 3 is coming early next week to ... 27, 2023 10:17 AM EST Copy Shortlink Today, <b>NVIDIA</b> shared its monthly DLSS 3 update, revealing that ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T15:17:40",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2023/01/Collage-Maker-27-Jan-2023-03.32-PM-scaled.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/dlss-3-delivers-massive-boosts-to-dying-light-2next-tuesday-marvels-midnight-suns-and-hitman-3/"
      }
    },
    {
      "id": "8727850336014195862",
      "title": "Nvidia RTX 4090 Ti expected release date and performance, rumored specs, and more",
      "url": "https://www.sportskeeda.com/gaming-tech/nvidia-rtx-4090-ti-expected-release-date-performance-rumored-specs",
      "description": "The RTX 4090 Ti will be a slightly improved version of the current Team Green flagship, the 4090.",
      "body": "Share\nThe GeForce RTX 4090 FE card (Image via Nvidia)\nThe RTX 4090 Ti will be a slightly improved version of the current Team Green flagship, the 4090. If the trends are anything to go by, this GPU will sacrifice thermal and power efficiency to deliver up to 10% more performance. Nvidia is, however, yet to declare any official information on this offering.\nMeanwhile, some details have already started surfacing on the internet. With even more CUDA cores and faster clock speeds, the 4090 Ti looks slated to take the performance crown once and forever.\nHowever, how these bumps in specifications impact thermal performance and power draw is a major concern. The GPU might require dual 16-pin power connectors as a single port can only deliver up to a maximum of 600 W.\nThe RTX 4090 Ti will be like no other GPU ever released",
      "snippet": "<b>Nvidia</b> is, however, yet to declare any official information on this offering. Meanwhile, some details have already started surfacing on the internet.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T15:01:54",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticg.sportskeeda.com/editor/2023/01/c276f-16748259897170-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/gaming-tech/nvidia-rtx-4090-ti-expected-release-date-performance-rumored-specs"
      }
    },
    {
      "id": "6985588155062888264",
      "title": "INTCs Dismal Earnings Drag Down Chip Stocks",
      "url": "https://www.tipranks.com/news/intcs-dismal-earnings-drag-down-chip-stocks",
      "description": "Chip giants including Intel (INTC), AMD (AMD), KLA Corp. (KLAC), and Nvidia (NVDA) trended lower in pre-market trading on Friday as Intels disappointing Q4 earning...",
      "body": "Chip giants including Intel (INTC), AMD (AMD), KLA Corp. (KLAC), and Nvidia (NVDA) trended lower in pre-market trading on Friday as Intels disappointing Q4 earnings and dismal outlook dragged down the other chip stocks.\nKLAC reported better-than-expected fiscal Q2 results with revenues of $2.98 billion, an increase of 26.8% year-over-year and surpassing analysts estimates by $150 million. Adjusted earnings came in at $7.38 per share surpassing Street expectations of $7.10.\nAMD is expected to announce its calendar Q4 earnings next week while NVDA is anticipated to announce its earnings on February 22.\nSemiconductor stocks can be very volatile, which can make investing in individual stocks difficult for some. For those looking to smooth out the volatility, the following semiconductor ETFs may be a better option:.\nThe iShares Semiconductor ETF (SOXX) has lost more than 7% in the past year.",
      "snippet": "... giants including Intel (INTC), AMD (AMD), KLA Corp. (KLAC), and <b>Nvidia</b> (NVDA) trended lower in pre-market trading on Friday as Intels disappointing ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T14:36:08",
      "provider": {
        "name": "tipranks",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://blog.tipranks.com/wp-content/uploads/2023/01/shutterstock_691548583-2-750x406.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "tipranks",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.tipranks.com/news/intcs-dismal-earnings-drag-down-chip-stocks"
      }
    },
    {
      "id": "4482273742644955971",
      "title": "Nvidia CEO says AI will need regulation social norms",
      "url": "https://www.ctvnews.ca/sci-tech/nvidia-ceo-says-ai-will-need-regulation-social-norms-1.6248839",
      "description": "Nvidia Corp Chief Executive Officer Jensen Huang on Tuesday said that the burgeoning field of artificial intelligence will create powerful tools that require legal regulation and social norms that have yet to be worked out.",
      "body": "Nvidia CEO says AI will need regulation, social norms\nIce Age relic found by Alberta woman out walking her dogs\nBuzzFeed soars on reports of plans to use ChatGPT's OpenAI, Meta deal\nTips to protect your personal information online\nNewly discovered asteroid makes one of the closest approaches of Earth\nEgypt unveils tombs and sarcophagus in new excavation\nNASA marks 20 years since space shuttle Columbia disaster\nJapan launches intel satellite to watch North Korea military sites\nRISKIN REPORTS\nDan Riskin on why migratory birds end up in the wrong place\nDan Riskin on the consequences of not experiencing nature\nDan Riskin on a tool that makes CO2 impacts more visible\nDan Riskin on why primates spend more time on the ground\nDan Riskin on why Arctic lakes are disappearing\nDan Riskin on climate change's impact on tree growth\nDan Riskin on the health of Antarctica's glaciers\nDan Riskin on the increasing rise of extreme weather events\nCTVNews.ca Top Stories\nWHO emergency declaration call based on virus spread and variants, Dr. Bogoch explains\nThe World Health Organization (WHO) is set to decide Friday, whether the COVID-19 pandemic still qualifies for an international emergency declaration title a decision that will involve factoring in how the virus and its variants are impacting countries around the world, says an infectious disease expert.\nThousands of Maritimers still without power after Thursday storm\nThursdays wet and windy storm has knocked out power to thousands of people in the Maritimes, most of which are in Nova Scotia.\nNewly discovered asteroid makes one of the closest approaches of Earth\nAn asteroid the size of a box truck made one of the closest passes of planet Earth ever recorded.\nRussian warship armed with advanced missiles sails into western Atlantic in strategic 'chess game'\nIn an unusual move, the Russian Defence Ministry broadcast that one of its newest warships, the Admiral Gorshkov, had tested the strike capabilities of a hypersonic Zircon missile in a virtual drill.\nCanadians fighting in Ukraine, despite no monitoring from government, speak out on war and loss\nOn Feb. 27, 2022, Ukrainian President Volodymyr Zelenskyy said his country needed fighters, and foreigners were welcome to join the front line in the defence against Russian aggression. Some Canadians were among the first to answer the call.\nHome Depot gave personal data to Meta without valid customer consent: watchdog\nThe federal privacy watchdog says Home Depot shared details from electronic receipts with Meta, which operates the Facebook social media platform, without the knowledge or consent of customers.\nProvincial governments not jumping to act on tighter alcohol warning guidelines\nPoliticians in charge of provincial and territorial liquor laws aren't hurrying to adopt or promote newly updated guidelines that advise a steep drop in Canadian drinking habits.\nNo more expensing home internet bills to taxpayers, Tory and Liberal MPs told\nThe federal Liberal government is joining the Opposition Conservatives in no longer allowing its members of Parliament to expense taxpayers for home internet services.\nSlow-burning, independent Canadian horror film yields international success\nThe immersive, slow-burn experience viewers get from 'Skinamarink' is the antithesis of seconds-long videos seen on TikTok, a platform that helped create buzz for the low-budget Canadian horror film months before its release.",
      "snippet": "<b>Nvidia</b> Corp Chief Executive Officer Jensen Huang on Tuesday said that the burgeoning field of artificial intelligence will create powerful tools that ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T14:19:00",
      "provider": {
        "name": "ctvnews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2023/1/27/nvidia-s-jensen-huang-in-2017-1-6248844-1674829097593.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "ctvnews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.ctvnews.ca/sci-tech/nvidia-ceo-says-ai-will-need-regulation-social-norms-1.6248839"
      }
    },
    {
      "id": "1001870589902933620",
      "title": "Ubuntu Pro is now available for everyone to use",
      "url": "https://www.techradar.com/news/ubuntu-pro-is-now-available-for-everyone-to-use",
      "description": "Following a successful beta testing period with companies like Nvidia and Google, Ubuntu Pro is now available to all.",
      "body": "(Image credit: Future)\nAudio player loading\nFollowing a three-month beta testing period, Canonical has announced the general availability of Ubuntu Pro which promises even better, timely CVE patches and compliance with a range of regimes like HIPAA and PCI-DSS.\nIts set to be available to a varied group of users and promises to be especially affordable (or, in some cases, free).\nCanonical, the company behind the Ubuntu OS, is keen to stress its history spanning almost two decades in which it has delivered timely security updates, and hopes to appeal to a more stringent market with its new Pro version.\nour survey\n(opens in new tab)\nand telling us your opinions and views about the tech industry in 2023. It will only take a few minutes and all your answers will be anonymous and confidential. Thank you again for helping us make TechRadar Pro even better.\nD. Athow, Managing Editor\nUbuntu Pro\nBeyond the 10-year security coverage and optional technical support that Ubuntu users already get, subscribers of the Pro version will unlock an additional 23,000 packages. The coverage extends to thousands of applications and toolchains, including Node.js, Python, Rust, and WordPress.\nPro will be available to all LTS versions from 16.04 LTS (Xenial Xerus), which became available in April 2016.\nRead more\nUbuntu 22.10 is here to boost IoT developers and enterprise users alike\nUbuntu Pro has already been in beta testing since October last year, and various prominent companies like Nvidia, Google, and VMWare have all taken part.\nAs part of the package, Pro users will be able to access FIPS-certified cryptographic packages, which are generally required for Federal Governments and other organizations subject to compliance regimes like FedRAMP, HIPAA, and PCI-DSS.\nPricing depends on your use case, ranging from $25 per year for\nworkstation\nto $500 per year for server, with a 30-day free trial. Its also available on public cloud marketplaces (like AWS, Azure, and Google Cloud) with an hourly pricing structure, which Ubuntu says is around 3.5% of the average underlying compute cost.\nFor personal and small-scale commercial users with up to five machines, like during the beta period, Ubuntu Pro remains free of charge, while official Ubuntu community members can use Pro on up to 50 machines.\nCheck out the\nfor the ultimate portability\nAre you a pro? Subscribe to our newsletter\nSign up to theTechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nContact me with news and offers from other Future brands\nReceive email from us on behalf of our trusted partners or sponsors\nBy submitting your information you agree to the",
      "snippet": "Following a successful beta testing period with companies like <b>Nvidia</b> and Google, Ubuntu Pro is now available to all. (Image credit: Future) Audio ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T14:05:22",
      "provider": {
        "name": "techradar",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/P6VcwGznoXwovzAzfdq68N.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "techradar",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.techradar.com/news/ubuntu-pro-is-now-available-for-everyone-to-use"
      }
    },
    {
      "id": "7917534895381476011",
      "title": "Nvidia's Eye Contact Effect Changes the Game for Video Creators",
      "url": "https://www.technewsworld.com/story/nvidias-eye-contact-effect-changes-the-game-for-video-content-creators-177717.html?rss=1",
      "description": "Nvidia's new effect adjusts the eyes of the speaker to reproduce eye contact with the camera. This is achieved using the AI horsepower in Nvidias GPUs to estimate and align gaze precisely.",
      "body": "Nvidias Eye Contact Effect Changes the Game for Video Content Creators\nBy Mark N. Vena\nJanuary 27, 2023 5:00 AM PT\nEmail Article\nNvidia Broadcast App | Image Credit: Nvidia\nVideoconferencing, podcasts, and webinars surged in popularity during the pandemic years of 2020 and 2021 as remote work became part of the new normal. With the pandemic now in the rearview mirror, video communications techniques have shown no sign of slowing down.\nWhats been amusing to me is that despite the pervasiveness of video communications, how unflattering we often appear on camera using underpowered, low-resolution webcams get too little attention. Poor lighting, mainly when using video calls from home, is undoubtedly a big problem. Sub-HD resolution webcams built into most, even high-end, laptops dont help.\nWithout the professional assets available in a professional television studio, politicians, celebrities, and industry experts often look ghastly when being interviewed remotely from their homes.\nRoutine videoconferencing calls from home are especially vulnerable to an amateur hour look and feel, particularly during a formal presentation where wandering eye gaze (e.g., not looking directly into the webcam) can distract the viewer.\nThe location of the webcam is responsible for this unwelcome effect because the camera is generally integrated at the top of the laptop panel or on a separate stand that is difficult to place in front of a desktop display.\nBecause typical videoconferencing using a desktop or laptop PC doesnt have proper teleprompter functionality, which is complex, bulky, and expensive, its nearly impossible to read speaker notes without avoiding the annoying phenomenon of a horrible webcam angle that stares up or down your nose.\nAre there any quick ways to fix the eye gaze problem?\nThere are a few ways to mitigate this problem in a typical desktop or laptop home setup. However, these approaches are strictly gimmicky and dont eliminate the problem.\nA couple of companies provide tiny external webcams, often equipped without an integrated microphone, to reduce the devices size and allow placement in the center of your screen, in front of any text material or the viewing window itself of the video app you are using.\nThese cameras use a thin wire draped and clipped to the top of the display. In this way, you look directly into the webcam and can see most, though not all, of the presentation or text material you are presenting.\nStill, another method is using a clear piece of acrylic plastic that allows you to mount nearly any webcam and hook it to the top of the display so that the webcam suspends itself in front of the displays center point.\nThe advantage of this approach is that it frees you to use your preferred webcam. The downside is that the size of the webcam and the acrylic plastic apparatus often obscures a good portion of the screen, making it less useful as a teleprompter alternative.\nDown the road, we may see laptop and PC displays with integrated webcams behind the LCD panel, which are invisible to the user. While this is an ideal fix for the problem Ive described above, the downside is that the cost of these specialty displays will be very high, which most manufacturers will be reticent to offer due to the price elasticity implications.\nAI can fix eye contact issues conveniently and cost-effectively.\nThe idea of using artificial intelligence to mitigate or eliminate eye contact during videoconference calls is not new. When done correctly, AI can eliminate the need to purchase expensive teleprompting equipment that television studios use or resort to some of the gimmicky methods Ive described above.\nThe challenge with employing AI to perform eye contact corrections on the fly (live) or even in a recorded scenario is that it requires processor horsepower to do much of the heavy lifting.\nApple Silicon has had this integrated capability for a few years with its iPhone chips. Not many users know that Apples FaceTime app has eye contact correction (which can be turned off), which ensures that your eye stare is focused on the middle of the screen, regardless of the orientation of the iPhone.\nEye Contact setting in Apples FaceTime app\nMicrosoft has also joined the AI party to fix eye contact issues. Last year, it announced that it would add eye contact solution capability to Windows 11 by leveraging the power of Qualcomms Arm solutions and taking advantage of neural processing unit (NPU) silicon to enhance video and audio in meetings  including subject framing, background noise suppression, and background blur.\nMany of these features have already been available on Microsofts Surface Pro X device, which uses an Arm chip. Still, Microsoft will broadly deploy this functionality on more compatible models from major PC OEMs this year.\nNvidia Broadcast With Eye Contact\nNvidias Broadcast app\n, which works on a wide range of Nvidia external graphics cards, is a robust AI tool that improves video calls and communications on x86-based PCs. Last week, Nvidia enhanced the utility in version 1.4 to support its implementation of Eye Contact, making it appear that the subject within the video is directly viewing the camera.\nThe new Eye Contact effect adjusts the eyes of the speaker to reproduce eye contact with the camera. This capability is achieved using the AI horsepower in Nvidias GPUs to estimate and align gaze precisely.\nThe new Eye Contact effect in Nvidia Broadcast 1.4 moves the eyes of the speaker to simulate eye contact with the camera. | Image Credit: Nvidia\nThe advantage of Nvidias approach is the capability is not confined to a single videoconferencing platform or app. Apple only supports its eye contact correction capability using iPhones FaceTime app. However, I wouldnt be surprised if Apple extends this capability to macOS users later this year in conjunction with its Continuity Camera capability.\nIn addition, Nvidia Broadcast provides Vignette functionality comparable to what many Instagram app users experience. This way, Nvidia Broadcast can generate an understated background blur to get an AI-simulated hazy visual on your webcam, immediately enhancing visual quality.\nSubstituting background images on videoconference calls is nothing new. Still, Nvidias approach will presumably offer better quality as it harnesses the power of its graphics cards, which are optimized for video content creation and gaming.\nClosing Thoughts\nThe eye contact feature in Nvidias Broadcast app is currently in beta form and is not suitable for deployment yet. Like any beta feature, it will suffer from inevitable glitches, and we should delay formal judgment of its quality until the production version is made available.\nMoreover, Nvidia Broadcast is not just a run-of-the-mill app but an open SDK with features that can be integrated into third-party apps. That opens up interesting new potential for third-party applications to directly leverage the functionality in Nvidia Broadcast.\nDespite that, Im amazed by some of the ad",
      "snippet": "... Eye Contact Effect Changes the Game for Video Content Creators By Mark N. Vena January 27, 2023 5:00 AM PT Email Article <b>Nvidia</b> Broadcast App.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T13:00:00",
      "provider": {
        "name": "technewsworld",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.technewsworld.com/wp-content/uploads/sites/3/2023/01/Nvidia-Broadcast-App.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "technewsworld",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.technewsworld.com/story/nvidias-eye-contact-effect-changes-the-game-for-video-content-creators-177717.html?rss=1"
      }
    },
    {
      "id": "401018913019873546",
      "title": "Lenovo Yoga Slim 7i Pro X Review: Portable Powerhouse",
      "url": "https://www.gadgets360.com/laptops/reviews/lenovo-yoga-slim-7i-pro-x-review-laptop-price-in-india-specifications-3728450",
      "description": "The Lenovo Yoga Slim 7i Pro X offers impressive features such as a 3K resolution display, slim chassis, and the option to spec it with an Nvidia RTX 3050 GPU. If you&#039;re a content creator, should this be your next Windows laptop? Find out in our review.",
      "body": "It has a 3K resolution display with Dolby Vision playback support\nYou can configure it with up to an Nvidia GeForce RTX 3050 GPU\nOverall performance is very good\nLenovo's Yoga line of 2-in-1, convertible laptops is popular, but its Yoga S or Slim series is equally interesting. These laptops are designed to be slim and powerful, offering a mix of multimedia capabilities and raw performance for those who don't need a convertible design. The Lenovo Yoga Slim 7i Pro X sits at the top of the stack and while the name is quite a mouthful, it's designed for content creators and professionals who need calibrated hardware for theirworkflows. Let's get into all the details so you can decide if this should be your next laptop.\nLenovo Yoga Slim 7i Pro X price in India\nThe Lenovo Yoga Slim 7i Pro X starts at Rs. 1,12,200 as per the Lenovo India website. The base variant comes with a 12th Gen Intel Core i5 CPU, 16GB of RAM, a 512GB SSD, and a 3K non-touch display. The configuration however, can be customised to suit your needs.Lenovo sent me a higher spec'd variant which had an Intel Core i7 CPU, 16GB of RAM, a 1TB SSD, and an Nvidia GeForce RTX 3050 GPU, priced at Rs. 1,54,100. The price can go higher if you opt for additional software, double the RAM, and a touchscreen display.\nThe Lenovo Yoga Slim 7i Pro X looks good in this Dark Teal colour\n\nLenovo Yoga Slim 7i Pro X design\nThe Lenovo Yoga Slim 7i Pro X looks like any other premium clamshell laptop. The lid can be opened up to 180 degrees, but not beyond that like other Yoga convertibles. I think the Dark Teal finish of my review unit looks very nice as it's not a common colour. The smooth matte texture is also easy on the fingers and doesn't attract fingerprints easily. All the edges and side panels havebeen thoughtfully rounded so this device is comfortable to hold and use. The laptop is moderately heavy, tipping the scales at a little over the claimed 1.4kg.\nXiaomi Notebook Pro 120G Review: All About That Display\nYou get a decent selection of ports on the Yoga Slim 7i Pro X. The left side has two Thunderbolt 4 ports (Type-C) for charging and video output, along with a full-sized HDMI 2.0 port. The right side of the laptop has a Type-A USB 3.2 (Gen 1) port, a headphone and microphone combo socket, the power button, and a toggle switch to disable the webcam and the Windows Hello IR camera for at the hardware level, so no malicious app can use them in the background, if you need privacy.\nThe 14.5-inch display on the Lenovo Yoga Slim 7i Pro X is quite immersive thanks to the slim bezels all around it, and good brightness. The IPS display has a 3K (3072 x 1920 pixels) resolution and 120Hz refresh rate.It comes factory calibrated with a claimed colour accuracy of Delta E<1. The display also supports Dolby Vision playback and Nvidia's G-Sync.\nThe Lenovo Yoga Slim 7i Pro X features two Thunderbolt 4 ports\n\nThe keyboard is evenly backlit with well-spaced keys, good travel, and relatively silent operation. There are perforated speaker grilles on either sides of the keyboard and a large trackpad below it. The exhaust vents are hidden near the display's hinge. The Lenovo Yoga Slim 7i Pro X ships with a 100W USB Type-C power adapter.\nAsus Zenbook 17 Fold OLED (UX9702) Review\nLenovo Yoga Slim 7i Pro X specifications\nLenovo's current configurations of the Yoga Slim 7i Pro X in India are based on Intel 12th Gen Core CPUs, but 13th Gen options should arrivesoon, just like the\nrecently refreshed\n. The variant I have has an Intel Core i7-12700H CPU with a total of 14 cores (six performance, eight efficiency). The 16GB of LPDDR5 RAM is soldered to the motherboard, so expansion isn't possible.\nMy unit is also kitted out with an Nvidia GeForce RTX 3050 GPU with 4GB of GDDR6 RAM. The stereo speakers are tuned by Harman and support Dolby Atmos. Other features include Wi-Fi 6E, Bluetooth 5.1, and a 4-cell 70WHr battery which is said to deliver up to 10 hours of battery life. There's no fingerprint sensor, but you get the IR camera for Windows Hello face recognition.\nThe backlit keyboard on the Lenovo Yoga Slim 7i Pro X is very comfortable for typing on\n\nThe Lenovo Yoga Slim 7i Pro X ships with Windows 11 Home, although you can upgrade to 11 Pro when configuringit. You get the typical Lenovo apps preinstalled such as Lenovo Vantage for keeping drivers and firmware updated, Lenovo Smart Appearance (webcam enhancements), Lenovo Voice, etc. The Yoga Slim 7i Pro X is also Nvidia Studio validated which means it's optimised to work better with creator apps such as Adobe Premiere Pro.\nHP Pavilion Plus Laptop 14 Review: Sophisticated Power\nLenovo Yoga Slim 7i Pro X performance and battery life\nWith the top-end specs ofmy review unit, the Lenovo Yoga Slim 7i Pro X was an absolute joy to use for both work and play. The exhaust fan stays silent in normal use cases but can be heard faintly when gaming or running other heavy workloads. Certain spots on the bottom of the laptop, near the intake vents, stay a bit warm even with light usage. When gaming, the base and some of the keys tend to get a little hot, probablybecause of the dedicated GPU.\nIf you'll be doing a lot of typing, then you'll be happy to know that the keyboard is very comfortable. The trackpad works just as well. This 3K non-touch display on the Lenovo Yoga Slim 7i Pro X offers sharp visuals with punchy colours. I found the brightnessto be more than adequate and the display's backlight intensity is automatically adjusted based on ambient light. By default, the Nvidia GPU runs in Optimus mode, which means it's only enabled when an application needs it. In order to use G-Sync in games, you'll need to switch to the GPU-only mode, but this will impact battery life.\nModern games such as Death Stranding run well on the Lenovo Yoga Slim 7i Pro X with an Nvidia RTX 3050 GPU\n\nBenchmark performance of the Lenovo Yoga Slim 7i Pro X was impressive. In Cinebench R20's single and multi-core tests, the laptop scored 682 and 5,025 points respectively. 3DMark Time Spy's graphics test suite returned 3,966 points. SSD performance was equally good. The 1TB SSD in my unit returned a little over 6GBps read speeds in sequential and random tests, and over 4.5GBps write speeds in sequential and random tests. Real-world tests ran well too. It took 1 minute, 12 seconds to compress a 3.7GB folder of assorted files, while encoding a 1.3GB AVI file to MKV using Handbrake took just 42 seconds.\nLG Gram 14 (14Z90Q) Review: Best Windows Alternative to the MacBook Air?\nSince my review unit had a decent GPU, I fired up a few popular games to see how well the Lenovo Yoga Slim 7i Pro X performs. Fortnite ran smoothly at a steady 30+fps at the High' graphics preset at full-HD. Death Stranding was also very playable at 1440p, using the High' graphics preset with Nvidia's DLSS enabled. This laptop can definitely handle AAA titles at moderate settings and resolutions, but it does get quite hot in the process.\nNetflix in Microsoft Edge detected the Dolby Vision-compatible d",
      "snippet": "... Yoga Slim 7i Pro X offers impressive features such as a 3K resolution display, slim chassis, and the option to spec it with an <b>Nvidia</b> RTX 3050 GPU.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T12:15:29",
      "provider": {
        "name": "gadgets360",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.gadgets360cdn.com/large/lenovo_yoga_slim_7i_pro_x_cover_review_gadgets360_1674817332881.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "gadgets360",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.gadgets360.com/laptops/reviews/lenovo-yoga-slim-7i-pro-x-review-laptop-price-in-india-specifications-3728450"
      }
    },
    {
      "id": "8786526356695770808",
      "title": "Intel Confirms Meteor Lake CPU Ramp In 2H 2023, Lunar Lake In 2024 For Client, Emerald Rapids In 2H 2023 & Granite Rapids In 2024 For Server",
      "url": "https://wccftech.com/intel-confirms-meteor-lake-cpu-ramp-in-2h-2023-lunar-lake-in-2024-for-client-emerald-rapids-in-2h-2023-granite-rapids-in-2024-for-server/",
      "description": "Intel has reaffirmed its production plans for next-gen Meteor Lake, Lunar Lake, Emerald Rapids, Granite Rapids CPUs for client & servers.",
      "body": "Jan 27, 2023 06:50 AM EST\n\nCopy Shortlink\nYesterday, Intel posted its most disastrous quarter in recent times with all major segments reporting losses but the company also reaffirmed that these results won't affect its internal execution and roadmap plans for next-gen client and server CPUs.\nIntel Meteor Lake & Lunar Lake CPUs Aim 2H 2023 & 2024 Ramp For Client, Emerald Rapids & Granite Rapids Aim 2023 & 2024 Launch, Respectively\nIntel has a lot of work to do to get back into the game and that's where all the new and upcoming products come in. According to Intel, the company is prepared to begin production of its Meteor Lake CPUs based on the Intel 4 process node today while a full-on ramp is expected in the second half of 2023. Intel states that both Intel 4 and Intel 3 process nodes are looking good and on track to become their first EUV-powered designs for the CCG and DCG.\nvia Intel\nIntel Aiming To Ship 1 Million Sapphire Rapids Xeon CPUs By Mid-2023\nStarting with the first product release of 2023, we have Intel's Sapphire Rapids Xeon CPUs which were launched on the 10th of January and it looks like Intel has landed some major customer & partner wins that included Dell Technologies, Google Cloud, HPE, Lenovo, Microsoft Azure, NVIDIA and Amazon amongst several others. Chipzilla expects Sapphire Rapids to ship 1 Million units by the mid of 2023 and that would also mark a positive trend for DRAM makers as we recently told.\nOn the product front, the PRQ (product release qualification) of SPR (Sapphire Rapids) in Q3 and the formal introduction of our 4th Gen Intel Xeon Scalable CPU and Xeon CPU Max series, better known to many of you as SPR and SPR HBM (Sapphire Rapids with high bandwidth memory), respectively, on Jan 10 was a great milestone.\nIt was particularly satisfying to host a customer-centered event including testimonials from Dell, Google Cloud, HPE, Lenovo, Microsoft Azure, and NVIDIA, among others. We are thrilled to be ramping production to meet a strong backlog of demand and we are on track to ship 1 million units by mid-year. In addition, as part of AXGs move into DCAI, it is noteworthy that our Intel Flex Series, optimized for and showing clear leadership in media stream density and visual quality, is now shipping initial deployments with large CSPs (communication service providers) and MNCs (multinational corporations), enabling large-scale cloud gaming and media delivery deployments.\nvia Intel\nIntel Xeon Emerald Rapids Launch In 2H 2023, Granite Rapids On Track For 2024\nTalking about future Xeon chips, Intel reaffirmed that its Emerald Rapids CPUs are sampling and they have completed the first power-on with top customers. The Emerald Rapids CPUs will be a refresh of sorts of the Sapphire Rapids lineup, acting as an intermediary between that and the Granite Rapids family. The CPUs are expected to launch in 2H 2023. The Granite Rapids CPUs are expected to launch in 2024 and are already running multiple operating systems & various configs at Intel's labs. The Sierra Forest CPUs featuring an all-E-Core design are also on track for a 2024 launch.\nOur DCAI roadmap only improves from here. Emerald Rapids is sampling and has completed power-on with top OEM (original equipment manufacturer) and CSP customers, and it remains on track to launch in the second half of 2023. Granite Rapids, our next performance core addition to the Xeon portfolio is on-track to launch in 2024, running multiple operating systems across many different configurations.\nFurther, our first Efficient-core product, Sierra Forrest, is also on on-track for 2024. Lastly, it is appropriate to continue to highlight PSG for its stand-out performance, delivering record Q4 revenue, up 42% year-over-year. We are planning to have a more fulsome look at our progress in DCAI at our next investor webinar later in Q1  stay tuned for the invitation.\nvia Intel\nIntel Meteor Lake CPUs In 2H 2023, Lunar Lake In 2H 2024 For Client Core Family\nBack to the client side of things, Intel's CCG will be working on two major products for 2023 and 2024. These include Meteor Lake which ramps up in 2H 2023 and Lunar Lake which ramps up in 2H 2024. Both CPU lineups are mobile first with Lunar Lake clearly labeled as being \"optimized for ultra-low power performance\". Do note that there's no mention of Arrow Lake but that's also going to launch sometime in 2024 with Lunar Lake more realistically being a 2025 product.\nMeteor Lake, our first disaggregated CPU built on Intel 4, remains on track for the second half of the year. And with MTL progressing well, its now appropriate to look forward to Lunar Lake, which is on track for production readiness in 2024, having taped-out its first silicon. Lunar Lake is optimized for ultra-low power performance, which will enable more of our PC partners to create ultra-thin-and-light systems for mobile users.\nIn addition, as we outlined on our webinar, we are excited by the strength of the Evo  brand, the introduction of Unison for leadership multidevice experiences as we ramp the more than 60 design wins, and the uniqueness of vPro in the enterprise market, helping our customers drive an almost 200% return on investment by deploying vPro platforms to their end users. Lastly as consumer graphics re-integrates into CCG, enthusiasm for our latest Alchemist-based discrete graphics products continues to build and we expect volume ramp through the year.\nvia Intel\nThe quoted information comes from Intel's EVP & GM of CCG (Client Computing Group), Michelle Johnston Holthaus, who has stated that the Lunar Lake family will feature a fresh new architecture and a brand new design built from the ground up. The architecture will mainly focus on bringing some big performance per watt improvements in the mobile space & more information is expected to be unveiled at the Financial Day on the\npress-only HotChips presentation\n, Intel revealed that the Lunar Lake family is originally aimed at the 15W low-power mobile CPU segment. The CPU will utilize a sub-20A node as its process technology alongside an external foundry node for various other IPs since this will be a multi-tiled chip design. You can expect all the latest and greatest innovations from Intel such as Foveros packaging (25um pitch). Now saying that these chips are optimized for mobile doesn't necessarily mean that they won't launch on the desktop platform but with\nreports coming out that Intel might shift its Meteor Lake chips away from desktops\nand do an intermediate refresh of sorts on the platform, it may also not be too farfetched to believe so.\nRest assured, we remain committed to creating value for our owners and to delivering the long-term strategic roadmap we laid out at the beginning of this journey, and we are confident in our ability to do so. We will: (1) Deliver on five nodes in four years, achieving process performance parity in 2024 and unquestioned leadership by 2025 with Intel 18A; (2) execute on an aggressive SPR ramp, introduce EMR (Emerald Rapids) in the second half of 2",
      "snippet": "... major customer & partner wins that included Dell Technologies, Google Cloud, HPE, Lenovo, Microsoft Azure, <b>NVIDIA</b> and Amazon amongst several others.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T11:50:13",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2023/01/newsroom-intel-4th-gen-intro-event-9.jpg.rendition.intel_.web_.1648.927.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/intel-confirms-meteor-lake-cpu-ramp-in-2h-2023-lunar-lake-in-2024-for-client-emerald-rapids-in-2h-2023-granite-rapids-in-2024-for-server/"
      }
    },
    {
      "id": "3834863901534866107",
      "title": "Booming Chinese Esports Hotel Business Now Adopting NVIDIA's Fastest GeForce RTX 4090 GPUs",
      "url": "https://wccftech.com/booming-chinese-esports-hotel-business-now-adopting-nvidias-fastest-geforce-rtx-4090-gpus/",
      "description": "In Asia, & more specifically in China, the growing Esports hotel business has started to adopt NVIDIA's GeForce RTX 4090 graphics cards.",
      "body": "Jan 27, 2023 05:57 AM EST\n\nCopy Shortlink\nIn Asia, and more specifically in China, the growing Esports hotel business has started to adopt NVIDIA's flagship GeForce RTX 4090 graphics cards.\n20,000 Esports Locales Expected In China By The End of 2023, Growing Hotel Business Adopts NVIDIA's Brand New GeForce RTX 40 GPUs\nInternet cafes are commonplace in coffee shops, hotels, and even their standalone spots. In the last decade, we have seen an uprising of online gaming centers, allowing users to pay for a set period and play on PC systems with superfast speeds and superior graphics than they may receive at home. The concept of Esports hotels is starting to spread throughout some regions, with China witnessing an estimated boom of 20,000 hotels in 2023.\nOne reason why these businesses (esports cafes and esports hotels) have been so lucrative is because of the adoption of brand-new technologies. In Ma'anshan, Anhui, an Esports hotel has adopted NVIDIA's brand new GeForce RTX 4090 graphics cards to make sure that their customers experience the best gaming performance in the time they spend playing games at the recreational spot.\nOne hotel owner in Ma'anshan, Anhui, wants to ensure that his occupants enjoy their stay and receive the ultimate gaming experience. The hotel is the most extensive gaming configuration in the area (this writer was able to locate two hotels with a significant focus on esports), housing over thirty systems using ZOTAC GAMING GeForce RTX 4090 graphics cards (only 29 are pictured below).\nI also like playingn games very much. I understand the gold content of RTX 4090, and I want to share it with every player who loves games in our [hotel].\nAlthough the environment has not been very good in the past year, we always firmly believe that the e-sports hotel industry is still in a period of rapid development, and it is worth our investment and layout in advance.\nWe also believe that after our high-end computer experience, we can't go back to where they played before.\n Esports hotel owner (Machine Translated)\nLooking at several booking websites, a typical stay can be as much as $29 a night. However, they do not mention the rate to use the various esports systems in select rooms. Below is an image of one room accommodating a few PC systems for esports.\nHotels such as this are increasing in popularity, especially with some of the occupants under 21. In China, the targeted age range for esports gamers is usually between fourteen and eighteen. Additionally, some hotels that offer similar PC systems but are used for business do not allow children. Furthermore, gaming has become a very expensive hobby and with cards such as RTX 4090 priced around $2000 US, these hotels allow gamers to try out and experience what's in store for them first hand.\nDue to the enormous popularity of gaming each year, more and more hotels are welcoming gamers to stay and play on systems, such as the ones above, that utilize GPUs that are currently the fastest globally.\nNews Source:",
      "snippet": "In Asia, & more specifically in China, the growing Esports hotel business has started to adopt <b><b>NVIDIA</b>'s</b> GeForce RTX 4090 graphics cards.\nJan 27, 2023 05:57 AM EST Copy Shortlink In Asia, and more specifically in China, the growing Esports hotel business has started to adopt <b><b>NVIDIA</b>'s</b> flagship GeForce RTX 4090 graphics cards.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T10:57:22",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2023/01/China-Esports-Gaming-Hotel-with-NVIDIA-GeForce-RTX-4090-GPUs-_2-gigapixel-standard-scale-4_00x-Custom-728x411.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/booming-chinese-esports-hotel-business-now-adopting-nvidias-fastest-geforce-rtx-4090-gpus/"
      }
    },
    {
      "id": "6471784477852936407",
      "title": "Hardware dependence -- what it is and why it's a problem [Q&A]",
      "url": "https://betanews.com/2023/01/27/hardware-dependence-what-it-is-and-why-its-a-problem-qa/",
      "description": "We're currently in the middle of a global chip shortage, while at the same time major hardware companies like Intel, NVIDIA and Arm are looking to dominate the hardware market for AI and ML applications.",
      "body": "Tweet\nWe're currently in the middle of a global chip shortage, while at the same time major hardware companies like Intel, NVIDIA and Arm are looking to dominate the hardware market for AI and ML applications.\nThis creates something of an issue where models have to be tuned and optimized according to specific hardware specifications and software frameworks, sacrificing the portability that the industry has come to take for granted..\nWe spoke to Jason Knight, CPO at OctoML, to find out why hardware dependence is becoming such an issue.\nAdvertisement\nBN: Can you describe what you mean when you say 'hardware dependence' in relation to deploying ML models and applications?\nJK: Generally, when ML models are created and trained, it's done by a data scientist using software and hardware that is well suited to handling large amounts of compute and data. This creates implicit and explicit dependencies between the hardware, where a model was trained and where it can be deployed.\nLet's take this example: Python is the lingua-franca of ML training today, but a developer might want to deploy that model onto a device or codebase where Python is not a good choice. Because interpreted languages like Python are rarely used in embedded and mobile contexts, the developer may not be able to deploy the model at all without expending significant porting effort.\nMore subtle hardware dependence shows up when a model is 'fast enough' when run on the hardware it was trained on, but is either too slow -- or doesn't fit at all -- on the device that you'd like to deploy your model and application to. The performance problems can come from either raw theoretical performance not being high enough -- for example where the particular quantization machinery is not present -- or more subtly: the software implementations of operators that you relied upon (and worked well) when building the model give lower performance on your target device because of software limitations, as opposed to hardware limitations.\nFurther dependence can also be introduced by the software stacks surrounding the model execution. For example, you may be familiar with installation and support of one GPU vendor's device drivers and library limitations, only to run into issues when switching to another vendor's stack and are now missing performance counters, debug capabilities, or thermal throttling characteristics that you were used to on another hardware platform.\nAll of these factors combine to create a very high barrier for a developer, team, or company to switch from one platform in training to another for deployment (or migrating from one deployment platform to another).\nBN: What are the repercussions of this dependence?\nJK: The 30,000 foot view is that this lack of agility is slowing down innovation. We can all firmly agree that ML is no longer a 'visionary' concept. Businesses are deriving practical business value, and increasing investments each year. ML is helping advance the sciences and healthcare. However, we're hitting a point of diminishing returns. ROI could be greater; the speed at which ML helps uncover breakthroughs in the aforementioned areas could be faster.\nBut the resources/costs/time it takes to deploy ML are driving businesses to focus more on budgets than innovation -- especially now given the economy. And this doesn't come as a surprise given 90 percent of ML compute costs are tied to inferencing production workloads.\nThis leaves many in the industry scratching their heads wondering: why don't we have a cost-effective option to shift around models at peak performance like we do with standard software development in the cloud? This is the major problem we face in the ML industry today.\nBN: There is software that comes 'built into' certain pieces of hardware? Is that not enough?\nJK: Even in a perfect world, where all ML software that hardware vendors provide gives optimal performance for every ML workload and has every feature that developers desire, there are still hardware limitations such as memory size, memory bandwidth, compute speed, quantization format support, etc. that create barriers between moving ML models between one hardware platform and another. There are also the switching costs described above between training and deployment software ecosystems.\nAnd lets be clear: ML software at all levels of the stack is far from perfect. The field moves rapidly and the search to converge on shared/optimal software patterns is still a work in progress. We are still a long way off from the ML equivalent of POSIX, x86, OSI networking stack, HTTP, or other near universal API convergences that have happened in computings history. And as a result, there are still many rough spots in the implementations that you find as hardware vendors struggle to keep up with the pace of innovation.\nBN: How can ML practitioners break this dependence?\nJK: The shortcut path that most ML practitioners use today (wherever possible) is to work around the problem by trying to maintain a training environment (both software and hardware) that is as similar as possible to your deployment environment. However, this is often costly (oversized/specialized hardware at deployment time) and many practitioners do not have this choice. This 'workaround' is one of the reasons why NVIDIA has been so strong in the ML market at large: their high market penetration in ML training puts the center of 'ML ecosystem mass' strongly in their favor.\nTo break the dependence, we need better abstractions between ML practitioners and the hardware that they depend on. This will take time (as all industry consolidations do) and doubly so because the pace of innovation in ML is still so rapid. I expect well see the most concentrated attempts at breaking the attempts come from cloud providers (who would love for their users to migrate compute heavy ML workloads onto their increasingly proprietary compute platforms) and motivated startups who are able to apply innovative solutions to creating these new abstractions. One example of this is OctoML, who uses machine learning to develop portable ML software experiences for users to take a model and optimize it for a range of hardware.\nBN: Do you think this is a problem that can be surpassed now or will it take several years?\nJK: We can make significant inroads with focused efforts by abstracting away some of this complexity for users. But for the broader industry to coalesce on one or two APIs/frameworks/open standards will take five plus years, if ever.\nTo see how this could play out, look at the distributed computing industry where we have Kubernetes as the defacto standard in place today, yet there is still a significant amount of innovation happening in the Function-as-a-Service domain to eclipse Kubernetes as the API to deploy web workloads onto. Or go even further back to the database industry which has recently seen the explosion of NoSQL and now hosted data lake platforms like Snowflake.\nBN: Ultimately, what will hardware independence enable?\nJK: Hardware",
      "snippet": "... chip shortage, while at the same time major hardware companies like Intel, <b>NVIDIA</b> and Arm are looking to dominate the hardware market for AI and ML ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T10:28:56",
      "provider": {
        "name": "betanews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://betanews.com/wp-content/uploads/2016/01/firewall_security-50x50.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "betanews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://betanews.com/2023/01/27/hardware-dependence-what-it-is-and-why-its-a-problem-qa/"
      }
    },
    {
      "id": "4180698219490769083",
      "title": "New AI Tech Gives Webcam Users Constant, Creepy Eye Contact",
      "url": "https://www.gizmodo.com.au/2023/01/new-ai-tech-gives-twitch-streamers-constant-creepy-eye-contact/",
      "description": "Nvidias latest streaming software update gives you weird, always-staring eyes, for better engagement",
      "body": "visualperception\nImage: Nvidia\nNvidias come up with new AI-powered tech that swaps out your real eyes for digital ones that will never stop looking at your webcam. Its very creepy, and one more sign of how unnatural you have to act online to become a popular streamer in 2023.\nThats just how it is: To succeed in the world of livestreaming, you need to be on all the time, always engaged, and never taking too many breaks for fear of shrinking your potentially fickle audience. It can quickly lead to burnout. Time and time again weve seen big, medium, and small streamers lose their passion for playing games online, leading to extended breaks, panic attacks, and more. But what if an AI-powered tool could help you fake some of that oh-so-important engagement? Enter Nvidias latest update to its Broadcast software.\nThis suite of tools is meant to help you look and sound better as you stream, with features like background removal and keyboard noise suppression. As of this new version you can, with the push of a button, now apply fake, AI-powered eyeballs to your real human face. And these new eyes will stare directly at the camera at all times, letting you never stop engaging with your audience even as you read your chat or look around at other things in your room. It looks wild, and very creepy!\n\nJanuary 17, 2023\nSome have suggested that this tech could help people with autism who struggle to keep eye contact during meetings and livestreams. And while I respect that use case, I do question if this is the path we want to go down. I dont think constant eye contact  especially creepy, direct staring eye contact like this  is something we all need or should want. I certainly dont think pasting creepy AI eyes on everyone is a good thing. And as pointed out by one tweet, this kind of static, dead stare is not how people actually look when talking to large groups. Looking away or toward other people and cameras is natural, and can be useful and even important.\nOnline reactions to this new tech have included people freaking out over how creepy and weird it looks and pointing out how unnatural it feels. Even so, you can also find a lot more positive responses to the above tweet and other online examples of this strange new AI gizmo: people excited about how it will help their YouTube videos or livestreams on Twitch, and happy they can read chat or look away from the stream, while their audience is tricked into thinking they are still engaged with them. To me that just seems like a really unhealthy (and unsustainable) mindset that will eventually lead to more burnout that AI-powered tech cant fix, treat, or prevent.\nShare this Story",
      "snippet": "visualperception Image: <b>Nvidia <b>Nvidia</b>s</b> come up with new AI-powered tech that swaps out your real eyes for digital ones that will never stop looking ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T01:30:55",
      "provider": {
        "name": "gizmodo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2023/01/27/eye-contact.png?quality=80&resize=1280,720",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "gizmodo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.gizmodo.com.au/2023/01/new-ai-tech-gives-twitch-streamers-constant-creepy-eye-contact/"
      }
    },
    {
      "id": "5177285955017858241",
      "title": "Zacks Investment Ideas feature highlights: SPY SMH Nvidia and XBI",
      "url": "https://www.nasdaq.com/articles/zacks-investment-ideas-feature-highlights:-spy-smh-nvidia-and-xbi",
      "description": "For Immediate Release Chicago, IL  January 27, 2023  Today, Zacks Investment Ideas feature highlights Spdr S&P 500 ETF SPY, Vaneck Semiconductor ETF SMH, Nvidia NVDA and SPDR S&P Biotech ETF XBI.",
      "body": "->\nFor Immediate Release\nChicago, IL  January 27, 2023  Today, Zacks Investment Ideas feature highlights Spdr S&P 500 ETF SPY, Vaneck Semiconductor ETF SMH, Nvidia NVDA and SPDR S&P Biotech ETF XBI.\nThis \"Golden\" Technical Indicator Is Triggering Across the Market\nWhat Is a Golden Cross?\nTechnical analysis is the best way for investors to determine potential trend changes in individual equities and equity markets. Though technical analysis can get complicated, simple and highly reliable signals exist for analysts who prefer \"bar napkin\" technical research. One such signal is the \"Golden Cross\". Golden Cross refers to the phenomenon where a faster-moving average (50-day MA is most common) crosses over a slower moving average (200-day MA).\nWhen a Golden Cross triggers in a particular security or index, it is a signal to technical analysts that a major trend change has occurred, and the long-term trend has flipped from bearish to bullish.\nDeath Cross Means Caution\nOn the contrary, a \"Death Cross\" is the opposite of a Golden Cross. A Death Cross triggers when the short-term moving average (50-day MA) is above the longer-term moving average (200-day MA) and crosses below it. In March of last year, a death cross in the Invesco Nasdaq 100 ETF  was an early signal that 2022 would be a rough year for bulls.\nPros and Cons of Crosses\nThe Golden Cross signal has many positives, which include:\n      Ease of identification: Simply bring up a daily chart of an instrument and add the 50- and 200-day MAs.\n      Eliminates Guesswork: By becoming more mechanical, investors can evaluate trend changes based on fact, not bias.\n      A Meaningful Signal: Because cross signals are rare, they are more meaningful.\nLike all signals, crosses are not perfect. Cons include:\n      Delayed Response: Since the signal is long-term, it does usually work right away.\n      False Signals: Investors should be cautious in a sideways market, as the cross can produce false signals.\nWhat Are the Market and Key Industry Groups Telling Us?\nIn general, the pros outweigh the cons for investors looking for a largely reliable long-term signal. At present, some key markets and stocks are nearing signals or have already triggered them. For example, the Spdr S&P 500 ETF, the most widely followed market ETF, is approaching a Golden Cross. A successful cross in this index would bode well for U.S. markets in 2023.\nWednesday, the Vaneck Semiconductor ETF triggered a Golden Cross. Semiconductors are a key industry group and often lead the market higher. Recent strides in AI are sending stocks like Nvidiahigher.\nAnother welcome sign is that beaten-down industries like biotech are now triggering Golden Crosses. The SPDR S&P Biotech ETF is the most popular ETF tracking the space. Both large-cap and small-cap biotech stocks are participating in the rally.\nBreakdown\nGolden Crosses and Death Crosses have proven to be reliable indicators in past years. Investors should understand the pros and cons of the signal and accept that it is not a panacea but rather an indication of a potential trend change. Looking at today's market, several important industry groups have already triggered Golden Crosses  though the most significant signal has yet to trigger. Watch to see if the S&P 500 can trigger a Golden Cross to confirm that the overall market has shifted back to the bull side.\nWhy Haven't You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit\nfor information about the performance numbers displayed in this press release.\n5 Stocks Set to Double\nEach was handpicked by a Zacks expert as the #1 favorite stock to gain +100% or more in 2021. Previous recommendations have soared +143.0%, +175.9%, +498.3% and +673.0%.\nMost of the stocks in this report are flying under Wall Street radar, which provides a great opportunity to get in on the ground floor.",
      "snippet": "... 2023 Today, Zacks Investment Ideas feature highlights Spdr S&P 500 ETF SPY, Vaneck Semiconductor ETF SMH, <b>Nvidia</b> NVDA and SPDR S&P Biotech ETF XBI.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/zacks-investment-ideas-feature-highlights:-spy-smh-nvidia-and-xbi"
      }
    },
    {
      "id": "8807645192940244439",
      "title": "Is It Too Late to Buy Nvidia Stock?",
      "url": "https://www.nasdaq.com/articles/is-it-too-late-to-buy-nvidia-stock-5",
      "description": "Shares of Nvidia (NASDAQ: NVDA) have been in red-hot form over the past three months, with the chipmaker's stock rising 50% as investors seem to have regained confidence in semiconductor stocks following a terrible 2022.",
      "body": "(NASDAQ: NVDA)\nhave been in red-hot form over the past three months, with the chipmaker's stock rising 50% as investors seem to have regained confidence in semiconductor stocks following a terrible 2022.\nThe PHLX Semiconductor Sector index is up an impressive 25% in the past three months, which might seem a tad surprising given the bleak semiconductor industry outlook for 2023. Gartner, for instance, forecasts a 3.6% decline in global semiconductor revenue this year.\nDoes this mean that Nvidia's rally could be cut short, especially considering the massive headwind it faces in the form of weak graphics card demand? Or should investors continue buying the stock in the hope that the chipmaker will sustain its momentum and crush the market in 2023? Let's find out.\nNvidia gets a price-target hike, but can it deliver?\nBarclays has adopted a positive stance on chipmakers with exposure to the data center, smartphone, and personal computer (PC) markets.\nNvidia relies on data centers and PCs for a nice chunk of its revenue. It also stands to gain from the growing adoption of artificial-intelligence (AI) applications, which require massive computing power in data centers that Nvidia's graphics processing units (GPUs) provide. As a result, Barclays has increased its price target on Nvidia stock to $250 from $170. The updated price target represents a 29% upside from current levels.\nIt won't be surprising to see the data center business turn out to be a key growth driver for Nvidia this year since it has been doing the heavy lifting for the company at a time when the gaming business is in the soup. In the third quarter of fiscal 2023, for instance, Nvidia's data center revenue increased 31% year over year while gaming revenue was down 51%.\nMoreover, the data center business produced 64% of the chipmaker's total revenue, which means that it can move the needle in a big way for the company.\nA strong showing from the data center business will be the key to Nvidia's growth in fiscal 2024. Analysts anticipate the company will deliver a 9% increase in revenue in fiscal 2024 to $29.3 billion, as well as a 32% spike in earnings. Those numbers would be a major improvement over fiscal 2023's estimate of flat top-line growth and a 26% drop in earnings per share.\nNvidia may be able to meet or even exceed Wall Street's estimates as it is about to enter a new market. The chipmaker's ARM server CPUs (central processing units) are set to hit the market in 2023, and Nvidia is attacking this market at an opportune moment. ARM CPUs are expected to capture a quarter of the server processor market by 2025 as compared to 7.1% in the second quarter of 2022.\nMore importantly, the ARM server CPU market is expected to generate $16 billion in revenue in 2023, a number that could jump to $82 billion by 2030 as per estimates compiled by Statista. So the addition of ARM server processors to Nvidia's portfolio should give the company a solid opportunity to amplify its data center revenue from this year.\nAlso, Nvidia has a tight grip on the market for data-center graphics processing units (GPUs). IDC estimates that the company was sitting on a massive 91% of the enterprise GPU market in 2021, while rival Advanced Micro Devices' share was in the single digits.\nGrand View Research estimates that sales of data center GPUs could increase at an annual rate of 23.5% through 2030 thanks to their use in supercomputers, AI applications, medical imaging, and drug research, among other areas.\nSo the healthy prospects of the data center CPU and GPU market could be a nice tailwind for Nvidia this year and beyond. The company might be able to deliver faster-than-expected growth thanks to the data center catalyst, and the stock could head higher as a result. But the bad news for investors is that Nvidia's rally has made the stock very expensive.\nNvidia stock needs to justify its price\nNvidia stock is now trading at a rich valuation. The chipmaker has a price-to-sales ratio of 17 and a price-to-earnings (P/E) ratio of 82. The current earnings multiple is way higher than Nvidia's five-year average P/E of 59. Meanwhile, the sales multiple is also well above the S&P 500's reading of 2.4.\nInvestors might not be comfortable paying so much for a company that's facing a massive threat in one of its key businesses. And Nvidia's recent results haven't been all that inspiring to warrant such a steep valuation. Had the company been firing on all cylinders and growing rapidly, growth investors may have considered putting their money on Nvidia.\nBut that isn't the case, and Nvidia will have to substantially accelerate its growth to justify its valuation. That's why investors who have missed its recent rally might want to wait for a better entry point since it is too late to buy this tech stock right now.\n10 stocks we like better than Nvidia\nWhen our award-winning analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Nvidia wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
      "snippet": "Shares of <b>Nvidia</b> (NASDAQ: NVDA) have been in red-hot form over the past three months, with the chipmaker's stock rising 50% as investors seem to have ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/is-it-too-late-to-buy-nvidia-stock-5"
      }
    },
    {
      "id": "6732074664804814338",
      "title": "Is Intel's Downfall Good News for AMD and Nvidia Investors?",
      "url": "https://www.nasdaq.com/articles/is-intels-downfall-good-news-for-amd-and-nvidia-investors",
      "description": "Today's video focuses on Intel's (NASDAQ: INTC) earnings report and how it might affect Advanced Micro Devices (NASDAQ: AMD) and Nvidia (NASDAQ: NVDA). Is Intel's problem isolated, or should semiconductor investors be worried? Check out the short video to learn more, consider sub",
      "body": "(NASDAQ: NVDA)\n. Is Intel's problem isolated, or should semiconductor investors be worried? Check out the short video to learn more, consider subscribing, and click the special offer link below.\n*Stock prices used were the after-market prices of Jan. 26, 2023. The video was published on Jan. 26, 2023.\n10 stocks we like better than Intel\nWhen our award-winning analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Intel wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
      "snippet": "... video focuses on Intel's (NASDAQ: INTC) earnings report and how it might affect Advanced Micro Devices (NASDAQ: AMD) and <b>Nvidia</b> (NASDAQ: NVDA).",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/is-intels-downfall-good-news-for-amd-and-nvidia-investors"
      }
    },
    {
      "id": "6739169802707080144",
      "title": "Chip Stocks Are Expanding Into Software Markets -- Is This a Bad Move?",
      "url": "https://www.nasdaq.com/articles/chip-stocks-are-expanding-into-software-markets-is-this-a-bad-move",
      "description": "In today's video, Jose Najarro and Nick Rossolillo discuss Nvidia (NASDAQ: NVDA), Synopsys (NASDAQ: SNPS), Cadence (NASDAQ: CDNS), Ansys (NASDAQ: ANSS), Siemens (OTC: SIEGY), and how chips are given a purpose via software applications. Jose does have some concerns about these sof",
      "body": "(OTC: SIEGY)\n, and how chips are given a purpose via software applications. Jose does have some concerns about these software investments. Check out the short video to learn more, consider subscribing, and click the special offer link below.\n*Stock prices used were the market prices of Jan. 24, 2023. The video was published on Jan. 24, 2023.\n10 stocks we like better than Synopsys\nWhen our award-winning analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Synopsys wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
      "snippet": "In today's video, Jose Najarro and Nick Rossolillo discuss <b>Nvidia</b> (NASDAQ: NVDA), Synopsys (NASDAQ: SNPS), Cadence (NASDAQ: CDNS), Ansys (NASDAQ: ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/chip-stocks-are-expanding-into-software-markets-is-this-a-bad-move"
      }
    },
    {
      "id": "7007242879945268939",
      "title": "Why Nvidia Can Continue to Grow in This Important Market",
      "url": "https://www.nasdaq.com/articles/why-nvidia-can-continue-to-grow-in-this-important-market",
      "description": "Today's video focuses on Nvidia (NASDAQ: NVDA) and recent news that its products will be used to upgrade the Berzelius supercomputer at Linkping University in Sweden. The supercomputer will use various Nvidia products, from its data center infrastructure solutions to numerous so",
      "body": "(NASDAQ: NVDA)\nand recent news that its products will be used to upgrade the Berzelius supercomputer at Linkping University in Sweden. The supercomputer will use various Nvidia products, from its data center infrastructure solutions to numerous software solutions. Check out the short video to learn more, consider subscribing, and click the special offer link below.\n*Stock prices used were the market prices of January 26, 2023. The video was published on January 26, 2023.\nFind out why Nvidia is one of the 10 best stocks to buy now\nOur award-winning analyst team has spent more than a decade beating the market. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\nThey just revealed their ten top stock picks for investors to buy right now. Nvidia is on the list -- but there are nine others you may be overlooking.",
      "snippet": "Today's video focuses on <b>Nvidia</b> (NASDAQ: NVDA) and recent news that its products will be used to upgrade the Berzelius supercomputer at Linkping ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/why-nvidia-can-continue-to-grow-in-this-important-market"
      }
    },
    {
      "id": "1034630541251517020",
      "title": "Members Trust Co Reduces Stake in NVIDIA Co. (NASDAQ:NVDA)",
      "url": "https://www.wkrb13.com/2023/01/26/members-trust-co-reduces-stake-in-nvidia-co-nasdaqnvda.html",
      "description": "Read Members Trust Co Reduces Stake in NVIDIA Co. (NASDAQ:NVDA) at WKRB News",
      "body": "alerts:\nAnalysts Set New Price Targets\nSeveral analysts have commented on the company. Morgan Stanley cut their target price on NVIDIA from $182.00 to $175.00 and set an equal weight rating on the stock in a research note on Thursday, November 17th. Summit Insights upgraded NVIDIA from a hold rating to a buy rating in a research report on Wednesday, November 16th. Credit Suisse Group  reiterated an outperform rating and set a $210.00 target price (up from $205.00) on shares of NVIDIA in a research report on Wednesday, November 16th. Cowen lifted their target price on NVIDIA from $200.00 to $220.00 in a research report on Monday, December 12th. Finally, StockNews.com downgraded NVIDIA from a hold rating to a sell rating in a research report on Thursday, October 20th. Two research analysts have rated the stock with a sell rating, nine have issued  a hold rating, twenty-three have assigned  a buy rating and one  has given a strong buy rating to the companys stock. According to data from MarketBeat, the stock  has a consensus rating of Moderate Buy and a consensus price target of $209.23.\nInsider Activity at NVIDIA\nIn related news, Director Mark A. Stevens sold 60,000 shares of the companys stock in a transaction dated Wednesday, December 21st. The shares were sold at an average price of $165.09, for a total value of $9,905,400.00. Following the completion of the sale, the director now owns 2,250,193 shares of the companys stock, valued at $371,484,362.37. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at the SEC website. In other news, insider Donald F. Robertson, Jr. sold 2,494 shares of NVIDIA stock in a transaction dated Thursday, December 15th. The stock was sold at an average price of $167.89, for a total value of $418,717.66. Following the completion of the transaction, the insider now owns 56,617 shares in the company, valued at approximately $9,505,428.13. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this link. Also, Director Mark A. Stevens sold 60,000 shares of the businesss stock in a transaction that occurred on Wednesday, December 21st. The stock was sold at an average price of $165.09, for a total value of $9,905,400.00. Following the sale, the director now owns 2,250,193 shares of the companys stock, valued at approximately $371,484,362.37. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 227,787 shares of company stock valued at $36,844,997. 4.04% of the stock is currently owned by insiders.\nNVIDIA Stock Performance\nShares of NASDAQ NVDA traded up $1.29 during mid-day trading on Thursday, hitting $194.52. The stock had a trading volume of 18,150,506 shares, compared to its average volume of 44,808,789. NVIDIA Co. has a twelve month low of $108.13 and a twelve month high of $289.46. The company has a debt-to-equity ratio of 0.45, a quick ratio of 2.74 and a current ratio of 3.39. The firm has a market cap of $484.35 billion, a PE ratio of 82.23, a PEG ratio of 7.32 and a beta of 1.77. The company has a 50 day moving average of $162.78 and a two-hundred day moving average of $154.05.\nNVIDIA (",
      "snippet": "Read Members Trust Co Reduces Stake in <b>NVIDIA</b> Co. (NASDAQ:NVDA) at WKRB News. Analysts Set New Price Targets Several analysts have commented on the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T21:18:42",
      "provider": {
        "name": "wkrb13",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/nvidia-co-logo.jpg?v=20221020142916&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wkrb13",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wkrb13.com/2023/01/26/members-trust-co-reduces-stake-in-nvidia-co-nasdaqnvda.html"
      }
    },
    {
      "id": "8174545944852957760",
      "title": "Nvidia Stock: Plenty of Catalysts Ahead",
      "url": "https://www.tipranks.com/news/article/nvidia-stock-plenty-of-catalysts-ahead",
      "description": "2022 was a difficult year for Nvidia (NASDAQ:NVDA) marked by a severe deceleration in demand for its Gaming graphic cards amidst concerns of a slowdown for its Data...",
      "body": "click here\n)",
      "snippet": "2022 was a difficult year for <b>Nvidia</b> (NASDAQ:NVDA) marked by a severe deceleration in demand for its Gaming graphic cards amidst concerns of a ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T17:35:10",
      "provider": {
        "name": "tipranks",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://blog.tipranks.com/wp-content/uploads/2022/12/NVDA-1221-750x406.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "tipranks",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.tipranks.com/news/article/nvidia-stock-plenty-of-catalysts-ahead"
      }
    },
    {
      "id": "4908029943385507392",
      "title": "GeForce NOW Hitman and all new games that support DLSS 3",
      "url": "https://pledgetimes.com/geforce-now-hitman-and-all-new-games-that-support-dlss-3/",
      "description": "NVIDIA has announced the rollout of the GFN Ultimate update, which allows subscribers to GeForce NOW to play with the",
      "body": "\n  \n  NVIDIA has announced the rollout of the GFN Ultimate update, which allows subscribers to GeForce NOW to play with the performance of an RTX 4080 and to use technology DLSS 3 to further increase the quality of the experience.Among the new games compatible with DLSS 3 we find Hitman World of Assassinationwhile soon this feature will also be available in Marvel's Midnight Suns, the extraordinary turn-based strategy with superheroes developed by Firaxis, the authors of XCOM.NVIDIA DLSS 3, the RTX technology available through the powerful Ada Lovelace architecture, accelerates performance by generating high-quality frames, reads the press release.\"DLSS 3 additions also include NVIDIA Reflex, a technology that reduces system latency for all GeForce NOW users and makes games even more responsive.\"Ultimate subscribers will be able to experience these and more games pushing up to 4K 120fps, or immerse themselves in ultrawide streaming up to 3840 x 1600 at 120fps.\"With the ability to take your games and save data with you literally anywhere, there's a lot to come for GeForce NOW users, including 5 new games adding to your library this week:\"\n\nWatch Dogs: Legion (Relaunch on Steam, 01/26)\nOddballers (Relaunch on Ubisoft Connect, 01/26)\nTom Clancy's Ghost Recon: Breakpoint (Relaunch on Steam, 01/23)\nCygnus Enterprises (Steam)\nRain World (Steam)\nThe Eternal Cylinder (Steam)\n\n      !function(f,b,e,v,n,t,s)\n      {if(f.fbq)return;n=f.fbq=function(){n.callMethod?\n      n.callMethod.apply(n,arguments):n.queue.push(arguments)};\n      if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0';\n      n.queue=[];t=b.createElement(e);t.async=!0;\n      t.src=v;s=b.getElementsByTagName(e)[0];\n      s.parentNode.insertBefore(t,s)}(window, document,'script',\n      'https://connect.facebook.net/en_US/fbevents.js');\n      fbq('init', '1624156791000312');\n      fbq('track', 'PageView');\n      \n    // initialize the library with the API key\n    window.fbAsyncInit = function() {\n      FB.init({\n        appId      : '175982639107667',\n        xfbml      : false,\n        version    : 'v7.0',\n        status     : true,  \n        cookie     : true\n      });\n    };\n    (function(d, s, id){\n      var js, fjs = d.getElementsByTagName(s)[0];\n      if (d.getElementById(id)) {return;}\n      js = d.createElement(s); js.id = id;\n      js.src = \"https://connect.facebook.net/it_IT/sdk.js\";\n      fjs.parentNode.insertBefore(js, fjs);\n    }(document, 'script', 'facebook-jssdk'));\n  \r\n#GeForce #Hitman #games #support #DLSS",
      "snippet": "<b>NVIDIA</b> has announced the rollout of the GFN ... the press release.\"DLSS 3 additions also include <b>NVIDIA</b> Reflex, a technology that reduces system latency ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T17:17:21",
      "provider": {
        "name": "pledgetimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://multiplayer.net-cdn.it/thumbs/images/2020/12/26/hitman-3_jpg_1200x0_crop_q85.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pledgetimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://pledgetimes.com/geforce-now-hitman-and-all-new-games-that-support-dlss-3/"
      }
    },
    {
      "id": "970341218741187340",
      "title": "NVIDIA reveals GeForce Now DLSS 3 boosts for Hitman 3 and Marvel's Midnight Suns",
      "url": "https://www.windowscentral.com/gaming/pc-gaming/nvidia-geforce-now-getting-dlss-3-boosts-for-hitman-3-and-marvels-midnight-suns",
      "description": "NVIDIA announced its latest updates that will be coming to its game streaming service, GeForce Now. This includes adding technologies that support better visuals and performance as well as the additio",
      "body": "(Image credit: NVIDIA)\nWhat you need to know\nNVIDIA GeForce Now RTX 4080 SuperPODs are continuing to roll out bringing better performance and features to Ultimate members.\nThis includes bringing support for NVIDIA Ada Lovelace GPU architecture technologies like DLSS 3, which improves visuals and performance.\nThe latest games to receive DLSS 3 boosts will be Hitman 3 and Marvel's Midnight Suns.\nAdditionally, six games are being added to NVIDIA GeForce Now's library this week.\nToday, NVIDIA revealed that RTX 48080 SuperPods are continuing to release for its GeForce Now gaming streaming service. This latest update will bring support for NVIDIA Ada Lovelace GPU architecture technologies like Deep Learning Super Sampling 3 (\nDLSS 3\n) to more games. This makes it capable of delivering up to four times the performance of what is offered without this feature.\nDLSS 3 is a technology developed by NVIDIA that was created to help produce the best rendering features available like real-time ray tracing, but what makes it so important is that it allows this to happen without getting in the way of a game's performance. Rather than simply generating better pixels, this tech produces new high-quality frames for the best visual experience possible. In other words, with the addition of this update to NVIDIA GeForce Now, Ultimate members will be able to enjoy games with much better performance and visuals.\nThe list of games within GeForce Now cloud game streaming that support DLSS 3 continues to grow with the upcoming supported titles being Hitman 3 and Marvel's Midnight Suns. Both games will offer impressive ray-tracing and Marvel's Midnight Suns will even support ultrawide resolutions at up to 3840 x 1600 at 120 frames per second, for a smooth and beautiful playing experience. \nIn addition to this news, NVIDIA revealed that six games are being added to its GeForce Now cloud game streaming service this week. These include:\nTom Clancys Ghost Recon: Breakpoint (Steam, Jan. 23)\nOddballers (Ubisoft Connect, Jan. 26)\nWatch Dogs: Legion (Steam, Jan. 26)\nCygnus Enterprises (Steam)\nRain World (Steam)\nThe Eternal Cylinder (Steam)\nAs always, GeForce Now users can play their games anywhere from compatible devices, which include PC, Mac, mobile devices, Chromebooks and LG TVs. Some of the best games of all time are available on this service, and since NVIDIA stores this information on their servers, cross-saves are available for you to access your game data from various devices.\n(opens in new tab)",
      "snippet": "<b>NVIDIA</b> announced its latest updates that will be coming to its game streaming service, GeForce Now. This includes adding technologies that support ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T16:21:45",
      "provider": {
        "name": "windowscentral",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/abF8g2n97F7hkQQ2g8aXBD.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "windowscentral",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.windowscentral.com/gaming/pc-gaming/nvidia-geforce-now-getting-dlss-3-boosts-for-hitman-3-and-marvels-midnight-suns"
      }
    },
    {
      "id": "8144112402263659732",
      "title": "My heart is aching for this tiny single slot RTX 4090",
      "url": "https://www.pcgamer.com/my-heart-is-aching-for-this-tiny-single-slot-rtx-4090/",
      "description": "Oh boy, I thought the RTX 4090 Founders Edition looked good, but this is like my fantasy RTX 4090 design. This is like a single slot version of Nvidia&apos;s top GPU&#x2014;hell, the world&apos;s top",
      "body": "RTX 4090 Founders Edition\n(opens in new tab)\nlooked good, but this is like my fantasy RTX 4090 design. This is like a single slot version of Nvidia's top GPUhell, the world's top GPU right nowyet it channels the utilitarian chic of my all-time favourite graphics card, the GeForce 8800 GT.\nAnd is unfeasibly even smaller.\nBut this is not a graphics card that you can go out, pull off the shelf, stick under your jumper, and take home to your rig. No, this is what happens if you mix a third-party RTX 4090 with Alphacool's Enterprise Series water block. And, oh my, does it have my attention.\nOptimum Tech has picked up the block and installed it on an Inno3D cardthe iChill X3 to be preciseand notes that there are actually only a few cards' PCBs that do actually fit the Alphacool block. There are a few specific Inno3D models, but the block maker's site does state that while it's not compatible with the Nvidia Founders Edition, it is compatible with any card built using the standard reference design PCB Nvidia supplied to its partners.\nAs an ES block it's designed to go into server racks, hence the single slot design, lack of RGB bling, and the fact the hose connections are located at the rear.\nBut that is by no means a bad thing, because just look at that sleek wee hunk of metal. This is all made possible by the fact that the actual PCB (printed circuit board) for Nvidia's RTX 4090 is actually very small. The Founders Edition and AIB cards all look absolutely monstrous because of the level of cooling necessary to keep this 450W AD102 chip under control.\nWhen dropped into a decent liquid cooling loop, however, there is enough chip chilling on offer to keep the RTX 4090 running cool and practically silent. Optimum Tech demonstrates the card in action on an open test bench, with a single radiator cooling both GPU and processor, and the temperatures look great.\n(Image credit: Optimum Tech)\nThey note it's within a few degrees of a water-cooled RTX 3090 and around the same as MSI's hybrid water cooled RTX 4090 Suprim-X, which is a great result. As is the 56C average noted when stressing the chip via the fluffy power virus, Furmark. Running a few gamesGod of War and Controlthe temps remain around the same level, if a little lower, and the card's still able to post 2.7GHz+ clock speeds.\nThat's the same sort of speed as our massive RTX 4090 Founders Edition, which I'm now looking at with disgust. Bloated sack of GPU that it is.\nOf course, these water blocks don't come cheap. The",
      "snippet": "... it's not compatible with the <b>Nvidia</b> Founders Edition, it is compatible with ... using the standard reference design PCB <b>Nvidia</b> supplied to its partners.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T15:22:46",
      "provider": {
        "name": "pcgamer",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/9y7gRvtoYVSmXCZV3xKWd9.gif",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pcgamer",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.pcgamer.com/my-heart-is-aching-for-this-tiny-single-slot-rtx-4090/"
      }
    },
    {
      "id": "3661286358020462144",
      "title": "The best use for AI eye contact tech is making movie stars look straight at the camera",
      "url": "https://www.theverge.com/2023/1/26/23572459/ai-eye-contact-tech-nvidia-movie-edit-clips",
      "description": "A bunch of tools, from FaceTime to Nvidias Broadcast, can now use AI to make sure youre always making eye contact. But a much funnier way to use this technology is editing movies so the actors are looking straight at the camera.",
      "body": "Over the past few years, a bunch of tools have been released that use AI to edit video calls in real time so that the caller is making eye contact with the camera. FaceTime can do it. Microsoft Teams can do it. And Nvidia Broadcast can do it, too. (Provided, in each case, you have the necessary hardware or software.)\n\nThis tech comes with a bunch of interesting questions, of course. Like: is constant unbroken eye contact good or a bit creepy? Are these tools useful for people who dont naturally like eye contact? Or is this all just the thin edge of a wedge labeled, for the sake of argument, the increasing use of AI to create a more polished digital version of ourselves is contributing to an increased sense of alienation and loss of identity? \n\nMy answer to that last question is: yeah, probably. But forget that high-brow trash for now, because heres the stupidest and best use case of this technology yet: editing movie scenes so actors make eye contact with the camera. \n\nMaster of the form is Daniel Hashimoto, a VFX specialist known for his Action Movie Kids channel on YouTube and weekly podcast on the industry. Heres some of his best work, via his Twitter:\n\n[Media: https://twitter.com/ActionMovieKid/status/1617989809087336448]\n\n[Media: https://twitter.com/ActionMovieKid/status/1617971237820719108]\n\n[Media: https://twitter.com/ActionMovieKid/status/1618241066398015489]\n\nChatting via Twitter DM, Hashimoto told us that he created the clips by simply connecting up his web browser to Nvidias Broadcast software, which offers the feature and does all the processing in real time. As an expert in visual effects, he says he was astonished by the results.\n\nFrom a technical perspective, the technology is incredible. The tracking is real-time, and the lighting and color matching is very impressive, said Hashimoto. I even discovered that the effect animates in and out, and respects a persons head direction, so it will correct the eyes, when they are looking just off screen, but respects if a person is clearly turning their head and looking at something else. Theres no doubt in my mind that every videoconferencing tool will have some version of this within the next little while.\n\nHe notes that some people misinterpreted his edits (particularly to a scene from The Bear, second above) as an attempt to improve the original but stressed that this couldnt be further from the truth. \n\nAs I mentioned online, this show, this performance, and this scene are transcendent  and it was pretty sacrilegious to have used it, said Hashimoto. He jokingly added that if anyone was offended by the video, they could call into his live show tomorrow to talk about it. \n\nWith that in mind, heres one last edit with a very appropriate subject matter:\n\n[Media: https://twitter.com/ActionMovieKid/status/1618460966928408579]",
      "snippet": "And <b>Nvidia</b> Broadcast can do it, too. (Provided, in each case, you have the necessary hardware or software.) This tech comes with a bunch of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T15:01:34.266",
      "provider": {
        "name": "theverge",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/1-B9pCNppfPD-wh_asbvJPUu7qU=/0x0:1990x1104/1200x628/filters:focal(995x552:996x553)/cdn.vox-cdn.com/uploads/chorus_asset/file/24387141/Screenshot_2023_01_26_at_14.24.05.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theverge",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.theverge.com/2023/1/26/23572459/ai-eye-contact-tech-nvidia-movie-edit-clips"
      }
    },
    {
      "id": "5961291237538306259",
      "title": "Nvidias new Broadcast app feature causes concern among tech community",
      "url": "https://www.samaaenglish.tv/news/40026211/tech-nvidias-new-broadcast-app-feature-causes-concern-among-tech-community",
      "description": "Must-have tool for video creators looking to take their content to next level",
      "body": "Jan 26, 2023\nPHOTO: Nvidia\nNvidia, a leading technology company known for its cutting-edge graphics processing units (GPUs), has released a new feature for its Broadcast app that has raised eyebrows in the tech community.\nThe feature, known as Eye Contact, uses AI to edit a live video feed so that it appears as if the person on the other end is always looking directly into the camera, even if they are not.\nThe feature, which debuted as part of the 1.4 patch for Nvidia Broadcast, is intended for content creators who want to maintain the illusion of eye contact with their audience, even when they are looking off-screen at notes or a script.\nHowever, many have found the feature to be unsettling and have raised concerns about its potential use in video conferencing and live streaming.\nOne Twitter user even posted a demo of the Eye Contact feature being used in scenes from the classic film Jurassic Park, noting that the edited footage was weird and off-putting.\nThe Eye Contact feature is yet another example of AI being made accessible to everyday consumers, with other software like DALL-E, Midjourney, and Free AI Art Generator being used to create memes and recreate the look of certain directors films.\nNvidia Broadcast is available for download, but users should be aware that it requires certain hardware, including an Nvidia GeForce RTX graphics card, to function properly.",
      "snippet": "Jan 26, 2023 PHOTO: <b>Nvidia Nvidia</b>, a leading technology company known for its cutting-edge graphics processing units (GPUs), has released a new ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T14:08:31",
      "provider": {
        "name": "samaaenglish",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.samaaenglish.tv/large/2023/01/2612031133c9915.jpg?r=120333",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "samaaenglish",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.samaaenglish.tv/news/40026211/tech-nvidias-new-broadcast-app-feature-causes-concern-among-tech-community"
      }
    },
    {
      "id": "7031462399213097410",
      "title": "Nextech AR's AI-Powered CAD to Poly Toggle3D Launches Major Technology Advancements",
      "url": "https://www.digitaljournal.com/pr/nextech-ars-ai-powered-cad-to-poly-toggle3d-launches-major-technology-advancements",
      "description": "Toggle3D is disrupting the Computer Graphics Market, which is projected to reach $160 billion by 2027 Dominated by Adobe, Autodesk, Solidworks,",
      "body": "Dominated by Adobe, Autodesk, Solidworks, Nvidia\nTORONTO, ON / ACCESSWIRE / January 26, 2023 /\nNextech AR Solutions Corp\n. (Nextech or the Company) (OTCQX:NEXCF)(CSE:NTAR)(FSE:EP2), a Metaverse Company and leading provider of augmented reality (AR) experience technologies, wayfinding technologies and 3D model services is pleased to announce the launch of a major upgrade to its AI powered SaaS platform,\nToggle3D\n, that enables the creation, design, configuration and deployment of 3D models at scale, using CAD files. In addition to the new modern look and design, the Company has launched an AI generated Physics Based Rendering (PBR) material creation tool which now allows for the scale of photorealistic materials. The Company believes that this new AI technology will accelerate signups for the platform.\nThe new design, which includes a UX/UI lift, is geared towards improving the platform functionality by simplifying the 3D modeling workflow even further. The design improvements also give the platform a fun and modern appeal, making it popular among those new to 3D design or even among experienced 3D artists looking for a friendly interface.\nWith the usability and simplicity of the platform, Toggle3D is disrupting the\nComputer Graphics Market, which is projected to reach $160 billion by 2027\n. The market includes competitors such as Adobe, Autodesk, Solidworks, Nvidia, etc.\nA pivotal new feature is the introduction of a new material template, which is now available as a feature in the Pro plan. The template contains three different AI-powered methods of creating high-quality Physics Based Renderings (PBR), the industry standard for creating photo-realistic materials, from scratch:\nMethod 1 allows users to create a uniform color material from scratch\nMethod 2 allows users to create a 3D material out of a texture swatch\nMethod 3 allows users to create a material by cropping a product reference photo\nThis means that users no longer have to create a similar-looking table top finish, but instead they can create its exact digital twin.\nThe advancements in the CAD converter also open up new use cases for manufacturers in product design, CPQ sales, product marketing, ads, and modeling. Manufacturers now have control of their 3D modeling needs and can do it all by themselves in Toggle3D with no experience or an in-house 3D modeling team required.\nTo try out some of these new and more advanced editing features, Toggle3D is offering a\n30-day free trial\non the Pro plan for a limited time.\nToggle3D is excited to offer an all-in-one solution for manufacturers, making 3D modeling easy and accessible for everyone, with no experience or in-house team required. With the new design, functionality, and features, Toggle3D is positioning itself as a leader in the industry and is well poised to take advantage of the growth in the Computer Graphics market.\nAbout Toggle 3D:\nLaunched in September,\nToggle3D is an AR enhanced standalone web application which enables product designers, 3D artists, marketing professionals and eCommerce site owners to create, customize and publish high-quality 3D models and experiences without any technical or 3D design knowledge required. The Company believes that\nToggle3D\nis the first platform of its kind, and this break-through SaaS product is a potential game changer for the manufacturing and design industry, as it provides a viable solution to convert large CAD files into lightweight 3D models at affordable prices and at scale.\nAccording to BIS Research\n, the CAD market, quantified by the amount spent on the creation of CAD files, is projected to reach $11 Billion dollars by 2023.\nTop Three Competitive Advantages of Toggle 3D Versus 3D Legacy Software Generating $11 Billion In Revenue\n1. NO Learning Curve:\nWhat makes Toggle3D different from the legacy 3D design software is its ease-of-use and democratization of 3D design. The goal is for anyone with no prior technical or 3D design experience to be able to hop into the platform and create a high-quality 3D visual in minutes. This is unlike legacy 3D modeling systems, that require months to truly feel comfortable with. Users would first be required to learn and understand the industry lingo, learn what the tools do and then learn how to use them in the legacy software. Meanwhile, we have streamlined this process in Toggle3D by humanizing 3D design terminology, creating templates to guide creation and simplifying the tools using machine learning to transfer the complexity out of the user experience into the backend platform, and instead allow more room for creativity.\n2. Web-based:\nToggle3D is a web-based design studio which means the user can access everything on the browser and start designing instantly. No desktop downloads involved, no updates to keep track of, and no system requirements to worry about. All the templates are organized into project panels that a user can access anywhere and seamlessly navigate between. This is different from how legacy software were built back in the day with the software package being broken out into multiple desktop apps that would require the user to understand system compatibility, download, sync, and learn independently.\n3. Collaboration:\nToggle3D will allow advanced, in-app collaboration. These new sets of features will allow multiple users to work at the same time and on the same project resulting in quick feedback and decision making cross-department, and team. These tools will allow businesses to adopt 3D organization-wide and unlock the power of group iteration. Users could set up workflows, permissions, and version history to keep up with real-time design changes. These advanced collaboration cycles are harder to set up in desktop apps and may sometimes slowdown or isolate the design workflow.\nTo learn more, please follow us on\nTwitter\n866-ARITIZE (274-8493)\nAbout Nextech AR\nNextech AR Solutions (OTCQX: NEXCF) (CSE: NTAR) (FSE: EP2) is a diversified augmented reality, AI technology Company that leverages proprietary artificial intelligence (AI) to create 3D experiences for the metaverse. Its main businesses are creating 3D WebAR photorealistic models for the Prime Ecommerce Marketplace as well as many other online retailers. The Company develops or acquires what it believes are disruptive technologies and once commercialized, spins them out as stand-alone public Companies issuing a stock dividend to shareholders while retaining a significant ownership stake in the public spin-out.\nOn October 26, 2022 Nextech AR spun out its spatial computing platform, ARway as a stand alone public Company. Nextech AR retained a control ownership in ARway Corp. with 13 million shares, or a 50% stake, and distributed 4 million shares to Nextech AR Shareholders. ARway is currently listed on the Canadian Securities Exchange (CSE:ARWY), in USA on the (OTC: ARWYF) and Internationally on the Frankfurt Stock Exchange (FSE: E65). ARway Corp. is disrupting the augmented reality wayfinding market with a no-code, no beacon spatial com",
      "snippet": "Dominated by Adobe, Autodesk, Solidworks, <b>Nvidia</b> TORONTO, ON / ACCESSWIRE / January 26, 2023 / Nextech AR Solutions Corp . (Nextech or the Company) ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T14:05:55",
      "provider": {
        "name": "digitaljournal",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "digitaljournal",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.digitaljournal.com/pr/nextech-ars-ai-powered-cad-to-poly-toggle3d-launches-major-technology-advancements"
      }
    },
    {
      "id": "5067239373903361452",
      "title": "GeForce NOW Upgrades Hitman: World of Assassination + Midnight Suns with DLSS 3; 6 New Games Added",
      "url": "https://wccftech.com/geforce-now-upgrades-hitman-world-of-assassination-midnight-suns-with-dlss-3-6-new-games-added/",
      "description": "Two games available within GeForce NOW will receive support for NVIDIA DLSS 3. Additionally, six new games have been added.",
      "body": "Rain World (Steam)\nThe Eternal Cylinder (Steam)\nHitman: World of Assassination and Marvel's Midnight Suns will both receive DLSS 3 support through GeForce NOW. The technology that's currently available for RTX 40 series cards will then become available on these two games. This means that both titles will support resolutions of up to 4K alongside other neat features such as NVIDIA Reflex.\nIt should also be a good time to mention that RTX 4080 upgrades will be available in London this week. So, Ultimate members from this region will now be able to experience these games and more up to 4K 120 FPS or use the newly implemented ultrawide setting at up to 3840 x 1600 at 120 FPS. Make sure to keep an eye on the map to see which cities get lit up next.\nWith this, GeForce NOW members should be able to get a lot of mileage out of these two games, particularly the newly released Hitman: World of Assassination Freelancer Mode, which spices up the gameplay for Agent 47 with a new rogue-like gameplay mode and allows players to take on several targets from various criminal organizations worldwide.\nGeForce NOW is available on PC, iOS, Android, NVIDIA SHIELD, and select Smart TVs. You can also play your favorite games with the power of the cloud through the Logitech G Cloud and the Cloud Gaming Chromebooks.\nShare this story",
      "snippet": "Two games available within GeForce NOW will receive support for <b>NVIDIA</b> DLSS 3. Additionally, six new games have been added.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T14:00:00",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2023/01/GFN_Thursday-Jan_26-scaled.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/geforce-now-upgrades-hitman-world-of-assassination-midnight-suns-with-dlss-3-6-new-games-added/"
      }
    },
    {
      "id": "6465004002683307779",
      "title": "Barclays Boosts NVIDIA (NASDAQ:NVDA) Price Target to $250.00",
      "url": "https://www.themarketsdaily.com/2023/01/26/barclays-boosts-nvidia-nasdaqnvda-price-target-to-250-00.html",
      "description": "Read Barclays Boosts NVIDIA (NASDAQ:NVDA) Price Target to $250.00 at Markets Daily",
      "body": "Get Rating\n) last announced its quarterly earnings results on Wednesday, November 16th. The computer hardware maker reported $0.34 earnings per share for the quarter, missing the consensus estimate of $0.44 by ($0.10). NVIDIA had a return on equity of 30.75% and a net margin of 20.85%. The company had revenue of $5.93 billion for the quarter, compared to analyst estimates of $5.82 billion. During the same period in the prior year, the business posted $1.01 earnings per share. NVIDIAs revenue for the quarter was down 16.5% on a year-over-year basis.  Research analysts predict that  NVIDIA will post 2.19 earnings per share for the current year.\nNVIDIA Announces Dividend\nThe business also recently announced a quarterly dividend, which was paid on Thursday, December 22nd. Investors of record on Thursday, December 1st were issued a $0.04 dividend. The ex-dividend date  was Wednesday, November 30th. This represents a $0.16 annualized dividend and a yield of 0.08%. NVIDIAs dividend payout ratio (DPR) is presently 6.81%.\nInsiders Place Their Bets\nIn other NVIDIA news, Director Mark A. Stevens sold 45,000 shares of the businesss stock in a transaction on Thursday, January 12th. The shares were sold at an average price of $164.70, for a total value of $7,411,500.00. Following the completion of the transaction, the director now owns 1,190,888 shares in the company, valued at $196,139,253.60. The transaction was disclosed in a legal filing with the SEC, which is accessible through this hyperlink. In other NVIDIA news, Director Mark A. Stevens sold 45,000 shares of the businesss stock in a transaction on Thursday, January 12th. The shares were sold at an average price of $164.70, for a total value of $7,411,500.00. Following the completion of the transaction, the director now owns 1,190,888 shares in the company, valued at $196,139,253.60. The transaction was disclosed in a legal filing with the SEC, which is accessible through this hyperlink. Also, insider Donald F. Robertson, Jr. sold 2,494 shares of the businesss stock in a transaction on Thursday, December 15th. The stock was sold at an average price of $167.89, for a total transaction of $418,717.66. Following the completion of the transaction, the insider now owns 56,617 shares of the companys stock, valued at approximately $9,505,428.13. The disclosure for this sale can be found here. Insiders sold a total of 227,787 shares of company stock worth $36,844,997 over the last 90 days. Corporate insiders own  4.04% of the companys stock.\nInstitutional Investors Weigh In On NVIDIA\nSeveral institutional investors have recently modified their holdings of the company. Vanguard Group Inc. lifted its position in shares of  NVIDIA by 1.2% during the 3rd quarter. Vanguard Group Inc. now owns 203,747,246 shares of the computer hardware makers stock worth $24,732,878,000 after purchasing an additional 2,326,387 shares during the last quarter.  State Street Corp lifted its position in shares of  NVIDIA by 0.9% during the 3rd quarter. State Street Corp now owns 98,751,264 shares of the computer hardware makers stock worth $11,987,416,000 after purchasing an additional 908,481 shares during the last quarter.  Price T Rowe Associates Inc. MD lifted its position in  NVIDIA by 7.2% in the second quarter. Price T Rowe Associates Inc. MD now owns 56,929,819 shares of the computer hardware makers stock valued at $8,629,991,000 after acquiring an additional 3,813,087 shares during the last quarter.  Legal & General Group Plc lifted its position in  NVIDIA by 4.4% in the second quarter. Legal & General Group Plc now owns 18,243,948 shares of the computer hardware makers stock valued at $2,765,602,000 after acquiring an additional 764,184 shares during the last quarter.  Finally, Baillie Gifford & Co. lifted its position in  NVIDIA by 13.7% in the fourth quarter. Baillie Gifford & Co. now owns 17,376,237 shares of the computer hardware makers stock valued at $2,539,364,000 after acquiring an additional 2,097,453 shares during the last quarter. 61.80% of the stock is owned by hedge funds and other institutional investors.\nNVIDIA Company Profile",
      "snippet": "Read Barclays Boosts <b>NVIDIA</b> (NASDAQ:NVDA) Price Target to $250.00 at Markets Daily. Get Rating ) last announced its quarterly earnings results on ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T07:38:46",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/images/flyonthewall.png&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/01/26/barclays-boosts-nvidia-nasdaqnvda-price-target-to-250-00.html"
      }
    },
    {
      "id": "4729356123016412041",
      "title": "Good news the Intel Core i9-13900K and NVIDIA RTX 4090 are ice age ready",
      "url": "https://www.tweaktown.com/news/90147/good-news-the-intel-core-i9-13900k-and-nvidia-rtx-4090-are-ice-age-ready/index.html",
      "description": "With record breaking cold temperatures in China, a content creator desiced to see if her high-end gaming PC would work in a -53C climate.",
      "body": "Jan 25, 2023 8:59 PM CST\n1 minute & 27 seconds read time\nIt's no secret that high-end CPUs and GPUs perform better in colder temperatures, especially when overclocking enters the picture. It's the reason why LN2 or liquid nitrogen is used to cool hardware pushing insane speeds - as opposed to, say, lava.\n5\nVIEW GALLERY - 5 IMAGES\nThanks to a Chinese content creator by the name of \"baka,\" we've now got confirmation that a powerful gaming PC rocking an Intel Core i9-13900K CPU and NVIDIA GeForce RTX 4090 will have no problem functioning during the next Ice Age.\nSome regions of China are experiencing some of the coldest temperatures they've seen for decades right now, so she decided to take her gaming rig to see how it holds up in a sub-zero -53C climate. And apparently, no hardware was damaged in the creation of the video.\nWatch the full video here.\nGreat news for those out there planning to ride out the next ice age playing PC games.\nWhat's very cool is that we also get to see an older-generation CPU without any heatsink or cooling outside of the freezing temperatures maintaining an icy -1 degrees C even when using AIDA64's stress test. The real fun, of course, came when it was time to fire up the Intel Core i9-13900K processor and an ASUS GeForce RTX 4090 ROG STRIX graphics card.\n5\nUsing a 360mm AIO cooler, the pump died, and the liquid froze due to the temperatures. Switching over to air cooling and a mix of high-end fans and a Noctua NH-P1 passive heatsink, the CPU sat at around 10-15C - which is remarkable when you consider that it's not unusual for a stress-tested Intel Core i9-13900K to push well over 90C. The CPU was overclocked to 6.18 GHz too.\nThings were even more impressive on the RTX 4090 side, with a -40C temperature recorded and temperatures staying below 30C. Of course, being in freezing temperatures, all of the cables end up covered in ice, which is a little concerning.\nASUS ROG Strix GeForce RTX 4090 OC Edition Gaming Graphics Card\nToday\nKosta Andreadis\nKosta might be a relatively new member of TweakTown, but hes a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit.\nNewsletter Subscription",
      "snippet": "... that a powerful gaming PC rocking an Intel Core i9-13900K CPU and <b>NVIDIA</b> GeForce RTX 4090 will have no problem functioning during the next Ice Age.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T02:59:02",
      "provider": {
        "name": "tweaktown",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "tweaktown",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.tweaktown.com/news/90147/good-news-the-intel-core-i9-13900k-and-nvidia-rtx-4090-are-ice-age-ready/index.html"
      }
    },
    {
      "id": "4219611622757801930",
      "title": "March 10th Options Now Available For NVIDIA",
      "url": "https://www.nasdaq.com/articles/march-10th-options-now-available-for-nvidia",
      "description": "Investors in NVIDIA Corp (Symbol: NVDA) saw new options begin trading today, for the March 10th expiration.   At Stock Options Channel, our YieldBoost formula has looked up and down the NVDA options chain for the new March 10th contracts and identified one put and one call cont",
      "body": "BNK Invest\n->\nInvestors in NVIDIA Corp (Symbol: NVDA) saw new options begin trading today, for the March 10th expiration.   At Stock Options Channel, our YieldBoost formula has looked up and down the NVDA options chain for the new March 10th contracts and identified one put and one call contract of particular interest.\nThe put contract at the $187.50 strike price has a current bid of $9.40.  If an investor was to sell-to-open that put contract, they are committing to purchase the stock at $187.50, but will also collect the premium, putting the cost basis of the shares at $178.10 (before broker commissions).  To an investor already interested in purchasing shares of NVDA, that could represent an attractive alternative to paying $193.91/share today.\nBecause the $187.50 strike represents an approximate 3% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless.  The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 99%.  Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract.  Should the contract expire worthless, the premium would represent a 5.01% return on the cash commitment, or 42.56% annualized  at Stock Options Channel we call this the\nYieldBoost\n.\nBelow is a chart showing the trailing twelve month trading history for NVIDIA Corp, and highlighting in green where the $187.50 strike is located relative to that history:\nTurning to the calls side of the option chain, the call contract at the $207.50 strike price has a current bid of $6.20.  If an investor was to purchase shares of NVDA stock at the current price level of $193.91/share, and then sell-to-open that call contract as a \"covered call,\" they are committing to sell the stock at $207.50.  Considering the call seller will also collect the premium, that would drive a total return (excluding dividends, if any) of 10.21% if the stock gets called away at the March 10th expiration (before broker commissions).  Of course, a lot of upside could potentially be left on the table if NVDA shares really soar, which is why looking at the trailing twelve month trading history for NVIDIA Corp, as well as studying the business fundamentals becomes important.   Below is a chart showing NVDA's trailing twelve month trading history, with the $207.50 strike highlighted in red:\nConsidering the fact that the $207.50 strike represents an approximate 7% premium to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the covered call contract would expire worthless, in which case the investor would keep both their shares of stock and the premium collected.  The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 99%.  On our website under the contract detail page for this contract, Stock Options Channel will track those odds over time to see how they change and publish a chart of those numbers (the trading history of the option contract will also be charted).   Should the covered call contract expire worthless, the premium would represent a 3.20% boost of extra return to the investor, or 27.14% annualized, which we refer to as the\nYieldBoost\n.\nMeanwhile, we calculate the actual trailing twelve month volatility (considering the last 251 trading day closing values as well as today's price of $193.91) to be 64%.  For more put and call options contract ideas worth looking at, visit StockOptionsChannel.com.",
      "snippet": "Investors in <b>NVIDIA</b> Corp (Symbol: NVDA) saw new options begin trading today, for the March 10th expiration. At Stock Options Channel, our YieldBoost ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/march-10th-options-now-available-for-nvidia"
      }
    },
    {
      "id": "7035878344400977913",
      "title": "Zacks Investment Ideas feature highlights: Microsoft Nvidia Alphabet Mobileye and Intuitive Surgical",
      "url": "https://www.nasdaq.com/articles/zacks-investment-ideas-feature-highlights:-microsoft-nvidia-alphabet-mobileye-and",
      "description": "For Immediate Release Chicago, IL  January 26, 2023  Today, Zacks Investment Ideas feature highlights Microsoft MSFT, Nvidia NVDA, Alphabet GOOGL, Mobileye MBLY and Intuitive Surgical ISRG",
      "body": "->\nFor Immediate Release\nChicago, IL  January 26, 2023  Today, Zacks Investment Ideas feature highlights Microsoft MSFT, Nvidia NVDA, Alphabet GOOGL, Mobileye MBLY and Intuitive Surgical\nISRG\nThe Coming AI Revolution: 5 Companies at the Forefront\nArtificial Intelligence, also known as AI, describes the technology that uses computers to mimic human knowledge and learning. While AI has been a well-known buzzword for years, the rollout of ChatGPT has catapulted it to the mainstream. ChatGPT (stands for Generative Pre-Trained Transformer) is an AI-powered chatbot that was launched in November 2022 by OpenAI  a company co-founded by some of Silicon Valley's most prominent names such as Reid Hoffman (LinkedIn founder), Elon Musk and Peter Thiel.\nThough ChatGPT is still merely a prototype, users are flocking to the tool due to its surprisingly deep knowledge across many areas and its in-depth responses to queries. Just how powerful is ChatGPT? The bot has passed the medical license, MBA operations, and bar exams  and it will only improve from here.\nToday we will cover 5 companies at the forefront of the AI revolution:\nMicrosoft: In 2019, Microsoft backed ChatGPT creator OpenAI with $1 billion in funding. After the hugely successful launch of the ChatGPT prototype, Microsoft announced earlier this week that the software giant would invest another $10 billion over the next ten years.\nMeanwhile, ChatGPT is converting from a free service to a \"freemium\" service. The tool is available for free to all. However, premium users can enjoy more rapid response speeds and availability when the bot's demand is high for $42 per month.\nMicrosoft's Azure is the primary cloud service provider for ChatGPT. Last night during MSFT's EPS call CEO Satya Nadella confirmed the company's commitment to AI by saying, \"We are committed to help customers use our platforms and tools to do more with less today and innovate for the future in the new era of AI.\" Shares rose 5% initially.\nNvidia: Though AI has been in use for years, it has only recently exploded in popularity because the masses are using it. What was holding AI back before? AI platforms such as ChatGPT require immense computing power to process intricate computing tasks. Nvidia is the leader in PC graphic processors, and its technologies are already being used in several AI realms, such as high-performance computing and virtual reality platforms. Nvidia competitorsalso stand to benefit.\nAlphabet: Google parent Alphabet is currently the biggest user of AI in its many businesses. Alphabet utilizes AI to:\n      Optimize its search engine Google.\n      Moderate content that violates policies on its YouTube video platform.\n      Spearhead its autonomous driving division Waymo.\n      Turn image data into actionable insights in its robotics company Boston Dynamics.\nThe best option for investors looking for a pure play on AI and autonomous driving would be Mobileye. Mobileye is a leader in the autonomous driving space and supplies its technologies to a wide array of automakers. Mobileye and Tesla should continue to lead in this space as demand grows due to the drastic increase in distracted driving deaths. Several months ago, Tesla CEO Elon Musk hinted that Tesla would soon look to manufacture a futuristic \"Robotaxi,\" which will be arideshare service that can operate without a human driver.\nIntuitive Surgical: Like driving, there are many realms that AI proponents believe will be better handled by machine rather than man. One such area is minimally invasive surgery  a medical practice where precision is paramount. Intuitive Surgical is best known for its successful \"da Vinci\" robotic surgical system which costs $2 million. Currently, surgeons control the device from a console away from the patient and can complete a variety of complex procedures. However, the company is using AI to collect and curate data to lead to better patient outcomes in the future.\nConclusion\nIn the long run, stocks are driven by higher earnings, and higher earnings are driven by innovation. Think back to some of the biggest winning stocks over the past few decades.\nFor this reason, investors need to begin tracking the AI space. Though the space is in its infancy and the use cases have only scratched the surface, investors should expect an influx of investment dollars following the recent success of ChatGPT and more game-changing technology to be unveiled in the coming years. While few public pure plays exist now, in the future, investors should expect new companies to come public and existing companies to derive more and more revenue from this groundbreaking industry.\nWhy Haven't You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit\nfor information about the performance numbers displayed in this press release.\nFree Report: Must-See Energy Stocks for 2023\nRecord profits at oil companies can mean big gains for you. With soaring demand and elevated prices, oil stocks could be top performers by far in 2023. Zacks has released a special report revealing the 4 oil stocks experts believe will deliver the biggest gains. (Youll never guess Stock #2!)",
      "snippet": "... 26, 2023 Today, Zacks Investment Ideas feature highlights Microsoft MSFT, <b>Nvidia</b> NVDA, Alphabet GOOGL, Mobileye MBLY and Intuitive Surgical ISRG.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/zacks-investment-ideas-feature-highlights:-microsoft-nvidia-alphabet-mobileye-and"
      }
    },
    {
      "id": "6079059893164415256",
      "title": "Data Centers Have a Heat Problem and It Could Mean Disruption and Opportunity for Investors",
      "url": "https://www.nasdaq.com/articles/data-centers-have-a-heat-problem-and-it-could-mean-disruption-and-opportunity-for",
      "description": "In today's video, Jose Najarro and Nick Rossolillo discuss Equinix (NASDAQ: EQIX), how important cooling is for semiconductors, and why companies like Intel (NASDAQ: INTC) and Nvidia (NASDAQ: NVDA) are taking steps to solve the problem. Jose is pretty excited about this market, b",
      "body": "(NASDAQ: NVDA)\nare taking steps to solve the problem. Jose is pretty excited about this market, but does Nick share his enthusiasm? Check out the short video to learn more, consider subscribing, and click the special offer link below.\n*Stock prices used were the market prices of Jan. 24, 2023. The video was published on Jan. 24, 2023.\n10 stocks we like better than Equinix\nWhen our award-winning analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Equinix wasn't one of them! That's right -- they think these 10 stocks are even better buys.",
      "snippet": "... important cooling is for semiconductors, and why companies like Intel (NASDAQ: INTC) and <b>Nvidia</b> (NASDAQ: NVDA) are taking steps to solve the problem.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/data-centers-have-a-heat-problem-and-it-could-mean-disruption-and-opportunity-for"
      }
    },
    {
      "id": "8049588642977699100",
      "title": "Nvidia",
      "url": "https://en.wikipedia.org/wiki/Nvidia",
      "description": "Nvidia Corporation ( ; most commonly referred to as Nvidia, stylized as NVIDIA, or (due to their logo) nVIDIA) is an American technology company incorporated in Delaware and based in Santa Clara, California. It designs graphics processing units (GPUs) for the gaming and professional markets, as well as system on a chip units (SoCs) for the mobile computing and automotive market. Its primary GPU product line, labeled \"GeForce\", is in direct competition with Advanced Micro Devices' (AMD) \"Radeon\" products. Nvidia expanded its presence in the gaming industry with its handheld Shield Portable, Shield Tablet and Shield Android TV.",
      "body": "",
      "snippet": "<b>Nvidia</b> expanded its presence in the gaming industry with its handheld Shield Portable, Shield Tablet and Shield Android TV.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "0001-01-01T00:00:00",
      "provider": {
        "name": "wikipedia",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wikipedia",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://en.wikipedia.org/wiki/Nvidia"
      }
    }
  ]
}
