{
  "_type": "news",
  "didUMean": "",
  "totalCount": 156,
  "relatedSearch": [],
  "value": [
    {
      "id": "5971374235647077895",
      "title": "Seriously where did you lot get the money for all those RTX 4090s?",
      "url": "https://www.pcgamer.com/seriously-where-did-you-lot-get-the-money-for-all-those-rtx-4090s/",
      "description": "Where did you people get all this money from?! Somehow Nvidia&apos;s RTX 4090 has appeared in the Steam Hardware Survey for the first time this January, and has popped in above any of AMD&apos;s high-",
      "body": "(opens in new tab)\nfor the first time this January, and has popped in above any of AMD's high-end graphics cards.\nThe\nAMD RX 6800 XT\n(opens in new tab)\nis one of the best GPUs the red team has ever released, and I get that the pandemic/chip shortage fun times kinda made it tough to buy, but it's been out since late 2020 and still comes in behind Nvidia's ~$2,000 graphics card.\nAnd that's even with the Radeon card steadily gaining popularity and market share in the Steam survey since at least September.\nIn fact, as pointed out in a\nRX 6900 XT\n(opens in new tab)\n, AMD's $999 version of its RDNA 2 GPU architecture which launched later. I get that it had a pretty significant price drop late in life, but damn.\nStill, the RX 580 is AMD's most popular discrete graphics card according to the collected Steam Hardware Survey data, and there are more of those than RTX 4090, RX 6800 XT, and RX 6900 XT combined. So, AMD's got that, at least.\nIt does bear saying, however, that the Steam Hardware Survey is purely a representative sample of the tech used by gamers with Steam installed, and not a complete record of the split of GPUs out in the wild.\nThough I expect every single one of the RTX 4090 owners who were offered the chance to submit their gaming PC's specs to Steam when they logged in most definitely clicked 'Accept.' After all, when you've spent a couple of grand on a GPU you want as many people to know as possible.\nYour next upgrade\n: Get into the game ahead of the rest\nI bet Gabe would be well impressed, too.\nStill, it is representative to a point, and sometimes it's easy to forget just how dominant Nvidia is in the GPU market, despite how good AMD's RX 6000-series graphics cards have proved. I mean, we still can't believe people are picking the RTX 3060 over\n(opens in new tab)\n.\nIt's cheaper, faster, and just plain better. And no, we won't stop going on about it until you lot listen, Intel's Arc cards get far more consistent, or we actually get some competitively priced RTX 40-series or RX 7000-series GPUs.\nMaybe one day.\nPC Gamer Newsletter\nSign up to get the best content of the week, and great gaming deals, as picked by the editors.\nContact me with news and offers from other Future brands\nReceive email from us on behalf of our trusted partners or sponsors\nBy submitting your information you agree to the",
      "snippet": "... to a point, and sometimes it's easy to forget just how dominant <b>Nvidia</b> is in the GPU market, despite how good AMD's RX 6000-series graphics cards ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:31:10",
      "provider": {
        "name": "pcgamer",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/HrM66xrkePLHLdFRkLhaoG.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pcgamer",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.pcgamer.com/seriously-where-did-you-lot-get-the-money-for-all-those-rtx-4090s/"
      }
    },
    {
      "id": "773316045101097436",
      "title": "Is the Intel Arc A380 worth buying in 2023?",
      "url": "https://www.sportskeeda.com/gaming-tech/is-intel-arc-a380-worth-buying-2023",
      "description": "Intel's budget range graphics card, the Arc A380, was released in June last year as a direct competitor to Nvidia and AMD's offerings.",
      "body": "Intel's budget range graphics card, the Arc A380, was released in June last year as a direct competitor to Nvidia and AMD's offerings. The graphics card landscape needed the entry of a third player to break the duopoly of AMD and Nvidia. To everyone's joy, Intel marketed its cards at prices significantly lower than the other two manufacturers had introduced.Dr. DefineRisk - Team Liberty@DefineRiskAfter updating the host BIOS I am finally able to get an @intel Arc a380 GPU working in a Windows 11 VM and I am blown away by #AV1 encoding speed! 1After updating the host BIOS I am finally able to get an @intel Arc a380 GPU working in a Windows 11 VM and I am blown away by #AV1 encoding speed! Since then, Intel has faced some driver issues with DX11 and DX9 titles, because of which, there is a certain level of apprehension among gamers and GPU enthusiasts. Going into 2023, are these apprehensions justified, or has Intel managed to turn the tide in its favor by optimizing the drivers well for the Arc A380?Intel Arc A380 is a tricky recommendation in the sub $200 categorySpecificationsMemory Size6 GBDirect X supportDX 12 UltimatePower draw75 WCore clock frequency2 GHzCore count8Memory bus width96 bitMemory Speed15.5 GBpsMemory bandwidth186 GBpsThe Intel Arc A380 is based on a TSMC-manufactured 6 nm architecture. Interestingly, Intel chose TSMC's fabrication process over its foundry. The reason cited by Intel was balance, which is just one way of admitting that the TSMC process was superior and cheaper.Intel has provided 8 Ray-tracing cores on the A380, but it is unwise to expect significant ray-tracing performance in this price range. Ray-tracing will massively eat into the available frames that the card outputs, which are plentiful at 1080p high settings.The Xe cores of the card sit at a number 8, while the clock speed of the GPU is at 2 GHz. This core clock speed is just about decent and in line with modern GPU offerings from the competition.Intel Canada@intelcanadaThe @HPCanada Victus 15L Gaming Tower is designed to elevate mainstream gaming with the #IntelArc (A380) graphics!Shop this impressive device at @costcocanada here: intel.ly/3WUMKgH52The @HPCanada Victus 15L Gaming Tower is designed to elevate mainstream gaming with the #IntelArc (A380) graphics!Shop this impressive device at @costcocanada here: intel.ly/3WUMKgH https://t.co/GyxNzqAde9The A380 only comes with a memory size of 6GB, which is plentiful for the targeted resolution and frames. Playing on 1080p in medium to high settings doesn't usually require a lot of video memory, and 6 GB on the Arc A380 is sufficient for the most part.Since this is a budget card, the sacrifices made were in the graphics memory interface width or the GPU bus width. A mere 96 bits of memory width is available on this card. The bandwidth is again on the lower side, with about 186 GBps available at max utilization.The memory speed is at a decent 15.5 GBps, thus ensuring that communication between the GPU processor and its VRAM isn't lacking.The supported APIs on Arc A380 are DirectX 12 Ultimate and Vulkan version 1.3. This is one area where Intel has been lagging since its release. Older titles, which rely on DX 9 and DX 11 APIs, need updates and optimizations to be pushed by Intel to work well and output decent frames.Intel has thankfully done something in this regard but has also decided to focus more on DX 12 and beyond.As for the output support, the Arc A380 supports Display port 1.4 and HDMI 2.1, but the card can never output these technologies' maximum supported resolution and refresh rate. Furthermore, the A380 has in-built support for H.264 and H.265 hardware encoding and decoding.A380 is about 10 to 15 % slower than similarly priced cardsThe nearest competitor to A380 is perhaps 1650 from Nvidia and RX 6500XT from AMD. The Intel card is a good 20 percent cheaper than the competition cards. It is, however, also 10 to 15 % slower across a lot of AAA titles while managing to match these two cards in some.This drawback is interestingly observed in DX 9 and DX 11 titles. Intel managed to nearly match the performance of these cards in the newer DX 12 titles. We should see better performance from the Intel budget card with further updates and driver optimization.Regarding sheer power efficiency, the RX 6500XT handsomely beats Intel by offering better performance at a lower power draw.The A380 performs best on an 11th gen Intel chip and higher, with Resizable BAR on with DX 12 titles. This is too much for people interested in plug-and-play. For anyone looking for a budget GPU to pair with their 11th-gen or higher Intel CPU for mostly DX 12 titles, the Intel Arc A380 may be a decent choice.Ultimately, it is difficult to recommend the A380 over cards like the RX6500 XT in the present scenario. However, things can change for the better for Intel with some more tweaks and optimizations in upcoming driver updates. The hardware has potential, but the software needs some tweaking.",
      "snippet": "... year as a direct competitor to <b>Nvidia</b> and AMD's offerings. Intel's budget range graphics ... year as a direct competitor to <b>Nvidia</b> and AMD's offerings.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T13:10:03",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticg.sportskeeda.com/editor/2023/02/78ef2-16753397319907-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/gaming-tech/is-intel-arc-a380-worth-buying-2023"
      }
    },
    {
      "id": "4696984705153796335",
      "title": "Galaxy Unpacked 2023: Samsung Galaxy Book 3 Series unveiled",
      "url": "https://www.moneycontrol.com/news/technology/galaxy-unpacked-2023-samsung-galaxy-book-3-series-unveiled-9978271.html",
      "description": "Samsung's premium laptop can be configured with 13th Gen Intel Core i9 and Nvidia's RTX 4070 GPU",
      "body": "The Indian pricing for the laptops has not been announced yet.\nSpecifications\nThe Galaxy Book 3 Pro comes in two sizes - 14 inch and 16 inch. They have a Dynamic AMOLED 2X display with an adaptive refresh rate of up to 120Hz, and can cover 120 percent of the DCI-P3 color gamut. The screens have a resolution of 2880 x 1800.\n(Image Courtesy: Samsung)\nAs for the internals, the Galaxy Book 3 Pro gives users a choice between 13th Gen Evo Core i5 and Core i7 processors, paired with Intel's Xe Graphics. You can configure both machines with up to 32GB LPDDR5 RAM, and up to 1TB of internal PCIe SSD storage. Both laptops come pre-loaded with Windows 11.\n(Image Courtesy: Samsung)\nSamsung's 2-in-1 convertible, the Galaxy Book Pro 360 has a 16-inch display which like all the laptops in the line-up is a Dynamic AMOLED 2X screen with a resolution of 2880 x 1800 and an adaptive refresh rate of up to 120Hz.\nYou are given a choice between Intel's 13th Gen EVO Core i7 or Core i9 processors, paired with Intel's Xe Graphics. It can also be configured with up to 32GB of LPDDR5 RAM, and up to 1TB of PCIe SSD internal storage. It also has S-Pen support.\n(Image Courtesy: Samsung)\nThe 16-inch Galaxy Book 3 Ultra has a Dynamic AMOLED 2X display with a 16:10 aspect ratio. It has a brightness of 400 nits, and an adaptive refresh rate from 48hz to 120hz. The screen has a resolution of 2880 x 1800.\nSamsung gives you a choice between Intel's latest 13th Gen EVO platforms and users can choose between a Core i7 or a Core i9. Customers can also choose between Nvidia's GeForce RTX 4050 or RTX 4070 laptop GPU.\nIt supports Wi-Fi 6E and Bluetooth 5.1. You can choose up to 32GB of LPDDR 5 RAM and up to 1TB of PCIe SSD internal storage. The webcam is a FHD 1080p shooter with a studio quality dual mic.\nAs for speakers, it has AKG's Quad Speaker array with support for Dolby Atmos. The battery is 76Wh, that can be charged with 100W USB Type-C adaptor. It has two Thunderbolt 4 ports, and a USB Type-A port. It also has HDMI 2.0 port, microSD slot and a headphone/mic port.\nThe Galaxy Book 3 Ultra will run Microsoft's Windows 11.\nInvite your friends and family to sign up for MC Tech 3, our daily newsletter that breaks down the biggest tech and startup stories of the day\nDAILY-EVENING\nSUBSCRIBE",
      "snippet": "Samsung's premium laptop can be configured with 13th Gen Intel Core i9 and <b><b>Nvidia</b>'s</b> RTX 4070 GPU.\nThe Indian pricing for the laptops has not been announced yet.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:10:17",
      "provider": {
        "name": "moneycontrol",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.moneycontrol.com/static-mcnews/2023/02/Galaxy-Book-3-770x433.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "moneycontrol",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.moneycontrol.com/news/technology/galaxy-unpacked-2023-samsung-galaxy-book-3-series-unveiled-9978271.html"
      }
    },
    {
      "id": "613313209195592836",
      "title": "MSI unveils 13th Gen Intel Core powered laptops with Nvidia RTX 40 GPUs",
      "url": "https://www.business-standard.com/article/technology/msi-unveils-13th-gen-intel-core-powered-laptops-with-nvidia-rtx-40-gpus-123020200961_1.html",
      "description": "MSI introduced laptops in the Stealth series Titan GT series Raider GE series Cyborg series Creator Z series and more",
      "body": "Taiwanese laptop maker MSI on Thursday announced the NVIDIA GeForce RTX 40 series GPU powered laptops at its 39MSIology The Leap to Singularity39 event Powered by up to 13th Gen Intel Core HX series processors the new laptops are offered in MSIrsquos Stealth series Titan GT series Raider GE series Cyborg series Creator Z series and Prestige series The new line ups are available for pre order in select countries with India launch expected on February 8 Below are the laptops detailMSI Stealth seriesMSI announced Stealth 16 Studio and Stealth 14 Studio in the new Stealth series Equipped with the aluminum magnesium alloy body both the laptop comes in pure white and star blue colours Stealth 14 Studio features the MSI Vapor Chamber thermal design which enables the laptop to provide enhanced gaming experience and handle multi tasks efficiently The Stealth 16 Studio is a thin and light design laptop weighing 199 kg and is thinner than 2 cmMSI Titan GT series and Raider GE seriesThe Titan GT77 HX is powered by 13th Gen Intel Core i9 13980HX processor paired with up to GeForce RTX 4090 laptop GPU Equipped with MSI OverBoost Ultra technology the laptop supports 52GHz frequency across its eight performance cores   depending on workload MSI claims the Titan GT77HX comes with the worldrsquos first 4K144Hz MiniLED displayThe Raider GE series is inspired by a sports car with an aerodynamic design MSI introduced a Smart TouchPad on the special edition of Raider GE78 HX Most used functional hotkeys are put on the touchpad which also supports customizationMSI Cyborg 15Aimed at gamers Cyborg 15 comes with a glass fiber translucent chassis design which lets users see the inner mechanical parts through it The eye catching Cyborg 15 provides a sci fi futuristic look with the latest graphics and processors and will definitely be the top choice for everyday gaming according to the companyMSI Creator Z17 HX StudioThe Creator Z17 HX Studio comes with the Vapor Chamber Cooler thermal design to maximize the efficiency of 13th gen Intel HX series processors paired with NVIDIA RTX 40 series GPU This laptop comes with an MSI Pen 2 which makes good use of the MPP26 technology to connect fasterMSI Prestige seriesMSI Prestige 13 Evo is a thin and light design laptop which is powered by 75Whrs battery The Prestige 16 Studio sports a 16 inch screen and comes with GeForce RTX 40 series laptop GPUs It features NVIDIA Studio which is said to enhance productivity and performance It comes in star blue and beige rose colours",
      "snippet": "... Thursday announced the <b>NVIDIA</b> GeForce RTX 40 ... processors paired with <b>NVIDIA</b> RTX 40 series GPU ... laptop GPUs It features <b>NVIDIA</b> Studio which is said ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:46:00",
      "provider": {
        "name": "business-standard",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bsmedia.business-standard.com/_media/bs/img/article/2023-02/02/full/1675330775-0191.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "business-standard",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.business-standard.com/article/technology/msi-unveils-13th-gen-intel-core-powered-laptops-with-nvidia-rtx-40-gpus-123020200961_1.html"
      }
    },
    {
      "id": "5596071496776437681",
      "title": "Samsung Galaxy Book3 Ultra",
      "url": "https://www.geeky-gadgets.com/samsung-galaxy-book3-ultra-unveiled-at-galaxy-unpacked-2023-02-02-2023/",
      "description": "Samsung unveiled their new Galaxy S23 range of smartphones at Galaxy Unpacked 2023, they also unveiled their new Samsung Galaxy Book3 Ultra, Book3 Pro",
      "body": "Roland Hutchinson\nSamsung unveiled their new Galaxy S23 range of smartphones at Galaxy Unpacked 2023, they also unveiled their new Samsung Galaxy Book3 Ultra, Book3 Pro 360, and Book3 Pro.\nThe Galaxy Book3 Ultra comes with a 16-inch display with a resolution of 2880 x 1800 pixels, it features the latest 12th Gen Intel Core i7 and Core i9 Processors. Plus it comes with an NVIDIA\n\nGeForce RTX  4070 Laptop GPU,\n1\nThere is also up to 32gB of RAM and up to 1TB of storage, plus it comes with Thunderbolt 4, HDMI 2.0, and a 100W USB Type-C charger.\nThe Galaxy Book3 series offers ultra-high performance computing with an upgraded CPU, GPU, display and more. The Galaxy Book3 Ultra features the latest 13th Gen Intel\n\nmaking it the fastest Galaxy Book to date, as well as the NVIDIA\n\nGeForce RTX  4070 Laptop GPU,\n11\nproviding studio-grade graphics to enhance both creative projects and the gaming experience. For the first time, Samsungs Dynamic AMOLED 2X Display\n\nfirst used in the Galaxy premium smartphone lineup display\n\nis featured in the Galaxy Book3 Ultra and Pro series. Its 3K (28801800) resolution shows incredibly fine detail, and the adaptive 120Hz refresh rate offers a smooth and slick viewing experience. The display is also VESA ClearMR and DisplayHDR TRUE BLACK 500 certified and has received SGS Eye Care Display certification for the guaranteed reduction of blue light. All these improvements empower users to perform multiple demanding tasks, watch rich and detailed content without loss of fidelity and play high-spec games smoothly. Plus, depending on your viewing needs, you can opt for either a 14-inch\n12\n13\nfeaturing a 16:10 aspect ratio with the Galaxy Book3 Ultra and Pro series.\nYou can find out more information about the new Samsung Galaxy Book3 Ultra, Book3 Pro 360, and Book3 Pro over at Samsungs website at the link below.\nSource",
      "snippet": "Plus it comes with an <b>NVIDIA</b> GeForce RTX 4070 Laptop GPU, 1 There is also up to 32gB of RAM and up to 1TB of storage, plus it comes with Thunderbolt ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:00:27",
      "provider": {
        "name": "geeky-gadgets",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.geeky-gadgets.com/wp-content/uploads/2023/02/Samsung-Galaxy-Book3-Ultra-1.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "geeky-gadgets",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.geeky-gadgets.com/samsung-galaxy-book3-ultra-unveiled-at-galaxy-unpacked-2023-02-02-2023/"
      }
    },
    {
      "id": "5317857490055914320",
      "title": "Galaxy Book3 Pro Laptop: Samsung unveils Galaxy Book3 Ultra with 13th Gen Intel chips, Nvidia GPUs",
      "url": "https://www.business-standard.com/article/technology/samsung-unveils-galaxy-book3-ultra-with-13th-gen-intel-chips-nvidia-gpus-123020200577_1.html",
      "description": "Samsung Galaxy Book3 Ultra will enter the markets on February 22; the specific launch date for India is not yet revealed",
      "body": "Samsung Galaxy\nBook3 Ultra: Specifications\nPowered by the latest 13th Gen Intel Core processor in i7 and i9 variants, the laptop is said to be the fastest Galaxy Book to date. It has discrete NVIDIA RTX GeForce 4050 and 4070 GPUs for enhanced graphics and gaming experience. Featuring a 16-inch Dynamic AMOLED 2X Display with 3K resolution, and an adaptive 120Hz refresh rate, the laptop weighs 1.79kg. The Galaxy Book3 Ultra is offered in 16GB and 32GB RAM variants and 512GB and 1TB of internal storage with an in-built expansion slot.\nEquipped with a 76Wh battery, the laptop is offered with a 100W USB Type-C fast-wired charging port. It features a 1080p fullHD camera and AKG quad-speaker system with Dolby Atmos technology. Among other features, the Book3 Ultra offers an island-type backlit keyboard, a fingerprint sensor on the power key, AI noise-cancelling dual microphones, a sleek aluminium body, and a seamless Samsung Galaxy connected experience. Galaxy Book3 Ultra will be available in a Graphite colour shade.\nSubscribe to Business Standard Premium\nExclusive Stories, Curated Newsletters, 26 years of Archives, E-paper, and more!\nInvalid email. Please include '@' in the email address\nSubscribe",
      "snippet": "It has discrete <b>NVIDIA</b> RTX GeForce 4050 and 4070 GPUs for enhanced graphics and gaming experience. Featuring a 16-inch Dynamic AMOLED 2X Display with ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:43:00",
      "provider": {
        "name": "business-standard",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bsmedia.business-standard.com/_media/bs/img/article/2023-02/02/full/1675319892-4242.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "business-standard",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.business-standard.com/article/technology/samsung-unveils-galaxy-book3-ultra-with-13th-gen-intel-chips-nvidia-gpus-123020200577_1.html"
      }
    },
    {
      "id": "2617887271730718709",
      "title": "Quest Global Teams with NVIDIA to Build Next-Gen Omniverse Digital Twin Solutions for Manufacturing Industry",
      "url": "https://www.latestly.com/agency-news/business-news-quest-global-teams-with-nvidia-to-build-next-gen-omniverse-digital-twin-solutions-for-manufacturing-industry-4787375.html",
      "description": "Get latest articles and stories on Business at LatestLY. Quest Global, one of the world's fastest-growing engineering services firms, announced its development of new services and solutions, based on the NVIDIA Omniverse Enterprise platform. These new services and solutions will assist in delivering the best 3D visualization, simulation, design collaboration and digital twin solutions for the manufacturing and automotive industries.",
      "body": "Bangalore (Karnataka) [India], February 2 (ANI/PRNewswire): Quest Global, one of the world's fastest-growing engineering services firms, announced its development of new services and solutions, based on the NVIDIA Omniverse Enterprise platform. These new services and solutions will assist in delivering the best 3D visualization, simulation, design collaboration and digital twin solutions for the manufacturing and automotive industries.Through this association, Quest Global aims to facilitate the transformation of the traditional manufacturing processes and facilities by enabling manufacturers to augment their physical production environments with large-scale, AI and IoT-enabled, digital twin counterparts. These digital twins will enable manufacturers to optimize their manufacturing, logistics, and warehouse processes, reduce waste, and unlock operational efficiencies.Also Read | Rivian Layoffs: EV Car Maker To Slash 6% of Its Workforce, CEO RJ Scaringe Announces Sackings in Email to Employees.Speaking on the occasion, Dushyant Reddy, Global Business Head for Hi-Tech, Quest Global, said, &quot;As organizations work towards enabling their manufacturing operations with predictive analysis, operational efficiencies, and innovative automation, live digital twins of factory solutions play a vital role in achieving that. We are proud to work with NVIDIA to set up an Omniverse center of excellence, with trained engineers and NVIDIA-specific labs and infrastructure. This association is a testament to our commitment towards helping our customers pursue the next frontier of innovation and solve the world's hardest engineering problems.&quot;NVIDIA Omniverse Enterprise is an end-to-end 3D simulation platform that helps organizations develop and operate physically accurate, perfectly synchronized and AI-enabled digital twins. Building the factories of the future requires uniting disparate datasets from many 3D digital content creation (DCC) and simulation applications in full fidelity, a capability uniquely enabled by Omniverse Enterprise, then connecting to scalable AI platforms such as NVIDIA Isaac Sim for robotics simulation and Metropolis for vision AI applications.Also Read | Lionel Messi Drops Retirement Hint; &amp;#8216;There's Nothing Left&amp;#8217;, Claims FIFA World Cup 2022 Champion.&quot;The industrial metaverse requires innovative simulation and AI capabilities to tackle today's critical manufacturing and automotive challenges,&quot; said Brian Harrison, Senior Director of Product Management for Omniverse Digital Twins at NVIDIA. &quot;The collaboration between Quest Global and NVIDIA delivers workflow solutions and enhancements that take manufacturing and design collaboration to the next level.&quot; Quest Global -- a long-standing Elite member of the NVIDIA Partner Network - is uniquely positioned to leverage its 3D simulation, engineering, and AI capabilities to help manufacturers quickly develop and harness digital twins of their production environments. The company plans to utilize the capabilities of Omniverse for its customers across industry sectors for product design, optimization and operation of factories of the future, simulation and training of robotics, synthetic data generation for AI training and much more.Since its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company's invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics and ignited the era of modern AI. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.We are Quest Global. We're in the business of engineering, but what we're really building is a brighter future. It's not just what we do, but why we do it that makes us different. We believe engineering has the unique opportunity to solve the problems of today that stand in the way of tomorrow. For 25 years, we have strived to be the most trusted partner for the world's hardest engineering problems. As a global organization headquartered in Singapore, we live and work in 17 countries, with 56 global delivery centers &amp;amp; offices, driven by 17,000+ extraordinary employees who make the impossible possible every day.Quest Global brings deep industry knowledge and digital expertise to deliver end-to-end global product engineering services. We bring together technologies and industries alongside the contributions of diverse individuals and their areas of expertise to solve problems better, and faster. This multi-dimensional approach enables us to solve the most important and large-scale challenges across the Aerospace &amp;amp; Defense, Automotive, Energy, Hi-Tech, Healthcare, Medical Devices, Rail, and Semiconductor industries. Read more.For More Information: Anubhuti AgarwalAnubhuti.Agarwal@quest-global.com This story is provided by PRNewswire. ANI will not be responsible in any way for the content of this article. (ANI/PRNewswire) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)",
      "snippet": "... engineering services firms, announced its development of new services and solutions, based on the <b>NVIDIA</b> Omniverse Enterprise platform.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:28:26",
      "provider": {
        "name": "latestly",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://st1.latestly.com/wp-content/uploads/2023/02/ANI-20230202061558.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "latestly",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.latestly.com/agency-news/business-news-quest-global-teams-with-nvidia-to-build-next-gen-omniverse-digital-twin-solutions-for-manufacturing-industry-4787375.html"
      }
    },
    {
      "id": "3838289538399107630",
      "title": "Intel & NVIDIA Chips Still In Use Openly For Chinese Military & Nuclear Research",
      "url": "https://wccftech.com/intel-nvidia-chips-still-in-use-openly-for-chinese-military-nuclear-research/",
      "description": "Intel and NVIDIA chips purchased from online sellers are in use in China, even after the US government has made attempts to halt sales.",
      "body": "Feb 2, 2023 01:00 AM EST\n\nCopy Shortlink\nWith China prevented by the U.S. government from accessing technologies that would assist various companies and organizations overseas in the use of designing military and nuclear weapons, that has not stopped any Chinese groups from obtaining non-blacklisted technology from other sources on the open marketplaces, namely Aliexpress and Taobao, reports the\nWall Street Journal.\nChina openly admits to using Intel and NVIDIA PC hardware obtained legally through online sellers from Taobao, Aliexpress, and more\nOne group discovered by a research report from WSJ was the China Academy of Engineering Physics, or CAEP, which the U.S. Department of Commerce has blocked since 1997. The news organization found that the CAEP utilizes Intel Xeon Gold CPUs and NVIDIA GeForce RTX GPUs in their research that was obtained from the two online marketplaces as well as others. It should be noted that the CAEP assisted China with its nuclear program and created the first hydrogen bomb for China. WSJ reports that the government has hundreds of warheads, possibly over 400 stockpiled, and is anticipated to reach over 1,500 in the next ten to fifteen years.\nThe Trump and Biden administrations have attempted to halt China's nuclear and military research and development, which has caused Chinese organizations to utilize consumer-grade CPUs and GPUs to assist with HPC or high-performance computing needs to help with their research.\nKevin Wolf, the former top Commerce Department official, told WSJ, \"It is insanely difficult to enforce the U.S. restrictions when it comes to transactions overseas.\" The CAEP still uses equipment and products purchased in 2020, including Intel processors and NVIDIA V100 graphics cards. In 2021, the Chinese government purchased over a third of the semiconductor chips in the world for supercomputers during the year 2021.\nA U.S. Bureau of Industry and Security representative explained to WSJ, \"As mass-market products move through multiple parties in global supply chains, full visibility on ultimate end users is a large undertaking.\"\nThis unfortunate discovery is not hidden from the U.S. government or the public, as the CAEP has been open about using the machines and technology. It is unknown what steps U.S. officials are planning to take further to stop the development of more weapons in China.\nNews Sources: Wall Street Journal,",
      "snippet": "Intel and <b>NVIDIA</b> chips purchased from online sellers are in use in China, even after the US government has made attempts to halt sales. Feb 2, 2023 ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:00:10",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2022/09/US-China-Chip-War-GPU-NVIDIA.webp",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/intel-nvidia-chips-still-in-use-openly-for-chinese-military-nuclear-research/"
      }
    },
    {
      "id": "8741967693641182500",
      "title": "Quest Global Teams with NVIDIA to Build Next-Gen Omniverse Digital Twin Solutions for Manufacturing Industry",
      "url": "https://finance.yahoo.com/news/quest-global-teams-nvidia-build-050000228.html",
      "description": "Quest Global, one of the world's fastest-growing engineering services firms, announced its development of new services and solutions, based on the NVIDIA...",
      "body": ",\nFeb. 2, 2023\n/PRNewswire/ --Quest Global, one of the world's fastest-growing engineering services firms, announced its development of new services and solutions, based on the NVIDIA Omniverse Enterprise platform. These new services and solutions will assist in delivering the best 3D visualization, simulation, design collaboration and digital twin solutions for the manufacturing and automotive industries.\nNVIDIA ElitePartner\nThrough this association, Quest Global aims to facilitate the transformation of the traditional manufacturing processes and facilities by enabling manufacturers to augment their physical production environments with large-scale, AI and IoT-enabled, digital twin counterparts. These digital twins will enable manufacturers to optimize their manufacturing, logistics, and warehouse processes, reduce waste, and unlock operational efficiencies.\nSpeaking on the occasion,\nDushyant Reddy\n, Global Business Head for Hi-Tech, Quest Global,\nsaid, \"As organizations work towards enabling their manufacturing operations with predictive analysis, operational efficiencies, and innovative automation, live digital twins of factory solutions play a vital role in achieving that. We are proud to work with NVIDIA to set up an Omniverse center of excellence, with trained engineers and NVIDIA-specific labs and infrastructure. This association is a testament to our commitment towards helping our customers pursue the next frontier of innovation and solve the world's hardest engineering problems.\"\nNVIDIA Omniverse Enterprise is an end-to-end 3D simulation platform that helps organizations develop and operate physically accurate, perfectly synchronized and AI-enabled digital twins. Building the factories of the future requires uniting disparate datasets from many 3D digital content creation (DCC) and simulation applications in full fidelity, a capability uniquely enabled by Omniverse Enterprise, then connecting to scalable AI platforms such as NVIDIA Isaac Sim for robotics simulation and Metropolis for vision AI applications.\nStory continues\n\"The industrial metaverse requires innovative simulation and AI capabilities to tackle today's critical manufacturing and automotive challenges,\" said\nBrian Harrison\n, Senior Director of Product Management for Omniverse Digital Twins at NVIDIA\n. \"The collaboration between Quest Global and NVIDIA delivers workflow solutions and enhancements that take manufacturing and design collaboration to the next level.\"\nQuest Global  a long-standing Elite member of the NVIDIA Partner Network  is uniquely positioned to leverage its 3D simulation, engineering, and AI capabilities to help manufacturers quickly develop and harness digital twins of their production environments. The company plans to utilize the capabilities of Omniverse for its customers across industry sectors for product design, optimization and operation of factories of the future, simulation and training of robotics, synthetic data generation for AI training and much more.\nAbout NVIDIA\nNVIDIA\n(NASDAQ: NVDA) has been a pioneer in accelerated computing. The company's invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics and ignited the era of modern AI. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\nAbout Quest Global\nWe are Quest Global. We're in the business of engineering, but what we're really building is a brighter future. It's not just what we do, but why we do it that makes us different. We believe engineering has the unique opportunity to solve the problems of today that stand in the way of tomorrow. For 25 years, we have strived to be the most trusted partner for the world's hardest engineering problems. As a global organization headquartered in\nSingapore\n, we live and work in 17 countries, with 56 global delivery centers & offices, driven by 17,000+ extraordinary employees who make the impossible possible every day.\nQuest Global brings deep industry knowledge and digital expertise to deliver end-to-end global product engineering services. We bring together technologies and industries alongside the contributions of diverse individuals and their areas of expertise to solve problems better, and faster. This multi-dimensional approach enables us to solve the most important and large-scale challenges across the Aerospace & Defense, Automotive, Energy, Hi-Tech, Healthcare, Medical Devices, Rail, and Semiconductor industries. Read more.\nFor More Information:",
      "snippet": "... Global, one of the world's fastest-growing engineering services firms, announced its development of new services and solutions, based on the <b>NVIDIA</b>.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:00:00",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.zenfs.com/en/prnewswire.com/7605fbd03c1000fd4c207b7330986f1f",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://finance.yahoo.com/news/quest-global-teams-nvidia-build-050000228.html"
      }
    },
    {
      "id": "213023811838796237",
      "title": "AMD admits to restraining chip supply to keep higher CPU and GPU prices",
      "url": "https://hardforum.com/threads/amd-admits-to-restraining-chip-supply-to-keep-higher-cpu-and-gpu-prices.2025342/",
      "description": "Ouch... so I guess we can say fuck Nvidia and AMD.   Apologize if this has been posted already.Hit em back by saying \"No\"!Smells like some collusion...",
      "body": "Ouch... so I guess we can say fuck Nvidia and AMD.   Apologize if this has been posted already.\n\nHit em back by saying \"No\"!\nSmells like some collusion?\n\nSource...",
      "snippet": "so I guess we can say fuck <b>Nvidia</b> and AMD. Apologize if this has been posted already.Hit em back by saying \"No\"!Smells like some collusion.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T01:56:27",
      "provider": {
        "name": "hardforum",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hardforum",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://hardforum.com/threads/amd-admits-to-restraining-chip-supply-to-keep-higher-cpu-and-gpu-prices.2025342/"
      }
    },
    {
      "id": "8603982764831536221",
      "title": "Invitation to Electrolux Q4 presentation",
      "url": "https://finance.yahoo.com/news/invitation-electrolux-q4-presentation-071900508.html",
      "description": "Electrolux results for the fourth quarter of 2022 will be published on February 2, 2023, at approximately 08.00 CET.",
      "body": "It feels like way too much to lose. We had $550K invested and told our adviser we wanted a conservative approach. Since then weve lost $88K.  Should we fire him?\nQuestion: Two years ago my husband took an early retirement when offered by his company.  At that time we had a 401(k) with about $550,000 that we gave to a big financial services firm rep to handle.  Answer: There are a few questions to ask here: First, is your withdrawal rate reasonable; second did your adviser do you wrong with those big losses; and third, what do you do about the adviser situation?\n22h ago\nWhy Semiconductor Stocks Taiwan Semiconductor, Nvidia, and Skyworks Solutions Rallied Today\nShares of semiconductor stocks Taiwan Semiconductor Manufacturing (NYSE: TSM), Nvidia (NASDAQ: NVDA), and Skyworks Solutions (NASDAQ: SWKS) were rising on Tuesday, up as much as 3.4%, 4.6%, and 2.2%, before settling into gains of 2.7%, 4%, and 0.6%, respectively, as of 1:42 p.m. ET.  The sector-wide optimism was helped along by a positive note from Bank of America semiconductor analyst Vivek Arya this morning, along with continued optimism over moderating inflation and the broader economy.  Arya wrote, \"We assume a soft-landing (nonmemory semi sales down [less than 5% year over year], also confirmed by recent Taiwan Semiconductor (TSM) results/outlook) as consumer chip inventory correction is completed by [the first half] and as industrial/auto chip pricing remains resilient.\"\n12h ago\nWhy Investors Hung Up on Verizon Today\nOn a generally down Tuesday for the stock market, Verizon Communications' (NYSE: VZ) shares did worse than those of many other companies.  The telecom giant saw its stock price erode by nearly 2.5%, amid a general slump in tech stocks and related titles, combined with a discouraging price cut from a prominent bank.  Before market open, analyst Bryan Craft of Deutsche Bank enacted a 10% cut to his level on Verizon stock.\n9h ago\nSeeking at Least 7% Dividend Yield? Morgan Stanley Suggests 2 Dividend Stocks to Buy\nThe conventional wisdom outlook for 2023 is mixed  most market watchers and economists would say that a recession is likely during the first half of the year, with disagreements centered more on the duration and depth of a downturn than its likelihood, and a rebound will come in the second half, leading to stock markets finishing this year about where they began. Weighing in from Morgan Stanley, chief Us equity strategist Mike Wilson notes the conventional wisdom, saying: Both the sell and buy\n17h ago\nThe bear market knocked down growth stocks by the dozens last year -- even if these companies didn't report bad news. So, if a particular growth company actually did report disappointing news, losses were much greater.\n13h ago\nTipRanks\nGoldman Sachs Bull Case Sees S&P 500 Rebounding 12% in 2023  Here Are 3 Stocks to Bet on It\nAfter 2022s inflation-driven market meltdown, 2023s bogey number 1 appears to be the fear of a global recession. However, Sharmin Mossavar-Rahmani, CIO of Goldman Sachs wealth-management segment, does not necessarily think this is a particularly bad omen for the stock market. Were not arguing that todays valuations fully discount a recession, but considering last years equity drawdown, we do think a significant part of any valuation reset has already occurred, Mossavar-Rahmani opined. In\n7h ago\nBiden Administration Paying Americans Thousands of Dollars to Upgrade Their Homes\nOn Aug. 16, President Joe Biden signed the Inflation Reduction Act into law, directing billions of dollars to Americans looking to upgrade their homes, businesses and cars. One provision of the law allows Americans making less than $150,000 a year to claim a $7,500 tax credit for buying an electric car. The law also provides $9 billion in rebates to help people electrify their home appliances and make their houses more energy-efficient. Its also allowing Americans to claim a tax credit for inst\n9h ago\nThanks to the moves of a pair of analysts, investors have taken more notice of the high-yielding REIT.\n8h ago\nChina Driving Dollar More Than Fed Hikes, BofA Strategists Say\n(Bloomberg) -- While much of the focus in currency markets right now is how the prospect of slowing Federal Reserve rate hikes has helped fuel dollar weakness, the biggest factor may be across the world in China.Most Read from BloombergMicrosoft to Cut Engineering Jobs This Week as Layoffs Go DeeperChinas Population Shrinks for First Time Since 1960s in Seismic ShiftInvestors Seek to Pull $20 Billion From Core Real Estate FundsApple Delays AR Glasses, Plans Cheaper Mixed-Reality HeadsetLarry Fi\n3h ago\nWhat Income Level Is Considered Rich?\nEarning more money can make it easier to pay the bills, fund your financial goals and spend on hobbies or \"fun,\" but what income is considered to make you rich? The answer can depend on several factors, including where you  Continue reading  The post What Income Level Is Considered Rich? appeared first on SmartAsset Blog.\n18h ago\nWall Street's fear gauge falls to its lowest level in months, and Wall Street strategists worry it could be a warning that the latest stock-market rally is coming to an end.\n10h ago\nWhy SoFi Technologies Stock Was Up 4.3% Today\nThe major indexes were mixed on Tuesday, as the S&P 500 was down 8 points (0.2%), the Dow Jones Industrial Average was off 392 points (1.1%), while the Nasdaq Composite was down 16 points (0.14%).  It is fourth-quarter earnings season, and the market took a bit of a hit today as some of the big bellwether banks reported Tuesday, including Goldman Sachs and Morgan Stanley.  Goldman Sachs had its worst earnings miss in a decade, as it got hit hard by the slowdown in the investment banking business.\n10h ago\nOccidental Petroleum stock's 91% rise in the past year is impressive. You can be sure Warren Buffett is paying attention to another trait.\n19h ago\nWhy Riot Platforms, Hut 8 Mining Corp, and HIVE Blockchain Technologies Are Volatile Today\nShares of the Chinese Bitcoin miner Riot Platforms (NASDAQ: RIOT) traded more than 10% higher earlier today.  Shares of Hut 8 Mining Corp (NASDAQ: HUT) traded as much as 19% higher today but now only trade about 8% higher, while shares of HIVE Blockchain Technologies (NASDAQ: HIVE) were up about 14% but now are only up about 4.5%.  Riot, Hut 8, and HIVE Blockchain are all Bitcoin miners, meaning their business model involves trying to mine as many Bitcoin as possible in the most efficient manner.\n15h ago",
      "snippet": "... Stocks Taiwan Semiconductor, <b>Nvidia</b>, and Skyworks Solutions Rallied ... Semiconductor Manufacturing (NYSE: TSM), <b>Nvidia</b> (NASDAQ: NVDA), and Skyworks ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.zenfs.com/en/prnewswire.com/6c670586990041fcd1e660598c27d654",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://finance.yahoo.com/news/invitation-electrolux-q4-presentation-071900508.html"
      }
    },
    {
      "id": "6933384113613420429",
      "title": "NVIDIA Reaches Analyst Target Price",
      "url": "https://www.nasdaq.com/articles/nvidia-reaches-analyst-target-price",
      "description": "In recent trading, shares of NVIDIA Corp (Symbol: NVDA) have crossed above the average analyst 12-month target price of $204.59, changing hands for $209.43/share.  When a stock reaches the target an analyst has set, the analyst logically has two ways to react: downgrade on valuat",
      "body": "BNK Invest\n->\nIn recent trading, shares of NVIDIA Corp (Symbol: NVDA) have crossed above the average analyst 12-month target price of $204.59, changing hands for $209.43/share.  When a stock reaches the target an analyst has set, the analyst logically has two ways to react: downgrade on valuation, or, re-adjust their target price to a higher level.  Analyst reaction may also depend on the fundamental business developments that may be responsible for driving the stock price higher  if things are looking up for the company, perhaps it is time for that target price to be raised.\nThere are 29 different analyst targets within the Zacks coverage universe contributing to that average for NVIDIA Corp, but the average is just that  a mathematical average.  There are analysts with lower targets than the average, including one looking for a price of $133.00.  And then on the other side of the spectrum one analyst has a target as high as $280.00.  The standard deviation is $39.517.\nBut the whole reason to look at the\naverage\nNVDA price target in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes.  And so with NVDA crossing above that average target price of $204.59/share, investors in NVDA have been given a good signal to spend fresh time assessing the company and deciding for themselves: is $204.59 just one stop on the way to an even\nhigher\ntarget, or has the valuation gotten stretched to the point where it is time to think about taking some chips off the table?  Below is a table showing the current thinking of the analysts that cover NVIDIA Corp:\nRecent NVDA Analyst Ratings Breakdown\n",
      "snippet": "In recent trading, shares of <b>NVIDIA</b> Corp (Symbol: NVDA) have crossed above the average analyst 12-month target price of $204.59, changing hands for ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/nvidia-reaches-analyst-target-price"
      }
    },
    {
      "id": "857036137717252614",
      "title": "Samsung's new Galaxy Book3 Ultra is the most powerful Galaxy notebook yet",
      "url": "https://www.hardwarezone.com.sg/tech-news-samsung-galaxy-book3-ultra-book3-pro-360-singapore-price-specs",
      "description": "The most extreme version of the Galaxy Book3 features a fast OLED display, H-series processors, and NVIDIA RTX graphics.",
      "body": "Next >\nSamsung's new Galaxy Book3 Ultra is the most powerful Galaxy notebook yet\nAlongside the new Galaxy S23 phones, Samsung also unveiled its new Galaxy Book3 notebooks. The star of the notebooks, however, has to be the all-new Galaxy Book3 Ultra.\nAs its name suggest, this is the flagship of the Galaxy Book3 lineup and its specs are impressive.\nIt has a 16-inch OLED display that has a resolution of 2880 x 1800 pixels and a high 120Hz refresh rate. The display is alsoVESA ClearMR and DisplayHDR TRUE BLACK 500 certified.\nAnd underneath the proverbial hood are the latest chips from Intel and NVIDIA. It's powered by Intel's latest 13th Gen H-series Core processors  and you can get it with either a the Core i7-13700H or Core i9-13900H.\nGraphics duties are handled by NVIDIA's RTX 40 series GPUs and you can get the Galaxy Book3 Ultra with either a GeForce RTX 4050 or RTX 4070.\nThe Galaxy Book3 Ultra can be equipped with up to 32GB of memory and 1TB of SSD storage.\nDespite the notebook's formidable specs, the Galaxy Book3 Ultra is just 16.5mm thick. Weight is around 1.7kg thanks to an aluminium chassis.\nIt won't be a Galaxy notebook without some sort of integration with Samsung's Galaxy mobile devices and users who are invested in Samsung's ecosystem will be able to quickly share and transfer files between the Galaxy Book3 Ultra and their Galaxy phones. And if you have a Galaxy Tab, you can use it as a secondary display.\nThe Galaxy Book3 Ultra wasn't the only notebook Samsung announced because there's also the Galaxy Book3 Pro and Galaxy Book3 Pro 360. The former is a traditional clamshell-style notebook while the latter is a convertible-style notebook.\nLike the Ultra, these notebooks are powered Intel's newest 13th Gen Core processors and they feature 3K OLED displays. The Galaxy Book3 Pro is available in 14 and 16-inch sizes while the Galaxy Book3 Pro 360 is only available in 16-inch.\n\nAvailability and pricing\nThere's no word yet on local availability and pricing but the Galaxy Book3 Pro and Pro 360 will go on sale later this month in the US with prices starting at US$1,449.99 (~S$1,901) and US$1,899.99 (~S$2,492) respectively.\nPrices of the more powerful Galaxy Book3 Ultra will start at S$2,399.99 (~S$3,147)but no release date has been set yet.\n< Prev",
      "snippet": "... the Galaxy Book3 features a fast OLED display, H-series processors, and <b>NVIDIA</b> RTX graphics. Next > Samsung's new Galaxy Book3 Ultra is the most ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "hardwarezone",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.hardwarezone.com.sg/thumbs/703985/og.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hardwarezone",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.hardwarezone.com.sg/tech-news-samsung-galaxy-book3-ultra-book3-pro-360-singapore-price-specs"
      }
    },
    {
      "id": "6513875784499888379",
      "title": "NVIDIA Sets Conference Call for Fourth-Quarter Financial",
      "url": "https://www.globenewswire.com/news-release/2023/02/01/2600043/0/en/NVIDIA-Sets-Conference-Call-for-Fourth-Quarter-Financial-Results.html",
      "description": "CFO Commentary to Be Provided in Writing Ahead of Call...",
      "body": "NVIDIA Sets Conference Call for Fourth-Quarter Financial Results\nCFO Commentary to Be Provided in Writing Ahead of Call\nFebruary 01, 2023 17:00 ET\n| Source:\nNVIDIA\nSanta Clara, California, UNITED STATES\nSANTA CLARA, Calif., Feb.  01, 2023  (GLOBE NEWSWIRE) -- NVIDIA will host a conference call on Wednesday, February 22, at 2 p.m. PT (5 p.m. ET) to discuss its financial results for the fourth quarter and fiscal year 2023, which ended January 29, 2023.\nThe call will be webcast live (in listen-only mode) on\ninvestor.nvidia.com\n. The companys prepared remarks will be followed by a question-and-answer session, which will be limited to questions from financial analysts and institutional investors.\nAhead of the call, NVIDIA will provide written commentary on its fourth-quarter results from its CFO. This material will be posted to\ninvestor.nvidia.com\nimmediately after the companys results are publicly announced at approximately 1:20 p.m. PT.\nThe webcast will be recorded and available for replay until the companys conference call to discuss financial results for its first quarter of fiscal year 2024.\nAbout NVIDIA",
      "snippet": "<b>NVIDIA</b> will host a conference call on Wednesday, February 22, at 2 p.m. PT (5 p.m. ET) to discuss its financial results for the fourth quarter and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T22:00:00",
      "provider": {
        "name": "globenewswire",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://ml.globenewswire.com/Resource/Download/ad3b9553-6933-40b1-adfd-2ed199cd141c?size=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "globenewswire",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.globenewswire.com/news-release/2023/02/01/2600043/0/en/NVIDIA-Sets-Conference-Call-for-Fourth-Quarter-Financial-Results.html"
      }
    },
    {
      "id": "8502395585160132935",
      "title": "NVIDIA Sets Conference Call for Fourth-Quarter Financial Results",
      "url": "https://www.einpresswire.com/article/614654318/nvidia-sets-conference-call-for-fourth-quarter-financial-results",
      "description": "NVIDIA will host a conference call on Wednesday, February 22, at 2 p.m.PT (5 p.m. ET) to discuss its financial results for the fourth quarter and fiscal year",
      "body": "CFO Commentary to Be Provided in Writing Ahead of Call\n/\nEIN News\n/ -- SANTA CLARA, Calif., Feb.  01, 2023  (GLOBE NEWSWIRE) -- NVIDIA will host a conference call on Wednesday, February 22, at 2 p.m.PT (5 p.m. ET) to discuss its financial results for the fourth quarter and fiscal year 2023, which ended January 29, 2023.\nThe call will be webcast live (in listen-only mode) on\ninvestor.nvidia.com\n. The companys prepared remarks will be followed by a question-and-answer session, which will be limited to questions from financial analysts and institutional investors.\nAhead of the call, NVIDIA will provide written commentary on its fourth-quarter results from its CFO. This material will be posted to\ninvestor.nvidia.com\nimmediately after the companys results are publicly announced at approximately 1:20 p.m. PT.\nThe webcast will be recorded and available for replay until the companys conference call to discuss financial results for its first quarter of fiscal year 2024.\nAbout NVIDIA\nSince its founding in 1993,\nNVIDIA\n(NASDAQ: NVDA) has been a pioneer in accelerated computing. The companys invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at\nhttps://nvidianews.nvidia.com/",
      "snippet": "<b>NVIDIA</b> will host a conference call on Wednesday, February 22, at 2 p.m.PT (5 p.m. ET) to discuss its financial results for the fourth quarter and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T22:00:00",
      "provider": {
        "name": "einpresswire",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.globenewswire.com/newsroom/ti?nf=ODczOTM2MyM1MzgxNTI2IzIwMDY5MTI=",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "einpresswire",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.einpresswire.com/article/614654318/nvidia-sets-conference-call-for-fourth-quarter-financial-results"
      }
    },
    {
      "id": "1722644881214162341",
      "title": "Nvidia GPU slowed down by Discord? There's a workaround",
      "url": "https://www.theshortcut.com/p/discord-slowing-down-nvidia-gpu-fix-coming",
      "description": "The popular chat server app is slowing down Nvidia GPUs by up to 200MHz  Nvidia is fixing it, and has offered a workaround in the meantime",
      "body": "Retweets\nBetter streaming with AV1\nThe update, issued last week, lets users with GeForce RTX 40-series GPUs use AV1 streams at 4K resolution with 60 frames per second and an 8Mbps bitrate. For context, thats a lower bitrate than what youd expect from a Netflix stream. Discord streaming is done as a P2P affair, and when users with machines incapable of decoding that stream join, it will automatically switch to the older H.264 standard.\nNvidias temporary fix involves downloading a GPU profile manager and updating the Discord profile with a new setting ID, then exporting a new profile to a .txt file and re-importing it, then quitting and reopening Discord.\nNvidia says it will release an OTA update soon to make this hotfix unnecessary.\nSubscribe",
      "snippet": "<b>Nvidia</b> says it will release an OTA update soon to make this hotfix unnecessary.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T20:16:08",
      "provider": {
        "name": "theshortcut",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4d27c617-8c33-4fa7-8273-ac3d9462b6fa_5377x3025.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theshortcut",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.theshortcut.com/p/discord-slowing-down-nvidia-gpu-fix-coming"
      }
    },
    {
      "id": "2226178191669274239",
      "title": "Samsung goes after the MacBook Pro, launches Galaxy Book3 range of high performance laptops; All you need know",
      "url": "https://www.timesnownews.com/technology-science/samsung-goes-after-the-macbook-pro-launches-galaxy-book3-range-of-high-performance-laptops-all-you-need-know-article-97534524",
      "description": "Intels 13th Gen chipset, Nvidias 4XXX GPU, 3K 120Hz AMOLED displays, packed in an aluminum frame the Galaxy Book3 series from Samsung will be available in select markets from 17th February onwards.",
      "body": "Samsung Unpacked 2023: Samsung today unveiled the Galaxy Book3 series, its latest flagship PC lineup featuring the Galaxy Book3 Ultra, Book3 Pro 360 and Book3 Pro. The Galaxy Book3 Ultra  Samsungs new premium PC  features ultra-high-performance computing, the Galaxy Book3 Pro 360 features a 2-in-1 convertible form factor with S Pen functionality, and the Galaxy Book3 Pro features thin and light, mobility-first clamshell design. The Galaxy Book3 series is designed for those who need seamless multi-device connectivity and premium hardware to supercharge their productivity and creativity. Today, were seeing an increasing number of people using multiple devices to perform efficiently. These new workflows are made possible thanks to our open and extensive Galaxy ecosystem, said TM Roh, President and Head of Mobile eXperience Business at Samsung Electronics. The latest Galaxy Book3 series further enriches our connected offerings. It is tailor-made for Galaxy enthusiasts looking for ultra-high computing performance and seamless connected Galaxy experiences to maximize their productivity and creativity.The Samsung Galaxy Book3 series (Galaxy Book3 Ultra, Book3 Pro 360 and Book3 Pro)The Galaxy Book3 series offers ultra-high performance computing with an upgraded CPU, GPU, display and more. The Galaxy Book3 Ultra features the latest 13th Gen Intel Core i9 processor, making it the fastest Galaxy Book to date, as well as the NVIDIA RTX GeForce 4070 mobile GPU, providing studio-grade graphics to enhance both creative projects and the gaming experience. For the first time, Samsungs Dynamic AMOLED 2X Display  first used in the Galaxy premium smartphone lineup display  is featured in the Galaxy Book3 Ultra and Pro series. Its 3K (2880x1800) resolution shows incredibly fine detail, and the adaptive 120Hz refresh rate offers a smooth and slick viewing experience. The display is also VESA ClearMR and DisplayHDR TRUE BLACK 500 certified, and has received SGS Eye Care Display certification for the guaranteed reduction of blue light. All these improvements empower users to perform multiple demanding tasks, watch rich and detailed content without loss of fidelity, and play high-spec games smoothly. Plus, depending on your viewing needs, you can opt for either a 14-inch or 16-inch display featuring a 16:10 aspect ratio with the Galaxy Book3 Ultra and Pro series. The audio quality of the Galaxy Book3 Ultra and Pro series is more refined, with a new quad speaker system that delivers clear, high notes and a rich bass sound. Studio quality dual microphones, along with AI Noise Canceling, clearly capture your voice and reduce background noise. And as video calls are now a part of everyday life, you can confidently join anytime and still look your best with Studio Mode, which offers improved visuals with lighting correction, auto framing, eye contact correction and smooth backgrounds.The Galaxy Book3 series offers a connected experience that is both intuitive and familiar. Link to Windows / Microsoft Phone Link, including all new on-the-go productivity features, allows users to enjoy seamless phone-to-PC connectivity across operating systems. Link to Windows / Microsoft Phone Links Recent Websites, lets you continue web sessions from your phone to PC  like looking up the price of a flight on your phone and then booking it on your PC, while Instant Hotspot enables effortless connection to wireless hotspots with just a click.In addition, users can move seamlessly between multiple screens across different devices with no disruptions. The Samsung Multi Control feature lets you control your PC, Galaxy Tab and now Galaxy smartphone with the Galaxy Book3 series keyboard and trackpad, enabling you to copy and paste or drag-and-drop between devices, while Second Screen turns your Galaxy Tab into an additional monitor with a single click. And since content creation increasingly happens on multiple devices, the Galaxy Book 3 series makes the creative process easier. Now, users can take high quality photos using Expert RAW on their Galaxy smartphone, transfer them to the Galaxy Book3 series automatically, and edit them with professional-level photo editing tool.The new Galaxy Book3 Ultra and Pro series uses a full aluminum frame for a premium look and feel  ensuring an enhanced user experience while preserving its light, sleek and flat design. Samsung is committed to the eco-conscious designs of the Galaxy Book3 Ultra and Pro series, furthering our efforts to preserve the planet for generations to come. Parts of the Galaxy Book3 Ultra and Pro series contain recycled plastics that use ocean-bound discarded fishing nets and water barrels.      Availability The Galaxy Book3 Ultra will be available in 16-inch in Graphite, the Galaxy Book3 Pro will be available in 14-inch and 16-inch Graphite and Beige color options and the Galaxy Book3 Pro 360 will be available in 16-inch with 5G connectivity options and Graphite and Beige color options. Galaxy Book3 Pro, and Pro 360 will be available in select markets starting on February 17 followed by Galaxy Book3 Ultra starting on February 22. Specs - Galaxy Book3 Ultra 16-inch    Galaxy Book3 Ultra 16-inch   Dimensions 355.4 x 250.4 x 16.5mm   Weight 1.79kg     OS Windows 11   Display 16-inch Dynamic AMOLED 2X (16:10 ratio),   400nits, Adaptive 120Hz Refresh Rate(48 - 120hz),   120% Color volume (DCI-P3), 3K (2880 x 1800)   *400nits (Typ), 500nits (HDR) -VESA HDR 500 authentication, HDR Contents only.   CPU (Platform) 13th Gen Intel Core i7/Core i9 (Intel EVO)     Graphic NVIDIA GeForce RTX 4070 Laptop GPU /   NVIDIA GeForce RTX 4050 Laptop GPU        Connectivity Wi-Fi 6E, 802.11 ax 2x2   (WLAN) Bluetooth v5.1         Color Graphite   Memory 16GB/32GB (LPDDR5)     Storage 512GB/1TB SSD (PCIe) + expansion slot     Camera/Mic FHD 1080p/Studio-quality Dual Mic   Audio AKG Quad Speaker (Woofer Max 5Wx2, Tweeter 2Wx2),   (Speakers) Smart Amp, Dolby Atmos   Keyboard 3-row Numeric, Island Type with Backlit     Battery 76Wh (Typical)   Charging 100W USB Type-C Adaptor   Authentication Secured-core PC, Fingerprint on Power Key   (Security)    Ports Thunderbolt 4 (2), USB Type-A (1),    HDMI 2.0, microSD, Headphone/Mic     Specs - Galaxy Book3 Pro Specifications      Galaxy Book3 Pro 14 Galaxy Book3 Pro 16   Dimensions 312.3 x 223.8 x 11.3mm 355.4 x 250.4 x 12.5mm   Weight 1.17kg 1.56kg   OS Windows 11   Display 14-inch Dynamic AMOLED 2X 16-inch Dynamic AMOLED 2X   (16:10 ratio), 400nits, Adaptive 120Hz Refresh Rate(48 - 120hz), (16:10 ratio), 400nits, Adaptive 120Hz Refresh Rate(48 - 120hz),   120% Color volume (DCI-P3), 120% Color volume (DCI-P3),   3K (2880 x 1800) 3K (2880 x 1800)    CPU 13th Gen Intel Core i5/Core i7 (Intel EVO)   (Platform)   Graphic Intel Iris Xe Graphics   Connectivity Wi-Fi 6E, 802.11 ax 2x2, Bluetooth v5.1   Color Graphite, Beige   Memory 8GB/16GB/32GB (LPDDR5)   Storage 256GB/512GB/1TB SSD (PCIe)   Camera/Mic FHD 1080p/Studio-quality Dual Mic   Audio AKG Quad Speaker",
      "snippet": "... it the fastest Galaxy Book to date, as well as the <b>NVIDIA</b> RTX GeForce 4070 mobile GPU, providing studio-grade graphics to enhance both creative ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-01T19:39:30",
      "provider": {
        "name": "timesnownews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.tnn.in/thumb/msid-97534524,imgsize-95692,width-1280,height-720,resizemode-75/97534524.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "timesnownews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.timesnownews.com/technology-science/samsung-goes-after-the-macbook-pro-launches-galaxy-book3-range-of-high-performance-laptops-all-you-need-know-article-97534524"
      }
    },
    {
      "id": "1336778964276447191",
      "title": "Samsung Unveils Galaxy Book 3 Series with 13th-Gen Intel CPU up to RTX 4070 GPU",
      "url": "https://beebom.com/samsung-galaxy-book-3-series-unveiled/",
      "description": "Alongside the Galaxy S23 series, Samsung has launched three new Galaxy Book laptops, including the Galaxy Book 3 Ultra, Pro, and Pro 360.",
      "body": "Last Updated:\nFebruary 2, 2023 2:27 am\nAlongside the Galaxy S23 series, Samsung has also unveiled a myriad of new laptops under its Galaxy Book 3 lineup. The new Galaxy Book 3 series comprises three variants, including the highest-end Galaxy Book 3 Ultra, the Galaxy Book 3 Pro, and the 2-in-1 Galaxy Book 3 Pro 360. Focusing on productivity and creativity, these Samsung laptops come with the newest 13th-Gen Intel processors, Nvidia graphics, an AMOLED panel, and more. So lets look at the key specifications of the latest Samsung Galaxy Books:\nSamsung Galaxy Book 3 Series Launched\nGalaxy Book 3 Ultra\nStarting with the top-of-the-line Galaxy Book 3 Ultra, this is Samsungs new premium laptop series that comes with high-end specs. Youre getting a full aluminum frame for a premium look and feel. Theres also a 16-inch Dynamic AMOLED 2X display with 3K resolution (2880 x 1800). The panel features a 16:10 aspect ratio, adaptive 120Hz refresh rate, and 400 nits of max brightness (500 nits in HDR). There are minimal bezels all-around, with the top one housing a Full-HD webcam and a dual-mic array.\nUnder the hood, the Galaxy Book 3 Ultra is powered by up to 13th-Gen Intel Core i9 H-series processors and Nvidia graphics cards. You will have the option to choose between the GeForce RTX 4070 or RTX 4050 laptop GPU. This is paired with up to 32GB DDR5 RAM and up to 1TB PCIe SSD storage. Samsung has also included an expansion slot to easily upgrade the storage on the Galaxy Book 3 Ultra. Theres also a 76Wh battery onboard, along with a 100W Type-C charger.\nThe Galaxy Book 3 Ultra will just be available in a Graphite color variant, so you dont have as many choices as Apple MacBooks. The laptop also has a fingerprint scanner integrated into the power button, a backlit keyboard, and an AKG-powered Quad Speaker system with Dolby Atmos support. As for connectivity, you will also find 2x Thunderbolt 4 ports, 1 USB Type-A port, an HDMI 1.4, a microSD card slot, and a 3.5mm audio jack.\nThe laptop runs Windows 11 out of the box and supports several Samsung-specific features. This includes Multi Control, which lets you control your PC, Galaxy Tab, and Galaxy phone with the Samsung Galaxy Book 3 keyboard and trackpad, Recent Websites in the Phone Link app, which lets you continue web sessions from your phone to PC, and more. You can now easily drag and drop files between your Samsung devices, use your tablet as a secondary monitor, and transfer high-quality Expert RAW pictures in a jiffy.\nGalaxy Book 3 Pro and Pro 360\nMuch like the Ultra, the Galaxy Book 3 Pro and Pro 360 models boast an all-aluminum build on the outside. While the Pro and Pro 360 also come in 16-inch models, the Pro can be bought in a smaller 14-inch model as well, much like the latest MacBooks. Samsung is using the same Dynamic AMOLED 2X panels with a 3K resolution and 120Hz refresh rate on all Pro variants. However, being a versatile 2-in-1 notebook, the Galaxy Book 3 Pro 360 is packing a touchscreen and supports S Pen input (provided in the box).\nTheres a major difference under the hood, though. While Samsung is still offering the latest 13th-Gen Intel Core processor on the Galaxy Book 3 Pro and Pro 360, they are using low-powered P-series chips as opposed to the H-series on the Ultra. This is paired with Intel Iris Xe graphics instead of a dedicated Nvidia GPU, up to 32GB of DDR5 RAM, and up to 1TB of PCIe SSD.\nThe rest of the specifications remain pretty much the same, except that you get a 65W adapter with these models. Also, you can choose between two color variants  Graphite and Beige.\nPrice and Availability\nSamsung has priced the Galaxy Book 3 Pro starting at $1,249, whereas the Galaxy Book 3 Pro 360 and Galaxy Book 3 Ultra with RTX graphics start at $1,399 and a whopping $2,399, respectively. As for availability, the Galaxy Book 3 Pro and Pro 360 will go on sale alongside the new S23 models on February 17 (in select markets) and the Galaxy Book 3 Ultra will be on sale from February 22.\nCurrently, there is no information on when the Galaxy Book 3 series will arrive in the Indian market. But, like the Galaxy Book 2 lineup from last year, we expect these laptops to make their way to the country soon. Stay tuned for more updates.\nTAGS",
      "snippet": "... on productivity and creativity, these Samsung laptops come with the newest 13th-Gen Intel processors, <b>Nvidia</b> graphics, an AMOLED panel, and more.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T19:26:53",
      "provider": {
        "name": "beebom",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://beebom.com/wp-content/uploads/2023/02/samsung-galaxy-book-ultra-launched.jpg?w=750&quality=75",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "beebom",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://beebom.com/samsung-galaxy-book-3-series-unveiled/"
      }
    },
    {
      "id": "1134754096639725747",
      "title": "Nvidia may have another monster Titan GPU in the works",
      "url": "https://www.digitaltrends.com/computing/nvidia-titan-ada-engineering-samples-appear/",
      "description": "It seems that Nvidia is really preparing a Titan RTX 40-series GPU. The specs of the card just popped up in a shipping manifest.",
      "body": "Nvidia may have another monster GPU in the works, and the price could be outrageous\nBy\nFebruary 1, 2023 10:08AM\nShare\nToday, yet another sign of an upcoming Nvidia Titan RTX Ada GPU appeared  the cards specs were spotted in a shipping manifest. This suggests that engineering samples of the monstrous GPU might be on their way to various development centers around the globe.\nEverything points to the Nvidia Titan card making a big comeback in this generation, and the development seems to be farther along than it initially seemed to be. Theres a catch, though  how many people will even be able to afford it?\nWccftech\n). The card is not referred to by name, but its fairly easy to guess that it might be the rumored Nvidia RTX Titan for the 40-series generation of cards. This is because the listing shows 48GB of GDDR6 memory combined with the PG137 board name.\nAccording to recent leaks, the PG137 PCB belongs to a beastly card that weve already seen pictures of before. Its a quad-slot GPU colored in a mix of black and gold; a telling sign that were looking at a new Titan card. The specifications also imply just that. The card is said to deliver 18,176 CUDA cores and 48GB of memory clocked at 24Gbps across a 384-bit bus. The bandwidth is estimated to be at 1.15TB/s.\nThe estimated total board power (TBP) is the real killer here  rumors point to 800 watts. This implies that the card will be using not one, but two 16-pin power connectors  presumably the same ones that have occasionally been melting when connected to the RTX 4090. In all likelihood, the GPU wont utilize the full 800W in order to run.\nThe shipping manifest serves to confirm, at the very least, the memory spec. However, previous leaks talked about 48GB of GDDR6X memory, while this source mentions GDDR6. Its possible that Nvidia is using a higher-clocked GDDR6 VRAM instead, but it could also be an error. The cards are clearly intended for testing purposes.\nNvidia might hit new levels of expensive\nMoore's Law Is Dead\nIt certainly seems like Nvidia may be quite far into the development of the Titan RTX Ada GPU, if thats what it will be called when it hits the shelves. The name is one thing, but the real question is  how much will it cost?\nThe current flagship RTX 4090 has a recommended list price of $1,600. In reality, it often sells for more, what with Nvidias board partners adding their own premiums to the base price. Nvidia is also supposedly working on an RTX 4090 Ti, which is said to feature the same core count but half the memory of the Titan GPU. Its not outlandish to assume that the 4090 Ti might cost anywhere between $2,000 to $2,500.\nNow, if the Titan RTX Ada is released with the aforementioned specs, the pricing gets tricky. Why? Because Nvidia already has a very similar GPU up for sale, the RTX 6000 Ada. This is a workstation GPU based on the new Ada Lovelace architecture. It comes equipped with the exact same core count as the rumored Titan, a boost clock of  2.5GHz, and 48GB of GDDR6 memory, with a maximum power draw of 300 watts.\nThe RTX 6000 Ada is very clearly aimed at professionals and not at gamers. It has an MSRP of $6,800 and can often be found at even higher prices. That makes a huge gap between the consumer-level Nvidia GPUs and this workstation model, but the RTX Titan would bridge that gap in terms of specifications. Where would the price land, though?\nIt would make no sense for Nvidia to charge the same kind of pricing for this GPU. While it will still be favored by content creators and other professionals over pure gamers, its a consumer GPU, and no ones going to pay north of $5,000 for it. However, it wont surprise me if  Nvidia slaps a $3,000 price tag on the Titan RTX Ada whenever it launches  after all, it will be the absolute best graphics card on the market. Well just have to wait and see how expensive its going to be if, and when, it appears.\nToday's tech news, curated and condensed for your inbox\nSubscribe",
      "snippet": "It seems that <b>Nvidia</b> is really preparing a Titan RTX 40-series GPU. The specs of the card just popped up in a shipping manifest.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:08:01",
      "provider": {
        "name": "digitaltrends",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.digitaltrends.com/wp-content/uploads/2022/12/GeForce-RTX-logo-is-shown-on-the-side-of-a-graphics-card-.jpg?resize=1200%2C630&amp;p=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "digitaltrends",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.digitaltrends.com/computing/nvidia-titan-ada-engineering-samples-appear/"
      }
    },
    {
      "id": "5497359835839459985",
      "title": "Save $300 on ASUS' ROG Flow Z13 Gaming Laptop Tablet at second-best price of $1,400",
      "url": "https://9to5toys.com/2023/02/01/asus-rog-flow-z13-gaming-laptop-tablet/",
      "description": "Amazon is currently offering the 2022 ASUS ROG Flow Z13 i7/16GB/512GB/RTX 3050 Gaming Laptop Tbalet for $1,399.99 shipped. Normally going for $1,700, this solid $300 price drop marks a new second-best price weve tracked to date while coming within $100 of the all-time low. Coming equipped with a previous-generation Intel i7-12700H processor and NVIDIA RTX",
      "body": "Comments\nAmazon is currently offering the 2022 ASUS ROG Flow Z13 i7/16GB/512GB/RTX 3050 Gaming Laptop Tbalet for $1,399.99 shipped. Normally going for $1,700, this solid $300 price drop marks a new second-best price weve tracked to date while coming within $100 of the all-time low. Coming equipped with a previous-generation Intel i7-12700H processor and NVIDIA RTX 3050 graphics, the ROG Flow Z13 gaming tablet computer will easily drive its 13.4-inch 19201200 120Hz display in most games. You also have support for Dolby Vision HDR content and Adaptive Sync so your games feel fluid. The keyboard will cover the screen while youre traveling and the touchscreen will allow you to draw or take notes. Rounding out the Flow Z13 is Wi-Fi 6E, Bluetooth 5.2, and Thunderbolt 4 support. Head below for more.\nOn a tighter budget? Check out the Acer Nitro 5 i5/8GB/256GB/RTX 3050 Gaming Laptop for $782 instead. Here youll be using the 10th gen Intel i5 processor with RTX 3050 graphics, which is a step down from the 12th Gen with the ASUS option above. The screen is larger at 15.6-inches but is a step down to 1080p 144Hz resolution and refresh rate. The total amount of RAM is downgraded to 8GB instead of 16GB and stepped back to DDR4. Wi-Fi 6 support is also present here.\nBe sure to stop by our PC gaming hub for the latest deals on hardware and peripherals. Want to pick up an additional keyboard to go alongside the keyboard folio included above? Were currently tracking the SteelSeries Apex 7 OLED Mechanical Gaming Keyboard marked down to $88, the new all-time low. This mechanical gaming keyboard will come with brown switches meaning youll get a soft tactile feel while typing and gaming, and it comes in a full-size layout meaning youll get a number pad with some additional editing keys. Each key has individual RGB backlighting that can be controlled through software, and the OLED display that comes integrated into this keyboard will also be controlled by the same software. This screen can display setting information, Discord messages, Spotify songs, and more.\nASUS ROG Flow Z13 i7/16GB/512GB/RTX 3050 Gaming Tablet features:\nWith a design inspired by the 20th-century Space Race, the Flow Z13 gaming laptop tablet has numerous nods to retro-futurism. Powered by a 12th Gen 14-core Intel Core i7-12700H CPU and a GeForce RTX 3050 GPU in this ultraportable tablet form factor, you can pair the best aspects of PC gaming with the freedom to go anywhere.",
      "snippet": "Coming equipped with a previous-generation Intel i7-12700H processor and <b>NVIDIA</b> RTX. Comments Amazon is currently offering the 2022 ASUS ROG Flow Z13 ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:04:00",
      "provider": {
        "name": "9to5toys",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/9to5toys.com/wp-content/uploads/sites/5/2022/12/2022-ASUS-ROG-Flow-Z13-i7-16GB-512GB-RTX-3050-Gaming-Tablet.jpg?resize=1200%2C628&amp;ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "9to5toys",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://9to5toys.com/2023/02/01/asus-rog-flow-z13-gaming-laptop-tablet/"
      }
    },
    {
      "id": "7418729197057171400",
      "title": "Samsung Galaxy Book3 Series Launched With 13th-Gen Intel Core CPUs, Nvidia RTX 4000 Series GPU; Here Are the Features, Specs, and Price",
      "url": "https://in.ign.com/tech/178898/news/samsung-galaxy-book3-series-launched-with-13th-gen-intel-core-cpus-nvidia-rtx-4000-series-gpu-here-a",
      "description": "Samsung's lineup of laptops receives a major spec boost.",
      "body": "India.\nSamsung India has just announced its latest lineup of thin-and-light laptops, the Galaxy Book3 Series for the market. The lineup includes the flagship Galaxy Book 3 Ultra, Book3 Pro 360 2-in-1, Book3 Pro, and the Book3. Amongst these different models, the company is offering the Samsung Galaxy Book3 in 15 and 13-inch display variants. Interested buyers can also get the Galaxy Book3 Pro with 14 and 16-inch variants.\nDuring the launch showcase, the company shared the top three aspects that it focused on to improve the Book3 lineup over the Book2 series from 2022. These include the performance of the laptops, thin-and-light portability and the overall Galaxy Ecosystem experience. Let's check everything you need to know about the Samsung Galaxy Book3 Series here including the specifications, features and price in India.\nThe Galaxy Book 3 Ultra will feature upto the latest 13th-Gen Intel Core i9 H-Series CPUs with 45W TDP. In addition this, the laptop also comes with the Nvidia GeForce RTX 4070 GPU with 60W TDP for light gaming and content creation. In terms of features, Samsung has added a 120Hz refresh rate-equipped 16-inch 3K-resolution Dynamic AMOLED 2X display with 16:10 aspect ratio. The company has also added a FHD-resolution webcam to the Ultra model for better video calling experience.\nNow, let's talk about the Galaxy Ecosystem experience that Samsung has added to the Galaxy Book3 Series. The company will add multiple new softwares to handle different features from the Ecosystem. These include the Samsung Multi Control, Samsung Galaxy Book Experience and the Samsung Galaxy Book Smart Switch. Existing softwares that will get additional features include the Microsoft Phone Link for instant Hotspot and recent websites sharing. Book3 Series users can also use Samsung Pass to enter passwords along with the fingerprint-based authentication.\nHere's everything you need to know about some of the specifications of all the Samsung Galaxy Book3 series models.\nThunderbolt 4 (2), USB Type-A (1), HDMI 2.0, microSD, Headphone/Mic.\nThunderbolt 4 (2), USB Type-A (1), HDMI 1.4, microSD, Headphone/Mic.\nThunderbolt 4 (2), USB Type-A (1), HDMI 1.4, microSD, Headphone/Mic, nano SIM slot (Optional).\nWhen it comes to the availability, the Samsung Galaxy Book3 Pro and the Samsung Galaxy Book3 Pro 360 will be the first to launch in select markets on February 17. The Samsung Galaxy Book3 Ultra will arrive a bit later on February 22. We'll soon update the piece with pricing details for the Galaxy Book3 series.",
      "snippet": "In addition this, the laptop also comes with the <b>Nvidia</b> GeForce RTX 4070 GPU with 60W TDP for light gaming and content creation. In terms of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:01:17",
      "provider": {
        "name": "ign",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://sm.ign.com/t/ign_in/screenshot/default/galaxy-book3-series-image-01-hi-1-02_y88h.1200.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "ign",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://in.ign.com/tech/178898/news/samsung-galaxy-book3-series-launched-with-13th-gen-intel-core-cpus-nvidia-rtx-4000-series-gpu-here-a"
      }
    },
    {
      "id": "304984604469170730",
      "title": "Samsung introduces the Galaxy Book 3 Ultra alongside a redesigned Pro series",
      "url": "https://www.xda-developers.com/samsung-galaxy-book-3-pro-ultra-launch/",
      "description": "Samsung's new laptop lineup is redesigned with a full aluminum chassis and super-sharp AMOLED displays, plus a model with Nvidia graphics.",
      "body": "Samsung introduces the Galaxy Book 3 Ultra alongside a redesigned Pro series\nBy\nPublished 1 hour ago\nSamsung's new laptop lineup is redesigned with a full aluminum chassis and super-sharp AMOLED displays, plus a model with Nvidia graphics.\nReaders like you help support XDA Developers. When you make a purchase using links on our site, we may earn an affiliate commission.\nRead More.\nThe first Samsung Galaxy Unpacked of 2023 is finally here, and Samsung is making waves with the new Galaxy Book 3 series of laptops. This year, in addition to the Samsung Galaxy Book 3 Pro and Book 3 Pro 360, which have been radically redesigned, we're also getting the brand-new Galaxy Book 3 Ultra, Samsung's most powerful laptop yet. All three laptops are up for pre-order today.\nSamsung Galaxy Book 3 Ultra\nWhile all three laptops have a lot new to them, the star of the show this year is definitely the brand-new Samsung Galaxy Book 3 Ultra. This is Samsung's most powerful laptop yet, and that starts with the 13th-generation Intel Core H-series processors inside. You can go up to a Core i9 processor, and that will get you 14 cores, 20 threads, and boost speeds up to 5.4GHz.\nYou can also add up to an Nvidia GeForce RTX 4070 Laptop GPU (with an option for an RTX 4050 also available), making this a viable laptop for some light gaming and more importantly, creative work. All of this is paired with up to 32GB of RAM and a 1TB SSD, with one free slot available inside the laptop if you need more storage.\nAnother highlight of this laptop is the 16-inch display. It comes in a 16:10 aspect ratio that's ideal for productivity, and it's a stunning Dynamic AMOLED 2X panel with up to 400 nits of brightness. It's much sharper than past Samsung laptops, too, with 2880 x 1800 resolution, and it has a smooth 120Hz refresh rate to make motion and animations look that much smoother.\nThe laptop also comes with a 1080p webcam  though there's no facial recognition  and the selection of ports is solid, including Thunderbolt 4, USB Type-A, HDMI, and a headphone jack. This also applies to the rest of Samsung's lineup this year. The Galaxy Book 3 Ultra comes in at 16.5mm thick, which is quite good for a laptop with discrete graphics, and it weighs 3.9 pounds. Unlike past Galaxy Book models, it uses an aluminum chassis, which feels more premium but is also significantly heavier than magnesium.\nThe Samsung Galaxy Book 3 Ultra is available for pre-order starting today, with prices starting at $2,399.\nSamsung Galaxy Book 3 Pro and Pro 360\nIf you want something a bit more mainstream, the Samsung Galaxy Book 3 Pro series is also a big step up from previous models. Of course, it now has 13th-generation Intel Core P-series processors, as you'd expect, along with up to 32GB of RAM and a 1TB SSD. But everything else has been upgraded, too.\nFor starters, the Galaxy Book 3 Pro comes in new sizes: a 14-inch model and a 16-inch version, both with a 16:10 aspect ratio this time around. The Galaxy Book 3 Pro 360 only comes in a 16-inch version, which has the same format as the clamshell variant, but now with support for touch and the S Pen, plus a 360-degree hinge so you can use it as a tablet.\nIn terms of specs, though, these displays are all the same as the Ultra model: Dynamic AMOLED 2X panels with 2880 x 1800 resolution, plus a 120Hz refresh rate. That's the new standard, and it's a huge step up from the Galaxy Book 2 Pro series, which still used Full HD 60Hz panels.\nSimilarly, the design of these laptops has also changed. Instead of aiming for an extremely light chassis, Samsung has now gone with a more premium feel with a solid aluminum chassis. That does make these new laptops noticeably heavier, at 2.58 pounds for the 14-inch Galaxy Book 3 Pro and 3.4 pounds for the 16-inch model (or 3.7 pounds for the Pro 360). They're still fairly light for their size, however, and they're also incredibly thin, measuring 11.3mm thick in the case of the 14-inch model, 12.5mm for the 16-inch clamshell, and 12.8mm for the convertible version.\nSamsung is also bringing back a 5G option for the Galaxy Book 3 Pro 360, after last year's models didn't add a follow-up to the 2021 Galaxy Book Pro 360 5G.\nThe Samsung Galaxy Book 3 Pro lineup starts at $1,449, but that price will vary a lot depending on the size and configuration you choose. Pre-orders are available now, and the laptops will ship on February 17.\nSamsung Galaxy ecosystem features\nIn addition to the new laptops themselves, Samsung is also continuing to improve the integration between its laptops and its phones. In addition to the Link to Windows functionality and all the Samsung apps available on its Galaxy Book laptops, the company has improved support for Samsung Multi Control. This feature lets you control your Galaxy tablet or phone using the keyboard and touchpad on your Galaxy Book laptop, and support for phones specifically is new this year. Previously, you could only interact with Samsung tablets this way. You can also still use a Galaxy tablet as a second screen for your laptop.\nAdditionally, you can now make it so that Expert RAW photos from your phone are automatically transferred to your laptop, so you can quickly start editing them in Adobe Lightroom. Other benefits of the Galaxy Book 3 series include support for Samsung Pass and Single Sign On, allowing you to sign in to all your Samsung apps while entering your Samsung account password just once.\nSamsung Galaxy Book 3 Pro\nThe Samsung Galaxy Book 3 Pro has been redesigned with a premium aluminum chassis and 14-inch or 16-inch display options.\n$1450 at Samsung\nSamsung Galaxy Book 3 Pro 360\nSamsung has also redesigned the Galaxy Book 3 Pro 360, and it's now available with a stunning 16-inch display,\n$1900 at Samsung\nSamsung Galaxy Book 3 Ultra\nThe brand-new Galaxy Book 3 Ultra is the most powerful of the lineup, featuring H-series Intel processors and Nvidia graphics.\n$2400 at Samsung",
      "snippet": "... AMOLED displays, plus a model with <b>Nvidia</b> graphics. Samsung introduces the Galaxy Book 3 ... AMOLED displays, plus a model with <b>Nvidia</b> graphics.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:01:16",
      "provider": {
        "name": "xda-developers",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2023/01/samsung-galaxy-book-3-ultra-2.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "xda-developers",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.xda-developers.com/samsung-galaxy-book-3-pro-ultra-launch/"
      }
    },
    {
      "id": "7830723345140277751",
      "title": "Samsung Galaxy Book 3 Ultra with RTX 4070 GPU announced",
      "url": "https://www.laptopmag.com/news/samsung-unveils-galaxy-book-3-ultra-with-13th-gen-intel-cpu-and-rtx-40-series-gpu",
      "description": "Samsung's new premium laptop, the Galaxy Book 3 Ultra packs 13th Gen Intel Core and Nvidia RTX 40 series GPU power",
      "body": "Samsung welcomes the new Galaxy Book 3 Ultra to its family of laptops\n(opens in new tab)\n(opens in new tab)\n(Image credit: Laptop Mag)\nThe Samsung Galaxy Book 3 Ultra was announced today at Samsung's Unpacked product launch event. For a limited time, you can use your Galaxy S23 credit at\nSamsung.com\n(opens in new tab)\ntoward the purchase of a new Galaxy Book 3 Series notebook. Plus get an additional 10% off and free memory upgrade and an extra $50 bonus Samsung Credit. \nIt improves upon its predecessor with an upgraded processor, graphics card, and display. It packs a 13th Gen Intel Core i7 CPU (up to i9),16GB of RAM (up to 32GB) and Nvidia Geforce RTX 4050 GPU (up to RTX 4070).\nFor the first time in the series, the Galaxy Book 3 Ultra sports a Samsungs Dynamic AMOLED 2X display as seen on the Galaxy S-Series phones. The laptop's stunning 16-inch, 3K (2880 x 1800) display delivers 400 nits of brightness for visibility outdoors. The panel's 120Hz refresh rate delivers a smooth viewing experience whether you're editing high-res videos or photos, streaming content or playing AAA games.\n(Image credit: Samsung)\nThe Galaxy Book 3 Ultra ensures seamless phone-to-PC connectivity with Link to Windows / Microsoft Phone Link and all new on-the-go productivity features. Recent Websites, for example, lets you pick up right where you left off from your phone to PC. One-click Instant Hotspot makes it easy to connect to a wireless hotspot when you're on the move. Expect enhanced video calls and audio with the Galaxy Book 3 Ultra's 1080p webcam, studio-quality dual mic, and AKG quad-speakers with Dolby Atmos.\nFor speedy file transfers and storage, you can opt for up to 512GB or 1TB SSD. Connectivity-wise, the Galaxy Book 3 has two Thunderbolt 4 ports, a USB Type-A port, HDMI port, microSD slot and headphone mic combo.\nSamsung's best premium PC yet, the Galaxy Book 3 is built for high-performance creating and gaming. It will be available for purchase on Feb. 17 at Samsung.com and select Samsung retailers.\nToday's best Samsung Galaxy Book 2 Pro 5G deals\n(opens in new tab)",
      "snippet": "... premium laptop, the Galaxy Book 3 Ultra packs 13th Gen Intel Core and <b>Nvidia</b> RTX 40 series GPU power. Samsung welcomes the new Galaxy Book 3 Ultra to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:01:00",
      "provider": {
        "name": "laptopmag",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/GrQTdhzQAvPhtQzcTUe4Je.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "laptopmag",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.laptopmag.com/news/samsung-unveils-galaxy-book-3-ultra-with-13th-gen-intel-cpu-and-rtx-40-series-gpu"
      }
    },
    {
      "id": "7820675782755320797",
      "title": "Samsung Galaxy Book 3 Ultra Takes On MacBook Pro With Intel Core i9 Nvidia RTX 4070",
      "url": "https://www.cnet.com/tech/computing/samsung-galaxy-book-3-ultra-takes-on-macbook-pro-with-intel-core-i9-nvidia-rtx-4070/",
      "description": "With a 16-inch AMOLED display, lots of ports and seamless connectivity with other Galaxy devices, the Ultra redefines premium laptops for Samsung.",
      "body": "Samsung's Galaxy Book Pro laptops are leveling up. At Samsung's Unpacked event Wednesday, the electronics giant announced the Galaxy Book 3 Ultra laptop alongside its latest flagship Galaxy S23 phones.Like Samsung's top Galaxy Ultra phonesand Galaxy Tab S8 Ultra tablet, the Ultra laptop will have the best performance, a ton of features and a killer display. But like the other Ultra devices, the Ultra laptop might be more computer than you need. Samsung also has the Galaxy Book 3 Pro and Pro 360, which are a notch below the Ultra in performance, but have a lot of features in common, along with their own added extras.Read more:Samsung Unpacked Live UpdatesThe Galaxy Book 3 Ultra is the star, though, and thankfully it fixes two things I didn't like about the otherwise excellent Galaxy Book 2 Pro models. One issue was their displays. While they had great-looking AMOLED panels, they were 16:9, 1080p widescreens; most premium laptops use higher-resolution 16:10 panels that give you more vertical space. The 16-inch Galaxy Book 3 Ultra makes the jump to 16:10. It's still an AMOLED panel, too, so you're going to get amazing color and contrast. Plus it has a 120Hz refresh rate for smoother-looking video; its resolution is 2,880x1,800 pixels.The second issue I had with the Book 2 Pro was that Samsung didn't offer any options for discrete graphics and frankly, if you're going to call something \"Pro\" you should offer something stronger than integrated graphics. That doesn't change with the Book 3 Pro models, but the Ultra will have either an Nvidia GeForce RTX 4050 or 4070 graphics chip and they'll be paired with a 13th-gen Intel Core i7 or i9 processor, respectively, giving the Ultra some pro-level laptop performance.Those components drive the price up considerably, with the Core i7 and RTX 4050 configuration starting at $2,400 and the Core i9 and RTX 4070 pairing going for $3,000. (Pricing and availability weren't announced for the UK or Australia, but the entry price converts to 1,950 and AU$3,400.) You get a lot of other great features for those prices like a 1080p webcam, a quad-speaker audio system, a fingerprint reader on the power button and a larger 76-watt-hour battery. The Ultra also has more ports than the Galaxy Book 2 Pro, with a USB-A port and HDMI 2.0 output joining its two Thunderbolt USB-C ports, microSD card slot and headphone jack.The good news is almost all of these things trickle down to the Pro models, with the big exceptions being the Core i9 processor and the discrete graphics. The nice thing about that is the 16-inch Galaxy Book 3 Pro laptop is 4 millimeters thinner and it's about a half pound lighter than the 16.5-mm thick, 4-pound (1.8-kilogram) Ultra. The Galaxy Book 3 Pro will also be available in a 14-inch size that's just 2.6 pounds (1.2 kilograms).There's also a 16-inch Galaxy Book 3 Pro 360 two-in-one, which is large for a two-in-one, but since it comes with one of Samsung's excellent S Pens, you'll have a lot of room to draw or take notes, plus it'll make a nice digital whiteboard for meetings. And again, all of the features like the high-res webcam, port assortment and quad speakers on the Ultra are here, too. It's also the only model to come with optional 5G wireless.Also, just like earlier Galaxy Books, the new Ultra and Pro laptops are made to work with other Galaxy devices. Things like sending files back and forth between your phone and laptop are easy. You can, for instance, start working on a file on your Galaxy phone and finish up on the Galaxy Book. Or you can use a Galaxy Tab S8 as a wireless external display to extend the laptop's screen. Your Galaxy Buds can automatically switch between devices as well.This extra layer of interoperability is something Apple does well with its iPhones, iPads and MacBooks, and Samsung is quickly catching up with help from Intel and Microsoft. These laptops have enterprise-level security, too, since they meetMicrosoft's secured-core PC requirements.There is one thing that Samsung kept the same as the previous generations and that's the overall look. They're nice and clean, if a bit unexciting, especially compared to Samsung's phones, which come in several colors -- these come in graphite or beige. Build quality is improved, though. They're sturdier, stiffer and stronger, which is certainly a plus even if they're a bit heavier because of it.The Samsung Galaxy Book 3 Ultra and Pro and Pro 360 laptops are available to preorder now through Samsung's site and the Pro models are expected to start shipping on Feb. 17.",
      "snippet": "With a 16-inch AMOLED display, lots of ports and seamless connectivity with other Galaxy devices, the Ultra redefines premium laptops for Samsung.\nthese come in graphite or beige.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:00:25",
      "provider": {
        "name": "cnet",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.cnet.com/a/img/resize/178167207943195d7ea61be775dedeb713f81dbf/hub/2023/01/31/e3d900cf-3d6b-4a07-b073-a4aa53c45416/samsung-galaxy-book-3-ultra-image-02-hi.jpg?auto=webp&amp;fit=crop&amp;height=630&amp;width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "cnet",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.cnet.com/tech/computing/samsung-galaxy-book-3-ultra-takes-on-macbook-pro-with-intel-core-i9-nvidia-rtx-4070/"
      }
    },
    {
      "id": "3034669820765058291",
      "title": "Samsung's Galaxy Book 3 Line Gets 120 Hz OLED Screens",
      "url": "https://www.tomshardware.com/news/samsung-galaxy-book-3-ultra-price-specs",
      "description": "Samsung is launching five laptops, including the new Galaxy Book 3 Ultra, with an OLED 3K touchscreen and the latest parts from Intel and Nvidia.",
      "body": "Comments (0)\n(Image credit: Samsung)\nSamsung is adding a new top-tier notebook  the Galaxy Book 3 Ultra  to its lineup. The Galaxy Book 3 Ultra is part of a refresh to the companys profile, which also includes the Galaxy Book 3 Pro (in both 14- and 16-inch models) and the Galaxy Book 3 Pro 360. This news is timed alongside Samsungs latest phone launches, and the new laptop borrows its Ultra moniker from the companys high-end handsets.\nThe Ultra will come with the latest chips from Intel (13th Gen Core i7 or i9, up to 45W, depending on the configuration) and Nvidia (RTX 4050 or RTX 4070)  but the highlight, for many, will be the screen. Both the Ultra and the Pro series will have what Samsung calls a Dynamic AMOLED 2X display, which originated on the brands smartphones.\nOn the Ultra, that's a 16-inch, 2880 x 1800 display with a 16:10 aspect ratio and 120 Hz refresh rate. It's also VESA ClearMR and Display HDR True Black 500 certified. On the Pro series, there's also a 14-inch variant with the same display specs. The Pro 360, with its 16-inch screen, will combine AMOLED with touch capability, and will come packaged with an S Pen stylus. We're curious to see how these displays will match up against those we've seen on the\nbest ultrabooks\n.\nThe touchpad on the ultra is nearly 40% larger than on previous Galaxy Books. The Ultra and Pro are also getting 1080p cameras, which will have studio modes for auto framing, eye contact correction, and light correction.\nSwipe to scroll horizontally\nStarting Price\n$2,399.99\nBy launching the laptops and phones together, Samsung is making a case for its ecosystem. The company suggests that this is their \"most seamless Samsung Galaxy Connected experience yet,\" using the Link to Windows app on the phone and Microsoft Phone Link on PC. There's also a Second Screen feature that will turn the company's Tab Tablets into external monitors, as well as Multi Control, which will let you control your PC, Galaxy Tab, and Galaxy smartphones via inputs on your laptop  similar to Apple's Universal Control.\n(Image credit: Samsung)\nThe Galaxy Book 3 Pro is using 28W Core i5 and Core i7 and has integrated graphics. The base model starts at 8GB of RAM (which can be upgraded to up to 32GB), and has a 256GB SSD (which can be upgraded to up to 1TB). Like the Ultra, it's made of aluminum, has an AMOLED display, and sports a 1080p webcam.\nThe Galaxy Book 3 Pro 360 is a 16-inch device and is the only device in the lineup with 5G wireless. It includes an S pen in the box, and shares CPU, RAM, and SSD options with the clamshell Pro.\nSamsung's full lineup of Galaxy Book 3 laptops will go on sale Feb. 17. The Ultra will start at $2,399.99, while the Pro will begin at $1,499.99.\nBe In the Know",
      "snippet": "Samsung is launching five laptops, including the new Galaxy Book 3 Ultra, with an OLED 3K touchscreen and the latest parts from Intel and <b>Nvidia</b>.\nComments (0) (Image credit: Samsung) Samsung is adding a new top-tier notebook the Galaxy Book 3 Ultra to its lineup.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:00:11",
      "provider": {
        "name": "tomshardware",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/kSCrcsgRjtudjrVz5u7RzF.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "tomshardware",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.tomshardware.com/news/samsung-galaxy-book-3-ultra-price-specs"
      }
    },
    {
      "id": "6327669468540385146",
      "title": "Nvidia's RTX and DLSS3 Cyberpunk Support Shows Why These Features Are The Future Of Gaming",
      "url": "https://exbulletin.com/tech/2032652/",
      "description": " NVIDIA Nvidias next-generation Deep Learning Super Sampling 3 (DLSS 3) technology now supports Cyberpunk 2077, one of the most popular and most demanding AAA video games. Will it run Crysis? Crysis was a very demanding game at the time, and even the most valuable game setups, including those with multiple high-end GPUs, couldnt keep []",
      "body": "Nvidias RTX and DLSS3 Cyberpunk Support Shows Why These Features Are The Future Of Gaming\n\nNVIDIA\nNvidias next-generation Deep Learning Super Sampling 3 (DLSS 3) technology now supports Cyberpunk 2077, one of the most popular and most demanding AAA video games. Will it run Crysis? Crysis was a very demanding game at the time, and even the most valuable game setups, including those with multiple high-end GPUs, couldnt keep up with the future of gaming at the time. As far back as today, the question that has loomed over the past few years has been, Can we run Cyberpunk 2077?\nFrom desktop GPUs to laptop GPUs, Nvidias GeForce RTX 40-series GPUs take graphics performance and experience to a whole other level. I believe that Cyberpunk 2077s support for his DLSS 3 is a testament to his leadership in Nvidias games and a return on investment the company has made.\nNvidia announced new products at CES 2023. You can read it here. You can read about GeForce RTX 40-series desktop and laptop GPUs, as well as over 50 AAA games that currently support or will support NVIDIAs DLSS 3 technology. Cyberpunk 2077 is one of those 50 and one of the best games showcasing Nvidias ray tracing and AI-enhanced graphics capabilities.\nAccording to Nvidia, Cyberpunk 2077 will use several ray tracing techniques to render massive futuristic cities with an incredible level of detail, giving gamers a glimpse into the future of PC gaming. The game has a mode called Psycho Mode for its ray-traced lighting settings, which Nvidia says will create a visually stunning gaming experience with expansive cityscapes that use subtle shadows to define depth. produce.\nNvidias DLSS 3 uses AI to make Cyberpunks Psycho mode playable. Systems with RTX 4070 Ti, RTX 4080 more than quadruple the frames per second (fps) and triple the fps with the RTX 4090 at maximum settings and 4K resolution (38402160) . These are incredible performance numbers for what he calls one of the most demanding AAA games on the market.\nCyberpunk 2077 38402160 GeForce RTX Desktop GPU Performance Ray Tracing On, Max Settings, Nvidia  [+] DLSS on\nNVIDIA\nNvidia also says the addition of DLSS 3 will set the stage for Cyberpunk 2077s Ray Tracing: Overdrive Mode, further enhancing the games visuals. Front seat will be his GeForce RTX 40 series graphics card from Nvidia.\nEven better, DLSS continues to improve through continuous training on Nvidias AI supercomputers. Games that support DLSS 3 are getting better and better, and more AAA games will continue to support his Nvidias DLSS 3.\nsummary\nCyberpunk 2077 is not a tinkering game. It requires compute-intensive hardware and lots of performance to run. Nvidia continues to raise the bar on gaming experiences, and I believe that its release and continued support for his DLSS 3 and RTX features for over 50 games is huge for the gaming community. increase. Nvidia has invested billions of dollars extra in real silicon and software to support these two functions. I believe these two features are the future of gaming experiences available today. Rasterization performance is one thing, but when you combine that with supersampling and raytracing, its a really great triplet of his.\nNext-level ray tracing in Cyberpunk 2077: I cant wait to see Overdrive mode and how Nvidias DLSS 3 feature takes it to the next level.\nNote: Jacob Freyman of Moor Insights & Strategy co-op contributed to this article.\nMoor Insights & Strategy, like all research and technology industry analyst firms, does or has provided paid services to technology companies. These services include research, analysis, advice, consulting, benchmarking, acquisition matchmaking, and speaking sponsorship. The company includes 88, Accenture, A10 Networks, Advanced Micro Devices, Amazon, Amazon Web Services, Ambient Scientific, Anuta Networks, Applied Brain Research, Applied Micro, Apstra, Arm, Aruba Networks (now HPE), Atom Computing, AT&T, Aura, Automation Anywhere, AWS, A-10 Strategies, Bitfusion, Blaize, Box, Broadcom, C3.AI, Calix, Campfire, Cisco Systems, Clear Software, Cloudera, Clumio, Cognitive Systems, CompuCom, Cradlepoint, CyberArk , Dell, Dell EMC, Dell Technologies, Diablo Technologies, Dialogue Group, Digital Optics, Dreamium Labs, D-Wave, Echelon, Ericsson, Extreme Networks, Five9, Flex, Foundries.io, Foxconn, Frame (now VMware), Fujitsu , Generation Z Consortium, Glue Networks, GlobalFoundries, Revolve (now Google), Google Cloud, Graphcore, Groq, Hiregenics, Hotwire Global, HP Inc., Hewlett Packard Enterprise, Honeywell, Huawei Technologies, IBM, Infinidat, Infosys, Inseego, IonQ , IonVR, Inseego, Infosys, Infosys, Infoot, Intel, Interdigital, Jabil Circuit, Keysight, Konica Minolta, Lattice Semiconductor, Lenovo, Linux Foundation, Lightbits Labs, LogicMonitor, Luminar, MapBox, Marvell Technolog y, Mavenir, Marseille Inc, Mayfair Equity, Meraki (Cisco), Merck KGaA, Mesophhere, Micron Technology, Microsoft, MiTEL, Mojo Networks, MongoDB, National Instruments, Neat, NetApp, Nightwatch, NOKIA (Alcatel-Lucent), Nortek, Novumind, NVIDIA, Nutanix, Nuvia (now Qualcomm), onsemi, ONUG, OpenStack Foundation, Oracle, Palo Alto Networks, Panasas, Peraso, Pexip, Pixelworks, Plume Design, PlusAI, Poly (formerly Plantronics), Portworx, Pure Storage , Qualcomm, Quantinuum, Rackspace, Rambus, Rayvolt E-Bikes, Red Hat, Renesas, Residio, Samsung Electronics, Samsung Semi, SAP, SAS, Scale Computing, Schneider Electric, SiFive, Silver Peak (now Aruba-HPE), SkyWorks, SONY Optical Storage, Splunk, Springpath (now Cisco), Spirent, Splunk, Sprint (now T-Mobile), Stratus Technologies, Symantec, Synaptics, Syniverse, Synopsys, Tanium, Telesign, TE Connectivity, TensTorrent, Tobii Technology, Teradata, T-Mobile, Treasure Data, Twitter, Unity Technologies, UiPath, Verizon Communications, VAST Data, Ventana Micro Systems, Vidyo, VMware, Wave Computing, Wellsmith, Xilinx, Zayo, Zebra, Zededa, Zendesk, Zoho, Z oom, and Zscaler.\nPatrick Moorhead, Founder, CEO and Chief Analyst of Moor Insights & Strategy, is an investor in dMY Technology Group Inc. VI, Dreanium Labs, Groq, Luminar Technologies, MemryX, and Movandi.\nSources",
      "snippet": "<b>NVIDIA Nvidias</b> next-generation Deep Learning Super Sampling 3 (DLSS 3) technology now supports Cyberpunk 2077, one of the most popular and most ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T17:38:13",
      "provider": {
        "name": "exbulletin",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imageio.forbes.com/specials-images/imageserve/63da962db1cb078919e6ed8a/0x0.jpg?format=jpg&#038;width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "exbulletin",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://exbulletin.com/tech/2032652/"
      }
    },
    {
      "id": "5291007483312886766",
      "title": "Nvidia's RTX And DLSS3 Cyberpunk Support Demonstrate Why These Features Are The Future Of Gaming",
      "url": "https://www.forbes.com/sites/patrickmoorhead/2023/02/01/nvidias-rtx-and-dlss3-cyberpunk-support-demonstrate-why-these-features-are-the-future-of-gaming/",
      "description": "#1-Ranked Industry Analyst Patrick Moorhead dives into Nvidia's DLSS 3 and how features like it demonstrate the future of gaming.",
      "body": "Share to Linkedin\nNvidia\nNvidia's next-generation Deep Learning Super Sampling 3 (DLSS 3) technology now supports one of the most popular and most demanding AAA video games, Cyberpunk 2077. If you were a gamer in the mid-2000s, you probably heard the question, \"can it run Crysis?\" Crysis at the time was a very demanding game that even the worthiest of gaming setupsincluding setups with multiple high-end GPUS could not keep up with what was, at the time, the future of gaming. Flash forward to today, and the question looming over the past couple of years has been, \"can it run Cyberpunk 2077?\"\nFrom desktop GPUs to laptop GPUs, Nvidia's GeForce RTX 40 series GPUs have taken graphics performance and experience to a whole other level. I believe Cyberpunk 2077's support for DLSS 3 is in part a testimony to Nvidia's gaming leadership and a payoff to the investments its made.\nNvidia announced new products at CES 2023, which you can read about here, its GeForce RTX 40 series desktop and laptop GPUs as well as over 50 AAA games that now support or will soon support Nvidia's DLSS 3 technology. Cyberpunk 2077 is one of those 50 and is one of the best games to showcase the capabilities of Nvidia's Ray Tracing and AI-enhanced graphics capabilities.\nNvidia says Cyberpunk 2077 uses several ray tracing techniques to render a massive future city at incredible levels of detail and gives gamers a peek into the future of PC gaming. The game has a mode called \"Psycho mode\" in the ray tracing lighting settings that creates what Nvidia says is a visually stunning gaming experience with sprawling cityscapes that use subtle shadows to define depth.\nNvidia's DLSS 3 uses AI to make Cyberpunks Psycho mode playable. Systems with an RTX 4070 Ti, RTX 4080, are getting over quadruple the frames per second (fps) and triple the fps with an RTX 4090 at max settings and 4K resolution (3840x2160). These are unbelievable performance numbers for a game that is supposed to be one of the most demanding AAA games on the market.\nMORE FOR YOU\nDLSS On\nNvidia\nNvidia also mentioned that the addition of DLSS 3 sets the stage for Cyberpunk 2077 'Ray Tracing: Overdrive Mode,\" which looks to enhance the games visuals even more. Nvidia says it is the next iteration of \"but can it play\" and in the front seat will be Nvidia's GeForce RTX 40 series graphics cards.\nWhat's even cooler is that as DLSS continues to improve through ongoing training on Nvidia's AI Supercomputer. Games that support DLSS 3 will continue to get better and better, and more AAA games will continue to support Nvidia's DLSS 3.\nWrapping up\nCyberpunk 2077 is not a game to mess around with; it takes compute intensive hardware and a lot of performance to run. Nvidia continues to raise the bar for the gaming experience, and I believe its release and continued support of DLSS 3 and RTX features for over 50 games is huge for the gaming community. Nvidia is investing real silicon and software, billions of extra dollars to support these two features that I believe are the future of the gaming experience, available today. Rasterization performance is one thing, but when combining that with super-sampling and ray tracing, it really is a triad of awesomeness.\nI am excited to see Cyberpunk 2077's next-level Ray Tracing: Overdrive Mode and how Nvidia's DLSS 3 feature brings it to an even higher level.\nNote: Moor Insights & Strategy co-op Jacob Freyman contributed to this article.\nFollow me on",
      "snippet": "Share to Linkedin <b>Nvidia <b>Nvidia</b>'s</b> next-generation Deep Learning Super Sampling 3 (DLSS 3) technology now supports one of the most popular and most ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T16:45:37",
      "provider": {
        "name": "forbes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imageio.forbes.com/specials-images/imageserve/63da962db1cb078919e6ed8a/0x0.jpg?format=jpg&width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "forbes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.forbes.com/sites/patrickmoorhead/2023/02/01/nvidias-rtx-and-dlss3-cyberpunk-support-demonstrate-why-these-features-are-the-future-of-gaming/"
      }
    },
    {
      "id": "8900893297276571537",
      "title": "Intel Arc A750 gets a price cut down to $250 to better compete with AMD and NVIDIA cards",
      "url": "https://www.neowin.net/news/intel-arc-a750-gets-a-price-cut-down-to-250-to-better-compete-with-amd-and-nvidia-cards/",
      "description": "The Intel Arc A750 has received a $40 price cut, bringing the cost down to $250. Intel also says the graphics card performs much better in DirectX 9 games with its latest driver updates.",
      "body": "0\ncomments\nIntel's entry into the dedicated GPU business has not been completely smooth. However, its Arc graphics cards that launched in the fall of 2022 do provide some solid gaming performance for the price. Today, Intel announced that one of its graphics cards, the A750, will get a $40 price cut, bringing the cost of the card down to just $250.\nIntel also claims that the latest Arc graphics drivers offer gamers an FPS performance boost of up to 43 percent compared to the card's launch drivers when playing DirectX 9 games. As shown in the chart below, some of the biggest jumps come with playing Half-Life 2 and CS:GO. DirectX 11 and DirectX 12 games also have seen performance improvements with the new drivers as well.\nThe new price tag should make the A750 an even more attractive option for PC gamers who want an affordable graphics card that can also compete performance wise with similar NVIDIA and AMD cards. Intel also announced that gamers will be able to get free access to two upcoming games in a new A750 bundle: the steampunk-like action RPG Nightingale from developer Inflexion Games and the historical strategy game The Settlers: New Allies from Ubisoft.\nTags",
      "snippet": "... more attractive option for PC gamers who want an affordable graphics card that can also compete performance wise with similar <b>NVIDIA</b> and AMD cards.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T16:12:01",
      "provider": {
        "name": "neowin",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.neowin.com/news/images/uploaded/2022/03/1648654118_screenshot_(53)_story.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "neowin",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.neowin.net/news/intel-arc-a750-gets-a-price-cut-down-to-250-to-better-compete-with-amd-and-nvidia-cards/"
      }
    },
    {
      "id": "881725244484460033",
      "title": "Nvidia publishes workaround to the Discord bug hobbling GPU memory",
      "url": "https://www.pcgamer.com/nvidia-publishes-workaround-to-the-discord-bug-hobbling-gpu-memory/",
      "description": "Owners of Nvidia GeForce graphics cards are reporting a bug that slightly hobbles GPU memory speeds when running the Discord instant messaging app. Reportedly, memory speeds are reduced by 200MHz.That",
      "body": "(Image credit: Future)\nAudio player loading\nOwners of Nvidia GeForce graphics cards are reporting a bug that slightly hobbles GPU memory speeds when running the Discord instant messaging app. Reportedly, memory speeds are reduced by 200MHz.\nThat isn't a huge hit, but it's still suboptimal, especially as any reduction in memory frequencies is unwanted. The issue is thought to have first been identified by a user on the Linus Tech Tips forum.\nOn Monday,\nthe poster noticed\n(opens in new tab)\nthat the memory speed of their RTX 3060 Ti LHR (low hash rate) board dropped from 7,000MHz to 6,800MHz when Discord was running. Further investigation has revealed that the app is erroneously triggering a \"CUDA - Force P2 State\" lower power state in the graphics driver.\nIt's not thought any other element of Nvidia graphics cards are impacted, such as GPU core clock speed. Numerous posters\n(opens in new tab)\nhave confirmed the issue.\nA drop from 7,000MHz to 6,800MHz isn't something you'd likely notice in terms of gaming performance. But lots of gamers use Discord in the background while gaming and the memory clockspeed drop is an unintended behaviour that needs fixing.\nHappily, Nvidia has already done just that. In a knowledge base article published yesterday, Nvidia says an \"over the air update\" will be pushed to PCs at a later date, but in the meantime GPU owners can download the NVIDIA program GeForce 3D Profile Manager\n(opens in new tab)\nto resolve the issue.\nGiven the complexity of modern PCs and the huge size and scope of driver software, it's perhaps surprising that minor snafus like this aren't more common.\nWhatever, this one seems to have been swiftly identified and fixed. But is a reminder to keep your scanners peeled for similar issues. And also to shut down background apps that you won't be using while gaming. You never know what might be kyboshing your GPU performance slightly.\n(opens in new tab)",
      "snippet": "Owners of <b>Nvidia</b> GeForce graphics cards are reporting a bug that slightly hobbles GPU memory speeds when running the Discord instant messaging ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T16:07:26",
      "provider": {
        "name": "pcgamer",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/KEvDba6BdNTiSxzZU4vHJU.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pcgamer",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.pcgamer.com/nvidia-publishes-workaround-to-the-discord-bug-hobbling-gpu-memory/"
      }
    },
    {
      "id": "3368485954268159325",
      "title": "LeJeune Puetz Investment Counsel LLC Cuts Stock Position in NVIDIA Co. (NASDAQ:NVDA)",
      "url": "https://theenterpriseleader.com/2023/02/01/lejeune-puetz-investment-counsel-llc-cuts-stock-position-in-nvidia-co-nasdaqnvda.html",
      "description": "Read LeJeune Puetz Investment Counsel LLC Cuts Stock Position in NVIDIA Co. (NASDAQ:NVDA) at Enterprise Leader",
      "body": "alerts:\nAnalyst Upgrades and Downgrades\nNVDA has been the topic of a number of recent analyst reports. Truist Financial raised their price target on shares of NVIDIA from $198.00 to $238.00 and gave the company a buy rating in a report on Monday, January 23rd. Morgan Stanley decreased their price objective on NVIDIA from $182.00 to $175.00 and set an equal weight rating for the company in a report on Thursday, November 17th. Susquehanna Bancshares upped their target price on NVIDIA from $180.00 to $185.00 and gave the company a positive rating in a research report on Thursday, November 17th. Summit Insights raised NVIDIA from a hold rating to a buy rating in a report on Wednesday, November 16th. Finally, Cowen upped their price objective on shares of NVIDIA from $200.00 to $220.00 in a report on Monday, December 12th. Two equities research analysts have rated the stock with a sell rating, nine have assigned  a hold rating, twenty-three have issued  a buy rating and one  has given a strong buy rating to the stock. Based on data from MarketBeat, NVIDIA  has an average rating of Moderate Buy and an average target price of $209.23.\nInsider Buying and Selling at NVIDIA\nIn related news, Director Mark A. Stevens sold 60,000 shares of the companys stock in a transaction that occurred on Wednesday, December 21st. The shares were sold at an average price of $165.09, for a total transaction of $9,905,400.00. Following the sale, the director now directly owns 2,250,193 shares in the company, valued at $371,484,362.37. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this link. In other news, Director Mark A. Stevens sold 60,000 shares of NVIDIA stock in a transaction on Wednesday, December 21st. The shares were sold at an average price of $165.09, for a total transaction of $9,905,400.00. Following the completion of the sale, the director now directly owns 2,250,193 shares of the companys stock, valued at approximately $371,484,362.37. The transaction was disclosed in a filing with the SEC, which is available through the SEC website. Also, EVP Debora Shoquist sold 23,532 shares of the stock in a transaction on Friday, January 27th. The shares were sold at an average price of $205.00, for a total value of $4,824,060.00. Following the completion of the transaction, the executive vice president now directly owns 162,944 shares in the company, valued at approximately $33,403,520. The disclosure for this sale can be found here. Insiders have sold 262,060 shares of company stock valued at $43,817,257 in the last quarter. Corporate insiders own  4.04% of the companys stock.\nNVIDIA Trading Up 2.8 %\nShares of NASDAQ:NVDA traded up $5.48 during mid-day trading on Wednesday, reaching $200.85. 17,156,699 shares of the company were exchanged, compared to its average volume of 45,734,246. NVIDIA Co. has a 1 year low of $108.13 and a 1 year high of $289.46. The firms 50-day simple moving average is $166.07 and its 200 day simple moving average is $155.30. The firm has a market cap of $500.12 billion, a price-to-earnings ratio of 83.14, a P/E/G ratio of 7.28 and a beta of 1.77. The company has a debt-to-equity ratio of 0.45, a current ratio of 3.39 and a quick ratio of 2.74.\nNVIDIA (",
      "snippet": "... LeJeune Puetz Investment Counsel LLC Cuts Stock Position in <b>NVIDIA</b> Co. (NASDAQ:NVDA) at Enterprise Leader. Analyst Upgrades and Downgrades NVDA has ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T15:44:45",
      "provider": {
        "name": "theenterpriseleader",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/nvidia-co-logo.jpg?v=20221020142916&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theenterpriseleader",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://theenterpriseleader.com/2023/02/01/lejeune-puetz-investment-counsel-llc-cuts-stock-position-in-nvidia-co-nasdaqnvda.html"
      }
    },
    {
      "id": "8872683250243633668",
      "title": "NVIDIA graphics cards get a performance hit when Discord is running but you can fix it",
      "url": "https://www.neowin.net/news/nvidia-graphics-cards-get-a-performance-hit-when-discord-is-running-but-you-can-fix-it/",
      "description": "It&#039;s currently unknown why NVIDIA GeForce graphics cards are affected by Discord running in the background, but thankfully there&#039;s a manual fix you can try to get your card back up to speed.",
      "body": "Tom's Hardware\n), the company has admitted that a new update to the Discord app has caused NVIDIA graphics card memory clocks not to reach their full speeds when a user launches a game when Discord is running in the background.\nThe good news is that NVIDIA is aware of this rather odd bug, and a software update is in the works. The bad news is that there's no word on when that update will be released. However,  NVIDIA card owners could actually work around this Discord bug manually if you feel comfortable going deep and making changes to text files.\nHere's the procedure directly from NVIDIA:\nIf you haven't done so already, download the NVIDIA program GeForce 3D Profile Manager and then open it.\nThen click on the button Export SLI Profile in the Profile Manager.\nA file explorer window should appear. Select a location to export and save the NVIDIA Profiles text file.\nOpen the text file you saved using Notepad or a similar text application that does not use formatting.\nHere's the tricky part. Perform a search for the section \"Discord\". Add a new line and type the following text (as seen in the screenshot below): Setting ID_0x50166c5e = 0x00000000\nSave the edited NVIDIA Profiles as a txt file.\nOpen the GeForce 3D Profile Manager again and click on the Import SLI Profiles button.\nA file explorer window should appear again. Select the updated \"NVIDIA Profiles.txt\" file and then click on the Open button.\nFinally, you can now close the GeForce 3D Profile Manager app.\nSource:",
      "snippet": "s currently unknown why <b>NVIDIA</b> GeForce graphics cards are affected by Discord running in the background, but thankfully there&#039. s a manual fix ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T15:16:01",
      "provider": {
        "name": "neowin",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.neowin.com/news/images/uploaded/2021/03/1616455093_discord_story.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "neowin",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.neowin.net/news/nvidia-graphics-cards-get-a-performance-hit-when-discord-is-running-but-you-can-fix-it/"
      }
    },
    {
      "id": "2003804805060619715",
      "title": "NVIDIA Co. (NASDAQ:NVDA) Stock Position Decreased by Citizens National Bank Trust Department",
      "url": "https://www.wkrb13.com/2023/02/01/nvidia-co-nasdaqnvda-stock-position-decreased-by-citizens-national-bank-trust-department.html",
      "description": "Read NVIDIA Co. (NASDAQ:NVDA) Stock Position Decreased by Citizens National Bank Trust Department at WKRB News",
      "body": "alerts:\nAnalyst Upgrades and Downgrades\nSeveral equities analysts have weighed in on NVDA shares. Truist Financial lifted their price objective on NVIDIA from $198.00 to $238.00 and gave the company a buy rating in a report on Monday, January 23rd. Cowen boosted their target price on shares of NVIDIA from $200.00 to $220.00 in a research report on Monday, December 12th. Oppenheimer reduced their price target on shares of NVIDIA from $250.00 to $225.00 and set an outperform rating on the stock in a research report on Friday, November 11th. Susquehanna boosted their price objective on shares of NVIDIA from $180.00 to $185.00 and gave the company a positive rating in a research report on Thursday, November 17th. Finally, HSBC began coverage on NVIDIA in a research note on Thursday, December 15th. They issued a reduce rating and a $136.00 price target on the stock. Two analysts have rated the stock with a sell rating, nine have given a hold rating, twenty-three have issued  a buy rating and one  has assigned  a strong buy rating to the stock. Based on data from MarketBeat.com, the stock presently has a consensus rating of Moderate Buy and an average target price of $209.23.\nInsider Activity at NVIDIA\nIn other news, insider Donald F. Robertson, Jr. sold 2,494 shares of the stock in a transaction that occurred on Thursday, December 15th. The stock was sold at an average price of $167.89, for a total value of $418,717.66. Following the completion of the sale, the insider now directly owns 56,617 shares of the companys stock, valued at $9,505,428.13. The sale was disclosed in a document filed with the SEC, which is accessible through the SEC website. In related news, insider Donald F. Robertson, Jr. sold 2,494 shares of the firms stock in a transaction dated Thursday, December 15th. The shares were sold at an average price of $167.89, for a total transaction of $418,717.66. Following the transaction, the insider now directly owns 56,617 shares of the companys stock, valued at $9,505,428.13. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, CFO Colette Kress sold 10,741 shares of the companys stock in a transaction dated Thursday, January 26th. The stock was sold at an average price of $200.00, for a total transaction of $2,148,200.00. Following the completion of the sale, the chief financial officer now directly owns 536,960 shares of the companys stock, valued at $107,392,000. The disclosure for this sale can be found here. In the last quarter, insiders have sold 262,060 shares of company stock valued at $43,817,257. 4.04% of the stock is owned by corporate insiders.\nNVIDIA Price Performance",
      "snippet": "Read <b>NVIDIA</b> Co. (NASDAQ:NVDA) Stock Position Decreased by Citizens National Bank Trust Department at WKRB News. Analyst Upgrades and Downgrades ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T14:18:46",
      "provider": {
        "name": "wkrb13",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/nvidia-co-logo.jpg?v=20221020142916&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wkrb13",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wkrb13.com/2023/02/01/nvidia-co-nasdaqnvda-stock-position-decreased-by-citizens-national-bank-trust-department.html"
      }
    },
    {
      "id": "5966050644856432269",
      "title": "AMD is 'undershipping' chips to keep CPU GPU prices elevated",
      "url": "https://www.pcworld.com/article/1499957/amd-is-undershipping-chips-to-keep-cpu-gpu-prices-elevated.html",
      "description": "AMD joins Nvidia in \"undershipping\" chips to balance supply and keep prices higher.",
      "body": "Feb 1, 2023 8:44 am PST\nImage: Adam Patrick Murray / IDG\nAs the PC industry flounders, Intel suffered from such disastrous sales last quarter that it instituted pay cuts and other extreme measures going forward. AMDs client PC sales also dropped dramaticallya whopping 51 percent year-over-yearbut the company managed to eke out a small profit despite the sky falling. So why arent CPU and GPU prices falling too? In a call with investors Tuesday night, CEO Lisa Su confirmed that AMD has been undershipping chips for a while now to balance supply and demand (read: keep prices up).\nWe have been undershipping the sell-through or consumption for the last two quarters, Su said, as spotted by PC Gamer. We undershipped in Q3, we undershipped in Q4. We will undership, to a lesser extent, in Q1.\nWith the pandemic winding down and inflation ramping up, far fewer people are buying CPUs, GPUs, and PCs. Its a hard, sudden reverse from just months ago, when companies like Nvidia and AMD were churning out graphic cards as quickly as possible to keep up with booming demand from cryptocurrency miners and PC gamers alike. Now that GPU mining is dead, shelves are brimming with unsold chips.\nDespite the painfully high price tags of new next-gen GPUs, last-gen GeForce RTX 30-series and Radeon RX 6000-series graphics cards are still selling for very high prices considering their two-year-old status. Strategic under-shipping helps companies maintain higher prices for their wares.\nThe Flagship Radon RX 7900 XTX is on of the few 'worthy' next-gen GPUs\nRadeon RX 7900 XTX",
      "snippet": "AMD joins <b>Nvidia</b> in \"undershipping\" chips to balance supply and keep prices higher. Feb 1, 2023 8:44 am PST Image: Adam Patrick Murray / IDG As the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T14:00:00",
      "provider": {
        "name": "pcworld",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.pcworld.com/wp-content/uploads/2023/02/AMD-Ryzen-9-7950X3d-1.jpg?quality=50&amp;strip=all&amp;w=1024",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pcworld",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.pcworld.com/article/1499957/amd-is-undershipping-chips-to-keep-cpu-gpu-prices-elevated.html"
      }
    },
    {
      "id": "2354398905396609265",
      "title": "NVIDIA GeForce Owners Report Gimped Memory Clocks While Gaming With Discord Open",
      "url": "http://hothardware.com/news/geforce-memory-clocks-gimped-with-discord-open",
      "description": "A recent update to the popular chat client seems to be interacting with NVIDIA drivers in a strange way.",
      "body": "Wednesday, February 01, 2023, 08:52 AM EDT\nComments\nWe take them for granted, but modern computers are absolutely amazing. Have you ever considered how much work must have gone into making sure that you can have a half-dozen displays connected to one system, with varying DPI and refresh rates, displaying all different applications running concurrently on a single system? It's a ridiculously complex problem, so naturally, multitasking occasionally causes myriad issues.\nIn this specific case, there's a problem with the NVIDIA driver profile for the popular chatting and screen-sharing app Discord. A particular setting to do with CUDA applications is toggled on in the driver profile. While we're not completely clear on what it does, based on the name\"CUDA - Force P2 State\"it appears to be forcing part of the graphics card into a lower power state than necessary.\nBy the way, did you know\nwe have a Discord server\n? Come on by!\nThis doesn't affect graphics core clocks, but it does have a negative effect on graphics memory clocks. Users on the LTT forums report VRAM clocks some 200-300 MHz lower than expected, depending on the model. That's a change in the final memory transfer rate, not the actual clock rate, so the difference is pretty small overall. Still, it's not great for your GPU to be running slower than it should for no real reason.\nThankfully, NVIDIA's already identified the problem and has a knowledge base page up with the fix. You can head over to NVIDIA's site to read that, but we actually think the solution provided on Reddit is easier. First, close Discord, and then you'll need to grab the free third-party tool NVIDIA Profile Inspector from Github. Extract it anywhere and run it, then click in the search bar at the top and type in Discord.\nFrom there, you'll need to scroll down to find the \"CUDA - Force P2 State\" option, which is probably set to the default of \"On\"; simply click on it and use the drop-down to toggle the setting \"off.\" Once that's done, click \"Apply Changes\" in the top right, and you should be good to go. This tweak accomplishes the exact same thing as NVIDIA's method, just in slightly fewer steps.\nFor what it's worth, this appears to be down to a change in the Discord application itself, and is not necessarily a bug. However, many users on Reddit (as well as your author, here) can confirm that Discord is indeed dropping GPU memory clocks, and that this quick tweak corrects them.",
      "snippet": "... update to the popular chat client seems to be interacting with <b>NVIDIA</b> drivers in a strange way. Wednesday, February 01, 2023, 08:52 AM EDT Comments ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T13:52:00",
      "provider": {
        "name": "hothardware",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.hothardware.com/contentimages/newsitem/60800/content/small_gpu_dram.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hothardware",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://hothardware.com/news/geforce-memory-clocks-gimped-with-discord-open"
      }
    },
    {
      "id": "1961624691565339857",
      "title": "Samsung Galaxy Book 3 Ultra hands-on: NVIDIA RTX 4070 power in a super slim frame",
      "url": "https://www.engadget.com/samsung-galaxy-book-3-ultra-laptop-hands-on-nvidia-rtx-4070-180029774.html?src=rss",
      "description": "Samsung brings the Ultra branding to its Galaxy Book line of laptops..",
      "body": "Samsung is ready to take its Ultra branding to the final frontier  at least, as far as its mobile products go. After introducing an Ultra variant of its tablets last year, the company is launching a similarly high-specced model of its Galaxy Book laptops in 2023. Alongside the new S23 series of flagship phones, Samsung launched the Galaxy Book 3 Pro, Galaxy Book 3 Pro 360 and Galaxy Book 3 Ultra at its Unpacked event in San Francisco today.\nThe Ultra and the Pro 360 are only available in 16 inches, while the clamshell Galaxy Book 3 Pro comes in 14- and 16-inch sizes. I was able to check out a few of them at a recent hands-on event, though Samsung didnt have every single model available. Rather than detail every configuration, Im going to focus on my impressions of the Book 3 Ultra here. For the complete breakdown of the six other laptops, check out our news post for the full specs.\nIn general, the Galaxy Book 3 lineup is pretty straightforward. Theyre powered by 13th-gen Intel Core i5 or i7 processors, with Iris X graphics and up to 32GB of DDR5 RAM. The Pro 360 is the only touch-enabled model, and Samsung has redesigned its display to remove a layer in the panel while still supporting touch. All models have 3K Dynamic AMOLED screens that run at 120Hz and can get as bright as 400 nits.\n\nThe star of the show, however, is the Galaxy Book 3 Ultra, and its a beast of a machine. It uses Intels Core i7 and i9 processors, and those are paired with NVIDIAs RTX 4050 and 4070 graphics cards respectively. The i7 model comes with 16GB of DDR5 RAM while the i9 configuration has 32GB.\nDespite packing such powerful guts, the Book 3 Ultra is an impressively thin and light laptop, weighing 1.79kg (3.9 pounds) and measuring 16.5mm (0.64 inches) thin. Its not as light as the LG Gram Style I saw at CES, which is just 1.2kg, but the latter doesn't offer RTX 30 series graphics. Samsungs laptop also felt more premium and sturdy than the Gram, which might be thanks to its aluminum frame, though I have to say LGs machines at least have a distinctive style. The Galaxy Books are starting to look boring, with the same MacBook-esque design theyve come in for years. Like the Galaxy S23 phones, parts of the Book 3 series were built from recycled plastics from discarded fishing nets.\nThe Book Ultra is heftier than the other Book 3s, but it also offers a generous array of ports including HDMI, microSD, two Thunderbolt 4 USB-C sockets, a USB-A slot and a 3.5mm audio jack. Like most laptops with a 16-inch screen, the Ultra also sports a roomy keyboard and its trackpad is positively enormous. I wish the buttons had a bit more travel, but typing on the Book Ultra was comfortable enough. Its no ThinkPad, but itll do the job.\nCherlynn Low / Engadget\nI didnt get to try out much else on the Galaxy Book 3, since we had a limited amount of time to check out a ton of devices. The few apps I opened, like Notepad and Control Panel, launched quickly, but I cant say thats a good measure of performance.\nI also wish I had been able to check out the 1080p webcam or new features like the updated quad speaker system and PC-smartphone connectivity tools like Recent Websites and Instant Hotspot via Microsofts Phone Link. In theory, though, signing into your Samsung account on the Book Ultra and your Galaxy smartphone should allow you to seamlessly move a web page from your phone to your PC. Samsungs Multi Control now supports Galaxy smartphones so you can use your laptop, tablet and phone with a keyboard and trackpad\nComputer makers have been building software that makes connecting your phone and PC less of a hassle for years. While tools like this are getting better over time, itll be interesting to see just how useful Samsungs offering will be in the real world. Frankly, the most intriguing thing about the Galaxy Book 3 Ultra is what Samsung has been able to squeeze into such a svelte frame. The Galaxy Book 3 Ultra will be available on February 17th from $2,400, but you should wait till we can get one in for testing to determine how it stacks up against the competition on performance and battery life before dropping your money.",
      "snippet": "Samsung brings the Ultra branding to its Galaxy Book line of laptops.\nSamsung is ready to take its Ultra branding to the final frontier at least, as far as its mobile products go.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T13:00:29",
      "provider": {
        "name": "engadget",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/os/creatr-uploaded-images/2023-02/75efbe90-a246-11ed-9ffe-f96883c5b986",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "engadget",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.engadget.com/samsung-galaxy-book-3-ultra-laptop-hands-on-nvidia-rtx-4070-180029774.html?src=rss"
      }
    },
    {
      "id": "8073164126176914063",
      "title": "Nvidia (NVDA) Stock: ChatGPT Driving This Year's Hype Train",
      "url": "https://seekingalpha.com/article/4573948-nvidia-chatgpt-driving-this-years-hype-train?source=feed_all_articles",
      "description": "Nvidia Corp.'s GPUs have powered the birth of a game-changer: OpenAI's ChatGPT - the Generative AI causing a buzz. Click here for our outlook on NVDA stock.",
      "body": ") since it bottomed in October, up more than 90% through its highs last week.\nBearish investors betting on a further decline must be stunned at how quickly investors\nhave jumped back into the Jensen Huang-led company.\nWe believe NVDA's outperformance is closely linked to the hype surrounding OpenAI's ChatGPT. Keen investors should know that the Generative AI platform is trained on Nvidia's GPUs. As such, investors optimistic about the potential of Generative AI have likely joined the recent buying frenzy.\nDeep learning is also \"expected to get bigger and more profitable.\" As the clear leader in the AI ecosystem, Nvidia is well-positioned to benefit from the hype (even if it doesn't translate to significant revenue generation yet in the near term), lifting its valuations further.\nCitigroup (\nAAPL\n) App Tracking Transparency has seen constructive developments. The WSJ reported recently:\nHeavy investment in artificial intelligence tools has enabled the company to improve ad-targeting systems to make better predictions based on less data, according to the interviews and documents. The company is shifting to forms of advertising less dependent on harvesting user data from off its platforms. - WSJ.\nAs such, despite the curtailment of enterprise IT spending due to significant macro headwinds, strategic AI investments requiring Nvidia's ecosystem could move to the forefront as companies look \"\nto quickly and economically\ngrow AI production at scale to drive business growth.\"\nTherefore, AI-first companies may need to build close partnerships with Nvidia as they explore opportunities to develop their strategic AI edge, as seen in Microsoft's collaboration with Nvidia, announced in November 2022.\nBaidu, Inc.'s (\nBIDU\n) announcement that it's ready to launch its ChatGPT-style chatbot demonstrates that China is highly advanced in AI. With Google potentially releasing its first Generative AI products in 2023, we believe it's clear that ChatGPT is moving beyond hype and into productization.\nWith this in mind, we believe it's clear why NVDA has recovered so quickly, as the bears likely didn't anticipate ChatGPT's public preview release to take the world by storm.\nBut, the critical question for NVDA investors has always revolved around its steep growth premium.\nAt an NTM EBITDA of 53.4x or an NTM normalized P/E of 49.5x, we believe NVDA is expensive.\nNvidia has surged significantly from its July 2022 lows of less than 27x, in line with its 10Y average of 27.1x.\nHence, we believe the reward/risk of adding NVDA now seems much less attractive than four weeks ago, when we revised our rating to a Buy.\nNVDA price chart (weekly) (TradingView)\nThe silver lining in NVDA's medium-term price chart is we believe its October lows will not likely be revisited.\nIts rapid recovery over the past four weeks sent NVDA surging to re-test its May and August 2022 highs, likely drawing some breakout traders/investors looking for a decisive upside break.\nHowever, we urge investors to avoid chasing the momentum surge, as a pullback looks increasingly likely, with last week's top a potential bull trap forming.\nDespite that, NVDA formed a higher low in December, suggesting that the trend of lower lows from November 2021 is likely over.\nThe next steep pullback will be your opportunity to add if you missed the lows in October and December. With the upcoming Fed meeting, Powell could grant patient investors the chance to add on weakness if he returns with his hawkish feathers dousing the recent optimism on an earlier-than-expected Fed pivot.\nRating: Hold (Revise From Buy).\nAre you looking to strategically enter the market and optimize gains?\nUnlock the key to successful growth stock investments with our expert guidance on identifying lower-risk entry points and capitalizing on them for long-term profits. As a member, you'll also gain access to exclusive resources including:\n24/7 access to our model portfolios\nDaily Tactical Market Analysis to sharpen your market awareness and avoid the emotional rollercoaster\nAccess to all our top stocks and earnings ideas\nAccess to all our charts with specific entry points\nReal-time chatroom support",
      "snippet": "<b>Nvidia</b> Corp.'s GPUs have powered the birth of a game-changer: OpenAI's ChatGPT. the Generative AI causing a buzz.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T13:00:00",
      "provider": {
        "name": "seekingalpha",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399238914/image_1399238914.jpg?io=getty-c-w1536",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "seekingalpha",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://seekingalpha.com/article/4573948-nvidia-chatgpt-driving-this-years-hype-train?source=feed_all_articles"
      }
    },
    {
      "id": "8858088172400296688",
      "title": "Save $20 on NVIDIA Shield TV Pro/Stick streamers with rare discounts from $130",
      "url": "https://9to5toys.com/2023/02/01/amazon-nvidia-shield-streamer-sale/",
      "description": "Amazon is now offering a rare chance to save on theNVIDIA Shield Android TV Pro streaming media player. Still marking one of the first price cuts in the past twelve months, the companys flagship home theater upgrade now arrives with a $179.99 sale price with free shipping across the board. Youd more regularly pay $200,",
      "body": "NVIDIA Shield Android TV Pro streaming media player\n. Still marking one of the first price cuts in the past twelve months, the companys flagship home theater upgrade now arrives with a $179.99 sale price with free shipping across the board. Youd more regularly pay $200, with todays offer delivering $20 in savings. It comes within $5 of our previous mention from nearly 2 months ago, and is the second-best price weve seen in the past 6 months.\nNVIDIA\nShield Android TV Pro\narrives as one of the more high-end streaming media players on the market with plenty of notable features. First and foremost is onboard Plex support with hardware transcoding, allowing you to create a server just by plugging in a USB hard drive or connecting to a NAS. Of course, theres access to all of the usual streaming services on top of 4K HDR playback, Alexa support, and more. A\nthat brings low-latency playback, night listening, and more to the Android 11 experience.\nAlso on sale today, Amazon is currently offering the\nNVIDIA Shield TV Stick for $129.99 shipped\n. Normally fetching $150, youre looking at yet another rare chance to save as the lead deal, with todays offer matching our previous mention for the 2022 low. This is also only the third price cut of the year, much like the flagship offering. While not as capable as the Pro model above, the Stick version of\nNVIDIA Shield\npacks much of the same Android TV features with 4K HDR playback, too.\nOver on the Amazon front, theres another streaming media player expereince currently up for grabs without paying full price. Amazons\nFire TV Stick 4K Max\nboasts the brands most capable feature set for bringing home a new home theater upgrade, including Wi-Fi 6 support for improved wireless connectivity anywhere in your home, as well as 4K playback with Dolby Atmos audio and Dolby Vision, all at $35. Then go check out the first discount we spotted on Amazons new backlit Alexa Voice Remote Pro.\nNVIDIA Shield Android TV Pro features:\nNVIDIA Shield TV Pro is the ultimate streaming media player for the modern living roompacked with features to make even the most demanding users proud. Level up to SHIELD TV Pro for more storage space, two USB 3.0 ports for expandability, Plex Media Server, SmartThings hub-ready, AAA Android gaming, Twitch broadcasting, and 3 GB RAM. SHIELDs versatility and speed set it apart. Its a streamer, game console, DVR, media server, and smart home hub with voice assistants.",
      "snippet": "<b>NVIDIA</b> Shield Android TV Pro streaming media player . Still marking one of the first price cuts in the past twelve months, the companys flagship home ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T12:51:58",
      "provider": {
        "name": "9to5toys",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/9to5toys.com/wp-content/uploads/sites/5/2022/08/Nvidia-Shield-TV-Pro-1.jpg?resize=1200%2C628&amp;ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "9to5toys",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://9to5toys.com/2023/02/01/amazon-nvidia-shield-streamer-sale/"
      }
    },
    {
      "id": "4904815163179978223",
      "title": "NVIDIA Corporation (NASDAQ:NVDA) is favoured by institutional owners who hold 65% of the company",
      "url": "https://news.yahoo.com/nvidia-corporation-nasdaq-nvda-favoured-120045067.html",
      "description": "If you want to know who really controls NVIDIA Corporation ( NASDAQ:NVDA ), then you'll have to look at the makeup of...",
      "body": "NASDAQ:NVDA\n), then you'll have to look at the makeup of its share registry. With 65% stake, institutions possess the maximum shares in the company. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn).\nBecause institutional owners have a huge pool of resources and liquidity, their investing decisions tend to carry a great deal of weight, especially with individual investors. Hence, having a considerable amount of institutional money invested in a company is often regarded as a desirable trait.\nLet's delve deeper into each type of owner of NVIDIA, beginning with the chart below.\nownership-breakdown\nWhat Does The Institutional Ownership Tell Us About NVIDIA?\nInstitutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index.\nWe can see that NVIDIA does have institutional investors; and they hold a good portion of the company's stock. This suggests some credibility amongst professional investors. But we can't rely on that fact alone since institutions make bad investments sometimes, just like everyone does. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at NVIDIA's earnings history below. Of course, the future is what really matters.\nearnings-and-revenue-growth\nInstitutional investors own over 50% of the company, so together than can probably strongly influence board decisions. NVIDIA is not owned by hedge funds. Looking at our data, we can see that the largest shareholder is The Vanguard Group, Inc. with 8.3% of shares outstanding. Meanwhile, the second and third largest shareholders, hold 7.2% and 5.5%, of the shares outstanding, respectively. In addition, we found that Jen-Hsun Huang, the CEO has 3.5% of the shares allocated to their name.\nStory continues\nOn studying our ownership data, we found that 25 of the top shareholders collectively own less than 50% of the share register, implying that no single individual has a majority interest.\nWhile it makes sense to study institutional ownership data for a company, it also makes sense to study analyst sentiments to know which way the wind is blowing. Quite a few analysts cover the stock, so you could look into forecast growth quite easily.\nInsider Ownership Of NVIDIA\nThe definition of an insider can differ slightly between different countries, but members of the board of directors always count. Company management run the business, but the CEO will answer to the board, even if he or she is a member of it.\nI generally consider insider ownership to be a good thing. However, on some occasions it makes it more difficult for other shareholders to hold the board accountable for decisions.\nWe can see that insiders own shares in NVIDIA Corporation. Insiders own US$19b worth of shares (at current prices). It is good to see this level of investment. You can\ncheck here to see if those insiders have been buying recently.\nGeneral Public Ownership\nWith a 31% ownership, the general public, mostly comprising of individual investors, have some degree of sway over NVIDIA. While this size of ownership may not be enough to sway a policy decision in their favour, they can still make a collective impact on company policies.\nNext Steps:\nWhile it is well worth considering the different groups that own a company, there are other factors that are even more important. Case in point: We've spotted   3 warning signs for NVIDIA  you should be aware of.\nUltimately the future is most important. You can access this free report on analyst forecasts for the company.\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\nHave feedback on this article? Concerned about the content? Get in touch with us directly.\nAlternatively, email editorial-team (at) simplywallst.com.\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nJoin A Paid User Research Session\nYoull receive a\nUS$30 Amazon Gift card\nfor 1 hour of your time while helping us build better investing tools for the individual investors like yourself.",
      "snippet": "If you want to know who really controls <b>NVIDIA</b> Corporation ( NASDAQ:NVDA ), then you'll have to look at the makeup of. NASDAQ:NVDA ), then you'll ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T12:00:45",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.zenfs.com/en/simply_wall_st__316/dca719ac52e206a9a696149c1568653d",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://news.yahoo.com/nvidia-corporation-nasdaq-nvda-favoured-120045067.html"
      }
    },
    {
      "id": "732793361949377285",
      "title": "Cyberpunk 2077 receives NVIDIA DLSS 3 support",
      "url": "https://www.geeky-gadgets.com/cyberpunk-2077-01-02-2023/",
      "description": "NVIDIA has announced that using the latest neural graphics Cyberpunk 2077 now supports DLSS 3 offering a more realistic and immersive rendering of the",
      "body": "Julian Horsey\nNVIDIA has announced that using the latest neural graphics Cyberpunk 2077 now supports DLSS 3 offering a more realistic and immersive rendering of the hugely popular science-fiction role-playing game. Check out the teaser below to learn more about what you can expect from the performance increase, ray tracing and graphics rendering when you enable DLSS 3 within Cyberpunk 2077. Obviously you will need a supporting graphics card to be able to appreciate the latest update as well as the other 21 games that now support DLSS 3.\nThese include Dying Light 2 Stay Human, Hitman 3, Marvels Midnight Suns, Microsoft Flight Simulator, Portal with RTX, The Witcher 3: Wild Hunt and Warhammer 40,000: Darktide. More are coming, including Atomic Heart, ILL SPACE and Warhaven.\nCyberpunk 2077 DLSS 3 support\nDLSS 3 is a package that includes a number of sophisticated technologies. Combining DLSS Super Resolution, all-new DLSS Frame Generation, and NVIDIA Reflex, running on the new hardware capabilities of GeForce RTX 40 Series GPUs, DLSS 3 multiplies performance while maintaining great image quality and responsiveness.\nExperience Cyberpunk 2077 like never before with incredible visuals of Night City enhanced by the new Ray Tracing: Overdrive Mode & up to 4X performance increase with NVIDIA DLSS 3.\nWatch this video on YouTube.\nIm deeply in love with DLSS with Frame Generation, gushes PC Gamer. DLSS 3 is incredible, and NVIDIAs tech is undeniably a selling point for the [GeForce RTX] 4080, asserts PCGamesN. [I]ts a phenomenal achievement in graphics performance, states Digital Foundry.\nSource : NVIDIA :",
      "snippet": "<b>NVIDIA</b> has announced that using the latest neural graphics Cyberpunk 2077 now supports DLSS 3 offering a more realistic and immersive rendering of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T11:55:39",
      "provider": {
        "name": "geeky-gadgets",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.geeky-gadgets.com/wp-content/uploads/2023/02/Cyberpunk-2077-DLSS-3-support.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "geeky-gadgets",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.geeky-gadgets.com/cyberpunk-2077-01-02-2023/"
      }
    },
    {
      "id": "4654529178802732497",
      "title": "Discord: a bug creates problems for some Nvidia video cards",
      "url": "https://pledgetimes.com/discord-a-bug-creates-problems-for-some-nvidia-video-cards/",
      "description": "Discord is certainly not an app to be underestimated. It is a platform that many gamers use to play together.",
      "body": "0\nDiscord is certainly not an app to be underestimated. It is a platform that many gamers use to play together. However, it is not only used by players, now also many students and freelancers take advantage of the app for their activities. In any case, today we unfortunately have to bring bad news as a bug is creating some problems to users!\nDiscord: a bug affects some video cards\nThe bug we want to tell you about today was reported by The Verge, and the reports are now flooding the web both on Reddit and on the Linus Tech Tips forum. Apparently a recent update to the desktop program is causing problems for some video cards, especially Nvidia. In particular, there would be declines in fino at 200 MHz in terms of memory clock.\nIf you havent encountered the problem, the reason is probably simple: the video cards that seem to be affected by it are only the RTX 30 series. If you own a 40 series instead then you should be safe.\nAnyway Nvidia is well aware of this problem with Discord and has also already published a support page that we leave you here in case you are interested, where it illustrates a method that allows you to temporarily stem the issue by going through GeForce 3D Profile Manager. Obviously this is only a temporary solution and the company is already working on a fix which will be released through a specific update.\nWe will obviously keep you updated in case of news and we cant do anything but cross our fingers hoping for a timely solution!\n#Discord #bug #creates #problems #Nvidia #video #cards",
      "snippet": "Apparently a recent update to the desktop program is causing problems for some video cards, especially <b>Nvidia</b>.\nIn particular, there would be declines in fino at 200 MHz in terms of memory clock.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T10:00:43",
      "provider": {
        "name": "pledgetimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://tech.icrewplay.com/wp-content/uploads/2020/04/discord.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pledgetimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://pledgetimes.com/discord-a-bug-creates-problems-for-some-nvidia-video-cards/"
      }
    },
    {
      "id": "8484927658549993133",
      "title": "Dell launches Alienware Aurora R15 desktop in India",
      "url": "https://www.thehindu.com/sci-tech/technology/dell-launches-alienware-aurora-r15-desktop-in-india/article66458085.ece",
      "description": "The Dell Alienware Aurora R15 desktop comes with 13th Gen Core Raptor lake processors with support for up to NVIDIA GeForce RTX 4090 GPU",
      "body": "The Alienware Aurora\nR15, based on the Legend 2.0 design, offers better performance through an optimised chassis for a 360 approach to style and practicality, convenient I/O ports, and cable management solutions, the company shared.\nThe Alienware Aurora R15 also sports an internal architecture designed to support higher wattage that prioritises speed, performance, and gameplay.\nThe Alienware Aurora R15 desktop comes powered by 13th Gen Intel Core Raptor Lake processors.| Photo Credit:Special Arrangement\nThe desktop supports ray-traced 4K gaming at 60+ FPS and enhanced overclocking. It also supports NVIDIA DLSS 3 AI (Artificial Intelligence) technology for AI-based acceleration, NVIDIA Reflex technology for an intelligent response, NVIDIA Broadcast App, and the NVIDIA Ada Lovelace Architecture.\nAs the aspiration of premium gaming devices keeps increasing, we at Dell are committed to constantly satisfying these challenging demands and offering the best gaming experience to our audience in India, said Pujan Chadha, Director for Product Marketing, India Consumer, Dell Technologies.",
      "snippet": "... with 13th Gen Core Raptor lake processors with support for up to <b>NVIDIA</b> GeForce RTX 4090 GPU. The Alienware Aurora R15, based on the Legend 2.0 ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T09:03:10",
      "provider": {
        "name": "thehindu",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://th-i.thgim.com/public/sci-tech/technology/pgsog9/article66458088.ece/alternates/LANDSCAPE_1200/AW%20Aurora%20R15%20-%203.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "thehindu",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.thehindu.com/sci-tech/technology/dell-launches-alienware-aurora-r15-desktop-in-india/article66458085.ece"
      }
    },
    {
      "id": "1499132186450273682",
      "title": "Cyberpunk 2077 gets DLSS 3 and a massive boost to RTX 40 Series RT performance",
      "url": "https://www.tweaktown.com/news/90203/cyberpunk-2077-gets-dlss-3-and-massive-boost-to-rtx-40-series-rt-performance/index.html",
      "description": "DLSS 3 and the groundbreaking Frame Generation has arrived in Night City, bringing a big boost to ray-tracing performance on GeForce RTX 40 Series GPUs.",
      "body": "Jan 31, 2023 9:59 PM CST\n1 minute & 24 seconds read time\nCyberpunk 2077 was prominently showcased during NVIDIA's big GeForce RTX 40 Series reveal last year. The visually stunning game was shown taking advantage of cutting-edge DLSS 3 rendering alongside the reveal of an RT Overdrive mode that will push the already intensive real-time ray-tracing in the game even further.\nExclusive to GeForce RTX 40 Series GPUs (RTX 4090, RTX 4080, RTX 4070 Ti), DLSS 3 is a combination of DLSS Super Resolution, NVIDIA Reflex, and Frame Generation. The latter needs the new GeForce GPUs because it is an intensive AI process involving specific hardware that can generate new frames to boost performance. As per the video posted by NVIDIA above, we're talking about the sort of leap that has made DLSS 3 one of the most talked about bits of PC gaming tech in the past year.\n\"Playing Cyberpunk 2077 with the AI-powered performance of NVIDIA DLSS 3 is the best way to access the stunning visuals the game has to offer - this technology helps us take a new step toward combining unconstrained visual fidelity with exceptional performance.\"\nJakub Knapik, Global Art Director, CD PROJEKT RED.\nThere have been some criticisms around DLSS 3's funky way of dealing with UI elements and text. On that front, NVIDIA notes that the Cyberpunk 2077 implementation features notable improvements in these areas, which might be one of the reasons its release was delayed. Latency, another critical area, is improved over just using DLSS 2 - with the RTX 4090 and DLSS 3 resulting in 41ms versus the RTX 3090 Ti's and DLSS 2's 78ms. It also delivers over double the performance using less power.\nAs per NVIDIA's 1440p and 4K benchmarks, DLSS 3 sounds incredible when you see the massive leap in performance.\n3\nVIEW GALLERY - 3 IMAGES\n3\nHaving checked out the update, I can confirm that the results are mind-blowing with no perceivable loss in visual quality. Using a GeForce RTX 4080 running the benchmark in 4K with RT Ultra settings and no DLSS, the result was an average fps of 30. With DLSS Quality and Frame Generation, this increased to 80fps.\nWith DLSS 3 finally in Cyberpunk 2077, now we wait for the RT Overdrive update.\nCyberpunk 2077: The Complete Official Guide-Collector's Edition\nToday\n* Prices last scanned on 1/31/2023 at 9:45 pm CST - prices may not be accurate, click links above for the latest price. We may earn an affiliate commission.\nNEWS SOURCE:\nKosta Andreadis\nKosta might be a relatively new member of TweakTown, but hes a veteran gaming journalist that cut his teeth on well-respected Aussie publications like PC PowerPlay and HYPER back when articles were printed on paper. A lifelong gamer since the 8-bit Nintendo era, it was the CD-ROM-powered 90s that cemented his love for all things games and technology. From point-and-click adventure games to RTS games with full-motion video cut-scenes and FPS titles referred to as Doom clones. Genres he still loves to this day. Kosta is also a musician, releasing dreamy electronic jams under the name Kbit.\nNewsletter Subscription",
      "snippet": "... GeForce RTX 40 Series GPUs (RTX 4090, RTX 4080, RTX 4070 Ti), DLSS 3 is a combination of DLSS Super Resolution, <b>NVIDIA</b> Reflex, and Frame Generation.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T03:59:02",
      "provider": {
        "name": "tweaktown",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "tweaktown",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.tweaktown.com/news/90203/cyberpunk-2077-gets-dlss-3-and-massive-boost-to-rtx-40-series-rt-performance/index.html"
      }
    },
    {
      "id": "9195614803981344559",
      "title": "Nvidia CEOs net worth rises $5.1bn",
      "url": "https://www.cmcmarkets.com/en/opto/nvidia-ceos-net-worth-rises-51bn",
      "description": "Jensen Huangs wealth rose sharply in January, as the Nvidia share price jumped on speculation it could benefit from the hype around ChatGPT.",
      "body": "In todays top stories, on the back of wildfire hype around ChatGPT, chipmaker Nvidias share price jumped and its CEOs wealth increased by some $5bn. This comes as Alphabet announces plans to build a ChatGPT rival. Elsewhere, Intel CEO Pat Gelsinger is to take a 25% pay cut, and UK cybersecurity firm Darktrace is launching a 75m buyback plan after fraud allegations. Lastly, sentiment on the EV industry seems to be improving, with the Global X Lithium & Battery Tech ETF rising 20.7% in January.\r\n\r\nNvidia rises on ChatGPT excitement\r\n\r\nThe hype around language chatbot ChatGPT is expected to prompt companies to boost their AI operations. The Nvidia [NVDA] share price jumped in January, as investors bet that there will be a ramp up in investment in its graphics chips. Meanwhile, $5.1bn was added to CEO Jensen Huangs wealth, one of the largest net-worth percentage gains among US billionaires in 2023 so far, according to the Bloomberg Billionaires Index.\r\n\r\nDarktrace buyback follows short report\r\n\r\nShares in UK cybersecurity favourite Darktrace [DARK.L] tumbled to an all-time low on Tuesday following the release of a short-seller report alleging fraud. Quintessential Capital Management has accused the company of marketing activities to channel funds back into its partners as payment for apparently fictitious purchases. Darktrace says it has full confidence in its accounting practices and has commenced a 75m buyback plan to lift its share price.\r\n\r\nAlphabet plans to build ChatGPT rival\r\n\r\nThe AI battle between big tech giants is heating up. Alphabet [GOOGL] is testing products with conversational learning technology. The project, nicknamed Atlas, is a code red response to Microsofts [MSFT] investment in ChatGPT owner OpenAI, according to CNBC. It remains to be seen how the products could be integrated into Alphabets services, but a spokesperson for the conglomerate told the TV channel that AI is foundational and transformative technology that is incredibly useful for individuals, businesses and communities.\r\n\r\nSentiment on EVs gathers pace\r\n\r\nInvestor sentiment on the EV industry appears to have turned a corner with the Global X Lithium & Battery Tech ETF [LIT] rising 20.7% in January. The gain was led by a 29.8% rally in miner Albemarle [ALB], the funds top holding with a 10.56% weighting as of 31 January. US semiconductor maker Wolfspeed and German chip supplier ZF Friedrichshafen have announced plans to build a $3bn EV chip plant in Germany.\r\n\r\nIntel boss takes pay cut\r\n\r\nIntel [INTC] CEO Pat Gelsinger is to take a 25% pay cut as the chipmaker looks to shore up cash for future investment, which will help accelerate our transformation and achieve our long-term strategy. Intel has issued a grim outlook amid soft PC demand, but rival AMD [AMD] is faring better: despite CEO Lisa Su expecting the PC total addressable market will be down 10% in 2023, she believes that cloud demand should recover in the second half of the year.",
      "snippet": "Jensen Huangs wealth rose sharply in January, as the <b>Nvidia</b> share price jumped on speculation it could benefit from the hype around ChatGPT. In ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:00:00",
      "provider": {
        "name": "cmcmarkets",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://assets.cmcmarkets.com/images/Nvidia_GettyImages-902419310_1200px_medium.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "cmcmarkets",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.cmcmarkets.com/en/opto/nvidia-ceos-net-worth-rises-51bn"
      }
    },
    {
      "id": "3838494118167766053",
      "title": "These 3 Stocks Are Ending the Nasdaq Bear Market",
      "url": "http://fool.com/investing/2023/02/01/these-3-stocks-are-ending-the-nasdaq-bear-market/",
      "description": "The question is, can they dodge a correction while the rest of the index catches up?",
      "body": "$209.43\nPrice as of February 1, 2023, 4:00 p.m. ET\nYoure reading a free article with opinions that may differ from The Motley Fools Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more.\nThe question is, can they dodge a correction while the rest of the index catches up?\nDespite its stumble to start the current trading week, the Nasdaq Composite\n(NASDAQINDEX: ^IXIC)\nis up 12% from the low point it reached near the end of last year, and it reached a four-month high on Friday. This is the best stretch we've seen from the index since 2021, before the recent bear market took shape.\nIf this is the shape of things to come, that bear market may well be ending.\nBefore jumping to such a conclusion though, be aware that the underlying support for this rally is extremely lopsided. Specifically, it's top-heavy. A trio of large caps (mega caps, actually) -- Tesla\n(\nNasdaq Composite\n's total market cap. Combine that degree of impact with the huge gains they've each recently achieved, and what you get are a heavily skewed index and a poorly balanced advance.\nIn simpler terms, were it not for Meta, Nvidia, and Tesla, the Nasdaq Composite's recent rally would not be anywhere near as impressive as it has been. The index might not even be toying with the prospect of exiting its bear market.\nPerhaps worse, looking back just a bit further reveals that Meta, Tesla, and Nvidia were among last year's biggest Nasdaq-listed losers, leaving them ripe for exaggerated bounces now. Ditto for Alphabet and Amazon, albeit to a lesser degree. The composite's recent rally may mostly be the result of sheer volatility.\nProceed with caution\nDon't misunderstand. A stock's recent history should have little to no bearing on an investor's decision to buy or sell it. The two most important questions any investor should ask before making a trade are (1) does this company have compelling long-term prospects, and (2) does this stock's price fairly reflect those prospects and the risks associated with them?\nThis isn't about a stock-picking approach, however. This is about understanding how market indexes work, and how they can sometimes paint a misleading picture. In this case, the Nasdaq Composite's rally may not be as well-grounded as it seems ... at least not yet.\nIt matters because stocks tend to move as a herd, with the majority of them taking their directional cues from the market's most-watched names. If Meta, Tesla, and Nvidia can't sustain their rallies, many other stocks are apt to follow suit with pullbacks of their own.\nThe good news is, there's still a chance this poorly balanced rally effort could become more balanced without pulling back and starting over first. We should give the market the benefit of the doubt and offer it a chance to do so before presuming the worst.\nBut, we should also proceed with caution here. There's no ironclad evidence the Nasdaq bear market is truly over yet. It won't be over until we see much more evenly balanced participation from the majority of Nasdaq-listed stocks.\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. James Brumley has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Amazon.com, Meta Platforms, Nvidia, and Tesla. The Motley Fool has a disclosure policy.\nStocks Mentioned",
      "snippet": "In simpler terms, were it not for Meta, <b>Nvidia</b>, and Tesla, the Nasdaq Composite's recent rally would not be anywhere near as impressive as it has ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T00:00:00",
      "provider": {
        "name": "fool",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://g.foolcdn.com/editorial/images/718632/chart-going-up.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fool",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://fool.com/investing/2023/02/01/these-3-stocks-are-ending-the-nasdaq-bear-market/"
      }
    },
    {
      "id": "1998806697473847459",
      "title": "Heads Up Cyberpunk 2077 And Dying Light 2 Finally Got GeForce DLSS 3 And Reflex Support",
      "url": "https://hothardware.com/news/cyberpunk-2077-dying-light-2-dlss-3-support",
      "description": "Cyberpunk 2077 And Dying Light 2 have been updated with support for NVIDIA's AI frame generation technology enabled by the latest Ada Lovelace GPUs.",
      "body": "Tuesday, January 31, 2023, 05:30 PM EDT\nComments\nIf you've got an NVIDIA RTX 40-series GPU and you feel like you need more frames in heavily ray-traced games Cyberpunk 2077 and Dying Light 2: Stay Human, you're in luck: both titles got updated today with support for the Ada Lovelace-exclusive DLSS 3 Frame Generation.\nThe third whole-number iteration of NVIDIA's Deep Learning Super Sampling is named a little oddly, because it's not super-sampling in the established per-frame sense. Rather than modifying the spatial resolution of the image, it instead uses AI to generate additional frames, effectively increasing the temporal resolution of the game.\nThis technique has its downsides, including the possibility of visual artifacts appearing in the AI-generated frames as well as an increase in input latency. NVIDIA counters the latter with the simultaneous deployment of its Reflex technology that reduces input lag by reducing the number of pre-rendered frames waiting in the buffer.\nThat, in turn, can reduce average framerates and introduce microstutter. In combination with DLSS 3 Frame Generation, though, the idea is that you'll enjoy a higher framerate while playing with similar input latency compared to standard, non-AI-assisted rendering. Of course, you can also combine Frame Generation with DLSS 2.x spatio-temporal upscaling to get even higher performance.\nNote that this update for Cyberpunk 2077 doesn't yet include the Ray-Tracing Overdrive mode that NVIDIA promoted at its launch event for the GeForce RTX 40 series. That'll come in a later patch, possibly to coincide with the Phantom Liberty expansion for the game. NVIDIA's Manuel Guzman comments that if the game won't launch after the recent update, you may need to first uninstall your mods.\nWith that said, you'll need to be on a fairly recent version of Windows to use DLSS 3 Frame GenerationWindows 10 2004 or later. That's because the feature requires \"Hardware-Accelerated Graphics Scheduling\" to be supported and enabled. CD Projekt Red has a short guide on its website explaining how to enable the feature in case it's somehow disabled on a supported machine.\nNote that the FPS counter is wrong in Dying Light 2 with DLSS 3. Steam reported 114 FPS in this scene.\nFinally, another bit of good news: this update for Dying Light 2 removes that game's Denuvo DRM which could bog down low end systems. Along with numerous performance optimizations and enhancements since we reviewed the game on release, this should help folks with more marginal machines enjoy the zombie-smashing parkour action title.\nNVIDIA's been aggressively pushing to get DLSS added to all of the latest PC games. Along with the announcements for these two games, NVIDIA says that DLSS 3 is coming to Hitman 3, Dakar Desert Rally, Deliver Us Mars, Marvel's Midnight Suns, and Perish. Those are in addition to earlier-announced titles, including Atomic Heart, Throne and Liberty, The Day Before, Tower of Fantasy, Witchfire, and others.",
      "snippet": "Tuesday, January 31, 2023, 05:30 PM EDT Comments If you've got an <b>NVIDIA</b> RTX 40-series GPU and you feel like you need more frames in heavily ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T22:30:00",
      "provider": {
        "name": "hothardware",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.hothardware.com/contentimages/newsitem/60798/content/small_cybepunk-dlss3-update.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hothardware",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://hothardware.com/news/cyberpunk-2077-dying-light-2-dlss-3-support"
      }
    },
    {
      "id": "3636429184061032455",
      "title": "NVIDIA Co. (NASDAQ:NVDA) Shares Purchased by Manchester Capital Management LLC",
      "url": "https://www.themarketsdaily.com/2023/01/31/nvidia-co-nasdaqnvda-shares-purchased-by-manchester-capital-management-llc.html",
      "description": "Read NVIDIA Co. (NASDAQ:NVDA) Shares Purchased by Manchester Capital Management LLC at Markets Daily",
      "body": "alerts:\nWall Street Analysts Forecast Growth\nSeveral research analysts have commented on the company. Credit Suisse Group  reaffirmed an outperform rating and set a $210.00 price target (up previously from $205.00) on shares of NVIDIA in a research report on Wednesday, November 16th. Morgan Stanley lowered their price target on NVIDIA from $182.00 to $175.00 and set an equal weight rating on the stock in a report on Thursday, November 17th. Summit Insights upgraded NVIDIA from a hold rating to a buy rating in a research report on Wednesday, November 16th. Susquehanna increased their price objective on shares of NVIDIA from $180.00 to $185.00 and gave the company a positive rating in a research note on Thursday, November 17th. Finally, Truist Financial lifted their price objective on NVIDIA from $198.00 to $238.00 and gave the stock a buy rating in a research report on Monday, January 23rd. Two equities research analysts have rated the stock with a sell rating, nine have given a hold rating, twenty-three have issued  a buy rating and one  has assigned  a strong buy rating to the companys stock. According to data from MarketBeat, NVIDIA  has an average rating of Moderate Buy and a consensus price target of $209.23.\nInsider Buying and Selling\nIn other news, CFO Colette Kress sold 10,741 shares of the stock in a transaction that occurred on Thursday, January 26th. The stock was sold at an average price of $200.00, for a total value of $2,148,200.00. Following the completion of the transaction, the chief financial officer now directly owns 536,960 shares of the companys stock, valued at approximately $107,392,000. The sale was disclosed in a legal filing with the SEC, which is available at this link. In other news, CFO Colette Kress sold 10,741 shares of the firms stock in a transaction that occurred on Thursday, January 26th. The shares were sold at an average price of $200.00, for a total transaction of $2,148,200.00. Following the completion of the sale, the chief financial officer now owns 536,960 shares of the companys stock, valued at $107,392,000. The transaction was disclosed in a document filed with the SEC, which is accessible through this link. Also, insider Donald F. Robertson, Jr. sold 2,494 shares of the stock in a transaction that occurred on Thursday, December 15th. The stock was sold at an average price of $167.89, for a total value of $418,717.66. Following the sale, the insider now owns 56,617 shares in the company, valued at $9,505,428.13. The disclosure for this sale can be found here. Insiders have sold a total of 262,060 shares of company stock valued at $43,817,257 over the last three months. 4.04% of the stock is owned by corporate insiders.\nNVIDIA Stock Performance",
      "snippet": "Read <b>NVIDIA</b> Co. (NASDAQ:NVDA) Shares Purchased by Manchester Capital Management LLC at Markets Daily. Wall Street Analysts Forecast Growth Several ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T21:10:41",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/nvidia-co-logo.jpg?v=20221020142916&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/01/31/nvidia-co-nasdaqnvda-shares-purchased-by-manchester-capital-management-llc.html"
      }
    },
    {
      "id": "965977614677045085",
      "title": "ChatGPT's massive hype has made these 5 artificial intelligence stocks some of the hottest on the market",
      "url": "https://finance.yahoo.com/news/chatgpts-massive-hype-made-5-205245334.html",
      "description": "\"We believe Nvidia has in ChatGPT a potentially meaningful compute demand driver,\" Citigroup analysts said recently.",
      "body": "An illustration of artificial intelligence, or A.I.\nShutterstock\nThe success of ChatGPT has sparked a rally in artificial intelligence stocks.\nShares of AI tech suppliers like Nvidia and Ambarella have jumped since the launch of ChatGPT.\nHere's a list of five AI stocks that have surged since OpenAI launched ChatGPT on November 30.\nEveryone is talking about ChatGPT, and investors are trading on the hype, sending both notable and under-the-radar artificial intelligence stocks soaring since the bot launched.\nOn November 30, OpenAI unveiled ChatGPT, and since then it has shown a capacity for a range of tasks, such as writing stock stories,\ndating-app messages\n.\nThe buzz has exploded, and OpenAI is getting a reported $10 billion investment from Microsoft. While OpenAI isn't traded on public markets, artificial intelligence stocks that are public have been riding the wave.\nHere's a list of five AI stocks that have seen a surge since November 29, the last trading day before ChatGPT launched.\nNvidia\nTicker: NVDA\nPercent gain: 23%\nNvidia, best known for its design and production of graphics-processing chips, is embedded in the artificial intelligence craze, and the firm's technology is used for various AI integrations from self-driving cars to robots.\nThe Nvidia stock rally has also made founder and CEO Jensen Huang considerably richer as his wealth has grown by more than $5 billion so far this year, Bloomberg data shows.\nWall Street is also bullish. Citigroup analysts recently estimated that a boom in ChatGPT usage could translate to $3 billion-$11 billion in sales for Nvidia in the next 12 months. \"We believe Nvidia has in ChatGPT a potentially meaningful compute demand driver,\" the bank said.\nMeanwhile, analysts at Bank of America said Nvidia is a top potential winner from generative AI growth, and Wells Fargo said new chips from Nvidia are poised to gain from greater computing needs of AI tools like ChatGPT.\nAmbarella\nTicker: AMBA\nPercent gain: 26%\nAmbarella is another chip company that serves the AI market. It designs semiconductors that are used in everything from entertainment consoles in cars to cellphones.\nStory continues\nIt also specializes in \"system on a chip\" semiconductors that combine multiple central processors on one logic board to provide artificial intelligence computing.\nAmbarella chips are used in self-driving functions, and the company recently partnered with German auto supplier Continental on an autonomous driving venture.\nMobileye\nTicker: MBLY\nPercent gain: 39%\nMobileye was spun off by Intel and focuses on self-driving technology and driver-assistance systems, including chips and cameras. Volkswagen, Ford, and GM are among its customers. The company has a near-fully autonomous system called SuperVision, and its Chauffeur product is designed to convert a car into a Level 4 self-driven vehicle.\nLast week, the company beat quarterly forecasts and gave an upbeat 2023 revenue projection. CEO Amnon Shashua touted roughly $17 billion worth of bookings that extends through 2030.\n\"We expect SuperVision to be a very large growth driver in 2023 and beyond,\" he told analysts on an earnings call.\nC3.ai\nTicker: AI\nPercent gain: 61%\nC3.ai is an artificial intelligence software suite provider, and has the success of ChatGPT to thank for its recent stock surge. Shares soared roughly 28% on Tuesday alone on news that it would integrate ChatGPT into its product suite.\n\"The C3 Generative AI Product Suite integrates the latest AI capabilities from organizations such as Open AI, Google, and academia, and the most advanced models, such as ChatGPT and GPT-3 into C3 AI's enterprise AI products,\" C3.ai said in a Tuesday press release.\nAlteryx\nTicker: AYX\nPercent gain: 28%\nAlteryx's software is best known for data and analytics, and the firm is also focused on furthering automation. The firm specializes in artificial intelligence integration, although on a smaller scale compared peers like Google and Meta.\nThe company will report quarterly results on February 9.\nRead the original article on",
      "snippet": "\"We believe <b>Nvidia</b> has in ChatGPT a potentially meaningful compute demand driver,\" Citigroup analysts said recently. An illustration of artificial ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T20:52:45",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/ny/api/res/1.2/kt7CSD1QjL3QloYPJOyEzg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/business_insider_articles_888/9c64b82aa0e7309e687194df9b920224",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://finance.yahoo.com/news/chatgpts-massive-hype-made-5-205245334.html"
      }
    },
    {
      "id": "5696913121868728493",
      "title": "ChatGPT Hype Lifts These 5 Artificial Intelligence Stocks to Forefront",
      "url": "https://markets.businessinsider.com/news/stocks/chatgpt-openai-artificial-intelligence-stocks-nvidia-mobileye-c3ai-ambarella-alteryx-2023-1",
      "description": "\"We believe Nvidia has in ChatGPT a potentially meaningful compute demand driver,\" Citigroup analysts said recently.",
      "body": "dating-app messages\n.\nThe buzz has exploded, and OpenAI is getting a reported $10 billion investment from Microsoft. While OpenAI isn't traded on public markets, artificial intelligence stocks that are public have been riding the wave.\nHere's a list of five AI stocks that have seen a surge since November 29, the last trading day before ChatGPT launched.\nNvidia\nTicker: NVDA\nPercent gain: 23%\nNvidia, best known for its design and production of graphics-processing chips, is embedded in the artificial intelligence craze, and the firm's technology is used for various AI integrations from self-driving cars to robots.\nThe Nvidia stock rally has also made founder and CEO Jensen Huang considerably richer as his wealth has grown by more than $5 billion so far this year, Bloomberg data shows.\nWall Street is also bullish. Citigroup analysts recently estimated that a boom in ChatGPT usage could translate to $3 billion-$11 billion in sales for Nvidia in the next 12 months. \"We believe Nvidia has in ChatGPT a potentially meaningful compute demand driver,\" the bank said.\nMeanwhile, analysts at Bank of America said Nvidia is a top potential winner from generative AI growth, and Wells Fargo said new chips from Nvidia are poised to gain from greater computing needs of AI tools like ChatGPT.\nAmbarella\nTicker: AMBA\nPercent gain: 26%\nAmbarella is another chip company that serves the AI market. It designs semiconductors that are used in everything from entertainment consoles in cars to cellphones.\nIt also specializes in \"system on a chip\" semiconductors that combine multiple central processors on one logic board to provide artificial intelligence computing.\nAmbarella chips are used in self-driving functions, and the company recently partnered with German auto supplier Continental on an autonomous driving venture.\nMobileye\nTicker: MBLY\nPercent gain: 39%\nMobileye was spun off by Intel and focuses on self-driving technology and driver-assistance systems, including chips and cameras. Volkswagen, Ford, and GM are among its customers. The company has a near-fully autonomous system called SuperVision, and its Chauffeur product is designed to convert a car into a Level 4 self-driven vehicle.\nLast week, the company beat quarterly forecasts and gave an upbeat 2023 revenue projection. CEO Amnon Shashua touted roughly $17 billion worth of bookings that extends through 2030.\n\"We expect SuperVision to be a very large growth driver in 2023 and beyond,\" he told analysts on an earnings call.\nC3.ai\nTicker: AI\nPercent gain: 61%\nC3.ai is an artificial intelligence software suite provider, and has the success of ChatGPT to thank for its recent stock surge. Shares soared roughly 28% on Tuesday alone on news that it would integrate ChatGPT into its product suite.\n\"The C3 Generative AI Product Suite integrates the latest AI capabilities from organizations such as Open AI, Google, and academia, and the most advanced models, such as ChatGPT and GPT-3 into C3 AI's enterprise AI products,\" C3.ai said in a Tuesday press release.\nAlteryx",
      "snippet": "\"We believe <b>Nvidia</b> has in ChatGPT a potentially meaningful compute demand driver,\" Citigroup analysts said recently. The buzz has exploded, and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T20:52:45",
      "provider": {
        "name": "businessinsider",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.insider.com/63d983d9e33c4000193a6c9b?width=1200&format=jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "businessinsider",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://markets.businessinsider.com/news/stocks/chatgpt-openai-artificial-intelligence-stocks-nvidia-mobileye-c3ai-ambarella-alteryx-2023-1"
      }
    },
    {
      "id": "7122195660997406435",
      "title": "Tested: Is Discord really slowing down Nvidia GPUs?",
      "url": "https://www.digitaltrends.com/computing/discord-slowing-down-nvidia-gpus/",
      "description": "If you're using Discord, be aware that a recent update may have impacted the performance of your Nvidia GPU -- but is it a big deal?",
      "body": "Tested: Is Discord really slowing down Nvidia GPUs?\nBy\nJanuary 31, 2023 12:38PM\nShare\nA recent Discord update may have introduced a bug that slows down your Nvidia GPU when you use the popular voice chat app. Not all cards are affected, but it appears that the vast majority of them might be.\nWe tested it ourselves to verify whether there really is a performance drop. Heres what we know, and if you are affected, theres a quick fix that can solve this problem.\nJacob Roach / Digital Trends.\nThe report about this peculiar issue first emerged on the Linus Tech Tips forums. An owner of an RTX 3060 Ti graphics card found that the memory clock of their GPU dropped by 200MHz as soon as Discord was launched, and it stayed at the lowered value until the app was closed.\nAnother user then pitched in and posted on the Nvidia subreddit, reporting that same problem, this time on an RTX 3080. It appears that Nvidias latest and greatest RTX 40-series cards are unaffected right now.\nBoth reports are related to RTX 30-series cards, but we tested this ourselves and found that the issue will likely affect a much larger user base than we initially thought. Even older graphics cards suffer from this problem, and as per the Steam Hardware Survey, those GPUs still make up the majority of the market.\nI tested this myself on my dated GTX 1060. Starting with HWiNFO, I compared the memory clock with and without Discord running in the background. Although the drop was less significant (100MHz instead of 200MHz), it was still there, and the moment I turned Discord off, the clock bounced back to normal.\nI also ran a FurMark benchmark to compare performance with and without Discord. This rig cant score high even on a good day, but within those measly scores, I could see a drop when I ran the benchmark while Discord was on. Without it, the card averages 71 frames per second (fps) and 4,272 points; with Discord, it maxed out at 69 fps and 4,151 points. Its interesting to note that in the benchmark, the memory clock did indeed drop by just over 200MHz.\nBenchmark scores with and without Discord running in the background.\nThe bug likely stems from the most recent Discord update that enabled AV1 streaming in 4K60 for Discord Nitro users. This seems to be limited to RTX 40-series cards, though, so while it enabled one feature for those high-end GPUs, it also seems to have broken something for other users.\nA lot of gamers run Discord in the background, and its no secret that many of Nvidias best GPUs are found in gaming rigs. For some players, this will almost be constant if they use Discord most of the time.\nWith that said, 200MHz worth of memory clock speed is really not that much, especially on high-end GPUs. Seeing a drop by 2 fps is pretty much nothing. You dont have to worry about the performance of your card, at least not unless you want to squeeze every last drop out of it. In games, this wont have any impact whatsoever.\nNvidia was quick to react to the post on Reddit and came up with a temporary fix. If you want to get ahead and sort this problem before Discord and Nvidia roll out proper updates of their own, make sure to check out the official Nvidia help article here.\nToday's tech news, curated and condensed for your inbox\nSubscribe",
      "snippet": "Another user then pitched in and posted on the <b>Nvidia</b> subreddit, reporting that same problem, this time on an RTX 3080. It appears that <b><b>Nvidia</b>s</b> ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T20:38:02",
      "provider": {
        "name": "digitaltrends",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.digitaltrends.com/wp-content/uploads/2022/06/discord-illustration.jpg?resize=1200%2C630&amp;p=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "digitaltrends",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.digitaltrends.com/computing/discord-slowing-down-nvidia-gpus/"
      }
    },
    {
      "id": "7241230488362349426",
      "title": "Discord's Recent Update Hamper Memory Clock on NVIDIA GPUs, Fix On The Way",
      "url": "https://wccftech.com/discords-recent-update-hamper-memory-clock-on-nvidia-gpus-fix-on-the-way/",
      "description": "A glitch has appeared after Discord's recent update, rendering certain NVIDIA graphics cards to have their memory downclocked by 200 MHz.",
      "body": "Jan 31, 2023 03:09 PM EST\n\nCopy Shortlink\nA glitch has appeared after Discord's recent update, rendering certain NVIDIA graphics cards to have their memory downclocked by 200 MHz. NVIDIA is currently working to alleviate the problem, and to see confirm whether the issue was due to the recent enablement of AV1 for NVIDIA GPUs within Discord.\nNVIDIA GPUs Are Having A Bad Day With Discord, Memory Downclocked on Certain Models But Fix Is On The Way\nUsers from the Linus Tech Tips forum and Reddit first discovered the issue, which was immediately brought to the attention of NVIDIA. The company quickly offered a workaround while attempting to fix the problem. The workaround involves downloading the GeForce 3D profile manager to initiate a solution immediately. NVIDIA is reported to send an official fix to users later for users willing to wait for the new software solution.\nto download the NVIDIA program GeForce 3D Profile Manager.\nOpen the GeForce 3D Profile Manager.\nClick on the button Export SLI Profiles.\nA file explorer window will pop up.  Select a location to export and save the NVIDIA Profiles text file.\nOpen the text file saved in step 4 using Notepad (or any program that does not automatically apply to format).\nPerform a search for the section \"Discord\".  Add a new line and type the following text as shown in the screenshot below:\nSetting ID_0x50166c5e = 0x00000000\nSave the edited NVIDIA Profiles as a txt file.\nGo back to the GeForce 3D Profile Manager and click on the Import SLI Profiles button.\nA file explorer window will appear. Select the updated \"NVIDIA Profiles.txt\" file and then click on the Open button.\n10. Once completed, you may close the GeForce 3D Profile Manager application.\nUsers with NVIDIA GeForce RTX 40 series graphics cards are not experiencing the same memory clock slowdowns that are happening to the previous generation's GPUs. The update was intended to offer NVIDIA users to enable AV1 encoding so they could stream at a higher quality on the social community platform. However, the new update is only helpful if you are a Discord Nitro member, which will cost users between $9.99 a month for the premium service that allows the new feature.\nAny Discord users that do not have a Nitro subscription or a graphics card that can decode AV1 codecs will instead see an H.264 pr H.265 stream due to the company utilizing a peer-to-peer streaming capability, and H.264 is still currently widely used above AV1, even with the new codec gaining more ground in adoption on more devices and applications.\nIf you have a compatible NVIDIA GeForce RTX 40 series card with AV1 capability and a premium Discord Nitro account, we recently covered how to access the new ability through Discord in this article. It is recommended that users affected by the new glitch disable the AV1 support on Discord for now and download the GeForce 3D profile manager if they would like to fix the problem sooner or wait until the company has had a chance to upload an official fix for the memory clock slowdown.\nNews Source:",
      "snippet": "... recent update, rendering certain <b>NVIDIA</b> graphics cards to have their ... Discord's recent update, rendering certain <b>NVIDIA</b> graphics cards to have their ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T20:09:09",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2023/01/Discord-slowdown-728x410.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/discords-recent-update-hamper-memory-clock-on-nvidia-gpus-fix-on-the-way/"
      }
    }
  ]
}
