{
  "_type": "news",
  "didUMean": "",
  "totalCount": 103,
  "relatedSearch": [],
  "value": [
    {
      "id": "2520111767443032649",
      "title": "Bengals CB Eli Apple: 'I'll Talk My Biggest Trash' For Whatever Team Wants Me In Free Agency",
      "url": "https://steelersdepot.com/2023/02/bengals-cb-eli-apple-ill-talk-my-biggest-trash-for-whatever-team-wants-me-in-free-agency/",
      "description": "In spite of his relatively successful employment, arguably the two things one is most likely to know about Cincinnati Bengals cornerback Eli Apple is the fact that he was considered a first-round bust, and the fact that he has a big mouth. The former 10th-overall pick has somewhat rehabilitated his image as an NFL player []",
      "body": "Ill leave that chip on my shoulder no matter what\n, Geoff Hobson quotes him as telling reporters recently for the teams website. Ill talk my biggest trash. Whether I back it up or dont, it doesnt matter. Its a game to me. Its something I love to do. No matter what anybody on the outside has to say.\nThere are, of course, a lot more trash talkers out there than were aware of, but many, perhaps most, limit that to the field rather than extending it very visibly to social media. Its notable that Apple has been rather silent since his poor performance against the Kansas City Chiefs and the Bengals loss, depriving of a second straight Super Bowl berth.\nThis isnt his first humbling that hes taken, though, starting with his struggles on the field as a member of the New York Giants, which led to his being traded to the New Orleans Saints during his third season. He had some success there before taking a step backward in Carolina in 2020, released after playing all of two games.\nOne mans misfortune, however, proved to be his opportunity, as the Bengals failed to get prized free agent cornerback Trae Waynes on the field in 2021. That swung the door open for Apple to contribute that season, ultimately starting 15 games in the regular season and throughout the playoffs.\nAs implied in his comments, he is set to be a free agent once again after playing out a one-year, $3.5 million contract. He played under a minimum-salary contract during the 2021 season. After two years of steady starting work, could he finally land a multi-year deal, and with whom? Hed like to be Cincinnati.\nIll definitely come back, he said, to Cincinnati even if he winds up somewhere else. I want to go anywhere Im wanted. No team like [the Bengals]. Cant catch that feel anywhere else. Maybe you could, but I dont know, Ive been a lot of other places. Its rare.\nThe Bengals are his fourth NFL team after flaming out with the Giants, having a moderate turnaround in New Orleans, being a complete disappointment in Carolina, and finally finding relevance, and possibly a home, with the Bengals.\nFor now, he appears to have lost to open his mouth too much on social media. But you know that never lasts very long.\nRelated Items:",
      "snippet": "... things one is most likely to know about Cincinnati Bengals cornerback Eli <b>Apple</b> is the fact that he was considered a first-round bust, and the fact ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T10:40:36",
      "provider": {
        "name": "steelersdepot",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://steelersdepot.com/wp-content/uploads/2022/02/Cooper-Kupp-Eli-Apple.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "steelersdepot",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://steelersdepot.com/2023/02/bengals-cb-eli-apple-ill-talk-my-biggest-trash-for-whatever-team-wants-me-in-free-agency/"
      }
    },
    {
      "id": "5909785115835836863",
      "title": "Giants draft bust, N.J. native Eli Apple plans to keep chirping: Ill talk my biggest trash",
      "url": "https://www.nj.com/giants/2023/02/giants-draft-bust-nj-native-eli-apple-plans-to-keep-chirping-ill-talk-my-biggest-trash.html",
      "description": "Former New York Giants cornerback Eli Apple and the Cincinnati Bengals lost to the Kansas City Chiefs, 23-20, in the AFC Championship Game.",
      "body": "Philadelphia Eagles\non Sunday, Feb. 12 at State Farm Stadium in Glendale, Ariz.\nBut Apple is open to running it back with the Bengals next season. The cornerback just finished his second campaign in Cincinnati and will be a free agent when the new league year begins next month. And a return to the Bengals is a distinct possibility.\nIts a beautiful city. (Cincinnati) is underrated. Ill definitely come back, Apple said of a possible visit. I want to go anywhere Im wanted. No team like (this one). Cant catch that feel anywhere else. Maybe you could, but I dont know, Ive been a lot of other places. Its rare.\nMORE NFL:",
      "snippet": "Former New York Giants cornerback Eli <b>Apple</b> and the Cincinnati Bengals lost to the Kansas City Chiefs, 23-20, in the AFC Championship ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T10:27:46.901",
      "provider": {
        "name": "nj",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nj.com/resizer/3GR4U3o8F733Ry7pzySytnsGKzM=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/TYYQIKCNDFC7TAFX2ZGSCD67CA.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nj",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nj.com/giants/2023/02/giants-draft-bust-nj-native-eli-apple-plans-to-keep-chirping-ill-talk-my-biggest-trash.html"
      }
    },
    {
      "id": "7084144822671111623",
      "title": "iPhone 15 Pro Max, iPhone 16 Ultra will feature periscope camera, Kuo claims",
      "url": "https://www.ibtimes.co.uk/iphone-15-pro-max-iphone-16-ultra-will-feature-periscope-camera-kuo-claims-1712210",
      "description": "Apple analyst Ming-Chi Kuo claims only the iPhone 15 Pro Max (iPhone 15 Ultra) will house a periscope camera when it launches in the second half of the year.",
      "body": "Just days after Apple unveiled the iPhone 14 series at its Far Out event, the rumour mill began churning out speculations surrounding the iPhone 15 series models. Meanwhile, the American tech giant is still mum on its plan to unveil the next-gen iPhones.Still, the word on the street is that Apple is prepping to take the wraps off the iPhone 15 lineup in the second half of this year. If rumours making the rounds online turn out to be true, this will be Apple's first iPhone series to come with a periscope camera.According to reliable Apple analyst Ming-Chi Kuo, the Cupertino-based tech behemoth will bring the periscope lens only to its higher-end iPhone series models. In other words, the periscope lens will be limited only to the top-end models in the iPhone 16 series as well.The iPhone 15 series is expected to comprise four models including the iPhone 15, iPhone 15 Plus, iPhone 15 Pro, and iPhone 15 Pro Max (or iPhone 15 Ultra).iPhone 15 Pro Max (iPhone 15 Ultra) CameraAccording to Kuo, the iPhone 15 Pro Max will be the first smartphone from Apple to feature its periscope camera. So, it looks like the company wants to widen the gap between the iPhone 15 Pro and the iPhone 15 Pro Max models. Nonetheless, this strategy will encourage Apple fans to purchase the more expensive iPhone model.A periscope lens will reportedly support 5x and even 10x optical zoom. The new technology will enable the iPhone 15 Pro Max to support up to 6x optical zoom. Notably, Kuo's latest tweet doesn't align with an earlier report by The Elec, which claims the periscope camera will be available on the iPhone 16 Pro and iPhone 16 Pro Max.A periscope camera uses a technology that involves refracting light onto the lens sensor. This causes magnification. Also, this lens mechanics is built inside the smartphone, unlike the zoom lens for a DSLR, which is built outside. In fact, the modern lenses in smartphones are so compact that they can fit inside a regular lens enclosure without taking up a lot of space.It is worth mentioning that leading smartphone manufacturers including Samsung, OnePlus, and Google have already adopted this technology. To those unaware, Oppo introduced periscope lens technology, which appeared for the first time on the Huawei P30 Pro in 2019.",
      "snippet": "<b>Apple</b> analyst Ming-Chi Kuo claims only the iPhone 15 Pro Max (iPhone 15 Ultra) will house a periscope camera when it launches in the second half of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T10:26:33",
      "provider": {
        "name": "ibtimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://d.ibtimes.co.uk/en/full/1706792/iphone-14-emergency-sos-via-satellite.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "ibtimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.ibtimes.co.uk/iphone-15-pro-max-iphone-16-ultra-will-feature-periscope-camera-kuo-claims-1712210"
      }
    },
    {
      "id": "6148531361390760139",
      "title": "Democratic senator urges Apple, Google to kick TikTok out of app stores",
      "url": "https://news.yahoo.com/democratic-senator-urges-apple-google-100318130.html",
      "description": "TikTok, owned by China's ByteDance, should be removed from app stores run by Apple Inc and Alphabet's Google because the short video social media app poses a...",
      "body": "The Biden administration is considering cutting off Huawei from American suppliers over national security concerns, according to reports.\n2d ago\nWhat we've learned from the latest charges in plot to kill Haitian president\nThe details of the criminal complaint read like a spy thriller.  In total, seven suspects are now in U.S. custody and facing charges related to the July 2021 assassination of Jovenel Mose, including the four arraigned Wednesday: Haitian-American citizens James Solages, Joseph Vincent and Christian Emmanuel Sanon, and Colombian citizen Germn Rivera Garca.\n11h ago\nINSIDER\nThe emergency declaration for COVID-19 will end in May, but Biden's administration told Insider that shouldn't impact his plan to cancel student debt.\n2d ago\nIn 2021 Nikki Haley Said She Would Support Trump If He Ran in 2024\nFormer South Carolina Governor Nikki Haley is set to formally announce her presidential bid two weeks from now, multiple outlets including The Post and Courier, CNN, and Politico reported Tuesday. If no one else jumps into the race before then, she will be the first prominent Republican to challenge former President Donald Trump, who launched his presidential campaign in November. Haley backtracked on how her former bosss campaign plans would affect her own. In a 2021 press conference, she said that she would support Trump if he ran in 2024.\n13h ago\nUSA TODAY Opinion\nOn COVID-19, Sam Harris' fans and Bret Weinsteins fans flooded my Twitter notifications. Even Elon Musk jumped in. This wasn't what I wanted.\n56m ago\nWatch Four Planets Spin Around a Star 130 Light-Years Away\nAstronomical phenomena tend to occur over timespans that dwarf our human scalea galaxy changes over millions and billions of years, not decades. But a new timelapse of observations of a distant star system shows its clockwork motion over just 12 years, packed into only a few seconds.\n18h ago\nLA Times\nOn the first day of Black History month and after right-wing complaints, the College Board issues a watered-down Black studies curriculum. So much the worse for students.\n14h ago\nABC News\nPromised green cards, catfishing, threats: How George Santos' ex-boyfriends say they were left feeling trapped, manipulated\nAs Rep. George Santos continues to face mounting scrutiny over fabricating large swaths of his biography, multiple men have described to ABC News past relationships with the New York congressman -- some allegedly occurring when they were still teenagers -- that they said turned toxic due to a flood of lies that Santos told to try to manipulate and trap them.  The new allegations come as Santos on Tuesday informed his Republican colleagues at a closed-door conference meeting that he would be recusing himself from committee assignments.  Several of the men ABC News spoke with said that they met Santos as young men, when Santos, who later ran for Congress as an openly gay Republican, was several years older than they were.\n2d ago\nRep. Omar and other Democrats have said removing her  and Reps. Adam Schiff and Eric Swalwell  from committees is political payback.\n56m ago\nFeds drop lobbying probe of retired general, lawyer says\nThe Justice Department has dropped its probe of retired four-star Gen. John Allen for his role in an alleged illegal foreign lobbying campaign on behalf of the wealthy Persian Gulf nation of Qatar, his lawyer told The Associated Press.  Attorney David Schertler said in a statement Tuesday that the Justice Department had informed him that it was closing its investigation of Allen and no charges would be filed.  The Justice Department declined to comment but a law enforcement official familiar with the inquiry who wasn't authorized to speak publicly confirmed the decision on condition of anonymity.\n2d ago\nRussian dictator Vladimir Putin knows that the \"window of opportunity\" for Russian troops on the battlefield is closing, so he will exert maximum pressure, former NATO Secretary General Anders Fogh Rasmussen said on Jan. 31, according to Ukrinform news agency.\n1d ago\nCase against ex-detective tossed due to prosecutor's conduct\nA perjury case against a former New York City narcotics detective was thrown out mid-trial Tuesday after prosecutors acknowledged failing to turn over evidence as required to his defense.  The Manhattan District Attorney's office also said it was demoting the prosecutor who handled the case, which had accused ex-detective Joseph Franco of lying about witnessing drug deals.  Because of the charges, hundreds of drug cases he'd worked were dismissed in the last few years because prosecutors disavowed them.\n2d ago\nThough Dollar Tree no longer sells all of its items for just $1, the discount store still offers remarkably good deals on items you might need in between a major shopping trip -- from food and...\n20h ago\nYahoo Finance Video\nRedfin CEO Glenn Kelman discusses agents using ChatGPT and says the technology will \"change online marketing.\" You can see the full interview here. Key video highlights 00:00 On use of ChatGPT 00:18 On the change to online marketing\n2d ago\nTesla Is Closing in on Mexico\nTesla is considering construction of an assembly plant north of Mexico City, just a couple of miles away from the capitals newest airport. The new Tesla plant could be a major export hub for the American EV maker, whose Model 3 and Model Y top the list of domestically-produced vehicles in the U.S.\n19h ago\nRetiring early seems to be on everyone's minds these days. The growing popularity of the so-called FIRE movement -- short for financial independence, retire early -- is a testament to how much...\n18h ago\n7 Ways to Make Money Daily With Investments\nIf you put your money to work by investing, you can profit daily from passive investments. Passive income-generating investments that don't require your active involvement include exchange-traded funds, individual stocks and bonds and real estate investment trusts. You can accumulate  Continue reading  The post 7 Ways to Make Money Daily With Investments appeared first on SmartAsset Blog.\n21h ago\nCanadian lawmakers back resettlement of 10,000 Uyghur Muslims\nOTTAWA (Reuters) -The Canadian parliament on Wednesday unanimously voted in favor of a non-binding proposal for the resettlement of 10,000 Uyghur Muslim refugees from China's Xinjiang region into Canada over two years.  The House of Commons voted 322-0 for Liberal member of parliament Sameer Zuberi's bill, which also called on the government to recognize that Uyghurs and other ethnic Turkic Muslims who have fled to third countries face \"pressure and intimidation\" by China to return.\n12h ago",
      "snippet": "... owned by China's ByteDance, should be removed from app stores run by <b>Apple</b> Inc and Alphabet's Google because the short video social media app poses ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T10:03:18",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.zenfs.com/en/reuters.com/854b73b0acc162d977f377e56e2b78ea",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://news.yahoo.com/democratic-senator-urges-apple-google-100318130.html"
      }
    },
    {
      "id": "3987182939726308393",
      "title": "Watch Out Managers, Job Cuts Are Coming for You Next",
      "url": "https://www.businessinsider.com/managers-job-cuts-are-coming-layoffs-tech-2023-2",
      "description": "Companies like Meta and FedEx are giving managers the ax. Meanwhile, Intel, Apple, and Goldman Sachs are docking higher-ups' pay.",
      "body": "Access your favorite topics in a personalized feed while you're on the go.\ndownload the app\nEmail address\nBy clicking Sign up, you agree to receive marketing emails from Insider                                  as well as other partner offers and accept our                                  Terms of Service and                                  Privacy Policy.\nManagers, beware: Layoffs have depleted your roster of reports, and they're probably coming for you next.\nFedEx says it is giving pink slips to more than 10% of its directors and officers as part of an ongoing cost-cutting measure. For his part, Meta CEO Mark Zuckerberg is pushing back against the endless loop of\n\"managers managing managers.\"\n\n\"Our management theme for 2023 is the 'year of efficiency,' and we're focused on becoming a stronger and more nimble organization,\" Zuckerberg said Wednesday in Meta's fourth-quarter earnings release. \"Next we're working on flattening our org structure and removing some layers of middle management to make decisions faster.\"\nMeanwhile, Intel is trimming pay for higher-ups, including CEO Pat Gelsinger, following similar reductions in compensation for Apple CEO Tim Cook and Goldman Sachs chief David Solomon.\nCompanies might be targeting managers for layoffs for a few reasons.\nCompanies in industries like tech that saw record profits during the pandemic aggressively bulked up staff. But new workers need managers  and those managers then get their own managers, and so on, ad infinitum.\nBut the companies that overhired now find themselves in a different economic situation than the one they prepared for. With the economic tides turning and investors applying pressure to get lean, companies may start to zero in on management bloat. With thousands of workers hit by layoffs in recent weeks, it might just make sense to companies to ax a manager who suddenly has far fewer reports to manage.\nFewer managers also means less overhead. Cutting a few links from the chain of command also means fewer rounds of approval to get tangled up in before getting a project up and running. In this economy, companies can't afford to move slowly; going \"extremely hardcore,\" as Elon Musk has demanded of Twitter workers who survived layoffs, is a guiding mantra.\nOne program manager who left Meta in September 2022 after 18 months told Insider he resigned because he was stifled by all the \"managers managing managers.\"\nAbove him, he said there was a manager, a senior manager, a department head, a director, a vice president, a chief business officer, and finally, the chief operating officer.\nHe said the primary goal of his department was \"empire-building,\" which meant driving up headcount as much as possible. He added that he probably worked just four hours a week in the role.\n\"There was almost this unwritten rule that you didn't ask for more work,\" he said. \"Managers realize that they're not really doing anything of import, and when you have someone that makes noise, I think that attracts unwanted attention.\"\nHe added, \"I've never been in an organization where it's so hard to take responsibility.\"\nSo what does this mean for managers now?\nZuckerberg summed it up pretty well for many CEOs during Meta's earnings call Wednesday: \"We closed last year with some difficult layoffs and when we did this, I said clearly that this was the beginning of our focus on efficiency and not the end.\"\nSign up for notifications from Insider! Stay up to date with what you want to know.\nSubscribe to push notifications",
      "snippet": "Meanwhile, Intel, <b>Apple</b>, and Goldman Sachs are docking higher-ups' pay. Access your favorite topics in a personalized feed while you're on the go.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T10:00:00",
      "provider": {
        "name": "businessinsider",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.insider.com/636e7a40f5877200181c7ad8?width=1200&format=jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "businessinsider",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.businessinsider.com/managers-job-cuts-are-coming-layoffs-tech-2023-2"
      }
    },
    {
      "id": "2209230091568244339",
      "title": "Watch out managers, the job cuts are coming for you next",
      "url": "https://finance.yahoo.com/news/watch-managers-job-cuts-coming-100000474.html",
      "description": "Companies like Meta and FedEx are giving managers the ax. Meanwhile, Intel, Apple, and Goldman Sachs are docking higher-ups' pay.",
      "body": "February 2, 2023, 4:00 AM\n\n3 min read\nLayoffs and executive pay reductions at companies like Meta, Intel, and FedEx suggest managers may be next to go after thousands of workers were laid off.\nsimplehappyart/Getty Images\nThousands of workers have already gotten pink slips this year, and it looks like managers will be next.\nCompanies like Meta and FedEx are paring back managerial jobs, and others like Intel are cutting pay.\nManagers may be an easy target as companies correct course after overhiring during the past few years.\nManagers, beware: Layoffs have depleted your roster of reports, and they're probably coming for you next.\nFedEx says it is giving pink slips to more than 10% of its directors and officers as part of an ongoing cost-cutting measure. For his part, Meta CEO Mark Zuckerberg is pushing back against the endless loop of\n\"managers managing managers.\"\n\"Our management theme for 2023 is the 'year of efficiency,' and we're focused on becoming a stronger and more nimble organization,\" Zuckerberg said Wednesday in Meta's fourth-quarter earnings release. \"Next we're working on flattening our org structure and removing some layers of middle management to make decisions faster.\"\nMeanwhile, Intel is trimming pay for higher-ups, including CEO Pat Gelsinger, following similar reductions in compensation for Apple CEO Tim Cook and Goldman Sachs chief David Solomon.\nCompanies might be targeting managers for layoffs for a few reasons.\nCompanies in industries like tech that saw record profits during the pandemic aggressively bulked up staff. But new workers need managers  and those managers then get their own managers, and so on, ad infinitum.\nBut the companies that overhired now find themselves in a different economic situation than the one they prepared for. With the economic tides turning and investors applying pressure to get lean, companies may start to zero in on management bloat. With thousands of workers hit by layoffs in recent weeks, it might just make sense to companies to ax a manager who suddenly has far fewer reports to manage.\nFewer managers also means less overhead. Cutting a few links from the chain of command also means fewer rounds of approval to get tangled up in before getting a project up and running. In this economy, companies can't afford to move slowly; going \"extremely hardcore,\" as Elon Musk has demanded of Twitter workers who survived layoffs, is a guiding mantra.\nStory continues\nOne program manager who left Meta in September 2022 after 18 months told Insider he resigned because he was stifled by all the \"managers managing managers.\"\nAbove him, he said there was a manager, a senior manager, a department head, a director, a vice president, a chief business officer, and finally, the chief operating officer.\nHe said the primary goal of his department was \"empire-building,\" which meant driving up headcount as much as possible. He added that he probably worked just four hours a week in the role.\n\"There was almost this unwritten rule that you didn't ask for more work,\" he said. \"Managers realize that they're not really doing anything of import, and when you have someone that makes noise, I think that attracts unwanted attention.\"\nHe added, \"I've never been in an organization where it's so hard to take responsibility.\"\nSo what does this mean for managers now?\nZuckerberg summed it up pretty well for many CEOs during Meta's earnings call Wednesday: \"We closed last year with some difficult layoffs and when we did this, I said clearly that this was the beginning of our focus on efficiency and not the end.\"\nRead the original article on",
      "snippet": "Meanwhile, Intel, <b>Apple</b>, and Goldman Sachs are docking higher-ups' pay. February 2, 2023, 4:00 AM 3 min read Layoffs and executive pay reductions at ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T10:00:00",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/ny/api/res/1.2/bDBVNj2ac6fDp68IPVSd0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/business_insider_articles_888/09d89f59631e4be3ebb40ff1f9e96256",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://finance.yahoo.com/news/watch-managers-job-cuts-coming-100000474.html"
      }
    },
    {
      "id": "6629413458680727035",
      "title": "Apple Preparing iOS 16.3.1 Update for iPhone as Wait for iOS 16.4 Beta Continues",
      "url": "https://www.macrumors.com/2023/02/02/apple-preparing-ios-16-3-1/",
      "description": "Apple appears to be preparing an iOS 16.3.1 update for the iPhone, based on evidence of the software in our website's analytics logs this week....",
      "body": "Joe Rossignol\nApple appears to be preparing an iOS 16.3.1 update for the iPhone, based on evidence of the software in our website's analytics logs this week. It's unclear when the update will be released, but it will likely be available at some point in February.\nThe same logs have accurately foreshadowed the release of several previous updates, including iOS 16.0.3 and iOS 16.1.1 most recently, so they have proven to be a reliable indicator of Apple's upcoming software releases. Minor updates like iOS 16.3.1 are typically focused on bug fixes, stability improvements, and security patches.\nIn the meantime, the wait continues for the first beta of iOS 16.4, which will likely be a more significant update with some new features. Previously-announced iOS features that have still yet to launch include Apple Pay Later for financing purchases, an Apple Card savings account option for Daily Cash, opt-in web push notifications via Safari, and more, but it's unclear if any of these features will be included in iOS 16.4.\nApple released iOS 16.3 in late January with support for physical security keys as a two-factor authentication option for Apple ID accounts, worldwide availability of Advanced Data Protection for expanded iCloud encryption, a new Black Unity wallpaper in celebration of Black History Month, Emergency SOS tweaks, and second-generation HomePod support.\nEvidence of both iOS 16.4 and iOS 17 have also shown up in our website's analytics logs in recent weeks, as Apple employees test the updates internally. iOS 17 is expected to be announced at Apple's annual developers conference WWDC in June.\nRelated Roundups: iOS 16,",
      "snippet": "<b>Apple</b> appears to be preparing an iOS 16.3.1 ... our website's analytics logs this week. Joe Rossignol <b>Apple</b> appears to be preparing an iOS 16.3.1 update ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:41:32",
      "provider": {
        "name": "macrumors",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.macrumors.com/t/I6nGfzeMmayDMMecSVWCQSUpLWQ=/2500x/article-new/2023/02/iOS-16.3.1-Public-Beta-Feature.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "macrumors",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.macrumors.com/2023/02/02/apple-preparing-ios-16-3-1/"
      }
    },
    {
      "id": "8768017235238611533",
      "title": "Earnings Tracker: Meta Gets a Like From Investors; Apple and Amazon Still Ahead",
      "url": "https://www.wsj.com/livecoverage/stock-market-news-today-02-02-2023/card/earnings-tracker-meta-gets-a-like-from-investors-apple-and-amazon-still-ahead-CMpJPMevbsmpXKgMp1LU",
      "description": "The busiest week of earnings season rumbles on, with Apple, Amazon and Google parent company Alphabet all due to report after the close Thursday.Here are some takeaways from this week's slew of results:In tech:Meta Platforms [gave an upbeat outlook](https://www.wsj.com/arti",
      "body": "News Corp is a global, diversified media and information services company focused on creating and distributing authoritative and engaging content and other products and services.\nDow Jones",
      "snippet": "The busiest week of earnings season rumbles on, with <b>Apple</b>, Amazon and Google parent company Alphabet all due to report after the close Thursday.Here ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:41:19.497",
      "provider": {
        "name": "wsj",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.wsj.net/im-589547/social",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wsj",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wsj.com/livecoverage/stock-market-news-today-02-02-2023/card/earnings-tracker-meta-gets-a-like-from-investors-apple-and-amazon-still-ahead-CMpJPMevbsmpXKgMp1LU"
      }
    },
    {
      "id": "1059550197868696302",
      "title": "Samsung Galaxy S23+ vs. iPhone 14 Plus: How Do They Compare?",
      "url": "https://pocketnow.com/samsung-galaxy-s23-vs-iphone-14-plus/",
      "description": "Samsung's Galaxy S23+ now has a direct competitor in the Apple iPhone 14 Plus, but which of the two comes out on top?",
      "body": "Battery\nThe Galaxy S23+ Is a Few Steps Ahead\nThe Samsung Galaxy S23+ joins the smartphone fray in 2023 with a redesigned back panel and flagship-grade specifications. Until recently, the Plus models from Samsung didn't have any direct competition from Apple, but the launch of the iPhone 14 Plus in September 2022, now leaves an option available for interested buyers.\nHere we compare the two large phones to see how they stack up against each other and which one you should consider.\nPrice\nThe Galaxy S23+ and iPhone 14 Plus are both devices whose retail prices hover around the $1000 mark. The iPhone 14 Plus starts at $899 and goes up to $1,099, while the Galaxy S23+ starts at $999.99 and offers a second variant that costs $1,119.99. While it may seem the devices trade blow for blow in terms of price, when it comes to the value on offer, the Galaxy S23+ outdoes the iPhone, particularly with its display.\nVariant\n$1,099 (512GB)\nDesign\nOn a scale of one to ten, if you'd ask us to rate how similar the designs on these devices are, we'd answer with seven. Both phones feature flat displays and flat glass back panels but differ when it comes to frame design. The Galaxy S23+ is slightly rounded on all sides while the iPhone 14 Plus is more squared-off. It also weighs about five grams lesser than the iPhone.\nThe Galaxy S23+ comes with the advantage of having a matte finish on its back glass  which uses Gorilla Glass Victus 2  which allows it to remain fingerprint-free most of the time, though the frame can become a little greasy. The device also drops the conventional camera module design we've seen in the past for a more minimalistic one, with only the lenses protruding out the back of the device.\nAs for iPhone 14 Plus, the device looks near-identical to the iPhone 13 and iPhone 14, bar the increase in size. Also, the matte aluminum rails and glossy back glass finish are here for another year running. Of the two devices, it's likely the Galaxy S23+ will feel more comfortable in your hands due to the subtle curves on its frame and lighter weight, though it can even come down to personal preference.\nDisplay\nSource: Pocketnow / Adam Z. Lein\nThe Galaxy S23+ ships with a 6.6-inch FHD+ display that uses Samsung's Dynamic AMOLED 2X panel. It has an adaptive refresh rate (48Hz ~120Hz) and seamlessly transitions within its range based on the display content. While Samsung doesn't publish any numbers for typical use, it does state that high brightness mode will push the display to output 1200 nits (HDR content will also match this number), and outdoor use can enable a peak of 1750 nits.\nOn the iPhone 14 Plus, you will find a slightly larger 6.7-inch panel, using Super Retina XDR technology with a resolution that's slightly above FHD+. While the display doesn't fall behind in terms of quality, when it comes to features, it does lag behind the Galaxy S23+. The panel has a max refresh rate of 60Hz and typical brightness hits a max of 800 nits, with HDR content pushing the panel to 1200 nits. Also, there isn't even an outdoor mode as seen on the S23+ and even the iPhone 14 Pro.\nProcessor, RAM, and Storage\nSource: Qualcomm\nThe Galaxy S23+ ships with a custom Qualcomm Snapdragon 8 Gen 2 processor with CPU and GPU cores clocked higher than the standard variant. Regardless, it is the latest available option from Qualcomm and comes up with a 4nm fabrication process, promising better performance and efficiency.\nOn the other hand, the iPhone 14 Plus ships with the A15 Bionic (with more GPU cores) from 2021. Although it is the upgraded variant, the processor is still over a year old and will fall short of the Snapdragon in synthetic benchmarks.\nBut when it comes to day-to-day use, if you're planning on just hopping between multiple apps or even rendering videos within mobile editing apps, it's likely that you will not see any significant difference in performance. Though if you plan on capturing a lot of images or playing newly developed games, the processing capabilities of the Snapdragon will have a positive impact on the image quality and in-game rendering.\nAs for RAM and storage options, the Galaxy S23+ has two storage options  256GB and 512GB  with 8GB of RAM. The iPhone 14 Plus offers three options, 128GB, 256GB, and 512GB, all with 6GB of RAM.\nCamera\nWhile we wait for reviews to arrive and detail the nitty gritty aspects of the camera performance on Galaxy S23+, we can briefly look at how the hardware differs between the two phones.\nThe Galaxy S23+ has a triple camera system on its back, headlined by a 50-megapixel wide sensor and supported by a 12-megapixel ultrawide plus 10-megapixel telephoto. There's also a new 12-megapixel shooter on the front. As for the iPhone 14 Plus, the device features a dual camera system, which uses 12-megapixel wide and 12-megapixel ultrawide cameras. Here too, you'll see a 12-megapixel shooter on the front. In the table below, we've detailed the aperture that each of these lenses uses.\nCamera\nf/2.4\n-\nOf the two devices, it's evident that the Galaxy S23+ is more versatile with its additional telephoto lens. So, if you're planning on taking creatively-focused photos where quick captures aren't necessary, the S23+ will provide you with more options. Though if you want to quickly capture photos and move to the next subject, the faster shutter speed on the iPhone can be a point to consider.\nBattery\nWhen it comes to endurance, despite its smaller battery sizes, the iPhone has proven itself to be a device that's tough to outlast. And although the Galaxy S23+ has a larger 4,700 mAh cell, we anticipate it will fall short of the backup provided by the iPhone's 4,323 mAh cell. Factors like the brighter display, higher refresh rate, and more powerful processor on the Galaxy S23+ are bound to contribute to this result.\nBut while we expect the Galaxy S23+ to fall behind the iPhone in terms of endurance, it doesn't lose out when it comes to charging, even if it has a larger cell. The Galaxy S23+ supports input from a 45W charger that will have it go from 0 to 50% in 30 minutes. The iPhone 14 Plus offers a similar claim with its smaller cell.\nWireless charging technology on the Galaxy S23+ is also a step above. It can accept inputs of up to 15W from any Qi-certified charger and charge other devices with a 4.5W output via Wireless Powershare.\nOn iPhone, a Qi-certified charger can only provide 7.5W of power, and to accept 15W, you will need to shell out extra money for a MagSafe-compatible wireless charger. There isn't any support for using reverse wireless charging to power other phones on iPhone.\nThe Galaxy S23+ Is a Few Steps Ahead\nOverall, when we look at the two phones on paper, the Galaxy S23+, with its better display, versatile camera, and powerful processor, puts itself ahead of the iPhone 14 Plus. If we choose to leave out subjective aspects like the ecosystem these devices work with, and if you're a buyer who prefers having the best available hardware for the cost, Samsung is the device to consider between these two",
      "snippet": "Samsung's Galaxy S23+ now has a direct competitor in the <b>Apple</b> iPhone 14 Plus, but which of the two comes out on top?. Battery The Galaxy S23+ Is a ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T09:01:16",
      "provider": {
        "name": "pocketnow",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static1.pocketnowimages.com/wordpress/wp-content/uploads/2023/02/galaxy-s23-vs-iphone-14-plus-featured-image.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pocketnow",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://pocketnow.com/samsung-galaxy-s23-vs-iphone-14-plus/"
      }
    },
    {
      "id": "3313928849867806084",
      "title": "ams OSRAM stands to benefit from Apple adopting micro LED",
      "url": "https://evertiq.com/news/53241",
      "description": "According to TrendForce, Apple is expected to adopt Micro LED for its consumer electronic products in the close future.",
      "body": "February 02, 2023\nams OSRAM stands to benefit from Apple adopting micro LED\nAccording to TrendForce, Apple is expected to adopt Micro LED for its consumer electronic products in the close future.\nThe Apple Watch will likely be the first among Apples products to feature a Micro LED display, and the adoption is anticipated to occur in 2024. Then, during the period from 2026 to 2030, the application scope of Micro LED could expand to encompass AR headset displays, smartphone displays, automotive displays, etc.\nThe Apple Watch as a product line was launched in 2015 and has been in the market for more than eight years. The Apple Watch Ultra, as the latest model was released near the end of 2022 and offers improvements to display specifications. Apple enlarged the display size to 1.93 inches and raised the display brightness level to 2,000 nits. These upgrades indicate that smartwatch brands continue to seek a larger and sharper display that can show texts clearly in an outdoor setting. TrendForce believes Apple will make a breakthrough for its smartwatch in 2024 by incorporating Micro LED. With this technology, the display of the Apple Watch could exceed 2 inches and achieve an even higher contrast level. Such improvements would satisfy the viewing needs of professionals and enthusiasts of various outdoor sporting activities.\nApple watch will facilitate the entry of micro-LED displays into the market for mainstream consumer electronics\nTrendForce points out that Apple has always been careful about adopting new technology, and its process for evaluating new technology is very lengthy. On the other hand, once Apple has decided to use a particular technology, the company usually tries to apply it across different product lines. Take OLED display as an example. Besides being incorporated into the Apple Watch and the iPhone, OLED display is expected to be featured in the iPad models for 2024 and the MacBook models for the 2025~2026 period. With the penetration of OLED among Apples products serving as the prime case study, TrendForce believes Apple will begin the gradual introduction of Micro LED starting in 2024.\nWhether Micro LED is incorporated into smartwatches, AR headsets, or smartphones, two major factors will determine the market competitiveness of this technology. The first factor involves lowering the costs of Micro LED chips. A notable solution to make the production of Micro LED chips much more economical is to enlarge the wafers that they are made from. Currently, the production lines for the mainstream Micro LED chips take in 6-inch wafers. Switching to 8-inch wafers will certainly result in a considerable cost reduction. The second factor is about flexibility. Micro LED has to work with different types of backplanes that contain glass, CMOS, etc. A reliable semiconductor manufacturing process is needed to serve as the basis for scaling up production. Such a process is also critical for the provisioning of a total solution (i.e., from chip production to mass transfer, inspection, and repair).\nAmong suppliers for LED chips, ams OSRAM has formed the tightest collaborative relationship with Apple in the field of Micro LED at this moment because it has advantages in addressing the two aforementioned factors. In the future, ams OSRAM will very likely become Apples key partner in supplying the Micro LED components that are embedded in next-generation displays.\nMicro LED remains Apples first choice in the selection of future display technologies\nLooking at the new kinds of display technologies that have emerged lately, Micro OLED and Micro LED are ones capable of meeting the demand for a high number of pixels per inch (PPI). However, Micro OLED cannot reach the higher level of brightness that Micro LED can achieve due to some inherent material-related limitations. Currently, there is a market rumour saying that Apple will be unveiling a headset device featuring a Micro OLED display this year. Nevertheless, in the development of AR headsets over the medium to long term, TrendForce believes building a headset with a completely transparent display will require optical waveguide technology. However, incorporating an optical waveguide will reduce the original brightness of a display by as much as 99%. Therefore, Micro LED with its huge brightness advantage can provide sufficient leeway to compensate for this massive loss of brightness. If Apple wants to release an AR headset or a pair of AR glasses that features a completely transparent display in the future, then Micro LED is most likely its first choice for the display technology.\nTurning to the smartphone market, most brands in the Android camp have made foldable OLED displays a main design feature for their upcoming flagship models. However, Apple as the second-largest smartphone brand has yet to enter the much-discussed market segment for foldable OLED models. TrendForce believes a possible reason as to why Apple is slow to enter this segment is its focus on Micro LED. In addition to rigid backplanes that have glass and CMOS, Micro LED is also highly suitable for flexible backplanes made of PI or other kinds of materials with similar attributes. And by adopting Micro LED, Apple may be able to make iPhone displays foldable, rollable, and even stretchable in the future. Hence, Micro LED has the potential to be the key technology that Apple will use to realise game-changing product innovations and thereby get further ahead of other brands in the market competition.\nFor more information visit TrendForce.\nAd",
      "snippet": "According to TrendForce, <b>Apple</b> is expected to ... stands to benefit from <b>Apple</b> adopting micro LED According to TrendForce, <b>Apple</b> is expected to adopt ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:57:00",
      "provider": {
        "name": "evertiq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://evertiq.com/th/c738x300nimgproductionams-OSRAM_engineers.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "evertiq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://evertiq.com/news/53241"
      }
    },
    {
      "id": "4392457034302196065",
      "title": "iPhone 16 Pro Max may house a periscope camera",
      "url": "https://timesofindia.indiatimes.com/gadgets-news/iphone-16-pro-max-may-house-a-periscope-camera/articleshow/97548619.cms",
      "description": "Apple is reportedly planning on including a new periscope camera in iPhone 16 Pro Max. This lens will allow users to take photos and videos from a muc",
      "body": "is reportedly planning on including a new\nperiscope\ncamera in\niPhone\n16 Pro Max. This lens will allow users to take photos and videos from a much wider angle than ever before. However, it appears that Apple may be limiting the use of this lens to the\niPhone 16 Pro Max\nonly.\nIf rumours are to be believed, Apple may limit the periscope lens technology to the Pro models due to the space that the hardware requires. Similarly, analyst\nMing-Chi Kuo\ntook to Twitter where he mentioned that periscope lens technology will be exclusively seen in the rumoured iPhone 16\nPro Max\nmodel.\n(4/5)As previously predicted, the highest-end model of the 2H23 new iPhone 15 model (15 Pro Max or 15 Ultra) will https://t.co/J8AgZMY5UD\n1675185037000\nKuo tweeted: \"My latest survey indicates only one/highest-end new iPhone 16 model in 2H24 will have the periscope camera, not the two models the market expected.\n\"Therefore, the contribution of the periscope camera to the demand for lens upgrades may be lower than the market consensus.\"\nRead Also\nApple might be looking to promote the iPhone 15 device as the finest of everything. This might be the cause of such a big price hike. The smartphone is also likely to have a premium titanium body, more RAM and a quicker CPU. The titanium body will not only offer a premium look to the iPhone 15 Ultra\nKuo's information contradicts a recent report from The Elec, which mentioned that \"Folded Zoom\" periscope lens would be available in both the iPhone 16 Pro and the iPhone 16 Pro Max next year.\nThe analyst also mentioned that previously it was predicted that the iPhone 15 Pro Max \"will adopt the periscope camera\".\n\"The market expected that adding periscope cameras to more iPhone models would drive demand for lens upgrades in 2023-2024,\" Kuo added.\nWhat is a periscope lens?\nPeriscope lens allows the light to reflect through an angled mirror towards the image sensor located in the camera. The directional shift allows for a \"folded\" telephoto lens system for improved optical zoom capabilities without the blurriness that comes with digital zoom.\nHowever, the Periscope lens technology is already used by smartphone manufacturers like Samsung. Meanwhile, the iPhone 15 Pro Max is likely to offer up to 6x optical zoom, an improvement over the current 3x optical zoom in the iPhone 14 Pro models.\nFor the last few years, the Pro and Pro Max\niPhones\nhave offered similar features, and battery life has been the main distinguishing feature between the devices aside from display size.\nLimiting periscope zoom technology to the Pro Max will likely frustrate those who like to have the latest technology but who do not care for the larger 6.7-inch size.\nIt remains to be seen if Apple will change their mind and make this lens available on other iPhones as well.\nAlso watch:",
      "snippet": "<b>Apple</b> is reportedly planning on including a new periscope camera in iPhone 16 Pro Max. This lens will allow users to take photos and videos from a ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:47:00",
      "provider": {
        "name": "indiatimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-97548577/97548577.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indiatimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://timesofindia.indiatimes.com/gadgets-news/iphone-16-pro-max-may-house-a-periscope-camera/articleshow/97548619.cms"
      }
    },
    {
      "id": "2429989285771987523",
      "title": "Apple May Launch New Watch Ultra With Larger 2.1-Inch Display in 2024",
      "url": "https://www.latestly.com/technology/apple-may-launch-new-watch-ultra-with-larger-2-1-inch-display-in-2024-4787817.html",
      "description": "Apple will reportedly launch a new 'Apple Watch Ultra' with a larger 2.1-inch display next year, the media reported.",
      "body": "San Francisco, February 2 :Apple will reportedly launch a new 'Apple Watch Ultra' with a larger 2.1-inch display next year, the media reported. This lines up with the information that Haitong International Securities analyst Jeff Pu had shared last month, reports MacRumors.Samsung Galaxy S23 Ultra, Samsung Galaxy S23 Plus and Samsung Galaxy S23: Price in India and Specification of Samsung Galaxy S23 Series. The current Watch Ultra features around a 1.93-inch screen, therefore, the 2024 model is likely to have nearly a 10 per cent larger display. The new wearable is expected to become the first Apple Watch with over a 50mm case size. The new Ultra is also likely to feature microLED display technology, which will offer higher brightness, decreased power consumption and improved contrast ratio as compared to the current models with OLED displays.iPhone 14 Crash Detection Feature Alerts Police Instantly, Offering Immediate Help for Accident Victims in Australia. The iPhone maker's transition to the technology might take many years to be completed as the microLED display production costs are currently high, the report said. Last month, Pu had also said that he expects Apple Watch sales to drop in 2023 due to &quot;lack of significant spec upgrade&quot;.",
      "snippet": "<b>Apple</b> will reportedly launch a new '<b>Apple</b> Watch Ultra' with ... Francisco, February 2 :<b>Apple</b> will reportedly launch a new '<b>Apple</b> Watch Ultra' with a ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:28:05",
      "provider": {
        "name": "latestly",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://st1.latestly.com/wp-content/uploads/2022/09/67-1-3.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "latestly",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.latestly.com/technology/apple-may-launch-new-watch-ultra-with-larger-2-1-inch-display-in-2024-4787817.html"
      }
    },
    {
      "id": "113569629677651560",
      "title": "Apple Amazon And 5 Stocks To Watch Heading Into Thursday",
      "url": "https://www.benzinga.com/news/earnings/23/02/30682840/apple-amazon-and-5-stocks-to-watch-heading-into-thursday",
      "description": "With US stock futures trading mixed this morning on Thursday, some of the stocks that may grab investor focus today are as follows:",
      "body": "Alphabet Inc.\nGOOGL\nto post quarterly earnings at $1.19 per share on revenue of $76.64 billion after the closing bell. Alphabet shares gained 4% to $104.40 in after-hours trading.\nMeta Platforms, Inc.\nMETA\nreported better-than-expected sales for its fourth quarter and announced a $40 billion increase in its buyback authorization. Meta shares jumped 19.7% to $183.32 in the after-hours trading session.\nAnalysts are expecting\nFord Motor Company\nF\nto have earned $0.62 per share on revenue of $40.69 billion for the latest quarter. The company will release earnings after the markets close. Ford shares gained 1.1% to $13.94 in after-hours trading.\nCheck out our  premarket coverage here\nC.H. Robinson Worldwide, Inc.\nCHRW\nposted weaker-than-expected results for its fourth quarter. C.H. Robinson shares dropped 4.9% to $97.15 in the after-hours trading session.\nAnalysts expect\nAmazon.com, Inc.\nAMZN\nto post quarterly earnings at $0.17 per share on revenue of $145.53 billion after the closing bell. Amazon shares rose 4.1% to $109.50 in after-hours trading.\nAfter the markets close,\nApple Inc.\nAAPL\nis expected to report quarterly earnings at $1.94 per share on revenue of $121.20 billion. Apple shares gained 0.4% to $146.07 in after-hours trading.\nAnalysts expect",
      "snippet": "After the markets close, <b>Apple</b> Inc. AAPL is expected to report quarterly earnings at $1.94 per share on revenue of $121.20 billion.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:24:24",
      "provider": {
        "name": "benzinga",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.benzinga.com/files/images/story/2023/02/02/image-apple-logo.jpg?width=1200&amp;height=800&amp;fit=crop",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "benzinga",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.benzinga.com/news/earnings/23/02/30682840/apple-amazon-and-5-stocks-to-watch-heading-into-thursday"
      }
    },
    {
      "id": "4201190784356985297",
      "title": "Apple may launch Watch Ultra with 2.1-inch display in 2024",
      "url": "https://telanganatoday.com/apple-may-launch-watch-ultra-with-2-1-inch-display-in-2024",
      "description": "This lines up with the information that Haitong International Securities analyst Jeff Pu had shared last month, reports MacRumors.",
      "body": "San Francisco:Apple will reportedly launch a new 'Apple Watch Ultra' with a larger 2.1-inch display next year, the media reported.\r\n\r\nThis lines up with the information that Haitong International Securities analyst Jeff Pu had shared last month, reports MacRumors.\r\n\r\nThe current Watch Ultra features around a 1.93-inch screen, therefore, the 2024 model is likely to have nearly a 10 per cent larger display.\r\n\r\nThe new wearable is expected to become the first Apple Watch with over a 50mm case size.\r\n\r\nThe new Ultra is also likely to feature microLED display technology, which will offer higher brightness, decreased power consumption and improved contrast ratio as compared to the current models with OLED displays.\r\n\r\nThe iPhone maker's transition to the technology might take many years to be completed as the microLED display production costs are currently high, the report said.\r\n\r\nLast month, Pu had also said that he expects Apple Watch sales to drop in 2023 due to \"lack of significant spec upgrade\".",
      "snippet": "San Francisco:<b>Apple</b> will reportedly launch a new '<b>Apple</b> Watch Ultra' with a larger 2.1-inch display next year, the media reported. This lines up with ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:15:33",
      "provider": {
        "name": "telanganatoday",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.telanganatoday.com/wp-content/uploads/2023/02/Apple-may-launch-Watch-Ultra-with-2.1-inch-display-in-2024.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "telanganatoday",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://telanganatoday.com/apple-may-launch-watch-ultra-with-2-1-inch-display-in-2024"
      }
    },
    {
      "id": "7301671165389838851",
      "title": "Biden: Apple Google's app stores are anticompetitive",
      "url": "https://fortune.com/2023/02/02/apple-google-app-store-elon-musk-secret-30-percent-tax-everything-commerce-dept-anticompetitive/",
      "description": "Musk complains about Apple's \"secret 30% tax on anything.\" The Commerce Dept. agrees.",
      "body": "February 2, 2023, 7:46 AM UTC\nThe U.S. Department of Commerce released a report on Wednesday examining Apple and Google's app store model.\nKevin DietschGetty Images\nOn Wednesday, the Biden administration argued that Apple and Googles app store model, including how it forces developers to give a 30% cut on any in-app purchases, hurts users and developers.\nThis put the White House on the same side as tech CEOs including Mark Zuckerberg, Tim Sweeney and even Elon Musk, who called Apples cut a secret 30% tax on everything you buy through their App Store amid his spat with Apple CEO Tim Cook late last year. The new report released by the U.S. Department of Commerce revealed that Musks complaints were already resonating in Washington.\nApple and Google have a significant gatekeeping role by controlling (and restricting) how apps are distributed, the report said, creating a model that fosters conditions of competition that are suboptimal.\nThe report added that the policies put in place by Apple and Google have created unnecessary barriers and costs for app developers, ranging from fees for access to functional restrictions that favor some apps over others.\nThe Commerce Department recommended that Apple and Google address limits on in-app purchasing, including removing requirements that force developers to use either the iOS App Store or Google Play Store for any purchases. Both Apple and Google have an interest in limiting purchases to their app stores: Both take a 30% cut of any transactions made on their app store, whether buying apps, making in-app purchases or paying for a subscription. Apple even takes a cut when users pay to boost their posts on social media platforms.\nThe Commerce Department also recommended that operators allow users to install their own apps to their phones and access competing marketplaces.\nThe current mobile app ecosystem, and especially the current app store model, is harmful to consumers and to app developers, Alan Davidson, the head of Commerces National Telecommunications and Information Administration (NTIA), told reporters on Wednesday.\nThe NTIA said it developed the report at the direction of Bidens executive order on competition issued in July  2021, committing the administration to promote innovation and competition across the economy. The Biden administration had previously signaled support for earlier attempts by Congress to regulate app stores.\nNeither Apple nor Google responded immediately to Fortunes request for comment. Both companies told Bloomberg that they disagreed with the reports conclusions.\nA secret 30% tax on everything\nThe 30% cut has long been a thorn in the side of software developers, who argue it limits competition and hurts smaller app creators. Both Meta and Microsoft have called for changes to the app store model. (Both Apple and Google have reduced the 30% fee for smaller developers in recent years).\nEpic Games, the developer behind the Fortnite video game, accused Apple of engaging in anti-competitive practices in a 2020 lawsuit. The judge presiding over the ruling declared that Apple had to allow developers to link to payment systems outside its app store (which would evade the 30% fee), but did not declare Apple a monopoly.\nMeta CEO Mark Zuckerberg has also criticized the iPhone makers policies. Apple has sort of singled themselves out as the only company that is trying to control unilaterally what apps get on a device, Zuckerberg said at a New York Times conference in November. I dont think thats a sustainable or good place to be.\nEven Twitter CEO Elon Musk complained about Apples policies in the days leading up to the launch of the Twitter Blue paid verification service.\nDid you know Apple puts a secret 30%  tax on everything you buy through their App Store?",
      "snippet": "... a report on Wednesday examining <b>Apple</b> and Google's app store model. Kevin ... the Biden administration argued that <b>Apple</b> and Googles app store model, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T07:46:36",
      "provider": {
        "name": "fortune",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://content.fortune.com/wp-content/uploads/2023/02/GettyImages-1461459099-e1675321156782.jpeg?resize=1200,600",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fortune",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://fortune.com/2023/02/02/apple-google-app-store-elon-musk-secret-30-percent-tax-everything-commerce-dept-anticompetitive/"
      }
    },
    {
      "id": "2120358304465106868",
      "title": "Apple Likely To Report Drop In Earnings Here's A Look At Recent Price Target Changes By The Most Accurate Analysts",
      "url": "https://www.benzinga.com/news/23/02/30682575/apple-likely-to-report-drop-in-earnings-heres-a-look-at-recent-price-target-changes-by-the-most-accu",
      "description": "Apple Inc. (NASDAQ: AAPL) is scheduled to release quarterly results after the closing bell on Feb. 2, 2023.",
      "body": "AAPL\nis scheduled to release quarterly results after the closing bell on Feb. 2, 2023.\nThe iPhone maker is expected to report quarterly earnings at $1.94 per share, down from $2.1 per share in the year-ago period. The company is likely to post revenue of $121.20 billion.\nApple recently discussed developing VR content for the platform with about half a dozen media partners, including Walt Disney and Dolby Laboratories Inc.\nApple shares rose 0.8% to close at $145.43 on Wednesday.\nBenzinga readers can access the latest analyst ratings on the\nAnalyst Stock Ratings  page. Readers can sort by stock ticker, company name, analyst firm, rating change or other variables.\nLets have a look at how Benzingas most-accurate\nanalysts have rated the company  in the recent period.\nDeutsche Bank analyst Sidney Ho maintained a Buy rating and cut the price target from $170 to $160 on Jan. 23, 2023. This analyst sees around 10% upside in the companys stock and has an accuracy rate of 81%.\nJP Morgan analyst Samik Chatterjee maintained an Overweight rating on Jan. 19, 2023, and lowered the price target from $190 to $180. This analyst sees around 24% upside in the companys stock and has an accuracy rate of 75%.\nCanaccord Genuity analyst Michael Walkley maintained a Buy rating on Jan. 18, 2023, and cut the price target from $200 to $170. This analyst sees around 17% upside in the companys stock and has an accuracy rate of 73%.\nRosenblatt analyst Barton Crockett maintained a Buy rating and cut the price target from $189 to $165 on Jan. 20, 2023. This analyst sees around 13% upside in the companys stock and has an accuracy rate of 52%.\nBarclays analyst Tim Long maintained an Equal-Weight rating on Jan. 11, 2023, and cut the price target from $144 to $133. This analyst sees around 9% downside in the companys stock and has an accuracy rate of 63%.\nRead This Next:",
      "snippet": "<b>Apple</b> Inc. (NASDAQ: AAPL) is scheduled to release quarterly results after the closing bell on Feb. AAPL is scheduled to release quarterly results ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T07:08:31",
      "provider": {
        "name": "benzinga",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.benzinga.com/files/images/story/2023/02/02/image-apple6.jpg?width=1200&amp;height=800&amp;fit=crop",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "benzinga",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.benzinga.com/news/23/02/30682575/apple-likely-to-report-drop-in-earnings-heres-a-look-at-recent-price-target-changes-by-the-most-accu"
      }
    },
    {
      "id": "5591752744511074102",
      "title": "Apple may launch Watch Ultra with enlarged 2.1-inch display in 2024",
      "url": "https://www.business-standard.com/article/technology/apple-may-launch-watch-ultra-with-enlarged-2-1-inch-display-in-2024-123020200471_1.html",
      "description": "Apple will reportedly launch a new Apple Watch Ultra with a larger 21inch display next year the media reported",
      "body": "Apple will reportedly launch a new 39Apple Watch Ultra39 with a larger 21 inch display next year the media reportedThis lines up with the information that Haitong International Securities analyst Jeff Pu had shared last month reports MacRumorsThe current Watch Ultra features around a 193 inch screen therefore the 2024 model is likely to have nearly a 10 per cent larger displayThe new wearable is expected to become the first Apple Watch with over a 50mm case sizeThe new Ultra is also likely to feature microLED display technology which will offer higher brightness decreased power consumption and improved contrast ratio as compared to the current models with OLED displaysThe iPhone maker39s transition to the technology might take many years to be completed as the microLED display production costs are currently high the report saidLast month Pu had also said that he expects Apple Watch sales to drop in 2023 due to quotlack of significant spec upgradequot  IANSajkskOnly the headline and picture of this report may have been reworked by the Business Standard staff the rest of the content is auto generated from a syndicated feed",
      "snippet": "<b>Apple</b> will reportedly launch a new <b>Apple</b> Watch Ultra with ... to become the first <b>Apple</b> Watch with over a ... said that he expects <b>Apple</b> Watch sales to drop ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:49:00",
      "provider": {
        "name": "business-standard",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-10/06/full/1665020034-0155.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "business-standard",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.business-standard.com/article/technology/apple-may-launch-watch-ultra-with-enlarged-2-1-inch-display-in-2024-123020200471_1.html"
      }
    },
    {
      "id": "5021123514837978056",
      "title": "US Senator Calls on Apple and Google to Ban TikTok From App Stores",
      "url": "https://www.macrumors.com/2023/02/02/us-senator-letter-apple-ban-tiktok/",
      "description": "United States Senator Michael Bennet today penned a letter to the chief executives of Apple and Google demanding that they ban Chinese-owned TikTok...",
      "body": "The New York Times\n).\nBennet, a Democrat of Colorado and member of the Senate Intelligence Committee, sent the letter to Apple's Tim Cook and Google's Sundar Pichai, saying that no company subject to \"Chinese Communist Party dictates should have the power to accumulate such extensive data on the American people or curate content to nearly a third of our population.\"\n\"TikTok's vast influence and aggressive data collection pose a specific threat to US national security because of its parent company's obligations under Chinese law,\" wrote Bennet. \"Article 7 of China's National Intelligence Law decrees that 'any organization or citizen shall support, assist, and cooperate with state intelligence work.' Article 14 provides Chinese state security agencies the authority to demand cooperation from companies like ByteDance, while Articles 16 and 17 allow intelligence agents to access relevant materials and files and make use of its communication tools and facilities.\"\nBennet goes on to cite a BuzzFeed News report from June last year that suggested TikTok engineers in China had access to the data of U.S. users between September 2021 and January 2022. \"Everything is seen in China,\" said one TikTok employee in recordings reviewed by BuzzFeed, with the recordings also referencing a \"Master Admin\" engineer in China who \"has access to everything.\"\nBennet's letter concludes: \"Given these grave and growing concerns, I ask that you remove TikTok from your respective app stores immediately.\"\nTikTok has been in the cross-hairs of U.S. regulators for years now, going back to the Trump administration's failed attempt to bar the app from U.S. app stores in September 2020. However, concerns over the app have heightened in the last few weeks after both Republicans and Democrats called for officials to impose stricter data collection restrictions or ban the app from the U.S. entirely.\nFor its part, TikTok's parent company ByteDance submitted a plan in August detailing how it plans to prevent the Chinese government from having access to data on U.S. users, and how it will offer the U.S. government oversight of the platform. The Biden administration has yet to respond to the company's plan.\nIn the meantime, at least 27 state governments have passed full or partial bans on the app, while a bipartisan bill introduced in Congress in December would ban the app for everyone in the United States. The House Foreign Affairs Committee plans to hold a vote on the bill this month.\nSenator Bennet's full letter to Apple and Google can be read on Scribd.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.\nTag:",
      "snippet": "... Michael Bennet today penned a letter to the chief executives of <b>Apple</b> and Google demanding that they ban Chinese-owned TikTok. The New York Times ).",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:48:25",
      "provider": {
        "name": "macrumors",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.macrumors.com/t/RKe-ihkRY_z5uXNYZSPfUNnvjbc=/1600x/article-new/2020/08/tiktok-logo.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "macrumors",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.macrumors.com/2023/02/02/us-senator-letter-apple-ban-tiktok/"
      }
    },
    {
      "id": "1327931802357929360",
      "title": "Apple is Reportedly Working on 20.5-Inch Foldable Notebook for 2025",
      "url": "https://www.phoneworld.com.pk/apple-is-reportedly-working-on-20-5-inch-foldable-notebook-for-2025/",
      "description": "According to information shared by display analyst Ross Young, Apple is developing a 20.5-inch foldable notebook that could be released as soon as 2025. The reports match the statement of Mark Gurman.",
      "body": "According to information shared by display analyst Ross Young, Apple is developing a 20.5-inch foldable notebook that could be released as soon as 2025. The reports match the statement of Mark Gurman. According to him, Apple will not reveal any foldable tablets in the coming year. However, another famous Apple analyst Ming-Chi Kuo hinted that Apple was developing a foldable iPad for 2024.\r\n\r\nApple is Reportedly Working on 20.5-Inch Foldable Notebook for 2025\r\nThe rumour about an all-screen foldable MacBook is not exactly new. Young has shared similar information back in February 2022. Previously, Apple was discussing foldable notebooks with displays around 20 inches in size with its suppliers.\r\nAccording to the latest report, Apple is still pursuing some kind of foldable notebook product. It will feature a full-size on-screen keyboard when folded. It also has the option to use it with an external keyboard when unfolded. The reports claim that it would be an all-new product category for Apple.\r\nThe dual display design would differ from current Mac notebooks that are foldable, as those machines feature a single display paired with a keyboard and trackpad. It has been unclear whether the rumoured 20-inch foldable would be positioned as an iPad, Mac, or something new entirely.\r\nHowever, multiple sources seem to think 2024 is too early for some kind of foldable. Let's wait and watch what Apple will think about the release of the new tablet. We will get more information in the coming days. So stay tuned.\r\nSee Also: Apple Plans To Allocate More Resources To Upcoming A17 Bionic Hinting At Improved Performance & Efficiency",
      "snippet": "According to information shared by display analyst Ross Young, <b>Apple</b> is developing a 20.5-inch foldable notebook that could be released as soon as ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:11:43",
      "provider": {
        "name": "phoneworld",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.phoneworld.com.pk/wp-content/uploads/2023/02/Apple-Foldable-Notebook-2025.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "phoneworld",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.phoneworld.com.pk/apple-is-reportedly-working-on-20-5-inch-foldable-notebook-for-2025/"
      }
    },
    {
      "id": "2431255665473872903",
      "title": "Apple Reports Earnings Today. What to Expect.",
      "url": "https://www.barrons.com/articles/apple-earnings-stock-what-to-expect-51675221513",
      "description": "The Street expects Apple to report its first year-over-year revenue decline since 2019. Profits are expected to fall too.",
      "body": "Expectations are muted for\nApple\ns financial results, particularly given recent production issues in China, but other crosscurrents make the report a little difficult to call.\nThe single biggest issue Apple will need to address in its December quarter report, due Thursday afternoon, is how demand for its products is being affected by a clear slowdown in consumer spending on PCs, mobile phones, and other electronics. The fading strength of the dollar, meanwhile, could skew how the numbers turn out.\nSubscribe",
      "snippet": "The Street expects <b>Apple</b> to report its first year-over-year revenue decline since 2019. Profits are expected to fall too.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:00:00",
      "provider": {
        "name": "barrons",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.barrons.com/im-714430/social",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "barrons",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.barrons.com/articles/apple-earnings-stock-what-to-expect-51675221513"
      }
    },
    {
      "id": "5364167833368814644",
      "title": "Samsung can finally make a name for itself as a laptop maker if it plays its cards right",
      "url": "https://www.techradar.com/features/samsung-can-finally-make-a-name-for-itself-as-a-laptop-maker-if-it-plays-its-cards-right",
      "description": "The Samsung Galaxy Book3 laptops are official, and they have genuinely piqued our interest for a change.",
      "body": "(opens in new tab)\n(Image credit: Samsung)\nHere at TechRadar, we've covered a lot of laptops over the years  and it's strange to say, but Samsung isn't really a brand that we spend a whole lot of time thinking about.\nSamsung makes some incredible products, obviously, from the best TVs to some of the best phones on the planet, but laptops generally are something of an after-thought.\nThe Galaxy line of laptops has definitely charmed us in the past, like the Samsung Galaxy Book2 Pro, but then devices like the Galaxy Chromebook Go come around and knock us out of love with the brand.\nNow, not every brand produces winner after winner, but brands like Acer, Asus, Dell, HP, and Lenovo are regulars on our best laptop list for a reason: they consistently put out high-quality products across their portfolio, and they're much more focused on getting mobile computing hardware right in a way that Samsung simply isn't, which is strange for a company with such a strong tech pedigree.\nAfter the latest Samsung Unpacked event though, it's clear that Samsung has a chance to reset expectations, and there are a lot of reasons why Samsung could deliver a fantastic laptop that a lot of people are going to be very interested in buying.\nWhatever else it has going for it, Samsung makes a gorgeous device\nThe Samsung Galaxy Chromebook 2 was one of the best looking laptops ever made.\n(Image credit: Future)\nNo matter what Samsung puts its hands to, it's bound to look incredible.\nFor all the grief people gave the Samsung Galaxy Chromebook 2, there's no denying that it was incredibly eye-catching, and Samsung's Galaxy S-series phones (as well as its Galaxy Tab S-series tablets) have always looked stellar.\nSamsung has a great eye for design that Apple frankly lacks, making it well positioned for a laptop maker to really set itself apart when it isn't in complete control of its specs in the way that Apple is. Even the best Windows laptop is going to have that same problem, so a great design will go a long way to making it competitive against rivals who have been in the laptop market longer, and have a more established presence in that space.\nIt doesn't matter if Samsung isn't a major laptop player; its name is bigger than anyone else's\n(Image credit: Samsung)\nSometimes we computing journalists forget that not everyone knows the ins and outs of the industry the way we do, so we might take Samsung's modest position in the broader computing space as common knowledge.\nBut that really isn't the case, not when you're out looking for a new laptop and can't tell who's who on the shelf. In many cases, customers are going to be focused on price above all, but they're also going to be looking for brand names they recognize as well; and fairly or not, Samsung's name is just about everywhere.\nThis is a major plus for Samsung. If you're buying a new computer with little to go on but your gut instinct, Samsung is going to have a major advantage over Lenovo and Acer, despite the latter two being the better laptop makers by dint of industry experience.\nOf course, all of this relies on Samsung actually making decent laptops  and given the specs of the Samsung Galaxy Book3 Pro, Samsung Galaxy Book3 Pro 360, and Samsung Galaxy Book3 Ultra, we're certain that these devices can deliver as well as those from rivals who will be relying on the same hardware as Samsung.\nPrice, performance, and integration will make or break Samsung's push into the laptop market\nWe already know the prices for Samsung's lineup of Book3 laptops, and we've gotten a sense of the specs they'll come with, all of which bodes well for Samsung's latest laptop push.\nOne key factor that will absolutely help the company establish itself will be how well it integrates the Galaxy Book3 series into the broader Samsung ecosystem. From smartwatches to phones and tablets, Samsung's Android devices are very well integrated in a way that only Apple can beat.\nIf Samsung is able to bring its laptops into that ecosystem is a compelling way, it will be able to do something no other laptop maker really can, which is provide a truly Apple-like experience across all of its devices.\nYes, Windows has Android integration, but this is necessarily limited by the fact that it's Windows that's doing all the work, not so much the OEMs putting out the Windows devices. Lenovo doesn't have a smartwatch, a phone, and a tablet that it can pair with its laptops the way Samsung does; and if the company leans into this advantage, and offers the kind of seamless integration between laptop, phone, tablet, and watch that Apple is able to, it could produce something really special in the Windows space that no one else has been able to pull off.\nIt remains to be seen if Samsung can ultimately do this, but there's no reason why it can't  and it has every reason to try.\nTechRadar Newsletter",
      "snippet": "... Samsung's Android devices are very well integrated in a way that only <b>Apple</b> can beat. If Samsung is able to bring its laptops into that ecosystem is ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:00:00",
      "provider": {
        "name": "techradar",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/oFN2xqiiPWJGGNmJQTYyGB.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "techradar",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.techradar.com/features/samsung-can-finally-make-a-name-for-itself-as-a-laptop-maker-if-it-plays-its-cards-right"
      }
    },
    {
      "id": "5650226284556899071",
      "title": "What did Apple do for Black History Month? Tech giant leaves internet divided with fitness challenge",
      "url": "https://www.sportskeeda.com/pop-culture/news-what-apple-black-history-month-tech-giant-leaves-internet-divided-fitness-challenge",
      "description": "Apple's recent fitness challenge for Black History Month, which rewards users with a \"Unity Award\" for exercising, was met with controversy.",
      "body": "Apple's recent fitness challenge for Black History Month, which rewards users with a \"Unity Award\" for exercising, was met with controversy. Apple Watch users were sent a notification for a campaign called the \"Unity Challenge,\" with the message:\"Let's come together to honor Black history. Earn this Unity award by closing your Move ring for seven days in a row during February.\"TikToker Tamika Turner, who goes by the username @prettycritical, pointed out the issue with the challenge in her post shared on Monday, January 20, 2023, with the caption: \"wtf apple?\"View on TikTokTamika called it an \"unbelievable and unacceptable\" stunt that was \"tone-deaf and cringy.\" They also reminded everyone about Tyre Nichols' murder. They added:\"The only thing Apple has to say about honoring Black people and Black history is, Use our product, maybe lose a little weight.'\"\"Where is the correlation\": Netizens divided over Apple's Unity ChallengeThe tech giant's latest campaign for Black History Month has left many internet users debating the move.Many netizens believed that the activity had no correlation with Black history and that they could have gone with other campaigns to support the Black community and creators. They described the campaign as \"cringe\" and \"weird.\"TikToker @Tiffany Lofay commented that it was ironic for Apple to \"ask for labor\" in an effort to \"honor descendants of slavery.\"A comment criticizing the campaign (Image via TikTok/@Tiffany Lofay)One user @liv remarked she would sit on her couch for seven days straight to spite the company.A comment criticizing the campaign (Image via TikTok/@liv)Here are some more comments criticizing the company's Unity Challenge:A comment criticizing the campaign (Image via TikTok/@Lilchen)A comment criticizing the campaign (Image via TikTok/@Kayleigh | NYC life)A comment criticizing the campaign (Image via TikTok/@GB)A comment criticizing the campaign (Image via TikTok/@Christopher LeBouef)A comment criticizing the campaign (Image via TikTok/@user)Meanwhile, the other half of TikTok was supportive of the campaign. They commented that the outcry was baseless as the tech giant frequently holds similar challenges during other holidays and occasions. Some netizens remarked that not everything is done with malicious intent and there was no need to read too much into it.Tiktoker @Tally pointed out that the watch is meant to encourage fitness, so the tie-in with Black History Month was a reasonable move.A comment supporting the campaign (Image via TikTok/@Tally)Here's what other TikTokers stated:A comment supporting the campaign (Image via TikTok/@user2783948742721)A comment supporting the campaign (Image via TikTok/@Jess)A comment supporting the campaign (Image via TikTok/@jerm726)A comment supporting the campaign (Image via TikTok/@Audrianna)A comment supporting the campaign (Image via TikTok/@user2783948742721)A comment supporting the campaign (Image via TikTok/@Hi)Tyre Nichols was a FedEx driver who was critically injured due to a violent beating at the hands of five Memphis police officers at a traffic stop on January 7, 2023. Nichols died of his injuries three days later.The horrific incident sparked nationwide debates over police brutality. The five cops in question were fired and arrested on charges of murder.Apple is yet to comment on the \"Unity Challenge\" controversy.",
      "snippet": "<b>Apple</b> Watch users were sent a notification for a campaign called the \"Unity Challenge,\" with the message:\"Let's come together to honor Black ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:56:32",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticg.sportskeeda.com/editor/2023/02/b52db-16753127706670-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/pop-culture/news-what-apple-black-history-month-tech-giant-leaves-internet-divided-fitness-challenge"
      }
    },
    {
      "id": "4077398670507535829",
      "title": "Reality Pro: Why these five Apple apps could be perfect for your AR/VR headset",
      "url": "https://www.imore.com/gaming/virtual-reality/reality-pro-why-these-five-apple-apps-will-be-perfect-for-your-vr-headset",
      "description": "Hopefully, the words \"game changer\" will be used a lot to describe Apple's rumored VR headset.",
      "body": "Reality Pro\nVR/AR headset. Recently, we've heard some exciting details about the new headset that mostly centered on what it could look like. And yet, we have heard very little about which apps will work with the wearable device, especially on day one.\nThe Reality Pro could focus heavily on gaming to start with. However, Apple's likely to also concentrate on entertainment, fitness, and health, using its apps on iPhone and macOS as inspiration.\nWith this in mind, here are a few ideas on what five of Apple's official apps could look like on the company's most important new product since the Apple Watch launched in 2015 if it gets confirmed.\nApple Arcade\n(Image credit: Apple)\nOut of the gate, Reality Pro, the rumored name for the headset, is going to have to impress gamers. This starts with Apple Arcade, which is currently available on the best iPhones, iPads, and Apple TV.\nRather than simply moving existing games to xrOS, the rumored operating system for the headset, Apple needs to offer some virtual exclusives, which should extend to non-Apple Arcade games. It's the quickest way to differentiate Reality Pro from competitive products.\nBeyond this, it will be about presentation and how the Reality Pro incorporates Apple Arcade into the xrOS interface. I expect we'll be blown away.\nApple Fitness\n(Image credit: Apple)\nUndoubtedly, the Reality Proheadset will be packed full of health and fitness features. The Meta Quest 2 already offers countless titles, and no doubt many of these will jump over to xrOS. However, the most important of these is likely to be Apple's Fitness app.\nAlready available on iPhone, iPad, and Apple TV, the native app is where you can find Apple Fitness Plus and its growing library of video and audio workouts. With the Reality Pro headset, I'd expect Apple's fitness offers to go outside  at least virtually. Imagine, for example, training for a 5K run using the headset by going up and down virtual hills. There's probably also going to be a meditation section that could take users to faraway places from the living room.\nHealth app\n(Image credit: Apple)\nThe Apple Health app could soon make a splash on the Reality Pro headset. Imagine, for example, seeing your step or weight history on a digital plane as you walk around virtually. In another scenario, perhaps Apple makes it a reality that you can go inside a virtual heart to see how your real heart pumped throughout your last workout.\nLet's take this a few steps further. Given the Reality Pro headset is expected to launch at around $3,000, it makes sense that Apple is already working with healthcare providers to bring the devices into medical settings. In these locations, for example, doctors could someday use the headset to show patients the inside of their bodies to show trouble spots in an immersive environment. In another, a patient could be shown what will happen to their body if they don't get a better shape.\nThe possible uses go on and on.\nApple TV Plus\n(Image credit: Apple TV Plus)\nLife isn't all about health and fitness, of course. That's why the Reality Pro headset is likely to be connected to Apple TV Plus from the start. Thanks to SharePlay, watching your favorite TV show or movie in a virtual setting with your family and friends should work seamlessly  even with those who don't have a headset.\nDifferently, Cupertino could build virtual reality extras into the Apple TV app to give it an immersive feel. Imagine walking into Lumon Industries and riding the elevator into all things Severance or kicking a ball on the set of Ted Lasso. There's no limit to where the Apple TV app could take you with the Reality Pro headset; perhaps a trip to Mars on For All Mankind's Helios is in your future for a vacation.\n(Image credit: Apple)\nWhat will be interesting to see is whether Apple allows other entertainment providers to use the same tools given to Apple TV. I would guess Apple eventually will, although perhaps not in the short term.\nRegardless, there needs to be a prominent entertainment feature that connects the reality headset to Apple TV that no one else has tried before. Otherwise, Apple will be accused of playing copycat.\nApple Music\n(Image credit: Apple)\nGoing back to the original iTunes and iPod, Apple has been a significant force in music. The Reality Pro launch allows the company to reinforce these bonafide. It won't be easy, however.\nListening to Apple Music is a highly personal experience, typically involving headphones or earbuds. By contrast, going to concerts is a group event where different personalities get together to celebrate their love for an individual artist or band. For Apple Music to succeed on the Reality Pro, I would expect Apple to take both experiences and merge them in a fun new way.\nOn the one hand, Apple should make it easy for you to access the music library when using the headset. Artist pages, Apple Music 1 integration, and a fresh take on the Listen Now section are three critical areas that should be addressed.\nApple Music on the Reality Pro should also have an immersive concert component where you can join other users to experience some of the world's most historic concerts from various angles for example, the Fleetwood Mac On With the Show Tour, Taylor Swift's 1989 Tour, or even Johnny Cash at San Quentin Prison. And then there are Apple-sponsored concerts, new and old, that would look fantastic virtually.\nThere's a lot riding on Apple's Reality Pro headset; hopefully, we'll see it soon. In the meantime, it's a fun time imagining what the rumored headset could mean to the company's existing apps, such as Arcade, Health, Fitness, TV, and Music.\nIt should be an exciting time if it gets announced soon - so stay tuned.\niMore Newsletter\nSocial Links Navigation\nStaff Writer\nBryan M. Wolfe has written about technology for over a decade on various websites, including TechRadar, AppAdvice, and many more. Before this, he worked in the technology field across different industries, including healthcare and education. Hes currently iMores lead on all things Mac and macOS, although he also loves covering iPhone, iPad, and Apple Watch. Bryan enjoys watching his favorite sports teams, traveling, and driving around his teenage daughter to her latest stage show, audition, or school event in his spare time. He also keeps busy walking his black and white cocker spaniel, Izzy, and trying new coffees and liquid grapes.\nTopics",
      "snippet": "... of <b><b>Apple</b>'s</b> official apps could look like on the company's most important new product since the <b>Apple</b> Watch launched in 2015 if it gets confirmed.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:00:58",
      "provider": {
        "name": "imore",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/ffpe8n5oiwgnAGQdXJjJZd.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "imore",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.imore.com/gaming/virtual-reality/reality-pro-why-these-five-apple-apps-will-be-perfect-for-your-vr-headset"
      }
    },
    {
      "id": "8696236511792609901",
      "title": "Ignore the haters the Galaxy S23 Plus is the perfect middle child",
      "url": "https://www.techradar.com/opinion/ignore-the-haters-the-galaxy-s23-plus-is-the-perfect-middle-child",
      "description": "The Galaxy S23 Plus offers just the right upgrades to justify buying it over the Galaxy S23.",
      "body": "(opens in new tab)\n(Image credit: Future / Lance Ulanoff)\nIn todays hierarchy of smartphones, the Plus models get a bad rap. The base-model phones, like the\nGalaxy S23\nand the\niPhone 14\n, are the least expensive. The Ultra and Pro Max have the coolest stuff. Plus phones? Why do they even bother? Im here to tell you to ignore the haters, and to say that the\nGalaxy S23 Plus\nis the cool one in the S23 lineup, in that same rebellious way that the middle child is the cool one.\nSamsung was smart with its phone family this year, and it didnt underpower the less expensive models. Sure, the\nGalaxy S23 Ultra\ngives you a lot more  so much more that Samsung couldnt even mention all of that phone's key features during its Unpacked presentation. That doesnt mean its more powerful than the more affordable phones, though.\nThe Galaxy S23 next to the Galaxy S23 Plus\n(Image credit: Future / Lance Ulanoff)\nEach of the Samsung Galaxy S23 devices is powered by the Qualcomm Snapdragon 8 Gen 2 for Galaxy Mobile platform. That for Galaxy bit means the primary core on the CPU has been overclocked, so Samsungs Gen 2 chips will be faster than competing phones using the same Qualcomm chipset, we presume.\nThis means that the Galaxy S23 will be one of the fastest phones you can buy, just like the Galaxy S23 Ultra. The Galaxy S23 Plus will also have the same graphics power and raw processing that youll find on the more expensive Ultra.\nThe Snapdragon powers the camera as well\nIn contrast, Apple didn't give its iPhone 14 or iPhone 14 Plus the newest A16 Bionic chipset. Those phones are using the same A15 Bionic platform as the aged iPhone 13 Pro. If you buy a less expensive Plus-sized iPhone, you're getting a slower device.\nInstead of following Apple, Samsung followed in Googles footsteps. The Pixel 7 has the same Tensor G2 chipset as the Pixel 7 Pro. That platform enables some excellent features that are exclusive to Pixel 7 devices, including photo unblur, which I love.\nThe camera app on the Galaxy S23 Plus\n(Image credit: Future / Lance Ulanoff)\nFor the same reason, its important for the Galaxy S23 Plus to have the same powerful Snapdragon 8 Gen 2 (do I have to say for Galaxy every time?!). Much of the camera work takes place on the mobile platform. The camera sensor collects data, then the Snapdragon processes that data into an image.\nBy giving the Galaxy S23 Plus the same chipset as the Ultra, that phone gets an effective camera upgrade, even though the pixel count remains the same. The sensor is also improved, and Samsung has undoubtedly improved its pixel-binning techniques to bring those unruly 50MP images down to a sharable 12MP or so.\nThe feature that really WOWS me on iPhone\nSo, Ive made the argument for buying the more affordable Galaxy S23 devices, but why the Plus? What does the Plus give me over the Galaxy S23? Well, have you ever lost your keys? The Galaxy S23 Plus can give you back your lost keys.\nThats because the Plus model, like the Ultra, gets ultra-wideband technology (UWB). This is the same radio technology that Apple uses in its AirTag accessories. An accessory that uses UWB can be found with supreme accuracy using a compatible phone. The Galaxy S23 Plus could literally point you in the direction of your keys, your wallet, your luggage, or your children.\nThe Galaxy S23 Plus has UWB, just like Apple's AirTags\n(Image credit: Future)\nThat is a seriously cool feature, and if I had to choose between omitting a super-high-megapixel camera or losing UWB features, Id pick the device that keeps UWB and shirks the big sensor.\nIve only started using AirTags recently with my iPhone, but the experience is one of those 'wow' moments when technology is startlingly good. The first time I needed to find my keys, my phone didnt just make them ring a jingle  my phone actually pointed me in the right direction and helped me find them. I felt like I was living in a spy movie.\nThen I slipped an AirTag into my luggage on my way to the CES tech show in Las Vegas. While all the other passengers were standing at the carousel tapping their feet and waiting, I was calmly playing games on my phone. I knew that the bags were still on the plane because I could see the location of my AirTag. I had no anxiety from waiting and wondering when the bags would arrive.\nI'll miss the zoom, but I'd miss my wallet more\nIt can party longer... but its not dumb enough to lose its keys\nThe 50MP camera on the Galaxy S23 Plus will take amazing photos. They may not match the diverse range of shots or the incredible detail youll get from the Galaxy S23 Ultra, but theyll still be better than the camera phone you owned last year  and that one was probably pretty good, too.\nAside from the UWB technology, the Galaxy S23 Plus gets a few upgrades that really matter. Because its a bigger phone, it gets a bigger battery inside. Its not a massive difference, but it could last a few hours longer than smaller devices.\nSamsung also starts the Galaxy S23 Plus with 256GB of storage. With judicious cloud synchronization, you can get away with 128GB, but if you really want to shoot a ton of 4K Super HDR video at 60fps, youll be thankful for the extra storage space on board.\nThe Galaxy S23 Plus starts at $999.99 / 1,049 / AU$1,649, which is $200 / 200 / AU$300 more than the Galaxy S23. When you consider what you get, its a worthwhile upgrade.\nThe camera array on the Galaxy S23 Plus\n(Image credit: Future / Lance Ulanoff)\nYou get a bigger display, a bigger battery, and twice the storage capacity. You also get the fantastic UWB features. The Galaxy S23 Plus is truly a great middle-child story. It isnt as serious and scholarly as the bigger Galaxy S23 Ultra, but it can party longer than the Galaxy S23, and its not dumb enough to lose its keys on the subway ride home.\nIf the Galaxy S23 Ultra is too much phone for you, the Galaxy S23 Plus might be just right. Ignore the haters who ask why this phone needs to exist. It deserves as much love as the rest of the family.\nTechRadar Newsletter",
      "snippet": "The Snapdragon powers the camera as well In contrast, <b>Apple</b> didn't give its iPhone 14 or iPhone 14 Plus the newest A16 Bionic chipset. Those phones ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:00:01",
      "provider": {
        "name": "techradar",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/278TiNb2sTCWp5NHcRTNH4.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "techradar",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.techradar.com/opinion/ignore-the-haters-the-galaxy-s23-plus-is-the-perfect-middle-child"
      }
    },
    {
      "id": "5264935534929503954",
      "title": "How to stop Big Tech from listening, tracking your voice recordings.",
      "url": "https://www.usatoday.com/story/tech/columnist/komando/2023/02/02/how-stop-big-tech-listening-tracking-your-voice-recordings/11150801002/",
      "description": "Most of what you type, say, search and buy is being tracked in one way or another. Big Tech gives us great products to use, and the price is privacy.",
      "body": "Check this list of red flags.\nYou can fight back. You can buy a mic blocker for around $10. It slides into your headphone port to stop recording. For an even cheaper do-it-yourself option, buy the most inexpensive pair of headphones you can find and snip them off.\nHeres how to limit what youre handing over to Big Tech:\nAmazon\nWhenever I write that your Echo device is always listening, Amazon assures me its only listening for the wake word. I dont see the difference here. Either way, if you have an Echo, theres not much point in keeping it around if you turn off the microphone.\nThe real issue is Amazon employees listening to your recordings. Heres how to stop that:\n Open the Alexa app on your phone, then tap the More menu button.\n Select Settings > Alexa Privacy.\n Choose Manage Your Alexa Data.\n Turn off the toggles next to Help improve Alexa and Use messages to improve transcriptions.\nYou can turn the Echo's mic off for extra privacy in certain situations. Press the microphone's off/on button at the top of the device. Whenever this button is red, the mic is off. To reactivate it, press the button again, and it will turn blue.\nUgh, come on, Alexa.\nRead our list of the most annoying Echo issues solved.\nYour cellphone\nDo you rely on Siri to get things done for you? You might not realize how much is being sent back to Apples servers.\nSince you cant really pick and choose what is shipped off and stored, your best bet is shutting down Siri if youre not comfortable with Apple having your recordings.\n Open the Settings app on your iPhone.\n Scroll down and tap Siri & Search.\n Toggle the green switch next to Listen for Hey Siri to the off position.\n You can also turn off Allow Siri When Locked to prevent Siri from activating when a button is pressed in your pocket.\nUse an Android? Heres how to turn off the OK Google wake phrase:\n Open the Google app on your phone.\n Tap your profile picture in the upper-right corner.\n Choose Settings > Google Assistant > General.\n Slide the toggle next to Google Assistant to the left to turn it off.\nYour apps might be listening too.\nThe Daily Money delivers our top personal finance stories to your inbox\nYour computer\nAre you worried about someone spying on you through your webcam? Thats easy: Grab a cheap cover or put a Post-It over the lens if you don't use it much.\nUnfortunately, you do have to root around your computer a bit to turn off mics.\nFor PCs running Windows 10:\n Right-click on the Start button and open Device Manager.\n In the Device Manager window, expand the audio inputs and outputs section, and you will see your microphone listed as one of the interfaces.\n Right-click on Microphone and select Disable.\nOn a Mac:\n Click the Apple menu > System Preferences...\n Select Sound > then the Input tab.\n Drag the Input volume slider to the left so it cant pick up any sound.\nThe internet is a dangerous place ",
      "snippet": "... pick and choose what is shipped off and stored, your best bet is shutting down Siri if youre not comfortable with <b>Apple</b> having your recordings.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:00:00",
      "provider": {
        "name": "usatoday",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.gannett-cdn.com/presto/2022/06/23/USAT/f3916fe4-5f47-4d37-8501-94f09a424a76-alexa_bug.png?crop=1911,1075,x0,y0&width=1911&height=1075&format=pjpg&auto=webp",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "usatoday",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.usatoday.com/story/tech/columnist/komando/2023/02/02/how-stop-big-tech-listening-tracking-your-voice-recordings/11150801002/"
      }
    },
    {
      "id": "4582526351799339306",
      "title": "Big Tech Earnings Preview",
      "url": "https://seekingalpha.com/article/4574468-big-tech-earnings-preview-google-apple-amazon?source=feed_all_articles",
      "description": "The mega cap stocks are offering rare and deep discounts.",
      "body": "MSFT\n) results last week were in line across the board, except the Personal Computing segment reported a slight miss on the top line. Notably, Personal Computing missed this quarter and is causing enough uncertainty that the CFO did not provide a fiscal year guide, which is out of character for Microsoft. Azure posted slightly better-than-expected growth of 38% compared to guidance of\n37% -- despite this December quarter beat, Microsoft is forecasting a notable slowdown in Azure to 31% to 30% -- or an 8-point deceleration sequentially.\nWith an eye toward fundamentals, Microsofts report is likely to be a reflection of whats to come. Over this past year, Microsoft was one of the strongest FAAMGs due to its ability to drive down costs for enterprises, yet even this advantage is beginning to erode. According to Satya Nadella on the December quarter earnings call: There is only one law of gravity that I think all of us are subject to, which is inflation-adjusted economic growth.\"\nIn other words, even the best companies and strong growth will slow down the longer inflation remains high. As investors, its not our job to control inflation or the Feds response, rather, we should be seeking out the highest quality companies and determining when they may bottom. Due to the market being forward-looking, the time to do that research is now with the goal of building long-term positions throughout 2023.\nBelow, we discuss the nuances to each companys fundamentals. It can take a lot of data to draw conclusions during a time of market uncertainty. Weve bolded what we think are the most important takeaways.\nRevenue Estimates for the next four quarters\nSeeking Alpha\nApples Q3 revenue grew by 8.1% YoY to $90.15 billion. Its revenue in Q4 is expected to fall 1.53% YoY to $122.05 billion and the analysts have lowered their estimates by 0.83% in the past month. Apples revenue decline will be the first since the March 2019 quarter. The consumer weakness might weigh on the upcoming results along with Covid-related production delays in China.\nApple was the only one among the three companies to beat on the top-line and bottom-line estimates in Q3.\nLooking forward, in Q1, the revenue is expected to grow 0.36% YoY to $97.63 billion and grow 4.5% and 4.7% in the following quarters. This will mark another weak growth quarter for Apple although weve argued in the past, the stock should be viewed as a value stock when we said Apple has been very consistent with its margins and cash flows.\nAmazons Q3 revenue grew by 14.7% YoY to $127.1 billion. The more important news was that Amazon offered weak Q4 guidance of $140 billion to $148 billion, which was well below the analysts' estimate of $155.37 billion at the time of Q3 results, and this led to the stock selling off after the report.\nAnalyst consensus is for revenue growth of 6.03% YoY to $145.70 billion. With that said, pending no more surprises come Thursday, Amazons growth should incrementally improve over the next four quarters.\nAlphabets Q3 revenue grew by 6.1% YoY to $69.09 billion. Analyst consensus expects Q4 revenue growth of 1.54% YoY for revenue of $76.49 billion. The companys CEO Sundar Pichai said in the Q3 earnings call:\nOur financial results for the third quarter reflect healthy fundamental growth in Search and momentum in Cloud. Our reported results reflect the effect of foreign exchange. The growth in our advertising revenues was also impacted by lapping last years elevated growth levels and the challenging macro climate.\nSimilar to Amazon, Alphabet is expected to incrementally improve revenue growth throughout 2023. Due to Azures deceleration, there will be emphasis on both AWS and Google Cloud revenue. Notably, Google Cloud accelerated last quarter while both AWS and Azure decelerated.\nTwitter\nAdjusted EPS estimates for the next four quarters\nSeeking Alpha\nApples bottom line continues to shine with minimal contraction compared to its peers. Although a return to bottom line growth is forecast for Q3 for many of the FAAMG stocks, it will greatly depend on what is stated on the upcoming earnings calls including the fiscal year guides. Microsoft pulling fiscal year guidance with only two quarters left in its fiscal year is a great example of how quickly things can change. As stated, its out of character for Microsoft to not guide for fiscal year, yet due to unique levers that Microsoft can pull, the company expects its operating margins to remain consistent.\nEPS Overview:\nApples Q3 adj. EPS came at $1.29. Analysts expect adj. EPS of $1.96 in the next quarter.\nAmazons adj. EPS came at $0.28 in Q3 and beat estimates by 35.5%. They expect Q4 adj. EPS of $0.17 and have lowered estimates by 12.5% in the past month.\nAlphabets Q3 adj. EPS came at $1.06 and missed estimates by 16%. The analysts expect Q4 adj. EPS to be $1.20.\nApple is the only company on the list that has not announced job cuts.\nPrice Action and Valuation Overview:\nYCharts\nApple stock has the highest return of 84% in the past three years, as can be seen in the above chart for the period from 01/29/2020 till 01/27/2023. Alphabet has a return of 38% and Amazon has a return of 10%.\nYCharts\nYTD Amazon has the highest return of 23%, compared to 12% for Alphabet, and 10% for Apple.\nP/S and P/E Ratio\nYCharts\nApple has a P/S ratio of 5.92, compared to 4.69 for Alphabet, and 2.11 for Amazon. Apple has a five-year average P/S ratio of 5.57, compared to 6.41 for Alphabet, and 3.71 for Amazon.\nYCharts\nAmazon has a P/E ratio of 94.84, compared to 23.40 for Apple, and 19.77 for Alphabet. Amazon has a five-year average P/E ratio of 97.10, compared to 24.05 for Apple, and 30.99 for Alphabet.\nFree Cash Flow Margin",
      "snippet": "<b>Apple</b> was the only one among the three companies to beat on the top-line and bottom-line estimates in Q3. Looking forward, in Q1, the revenue is ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T04:59:23",
      "provider": {
        "name": "seekingalpha",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/891501876/image_891501876.jpg?io=getty-c-w1536",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "seekingalpha",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://seekingalpha.com/article/4574468-big-tech-earnings-preview-google-apple-amazon?source=feed_all_articles"
      }
    },
    {
      "id": "7697150825770656265",
      "title": "Apple Creates a New Navigation Feature That Makes Google Maps Look Ridiculous",
      "url": "https://www.autoevolution.com/news/apple-creates-a-new-navigation-feature-that-makes-google-maps-look-ridiculous-209622.html",
      "description": "Apple is working around the clock on improving the experience with its",
      "body": "2 Feb 2023, 04:54 UTC\n By:\nApple is working around the clock on improving the experience with its Google Maps rival, and while new features are already rolling out, the company is also planning in advance and trying to come up with further innovations.\n9 photos\nOne of these ideas is detailed in a patent called navigation application with novel declutter mode and which was granted on January 31.\nAs anyone can figure out from its name, this new feature would have a very simple role: to simplify the user interface and put the focus entirely on the navigation experience.\nIf you use Google Maps and Waze on a regular basis, you certainly know that the interface can indeed be very cluttered at certain times. These applications are trying to show as much data as possible on the same screen, in some cases making it more difficult to notice the route directions.\nApple believes Apple Maps could do things differently, so the patent envisions a mode that can be enabled with the press of a button in the main UI.\nOnce activated, this mode would remove all the visual items that users wouldnt otherwise consider to be essential for the navigation experience, including buildings, landmarks, trees, and so on. The one thatll remain in focus is the road ahead, as the route would be clearly highlighted on the screen all the time.\nApple says the new feature would work both in 2D and",
      "snippet": "<b>Apple</b> is working around the clock on improving the experience with its. 2 Feb 2023, 04:54 UTC By.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T04:54:14",
      "provider": {
        "name": "autoevolution",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s1.cdn.autoevolution.com/images/news/apple-creates-a-new-navigation-feature-that-makes-google-maps-look-ridiculous-209622_1.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "autoevolution",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.autoevolution.com/news/apple-creates-a-new-navigation-feature-that-makes-google-maps-look-ridiculous-209622.html"
      }
    },
    {
      "id": "3773842161810488744",
      "title": "Meta reports sales fall but beats expectations",
      "url": "https://gulfnews.com/business/markets/meta-reports-sales-fall-but-beats-expectations-1.1675309957876",
      "description": "The social media giant said sales dropped one percent to $116.6 billion in 2022",
      "body": "The 2022 results ended a bad year for Meta, which in November announced it would lay off 11,000 employees or 13 percent of staff\nin the largest worker reduction in the company's history.\nZuckerberg said his company's \"management theme for 2023 is the 'Year of Efficiency' and we're focused on becoming a stronger and more nimble organization.\"\nBig tech platforms have been suffering from the souring economic climate, which is forcing advertisers to cut back on marketing, and Apple's data privacy changes, which have reduced leeway for ad personalization.\nTargeted advertising\nApple sent shockwaves through the industry in 2021 when it began inviting iPhone users to opt out of having their online activity tracked by apps for the purpose of targeting ads.\nThis dealt a punishing blow to Facebook and Instagram that depend on super-targeted advertising for revenue.\nMeta last year said Apple's policy, which impacts the precision of the ads it sells and thus their price, would cost the social media giant $10 billion in lost revenue in 2022.\nApple's iPhones hold about 55 percent of the smartphone market in the United States and about one third of smartphone users in Europe, the world's biggest ad markets.\nThe company is also under pressure for making a huge gamble on the metaverse, the world of virtual reality that Meta believes will be the next frontier online.\nThe bet however has yet to pay off with Meta's Reality Labs, the division that builds the necessary VR headsets and software, posting an operating loss of $4.28 billion in the last quarter of 2022. This followed big losses in the previous quarters.\n\"With losses at its VR division mounting, Mark Zuckerberg is going to have to accept an unfortunate reality: Virtual worlds are simply not what businesses or consumers want right now,\" said Insider Intelligence analyst Debra Aho Williamson.\nInvestors last year punished Meta, sending the company's share price down by an astonishing two thirds over 12 months, but the stock has so far recovered some of the ground in 2023.\nIn after-hours trading, Meta's share price was up as much as six percent.\nMore From Markets",
      "snippet": "Targeted advertising <b>Apple</b> sent shockwaves through the industry in 2021 when it began inviting iPhone users to opt out of having their online ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T03:42:51",
      "provider": {
        "name": "gulfnews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imagevars.gulfnews.com/2023/02/02/20230202-facebook_186103cabb1_large.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "gulfnews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://gulfnews.com/business/markets/meta-reports-sales-fall-but-beats-expectations-1.1675309957876"
      }
    },
    {
      "id": "2768788449132993526",
      "title": "Apple set to post rare revenue drop as focus shifts to demand rebound, CIO News, ET CIO",
      "url": "https://cio.economictimes.indiatimes.com/news/corporate-news/apple-set-to-post-rare-revenue-drop-as-focus-shifts-to-demand-rebound/97540026",
      "description": "\"With supply chain challenges largely normalized, we now believe Apple is entering a period of slower demand due to macro factors,\" said Cowen analyst Krish Sankar, adding that he expects 2% fewer iPhone units to be sold in 2023.",
      "body": "Apple Inc\nis expected to report its first decline in quarterly revenue in nearly four years after strict COVID-19 curbs in China rapped the economy and related protests upended iPhone production at its biggest supplier Foxconn.\nInvestors will look for details on how Chief Executive Tim Cook is trying to bolster demand in a weak economy that has prompted mass layoffs in the tech industry, a move Apple has so far avoided thanks to frugal hiring during the pandemic.\n\"With supply chain challenges largely normalized, we now believe Apple is entering a period of slower demand due to macro factors,\" said Cowen analyst Krish Sankar, adding that he expects 2% fewer iPhone units to be sold in 2023.\nThe world's biggest public company is expected to report on Thursday that iPhone sales fell about 5% for the all-important holiday quarter, according to Refinitiv. The last time iPhone sales slipped was in the August-October period in 2020, months into the COVID-19 pandemic.\nGRAPHIC: Apple's iPhone revenue set to fall for the first time since the pandemic Apple's iPhone revenue set to fall for the first time since the pandemic (https://www.reuters.com/graphics/APPLE-RESULTS/xmvjkrkgxpr/chart.png)\nUBS analysts expect iPhone sales to have held up better in the United States than China and Europe, as the economies reeled from the impact of COVID-19 and the Russia-Ukraine war.\nSome demand for the iPhone will likely be pushed into the current quarter after supply restrictions in the first quarter and some demand lost due to lack of product availability in the holiday period, BofA analyst Wamsi Mohan said.\nThe services business, a key growth engine for the company and home to Apple's music and video streaming services, is set to post its lowest revenue growth for the holiday quarter - another fallout of consumers limiting spending.\nTHE CONTEXT\nThe disruption at the world's biggest iPhone plant in Zhengzhou, China triggered a rare warning from Apple in November and limited stocks of its higher-end iPhone 14 models during what is typically its biggest sales quarter, powered by product launches and the holidays.\nGreater China, including Hong Kong, is key to Apple's fortunes, contributing roughly a fifth to annual revenue. The Cupertino, California-based tech behemoth had in 2019 pared its total sales forecast due to an economic slowdown in the country following the Sino-U.S. trade war.\nAnalysts, however, expect a much-faster recovery this time as factories have restarted in China and Apple diversifies its production footprint with plants in India.\n\"Commentary from luxury goods companies indicates China is rebounding quickly, which implies Mar-qtr Chinese iPhone sales should be better than expected,\" Evercore ISI analysts said in a note.\nFollow and connect with us on Twitter, Facebook, Linkedin,",
      "snippet": "\"With supply chain challenges largely normalized, we now believe <b>Apple</b> is entering a period of slower demand due to macro factors,\" said Cowen ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T03:00:00",
      "provider": {
        "name": "indiatimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://etimg.etb2bimg.com/thumb/msid-97540026,imgsize-43232,width-1200,height-628,overlay-etcio/apple-set-to-post-rare-revenue-drop-as-focus-shifts-to-demand-rebound.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indiatimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://cio.economictimes.indiatimes.com/news/corporate-news/apple-set-to-post-rare-revenue-drop-as-focus-shifts-to-demand-rebound/97540026"
      }
    },
    {
      "id": "3418872645723035539",
      "title": "iPhone Owners In South Korea Lose Lawsuit Claiming That Apple Was Slowing Down Devices To Increase Battery Life",
      "url": "https://wccftech.com/korean-iphone-owners-lose-batterygate-lawsuit-to-apple/",
      "description": "iPhone owners in South Korea were unsuccessful in getting a compensation from Apple through a lawsuit over the infamous batterygate issue",
      "body": "Feb 1, 2023 09:56 PM EST\n\nA teardown being performed on an iPhone 6S / Image Credits - iFixit\nApple was caught back in 2017 for\ndeliberately slowing down iPhones\nto increase battery life, but the companys decision continues to haunt it as it was struck lawsuit after lawsuit. Unfortunately, for the consumer, not all court proceedings end up going in their favor and South Korean residents will be highly disappointed with the recent outcome in which they failed to receive any compensation.\nAround 62,000 local customers sought compensation of a little over $10 million in a number of lawsuits against Apple\nThe claim was filed back in 2018 against Apple and its South Korean unit, Apple Korea, according to a report from Yonhap. The lawsuit alleged that the technology giant hid crucial information that the current iPhones would fail to run the latest iOS update at the time. Instead of offering battery replacements or initiating any kind of recall, the report states that Apple informed its customers to download and install the latest update. Instead of seeing improvements, owners of the iPhone 6 and iPhone 7 models complained that their handsets were experiencing severe malfunctions.\nSadly, The Seoul Central District Court ruled against some 9,800 iPhone owners without giving proper reasoning for the verdict while also informing these individuals that they would have to pay for the legal expenses. Similar lawsuits against Apple have been filed in the past, with around 62,000 customers previously seeking monetary compensation that amounted to 12.7 billion won, or $10.4 million.\niPhone owners can now view their battery health and decide if they wish to service their device or not\nEach iPhone owner in South Korea sought an amount of 200,000 won, or $164. Needless to say, a majority of these customers will probably switch to an Android phone as they likely felt that they were stabbed in the back for Apples lack of transparency. Evidence that Apple was slowing down phones came in the form of some benchmark tests performed by an iPhone 6S owner, whose iPhones performance had been severely degraded.\nThe owner swapped out the existing battery with a new cell, and the performance was restored, concluding that Apple was slowing down certain models whose battery capacity had diminished over time. Apple later admitted that it kept this practice a secret from its customers and introduced a Battery Health monitor to better inform customers when they should opt for a service. At least some positive outcome materialized out of this controversy.\nNews Source:",
      "snippet": "... owners in South Korea were unsuccessful in getting a compensation from <b>Apple</b> through a lawsuit over the infamous batterygate issue. Feb 1, 2023 09:56 ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T02:56:06",
      "provider": {
        "name": "wccftech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.wccftech.com/wp-content/uploads/2023/02/iPhone-6S-teardown.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wccftech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://wccftech.com/korean-iphone-owners-lose-batterygate-lawsuit-to-apple/"
      }
    },
    {
      "id": "4826029418615101846",
      "title": "Apple Launches Major League Soccer MLS Season Pass Streaming Service The Hollywood Reporter",
      "url": "https://niuenews1.com/apple-launches-major-league-soccer-mls-season-pass-streaming-service-the-hollywood-reporter/",
      "description": "In its most ambitious push into live sports yet, technology giant Apple on Wednesday officially launched its Major League Soccer subscription service, called",
      "body": "Telegram\nIn its most ambitious push into live sports yet, technology giant Apple on Wednesday officially launched its Major League Soccer subscription service, called MLS Season Pass.\nThe new service will be available in 100 countries at launch, and will be the exclusive home for MLS games through 2033, thanks to a 10-year deal valued at about $250 million per year.\nWhile Apple has explored the sports space before (most notably with its Friday night Major League Baseball games last season), the MLS deal is on a different level, with exclusive global rights to hundreds of matches.\nWith the NBA said to be seeking a digital partner for its upcoming rights talks, and with the NFL keeping a close eye on the space as it evolves, the MLS service is being viewed as a bellwether on its ambitions in the sector.\nFor MLS, the deal also gives it prime real estate and promotional capabilities from one of the most powerful companies in the world.\nFor Apple to come in and literally open up the book and say, alright, how do we make the consumer experience better? Right away, they looked at the schedule and said, okay, Lets fix that,' former New England Revolution star Taylor Twellman, who will be a match Analyst for MLS Season Pass, tells The Hollywood Reporter.\nWith all the games in one place, Apple and MLS shifted the schedule to have every game stream on Saturday nights (and some Wednesday nights) throughout the season to drive consistency.\nIts hard to quantify it because the league has never had it. Weve never had this in the United States in 27 years where the league now literally can be treated the same way that all the other Leagues in the world are treated, Twellman added. I think when you put it all together, Rome wasnt built a day, but I do believe as this year evolves, youre going to start seeing some of that growth, and I think people are going to be really excited, and I think new fans are going to come because the leagues finally being treated differently.\nAnd that scale will be represented in Apples user experience, both in the TV app and in other apps like Apple News, Apple Music, and even Apple Maps. The company is pursuing a seamless experience for its soccer product, a person familiar with the plans says.\nIn the Apple TV app, MLS games and content will be front and center when they are live, with a simple one click to subscribe option for the premium service. In Apple News, a sports Dashboard will let users follow their favorite teams, including MLS teams. A single click in the news app can take users straight to a live game. Even Apple Maps will be adding detail to MLS Stadiums across the country, making them more noticeable within the larger map, and Integrating more information about the teams.\nApple will offer 6 free games per week to Apple TV+ users, with every single game (including the playoffs) included in the premium service, which will live within the Apple TV app and be priced at $14.99 per month or $99.99 per year ($12.99 and $79.99 for existing Apple TV+ subscribers).\nIn addition, the entire slate of opening weekend games will be available for free. Games will also air locally on Fox TV stations, but Apple will have every game with no blackout restrictions.\nThe service will be closely watched by those in the sports space, both on the technical side (can Apple deliver the many simultaneous high-definition Streams and a quality UX?) and on the production side (can the studio and game broadcasters, who will be on site this season, deliver a product of the same quality of other national leagues?).\nAnd if it works, dont be surprised if Apple, and other leagues, pursue similar projects in the future.\nRelated",
      "snippet": "... its most ambitious push into live sports yet, technology giant <b>Apple</b> on Wednesday officially launched its Major League Soccer subscription service, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T02:43:29",
      "provider": {
        "name": "niuenews1",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.hollywoodreporter.com/wp-content/uploads/2023/01/Apple-MLS-Season-Pass-Apple-TV-My-Sports-league-page_print-H-2023.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "niuenews1",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://niuenews1.com/apple-launches-major-league-soccer-mls-season-pass-streaming-service-the-hollywood-reporter/"
      }
    },
    {
      "id": "4117245396693373152",
      "title": "INTERVIEW: Michael Urie Talks Shrinking and Friendship",
      "url": "https://www.themarysue.com/interview-michael-urie-talks-shrinking-and-friendship/",
      "description": "We spoke with Michael Urie for his new show 'Shrinking' on Apple TV+!",
      "body": "\nWhen it comes to comedy shows that will make you cry, Apple TV+ has you covered. And their latest is the show Shrinking from Bill Lawrence and Brett Goldstein that takes us on Jimmys (Jason Segel) healing journey after the death of his wife. But Jimmy would be nowhere without his friends who are ready to help him pick up the pieces (when hell have them).\nOne of those friends is Brian (played by Michael Urie). Brian is Jimmys best friend who hasnt seen him in over a year and while he has his own relationship with his boyfriend, hes still worried about the well-being of his best friend and getting to speak to Michael Urie about the series was a blast!\nWhats really wonderful about this show is that Jasons sort of the nucleus, he said. Jimmys the heart and all the veins that go off to his neighbors or his kid or his patients or his coworkers or his best friend. The lines get blurred and we all kind of know each other. And its all the people in Jasons life and the relationships that they develop around him, which I love. And when I was reading the script, I was like, oh wow, now I just get to have a scene with Harrison and I I can have a scene with Jessica and I know all these people. When I first got the job, I was like, I wonder if Ill only be a side side character that deals with Jimmy since Im his friend and its not like that.\nUrie went on to talk about the ensemble of the show. And it becomes a really wonderful ensemble. And building the relationship, specifically the relationship with Jimmy and Brian knowing theyre best friends, but they havent talked to each other for a year. And Jimmy is a different person now. It kind of made for a wonderful rebirth of the friendship. And we were able to kind of build it from the beginning and we would occasionally talk about like what do you think we were like before? Because the characters went to college together. So like what do you think the characters were like in college? What was this transition like? What was that transition like? And, it was great. It was a really great acting exercise to be like 1, 2, 3 best friends, but best friends whove been estranged.\nThe benefits of an ensemble\nTalking about how the show is an ensemble piece and reminds me a bit like theatre in how these characters interact with each other, I asked Urie about whether or not he preferred ensemble pieces to things where he is part of a larger story but might not work with everyone. For Urie though, he loves the ensemble work hes doing on Shrinking.\nI was on tons of episodes of The Good Wife and The Good Fight and I never met anyone that was on that show. Because I was always like in a different storyline. I mean, I met them at the wrap party, but I never got to work with Christine Baranski or Juliana Margoles. And I was always sort of bummed by it. I was like, God, Im sort of sequestered my own little world. But on a show like Shrinking or when we did Ugly Betty, you have these different characters. No two characters that are alike, which is so great. And you could have any combo and something fun would happen. And there was no character on Ugly Betty that I never worked with.\nHe went on, talking about how the characters all work together. At some point they put all the characters together and figured out what that was. What does this chemical mixture produce and Shrinking is like that too. You put two characters together, who have Jimmy in common, and what will happen. And, I got in trouble once for saying, it writes itself. A writer got mad at me for saying it writes itself. Of course it doesnt write itself. Somebody writes it. But when you put two characters together, theres inspiration that comes and it can be really exciting. And I love that about the show. I love that my character can have a scene with Harrison Ford or with Jessica Williams, even though my friend is Jimmy. Its really special. And I think whats great about it is you dont have to see the big intros. You dont need it, this shows so good about picking up mid scene or picking up in mid relationship. Its not all about showing your homework kind of, or a bunch of exposition. It really asks the audience to join us where we are. And I love that. I think thats great. I love that when Im watching TV and I think audiences love that too. \n_____________________\nShrinking airs on Apple TV+.\n(Featured image: Apple TV+)",
      "snippet": "... spoke with Michael Urie for his new show 'Shrinking' on <b>Apple</b> TV+!. When it comes to comedy shows that will make you cry, <b>Apple</b> TV+ has you covered.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T01:56:05",
      "provider": {
        "name": "themarysue",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.themarysue.com/wp-content/uploads/2023/02/michael-urie-in-shrinking.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarysue",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarysue.com/interview-michael-urie-talks-shrinking-and-friendship/"
      }
    },
    {
      "id": "4734499177254056429",
      "title": "Biden seeks app store competition",
      "url": "https://www.arkansasonline.com/news/2023/feb/02/biden-seeks-app-store-competition/",
      "description": "The Biden administration is taking aim at Apple and Google for operating mobile app stores that it says stifle competition.",
      "body": "Biden seeks app store competition\nReport: Consumers, developers hurt by current market\nbyFATIMA HUSSEIN The Associated Press|Today at 1:50 a.m.\nCustomers shop in an Apple store in Pittsburgh on Monday.(AP/Gene J. Puskar)\nWASHINGTON -- The Biden administration is taking aim at Apple and Google for operating mobile app stores that it says stifle competition.\nThe finding was contained in a Commerce Department report released Wednesday as President Joe Biden convened his competition council for an update on efforts to promote competition and lower prices.\n\"You've heard me say capitalism without competition isn't capitalism,\" Biden said Wednesday before convening the meeting. \"It is just simply exploitation.\"\nThe report from the Commerce Department's National Telecommunications and Information Administration says the current app store model -- dominated by Apple and Google -- is \"harmful to consumers and developers\" by inflating prices and reducing innovation. The companies have a stranglehold on the market that squelches competition, the report adds.\n\"The policies that Apple and Google have in place in their own mobile app stores have created unnecessary barriers and costs for app developers, ranging from fees for access to functional restrictions that favor some apps over others\" the report said.\nIn a January op-ed in The Wall Street Journal, Biden called on Democrats and Republicans to rein in large tech firms without mentioning by name Cupertino, Calif.-based Apple Inc. and Mountain View, Calif.-based Google LLC, owned by Alphabet Inc.\n\"When tech platforms get big enough, many find ways to promote their own products while excluding or disadvantaging competitors -- or charge competitors a fortune to sell on their platform,\" Biden said. \"My vision for our economy is one in which everyone -- small and midsized businesses, mom-and-pop shops, entrepreneurs -- can compete on a level playing field with the biggest companies.\"\nA representative from Apple told The Associated Press that \"we respectfully disagree with a number of conclusions reached in the report, which ignore the investments we make in innovation, privacy and security -- all of which contribute to why users love iPhone and create a level playing field for small developers to compete on a safe and trusted platform.\"\nA Google spokesperson said the firm also disagrees with the finding, namely \"how this report characterizes Android, which enables more choice and competition than any other mobile operating system.\"\nA legal battle over app store dominance is already playing out in the courts.\nApple has defended the area surrounding its iPhone app store, known as a walled garden, as an indispensable feature prized by consumers who want the best protection available for their personal information. The company has said it faces significant competition from various alternatives to video games on its iPhones. And Google has long defended itself against claims of holding a monopoly.\nThe Commerce report said \"new legislation and additional antitrust enforcement actions are likely necessary\" to boost competition in the app ecosystem.\nAlan Davidson, who leads the National Telecommunications and Information Administration, told reporters Wednesday the report \"identifies where legislation would be needed to address some of these issues.\"\nBiden said his administration will work with state and local officials to identify ways to crack down on junk fees in their jurisdictions. He also called on Congress to pass the Junk Fee Protection Act, which targets hidden fees in the entertainment, travel and hospitality industries.\nMeanwhile, the White House said the Consumer Financial Protection Bureau will move forward with a proposed rule to limit credit card late fees, which the bureau estimates would save consumers roughly $9 billion annually in late fees.\nRohit Chopra, the bureau's director, said the rule is projected to reduce typical late fees from about $30 to $8 for missed payments and could go into effect in 2024.\n\"Historically, credit card companies charged relatively small penalty amounts for missed payments, but once they discovered that these fees could be a source of easy profits, late fees shot up with a surge occurring in the 2000s,\" Chopra said. \"And in recent years, these late fees have surged to as much as $41 for a missed payment. These fees add up, with consumers being hit with $12 billion a year in late fees in addition to the billions of dollars in interest they're paying.\"\nPrint Headline: Biden seeks app store competition\nADVERTISEMENT",
      "snippet": "The Biden administration is taking aim at <b>Apple</b> and Google for operating mobile app stores that it says stifle competition. Biden seeks app store ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T01:50:00",
      "provider": {
        "name": "arkansasonline",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://wehco.media.clients.ellingtoncms.com/img/photos/2023/02/01/1D1Apps0202_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "arkansasonline",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.arkansasonline.com/news/2023/feb/02/biden-seeks-app-store-competition/"
      }
    },
    {
      "id": "4253194358760478463",
      "title": "20 foods that have almost zero calories",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/web-stories/20-foods-that-have-almost-zero-calories/photostory/97530759.cms",
      "description": "If you're on a weight loss diet or you want to limit your calorie intake, include these 20 foods in your meals.",
      "body": "20 foods that have almost zero calories\nShifa Khan\nRaspberries\nOnly 64 calories and 8 grams of fibre are found in one cup of raspberries. Consequently, raspberries are a low-calorie, satisfying food. Furthermore, its natural sweetness could aid in satisfying your sweet tooth.\nGetty Images\nApples\nApples are a fantastic source of fibre and have few calories, so they help you feel full. This fruit is loved by people who stick to their diet plans.\nGetty Images\nBeetroot\nA 100-gram serving of beetroot that is high in antioxidants such as betalains has only 43 calories. Additionally, it is an excellent source of nutrients that might aid with weight loss.\nGetty Images\nApricots\nApricots are a great low-calorie addition to your weight loss diet because they only have 48 calories per 100 grams.\nGetty Images\nCauliflower\nCauliflower is a great choice for weight loss because it only has about 27 calories and 5 grams of carbohydrates in one serving.\nGetty Images\nStrawberries\nStrawberries are a fantastic complement to a diet plan for losing weight. They are low in calories, nutrient-dense, and a fantastic source of fiber and other crucial elements.\nGetty Images\nBroccoli\nThe ability of broccoli to aid in weight loss is one of its key advantages. It contains a lot of fibre and other necessary nutrients while having little calories. Thus, it meets the criteria for the ideal weight-loss food.\nGetty Images\nCelery\nCelery can also be a wise addition to any weight-loss strategy because it only has 7 calories, 1/2 gram of fibre, and less than 1 gram of sugar per rib.\nGetty Images\nWatercress\nIncluding this nutrient-dense, low-calorie vegetable in your diet is definitely worthwhile if you're trying to lose weight.\nGetty Images\nCucumber\nCucumbers have a high water content, have few calories, and can be used as a low-calorie garnish on a variety of foods. These are potential weight loss foods.\nGetty Images\nLeeks\nLeeks are fat-free, high in fibre, and low in calories. They're excellent if you're on a diet, especially when you consider the satiety they also offer.\nGetty Images\nOnions\nA medium onion contains only 44 calories but is also a significant source of fibre, vitamins, and minerals. Vitamin C, a nutrient important for tissue healing, and iron absorption, is particularly abundant in this vegetable.\nGetty Images\nTurnip\nTurnips are low-calorie, non-starchy, and have a low glycemic index, therefore they have no impact on blood sugar levels when consumed. These traits support a healthy weight.\nGetty Images\nWatermelon\nIt's one of the greatest fruits to consume if you're attempting to lose weight because 90% of its weight is made up of water and has only 30 calories in 100 grams serving. Additionally, arginine, an amino acid present in watermelon, helps to burn fat quickly.\nGetty Images",
      "snippet": "If you're on a weight loss diet or you want to limit your calorie intake, include these 20 foods in your meals.\n20 foods that have almost zero calories Shifa Khan Raspberries Only 64 calories and 8 grams of fibre are found in one cup of raspberries.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T01:30:00",
      "provider": {
        "name": "indiatimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.toiimg.com/thumb/msid-97531035,width-900,height-1200,imgsize-1612752,resizemode-6.cms",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indiatimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://timesofindia.indiatimes.com/life-style/health-fitness/web-stories/20-foods-that-have-almost-zero-calories/photostory/97530759.cms"
      }
    },
    {
      "id": "4594773367574892850",
      "title": "iOS 16.3 lets users add lock screen widgets to a classic wallpaper",
      "url": "https://9to5mac.com/2023/02/01/ios-16-3-lock-screen-widgets-classic-wallpaper/",
      "description": "With iOS 16, Apple introduced a new lock screen for the iPhone that lets users customize it with different widgets, font styles, and even multiple wallpapers. However, the update removed classic iPhone wallpapers, and users who still had one of them before installing the update were unable to customize it. But that has changed with []",
      "body": "Reddit\nWith iOS 16, Apple introduced a new lock screen for the iPhone that lets users customize it with different widgets, font styles, and even multiple wallpapers. However, the update removed classic iPhone wallpapers, and users who still had one of them before installing the update were unable to customize it. But that has changed with iOS 16.3.\nCustomize your iPhone lock screen with a classic iOS wallpaper\nAlthough Apple doesnt mention it in the release notes for iOS 16.3, the latest update to the iPhone operating system lets users add widgets to a classic wallpaper, but only if you still have it. You can also change the font style.\nPreviously, when the user tried to customize the lock screen with a classic wallpaper that came with a version prior to iOS 16, the system would warn that the lock screen couldnt be customized and the user would have to choose a new wallpaper. With this change, iOS asks the user if they want to add a new wallpaper or customize the current one.\nHeres what the message says:\nCustomize Current Lock Screen\nCustomizing the current Lock Screen replaces the current Home Screen wallpaper. Adding a new wallpaper keeps the current wallpaper and creates an additional one.\nUnfortunately, Apple still doesnt give users the option to choose from other classic wallpapers with iOS 16. And if you remove your classic wallpaper, it can no longer be added back. Due to the new lock screen, which has animations and images that interact with the clock and widgets, the iOS 16 wallpapers are no longer static images. Instead, they are rendered in real time.\nBut if you want to download these classic wallpapers from older iOS versions to your device, we still have the image files available here:",
      "snippet": "With iOS 16, <b>Apple</b> introduced a new lock screen for the iPhone that lets users customize it with different widgets, font styles, and even multiple ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T01:08:40",
      "provider": {
        "name": "9to5mac",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/02/iOS-16.3-classic-wallpaper-lockscreen.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "9to5mac",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://9to5mac.com/2023/02/01/ios-16-3-lock-screen-widgets-classic-wallpaper/"
      }
    },
    {
      "id": "5888774916804211934",
      "title": "Mac Mini 2023: the most exciting of Apples new computers",
      "url": "https://www.smh.com.au/technology/why-the-mac-mini-is-apple-s-most-exciting-new-computer-20230201-p5ch6z.html",
      "description": "Apples smallest desktop Mac has been given a new lease on life with powerful new internals, and a price drop.",
      "body": "to save articles for later.\nNormal text size\nVery large text size\nAdvertisement\nThe humble Mac Mini is getting a new lease on life this week, standing out among the handful of Apple devices the tech giant is now launching with its powerful M2 chip.\nThis new 20 cm by 20 cm square unit fits neatly into whats been a bothersome gap in Apples computer lineup for years. Folks who wanted to use a Mac at home have previously gone for an all-in-one iMac or connected a MacBook to a bunch of peripherals.\nThe Mac Mini was there, but was overpriced and underpowered compared to the laptops. Last year, the company introduced the Mac Studio, which upped the power but also the price and size.\nPair the Mac Mini with Apples own display and accessories, or whichever ones suit your needs.\nWith the new Mac Mini, you can get what is essentially last years $1900 MacBook Air, in a tiny desktop format, for $1000. That makes it the least expensive current Mac you can get, to which you can add whatever keyboard, mouse and display you want, for a powerful and adaptable workstation.\nThat $1000 models M2 chip is more than enough for media and office tasks, plus light gaming, and makes for very snappy apps and browsing. Theres 8GB of RAM, a 256GB SSD, Gigabit Ethernet, two USB-A ports, two USB-C with Thunderbolt 4, HDMI 2.0 and a headphone jack. Its an impressive computer for the price, able to drive two high-resolution displays, and the USB-C ports are great for making a neat desktop setup.\nOf course, you can always pay more for greater capabilities, and with the Mini that includes upgrading to an M2 Pro machine with two extra Thunderbolt ports, much more powerful processing and graphics capabilities, HDMI 2.1, more RAM and faster Ethernet.\nIve been testing out an absolutely maxed out model that would cost around $3500, with a 19-core GPU and 32GB of RAM, and while its more hardcore than most users would need its brilliant to have as an option. It easily drives multiple high frame rate displays, gave me performance well in excess of 60 frames per second at 1440p in every game I tested, and didnt even spin up its cooling fans unless I was rendering multiple 4K video assets at the same time.\nLoading\nIve also been testing Apples fanciest Mac of early 2023; the new 16-inch MacBook Pro, which optionally comes with an M2 Max rocking 38 GPU cores and up to 96GB of RAM. None of thats even an option on the Mac Mini, and thats totally fine. The MacBook Pro is a huge, heavy, beautiful $7000 laptop thats likely a godsend for a very specific cohort of creative professionals, enabling feats of processing and rendering on battery power that just a few years ago would have required a computer the size of a table and serious cooling. The Minis strengths lie elsewhere.\nAs long as you dont need portability, the Mini is the ideal Mac to have at home, with specs that (finally) dont feel like a compromise and the ability to fully customise your setup with the peripherals of your choosing. The starting price of $1000 feels right as an entry point into the Mac ecosystem, especially considering the previous less powerful Mini cost more. And the upgrade to the M2 Pro model, which starts at $2000, provides a great option for all but the most demanding creatives to put at the heart of their setups.\nGet news and reviews on technology, gadgets and gaming in our Technology newsletter every Friday.",
      "snippet": "... is getting a new lease on life this week, standing out among the handful of <b>Apple</b> devices the tech giant is now launching with its powerful M2 chip.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T01:04:42",
      "provider": {
        "name": "smh",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.ffx.io/images/$zoom_0.4416%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_analysis_no_age_social_wm/b0fa995c2fcda27c02840a7406b190007f2643b8",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "smh",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.smh.com.au/technology/why-the-mac-mini-is-apple-s-most-exciting-new-computer-20230201-p5ch6z.html"
      }
    },
    {
      "id": "3332275430136917193",
      "title": "Shrinking review: Jason Segel is the ultimate sad therapist",
      "url": "https://www.deseret.com/entertainment/2023/2/1/23545494/jason-segel-shrinking-review",
      "description": "Ive always had a lot of issues with anxiety and depression and sought help when I needed it, and its why Im still here, he told the Deseret News",
      "body": "A poster of Shrinking.\nApple TV+\nTo Jason Segal, the entire process of creating a show from scratch feels like a rafting trip. You draw a map, plan for the weather, and get your gear from REI, but nothing can really prepare you for whats to come.\nThis moment happens, where you get in the river, and you realize the rivers in charge. Thats what making a show is like, he said of his latest series Shrinking in an interview with the Deseret News.\nTwo of the shows co-creators, Brett Goldstein and Bill Lawrence, worked intimately on Ted Lasso, a two-season hit that earned a handful of Emmys and a Golden Globe, too. Segel joined them as a writer, creating a relatable comedy that isnt afraid to tackle mental health.\nThe 10-episode series isnt like his other, more cheerful, work, like Forgetting Sarah Marshall. He plays a widowed therapist, putting his sad eyes to good use while starring opposite Indiana Jones actor Harrison Ford, a solemn shrink.\nThe first three episodes debuted on Apple TV+ on Jan. 27 and follow Jimmy (Segel), who lost his wife and is trying to cope while being a dad, friend and therapist. He decides to try a new approach  ignoring his training and ethics  by being brutally honest.\nUnorthodox therapy\nAn opening montage in Episode 1 reveals a bunch of Jimmys patients. Grace, who is one of them, is sitting on the couch, and venting about her boyfriend when Jimmy, still drunk and disheveled from last night, breaks.\nWeve been doing this for two years  two years of your life, he exclaims while standing up.\nAnd you keep telling me how great it is. Well, I saw him. Hes not that great. His muscles are too big, his shirts are too tight  no one likes that, its gross, he claims.\nThe blonde woman is especially startled when Jimmy tells her that her partner is emotionally abusive and that she should leave him, or he will dump her as her therapist. But alas, therapy is more complicated, and the creators of the show understand that.\nJason Segel and Luke Tennie in Shrinking.\nApple TV+\nIts not generally one and done. And this is a process and even with his new radical method of therapy ... he doesnt say that this is a solution, explained Segel. The truth, though, can clear room for the real work.\nJimmy replaces the typical procedure  How does that make you feel?  by getting personal. Consider the way he helps Sean (Luke Tennie), a former soldier, by taking him to an MMA sparring gym to help him cope with his anger issues.\nThe first four episodes, which were available for review, create a sense of trust between the two, but whether it pans out in therapy is unclear for now.\nGetting Harrison Ford on board\nCreatorsSegel, Goldstein and Lawrence didnt think the veteran actor would take on the role of Paul, the serious but secretly loving therapist.\nYou offer something to Harrison Ford, knowing that hes gonna say no, Segel said, noting that it was still brag-worthy.\nBut then he said yes. Its like youve asked the prettiest girl in school to prom. And somehow she said yes, he said. And then youre like, panicked. What am I going to wear? Where do I take them to dinner? Oh, no, I dont even really know how to dance.\nHarrison Ford in Shrinking.\nApple TV+\nMeanwhile, Goldstein, who wrote and acted in Ted Lasso, told The Hollywood Reporter that the cast and crew incessantly asked how they landed Ford.\nThe moment the star arrived on set, he tried to break through any sense of awe that might be in the room and treats everybody like a peer, Segel said.\nThe Star Wars alum anchors Segels erraticness and supplies a voice of reason with stoicism, easily becoming my favorite on the show. When Jimmy tells Paul of his new approach to therapy, the principled shrink, whos in the early stages of Parkinsons, shuts it down fast.\nGreat idea. We just rob them of their autonomy to help themselves, right? he says in Episode 1. Then we become what? Psychological vigilantes? Count on Ford to relax into his role as the chief of the practice.\nShrinking is darker than Ted Lasso\nPaul is Jimmys anchor and Alice, his daughter played by Lukita Maxwell, is his entire heart. While dealing with grief, Jimmy abandons his responsibilities as a dad, burdening the teenager, who gives him a morning aspirin after his night of partying and gets her own ride to school.\nStepping into Jimmys shoes was a really special journey for Segel, teaching him the characters struggles of being a good dad. Meanwhile, Christa Miller plays Liz, whos like a mother to Alice, a dynamic that works well on-screen.\nShe is a master at comedy and she has been doing it a long time, Segel said of working with her and sharing a vocabulary for humor.\nFans of Cougar Town will see the actress playing a nosy neighbor again but with more dramatic flare as Jimmy and Liz negotiate who gets to take care of the struggling teen.\nRelated\nOpinion: Ted Lasso, Americas therapist\nHow Ted Lasso honored the U.S. team ahead of World Cup\nThe moving scenes fit right into the dark space of grief and loss and trauma that Jimmys character exists in, Goldstein told the Deseret News prior to the shows release. The tone is a departure from the open and loving story of Ted Lasso, an American football coach teaching soccer in the U.K.\nShrinking is sort of a much more intimate show. Its set in this little community of neighbors, work colleagues and a family ... just three or four streets. And thats it, Goldstein said. The starkest difference is that Jimmy begins in a place of self-destruction. And it seems the 43-year-old is the perfect guy to play the part.\nJason Segel: The ultimate sad therapist\nFor the comedy actor, Jimmy was within his comfort zone, allowing him to easily put on the resting-dead-wife face, as he says in the show.\nIve always had a lot of issues with anxiety and depression and sought help when I needed it, and its why Im still here, Segel said.\nJason Segel in Shrinking.\nApple TV+\nIm sad a lot of the time, he joked. Ive never worn life very lightly. Its worked out great for me because its made me want to write and make made me want to express things. I have some sense that Im not alone in that.\nHe got his big break in 1999 when he got cast in Judd Apatows well-regarded seriesFreaks and Geeks, and found more fame through How I Met Your Mother and The Muppets, which he also wrote.\nSo, when I write something, I really write from a place that starts with this belief that were all probably having a hard time figuring out what the point of any of this is, he said, smiling. And maybe theres some fun in figuring it out together.\nThe show is rated TV-MA for some sexual references, violence and gore, multiple uses of profanity, and some crude humor.\nNext Up In                    Entertainment",
      "snippet": "<b>Apple</b> TV+ To Jason Segal, the entire process of creating a show from scratch feels like a rafting trip. You draw a map, plan for the weather, and get ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T01:00:00",
      "provider": {
        "name": "deseret",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://deseret.brightspotcdn.com/dims4/default/4b25a79/2147483647/strip/true/crop/2000x1142+0+587/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FFbhTonhyUpGnlubaY4PRO-kJwyw%3D%2F0x581%3A2000x3000%2F2000x2419%2Ffilters%3Afocal%28991x1739%3A992x1740%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F24402256%2FATV_Shrinking_key_art_2x3.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "deseret",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.deseret.com/entertainment/2023/2/1/23545494/jason-segel-shrinking-review"
      }
    },
    {
      "id": "1533503732353469712",
      "title": "Apple embraces potential of sports streaming with MLS deal",
      "url": "https://www.taiwannews.com.tw/en/news/4797507",
      "description": "Apple embraces potential of sports streaming with MLS deal | 2023-02-02 00:35:31",
      "body": "JOE REEDY , AP Sports Writer, Associated Press\n2023/02/02 00:35\nApple senior vice president of services Eddy Cue, right, speaks next to Major League Soccer Commissioner Don Garber during a MLS Season Pass and Apple...\nApple senior vice president of services Eddy Cue, right, speaks next to Major League Soccer Commissioner Don Garber during a MLS Season Pass and Apple TV talent announcement at MLS soccer media day in San Jose, Calif., Tuesday, Jan. 10, 2023. (AP Photo/Jeff Chiu)\nApple senior vice president of services Eddy Cue, middle, jumps toward a soccer ball next to Major League Soccer Commissioner Don Garber, middle right...\nApple senior vice president of services Eddy Cue, middle, jumps toward a soccer ball next to Major League Soccer Commissioner Don Garber, middle right, during a MLS Season Pass and Apple TV talent announcement at MLS soccer media day in San Jose, Calif., Tuesday, Jan. 10, 2023. (AP Photo/Jeff Chiu)\nFILE - Apple CEO Tim Cook speaks in front of the new Taiwan Semiconductor Manufacturing Company facility under construction in Phoenix, Tuesday, Dec. ...\nFILE - Apple CEO Tim Cook speaks in front of the new Taiwan Semiconductor Manufacturing Company facility under construction in Phoenix, Tuesday, Dec. 6, 2022.  Cook will take a more than 40% pay cut this year from a year earlier as the company adjusts how it calculates his compensation. Apple Inc. said in a regulatory filing that Cooks target total compensation is $49 million for 2023.   (AP Photo/Ross D. Franklin, File)\nCUPERTINO, Calif. (AP)  After taking its first dip into sports streaming last year, Apple is now immersing itself.\nThe tech giant kicked off a 10-year partnership with Major League Soccer on Wednesday with the launch of Season Pass on Apple TV+.\n\"This is very important for us. It is one of the key things we are doing this year and for the next 10 years. Were now part of a family together, Apple CEO Tim Cook said during a presentation for MLS players, owners and media at Apple Park last month.\nThe Apple launch comes after a transformative year for sports and streaming services. The NFL further embraced streaming last year as Prime Video carried Thursday Night Football and Major League Baseball partnered with Apple TV and Peacock to stream games. The NFL also reached an agreement with Googles YouTube TV to carry the Sunday Ticket package beginning next season.\nTech companies and broadcast outlets likewise see the value of live sports programming. According to a recent report by Parks Associates, revenue from sports streaming subscription packages is expected to increase 73% to $22.6 billion in 2027 after generating $13.1 billion last year.\nIn the era of cord cutting, tech companies, advertisers and sports leagues are also finding that younger viewers continue to migrate toward streaming and are watching for extended periods.\nAccording to Amazon tracking data, 22% of Thursday Night Football viewers on Prime Video were in the coveted 18-34 age demographic, compared with 14% of viewers watching NFL games on linear networks.\nThe average viewing time for Thursday Night games was 85 minutes  nine minutes longer than games not on Prime.\nApple teaming with MLS makes sense for both parties. Various studies have found that soccer fans are more likely to watch sports on streaming devices or recorded TV.\nThis is a deal that expresses where things have been headed for a while and pushes them forward as well, said Daniel Kirschner, the cofounder and CEO of Greenfly, a digital media distribution platform that works with over 30 leagues.\nMLS will receive at least $250 million per season from Apple. The league averaged $90 million per season under its previous eight-year agreements with Fox, ESPN and Univision.\nApple has made previous forays into sports streaming, but this is its first significant involvement with a league. MLB aired two games on Apple TV+ on Friday nights last year, including the game where St. Louis Albert Pujols became the fourth player in baseball history to reach 700 career home runs.\nThis deal could signal where sports streaming and league media rights are headed.\nApple and MLS are teaming up for a direct-to-consumer product that will allow fans to watch every game without local blackouts or restrictions and that reaches beyond North America. Fans in London, Paris and wherever the Apple TV app is available will be able to see the games as well.\nWeve looked at sports and acknowledged that theres never been a better time to be a sports fan, and theres also never been a worse time to be a sports fan, said Eddy Cue, Apples senior vice president of services. We have an opportunity with this partnership to make the experience a lot better for fans, and help grow the sport and the league in the US and beyond.\nMLS is taking over the production of all its matches, similar to how European soccer leagues do business. But the other leagues, such as the Premier League and Germanys Bundesliga, then sell their rights to broadcast outlets in each country. In this case, only one outlet  Apple  has worldwide rights.\nEven games on Fox in the United States, TSN and RDS in Canada and TelevisaUnivision will be on the Apple TV+ app.\nI think they were the right league to recognize that the long-term value of their rights is best situated with a streaming partner or a technology partner, as opposed to the traditional leagues that sill need big billions of dollars of payments from traditional networks, said Jon Cohen, senior vice president at Frequency, which provides software for ad-supported streaming channels. I think its the right time for both to do this.\nWhile Apple TV+ has had success as the first streaming service to receive an Oscar for Best Picture with CODA last year and Ted Lasso won back-to-back Emmys for Best Comedy, it is not turning into an entertainment company or studio. It remains a diversified company.\nSports drives a lot of engagement in terms of media. I think it shows that they have a very specific strategy with respect to growing their subscription and video services, Cohen said.\nMLS and Apples progress will be watched closely by other leagues. While the NFL, NHL and baseball have wrapped up rights deals the past two years, the NBA is expected to have some streaming component when it begins negotiations on its media rights this year.\nCue and Cook acknowledge there will be growing pains during the first year, especially with MLS getting up to speed with its own production company. Everyone, though, is focused on the potential of the project and the road ahead.\nPeople are going to say we are the smartest guys in the room or we were a couple of years too early, MLS Commissioner Don Garber said. The opportunities are endless, but it is an undertaking with many tests.\n___",
      "snippet": "<b>Apple</b> embraces potential of sports ... Writer, Associated Press 2023/02/02 00:35 <b>Apple</b> senior vice president of services ... a MLS Season Pass and <b>Apple</b>.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:35:31",
      "provider": {
        "name": "taiwannews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://tnimage.s3.hicloud.net.tw/photos/2023/AP/20230111/8daf743d9d0f4b54a77f17525a9e32f6.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "taiwannews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.taiwannews.com.tw/en/news/4797507"
      }
    },
    {
      "id": "6592960205579650002",
      "title": "Early impressions of Apples MLS Season Pass",
      "url": "https://www.sounderatheart.com/2023/2/1/23582124/early-impressions-apple-tv-mls-season-pass",
      "description": "The new streaming service officially debuted on Wednesday.",
      "body": "Flipboard\nEmail\nAfter much hype, Apple finally debuted MLS Season Pass on Wednesday. The digital streaming service will carry every teams regular-season, playoff and Leagues Cup matches for the next 10 years at least. While games are still almost a month away, this was the first chance for fans and media to get a closer look at the service.\nRelated\nHeres some of what we learned:\nMLS is front and center\nAs soon as you go to AppleTV, its impossible to miss the new service. Its prominently featured just about everywhere you scroll on the page from the top tabs to farther down the page. Im sure that will change as the season progresses, but it seems to be a good sign that Apple is promoting it. I also liked that at least on Apple and Roku devices it all loaded very quickly and came through with high-quality video.\nEase of starting the service\nIn addition to unveiling the service, season-ticket holders were also given codes to activate their accounts. Having gone through the process myself, I imagine there were some frustrations, even if most were relatively easy to navigate. I was forced to update my iOS in order to redeem the code, which took about 15 minutes all in. An Apple rep assured me that anyone with a web-connected device could redeem the code, even if they couldnt run the native app.\nThe trickier part will be in sharing access. Since redemption codes were given out per account  not per seat  I imagine the sharing feature will be widely used, but will also be a source of frustration. Apple allows users to share access to this service with up to five other people as long as they have an Apple ID, but youll also need to make them part of your \n plan. It also appears as though you can only add people to your plan while using an Apple device. Not ideal.\nTheres already a ton of content\nJust looking at the Sounders page, there are about a dozen features as well as countless clips of goals and highlights. I couldnt quite figure out how to do it now, but eventually, youll apparently be able to watch match replays all the way back to 2019. Although the quality and length of the Club Profiles range pretty wildly  some are as short as 90 seconds while\n that focused on the Sounders efforts to become carbon neutral. The features for each team should be updated frequently throughout the year.\nMost, if not all, of this content is free to everyone with an AppleID.\nOutside the paywall\nApple confirmed that there will actually be quite a lot of content available outside of the paywall. Most notably, six games every week will be available for anyone who creates a free Apple ID. Thats 40% of games. While thats not quite as good as prior years for fans of teams who broadcast most of their matches over-the-air, thats considerably more games than were nationally televised in the past. My suspicion is it should be more than enough to give casual fans an entry point.\nIn This Stream",
      "snippet": "Flipboard Email After much hype, <b>Apple</b> finally debuted MLS Season Pass on Wednesday. The digital streaming service will carry every teams ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:23:49",
      "provider": {
        "name": "sounderatheart",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/mCBioAx9AYnqoqEX6_4SiNUj06A=/0x0:2416x1265/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24402726/Screenshot_2023_02_01_at_10.24.32_AM.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sounderatheart",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sounderatheart.com/2023/2/1/23582124/early-impressions-apple-tv-mls-season-pass"
      }
    },
    {
      "id": "4204729304390928540",
      "title": "Nike plans new store at Bridgeport Village, planning documents show",
      "url": "https://www.oregonlive.com/business/2023/02/nike-plans-new-store-at-bridgeport-village-planning-documents-show.html",
      "description": "The sneaker company plans to open in a space formerly occupied by Apple.",
      "body": "Kristine de Leon | The Oregonian/OregonLive\nNike may soon open a new store in Bridgeport Village, city planning documents suggest.\nThe Portland Business Journal first reported this week that Nike will open in a space formerly occupied by Apple, which moved to another area of the shopping center. The publication indicated that signage posted outside the storefront says Nike by Bridgeport is coming soon.\nAccording to planning documents submitted to the city of Tualatin last spring, the Beaverton-based sneaker company will develop a 5,940-square-foot space at the outdoor shopping center.\nLinda Reidman, a spokesperson for Bridgeport Village, said Nike has put up a banner at the proposed store location and that the public is aware that a Nike store is coming. However, she said the footwear and apparel company has not shared a timeline with the shopping center and that no other information was currently available.\nNike did not respond to an email request for comment.\nThe plans for a new store raises more questions about the future of the Nike stores in downtown and Northeast Portland, following the companys abrupt closure of its downtown Seattle store last month.\nThe shoe company didnt offer a reason for closing the Seattle store after more than two decades, but it comes as the company is shifting its retail strategy with more focus on direct-to-consumer sales, both at physical locations and online. Meanwhile, its opening a new store in Bellevue, an affluent Seattle suburb.\nThe companys oldest factory store, located on Northeast Martin Luther King Boulevard in Portland, has been mostly closed to the public for several months.\nIts unclear whether the closure is temporary or permanent. Nike has not answered repeated requests for comment about the stores status.\n--Kristine de Leon, kdeleon@oregonian.com\nIf you purchase a product or register for an account through one of the links on our site, we may receive compensation.\nDisclaimer",
      "snippet": "The sneaker company plans to open in a space formerly occupied by <b>Apple</b>.\nKristine de Leon, kdeleon@oregonian.com If you purchase a product or register for an account through one of the links on our site, we may receive compensation.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:05:13.839",
      "provider": {
        "name": "oregonlive",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.oregonlive.com/resizer/xZ1nPF5SZjTsGMjj5EKR8YKw2Q4=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/6IRQ4HMBTNGNXDAAMIF2MFWO3U.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "oregonlive",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.oregonlive.com/business/2023/02/nike-plans-new-store-at-bridgeport-village-planning-documents-show.html"
      }
    },
    {
      "id": "5660338111894954831",
      "title": "iPhone 15 Mac Pro and iPad rumors are running wild: Macworld Podcast",
      "url": "https://www.macworld.com/article/1488050/iphone-15-mac-pro-ipad-rumors.html",
      "description": "The rumors about Apple products are running wild, and we talk about what to believe and what to ignore in this episode of the Macworld Podcast!",
      "body": "FEB 2, 2023 12:30 am PST\nImage: Foundry\nJanuary ended with a flurry of rumors about Apple products. And it wasnt just about Apples reality headset, which we covered in episode 823. The rumor mill is churning out speculation about just about every product in Apples lineup, so we thought wed go over some of them in this episode of the Macworld Podcast!\nThis is episode 826 with Jason Cross, Michael Simon, and Roman Loyola.\nListen to episode 826 on Apple Podcasts\nListen to episode 826 on Spotify\nGet info",
      "snippet": "The rumors about <b>Apple</b> products are running wild, and we talk about what ... Image: Foundry January ended with a flurry of rumors about <b>Apple</b> products.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "macworld",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.macworld.com/wp-content/uploads/2023/02/iphone-ipad-mac-pro.jpg?quality=50&amp;strip=all&amp;w=1024",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "macworld",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.macworld.com/article/1488050/iphone-15-mac-pro-ipad-rumors.html"
      }
    },
    {
      "id": "506307649588205052",
      "title": "Apple Q1 23 Earnings Conference Call At 5:00 PM ET",
      "url": "https://www.nasdaq.com/articles/apple-q1-23-earnings-conference-call-at-5:00-pm-et",
      "description": "(RTTNews) - Apple Inc. (AAPL) will host a conference call at 5:00 PM ET on February 2, 2023, to discuss Q1 23 earnings results.",
      "body": "Markets\nRTTNews\nFounded in the late 1990s by Andrew Mariathasan in New York, with the goal of covering Wall Street for a new generation of investors, RTTNews has expanded steadily over the years to become a trusted provider of content for a wide array of subjects across several platforms. RTT's Financial Newswire is relied upon by some of the world's largest financial institutions, including banks, brokerages, trading platforms and financial exchanges.\nMore articles by this source\n->",
      "snippet": "<b>Apple</b> Inc. (AAPL) will host a conference call at 5:00 PM ET on February 2, 2023, to discuss Q1 23 earnings results. Markets RTTNews Founded in the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "nasdaq",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nasdaq",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nasdaq.com/articles/apple-q1-23-earnings-conference-call-at-5:00-pm-et"
      }
    },
    {
      "id": "3532552970458997551",
      "title": "Apples growth story is consistent and sustained",
      "url": "https://www.computerworld.com/article/3687228/apples-growth-story-is-consistent-and-sustained.html",
      "description": "Over the last three years, the Mac has seen a 60% increase in market share  while the PC market grew 6%.",
      "body": "show that across the last three years the Mac has seen a 60% increase in market share while the PC market grew 6%, as Jamf CEO Dean Hager has pointed out.\nThats why Macs now account for 10.8% of all global PC shipments and 17% in the US.\nBut this isnt just happening to the Mac.\nGrowth (again)\nincreases in its industry share\n; it leads when it comes to wearables, and even the tablet industry (which consists of iPads, but also covers low budget, low power slates) delivers strong numbers.\nWhile we may see some weakness in the current quarter (financial results will be out later today) and relative disappointment during any recession, the momentum favors Apple. Its also generating larger share in emerging economies.\nI dont need to repeat myself with how these gains in consumer markets are also delivering benefits in enterprise IT. The tech professionals who read Computerworld are surely already experiencing that as multitudinous surveys show the ascent of Apple in the enterprise. This has almost become a given.\nMore growth in mobile\nLook closely and you may recognize that, for a generation at least, the company seems set to continue this progress, particularly around mobile devices.\nYou can also discern the direction of travel in the MDM enterprise markets.\nWhat I think Im seeing is more movement toward mergers and acquisitions affecting those vendors that try to serve multiple operating systems, while integrated single vendor firms seem to be thriving a little more.\nThats not intended as a slam against the companies in that space that do support all operating systems  I see the good work you do  just to point out that the focus remains on Apple. Thats where the market is going, which means any Apple-focused MDM solution cannot be limited by the other platforms they support.\nSlow and steady is better\nSeventeenth-century French playwright, Jean-Baptiste Poquelin (better known as\n) put it this way: The trees that are slow to grow bear the best fruit.\nThat makes sense in gardening, and certainly applies in Apples case.\nThe company which once hovered around 4% market share and was bought back from the brink of oblivion by a smart man with an iMac vision; a firm that switched successfully to Unix-based OS X, which it then put through an alchemical transfiguration to turn into dominance (or at least leadership) in mobile, is now growing in all its business sectors at a faster rate than the rest of the industry.\nAt least, thats how it seems when you zoom out.\nShort term struggles  the \"one-step-forward, one-step-back\" routine we all endure  are normal. The trick is to stay focused on what youll do once temporal troubles take flight, the \nstay hungry\n approach some may recall from a former Apple CEO.\nBut as Apples trees head into bloom, and while many forces (competitors, regulators, and a handful of charlatans) aim to seize some of their crop, the big picture seems positive, despite short term problems.\nPlease follow me on",
      "snippet": "... in the current quarter (financial results will be out later today) and relative disappointment during any recession, the momentum favors <b>Apple</b>.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "computerworld",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.idgesg.net/images/idge/imported/imageapi/2022/01/07/13/imac-g4-base-logo-100915715-large.jpg?auto=webp&quality=85,70",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "computerworld",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.computerworld.com/article/3687228/apples-growth-story-is-consistent-and-sustained.html"
      }
    },
    {
      "id": "401582564034717658",
      "title": "Apple 14-inch MacBook Pro (2023) review: The Rolls Royce of ultraportable notebooks",
      "url": "https://www.hardwarezone.com.sg/review-apple-14-inch-macbook-pro-2023-review-m2-max-singapore-price-specs",
      "description": "The latest 14 and 16-inch MacBook Pros have new processors and some other minor updates. Should you upgrade, are they worth buying? We answer these questions and more in this review.",
      "body": "Introduction\nSpec-bump update\nMany regard the M1 Pro and M1 Max MacBook Pros from 2021 to be the finest notebooks Apple has ever made. Well-built, supremely powerful, possessing a good selection of ports and a brilliant display, there is no doubt that they are landmark Mac notebooks.\nThe TLDR version:\nWith its combination of gorgeous display, top-notch build quality, great battery life, and out-of-this-world performance, this is the best ultraportable notebook you can buy.\nA year or so later, Apple has naturally tinkered with them and made them a little better. Ill cut to the chase, the newest 14 and 16-inch MacBook Pro are spec-bump updates. The big news is that they have new processors. They are now powered by the new M2 Pro and M2 Max. There are also some minor updates here and there which Ill get to later. But the big news is the processors.\nThe rest of the hardware is unchanged, which is no bad thing. Build quality is high and they are relatively portable considering the levels of performance that they offer. The Liquid Retina XDR display continues to impress with its dazzling colours even if they still suffer from blooming issues. The camera notch is still there and sadly doesnt do Face ID. The keyboard, trackpad, and speakers are all best-in-class items and will not disappoint.\nTo find out more about the design, display, keyboard, and trackpad of the MacBook Pro, read my review of the M1 14-inch MacBook Pro here.\n\nSay hi to M2 Pro and M2 Max\nAs usual, Apple is coy on the specifics of its new M2 Pro and M2 Max chips. What we do know is that they are built on the success of the M1 Pro and M1 Max chips and feature more cores and performance.\nHere are the high-level details.\nBuilt on a second-generation 5nm process\nUp to 40 billion transistors in M2 Pro, and 67 billion transistors in M2 Max\nNow up to 12 CPU cores\nUp to 19 GPU cores in M2 Pro and 38 GPU cores in M2 Max\nUp to 32GB memory in M2 Pro and 96GB in M2 Max\nNext-gen 16-core Neural Engine, up to 15.8 trillion operations per second\nUnified memory architecture\nThe end result of all these indigestible facts and figures means that you can expect up to 20% more CPU performance and 30% more GPU performance over the last-generation M1 Pro and M1 Max MacBook Pros. Thats quite a substantial improvement given that its only been a little more than a year since Apple unveiled the M1 Pro and M1 Max chips.\n\nOther improvements\nConnectivity is better on these new MacBook Pros. To start, the HDMI port now support the newer 2.1 standard which means support for 8K external displays at up to 60Hz and improved support for 4K external displays at up to 240Hz.\nTheres also support for Wi-Fi 6E. However, this feature is less likely to appeal to users here in Singapore since the 6GHz spectrum has yet to be cleared for us by the IMDA. Regardless, this means the ability to tap into the relatively uncontested 6GHz band with compatible Wi-Fi 6E routers like Googles Nest Wifi Pro.\nBattery life, according to Apple, has been improved thanks to the more efficient M2-class chips and other optimisations. The 14 and 16-inch MacBook Pro now last an hour longer respectively than the models they replace so battery life is now up to 18 hours for the 14-inch MacBook Pro and 22 hours for the 16-inch MacBook Pro. They last very long but Ill need more time to test if the battery life has really improved. Ill report back on this later.\n< Prev",
      "snippet": "... M1 Max MacBook Pros from 2021 to be the finest notebooks <b>Apple</b> has ever made. Well-built, supremely powerful, possessing a good selection of ports ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "hardwarezone",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.hardwarezone.com.sg/thumbs/703953/b.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hardwarezone",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.hardwarezone.com.sg/review-apple-14-inch-macbook-pro-2023-review-m2-max-singapore-price-specs"
      }
    },
    {
      "id": "7805430015013647094",
      "title": "Performance & conclusion : Apple 14-inch MacBook Pro (2023) review: The Rolls Royce of ultraportable notebooks",
      "url": "http://hardwarezone.com.sg/review-apple-14-inch-macbook-pro-2023-review-m2-max-singapore-price-specs/performance-conclusion-112",
      "description": "The latest 14 and 16-inch MacBook Pros have new processors and some other minor updates. Should you upgrade, are they worth buying? We answer these questions and more in this review.",
      "body": "Performance & conclusion\nCPU performance analysis\nNote: The unit Im testing is the 14-inch MacBook Pro with 12 CPU cores, 38 GPU cores, 64GB of memory, and a 2TB SSD.\nApple says the new M2 Pro and M2 Max MacBook Pros can deliver up to 20% more CPU performance and thats true for multi-threaded workloads. The multi-core performance of the new M2 Max chip was 19% and 18% better than the M1 Max on Geekbench and Cinebench respectively. And in our video transcoding test, the new M2 Max completed the task in just a little over 578 seconds (9mins 38s). Thats over two minutes faster than the M1 Max which took 705 seconds or nearly 12 minutes.\nSingle-core performance was less impressive but the M2 Max was still around 5% to 7% faster than the M1 Max. Interestingly, this means its single-core performance is also better than the M1 Ultra. However, the M1 Ultra is still the undisputed king in multi-threaded workloads  thanks mostly to the fact that it has 20 CPU cores (8 more than the M2 Max).\n\nGPU performance analysis\nNote: The unit Im testing is the 14-inch MacBook Pro with 12 CPU cores, 38 GPU cores, 64GB of memory, and a 2TB SSD.\nApple says the new M2 Pro and M2 Max MacBook Pros can deliver up to 30% more GPU performance over the last-generation M1-series Max MacBook Pros. In my tests, I found the increase in performance to be more modest but still remarkable. On Geekbenchs Compute workload, the M2 Max was around 16% faster than an M1 Max and performed similarly to a PC notebook powered by an NVIDIA GeForce RTX 3050 Ti GPU. It would have recorded higher numbers still had it been running using the Metal API  OpenCL was used so that comparisons could be drawn against Windows notebooks. Perhaps whats worth noting is that gaming performance has increased by around 18% across both Deus Ex and Shadow of Tomb Raider. Bear in mind that these games are running emulated on the M2 Max.\n\nStill excellent, still overkill for most people\nIts hard to fully eulogise just how exceptional Apples 14 and 16-inch MacBook Pros are. I didnt think the M1-based ones needed to be updated because they were and still are so fast and capable but yet Apple has given us even more powerful ones.\nBut you can never have too much power and the performance gains of the new M2 Max chip are appreciable, particularly if you do a lot of multi-threaded workloads or run apps that are graphically intensive and can take advantage of the extra GPU cores. That said, Id like to test the less powerful variants to know just how good the less expensive MacBook Pros are.\nThis brings us neatly to price. As tested, my unit with a nearly fully decked out M2 Max with 12 CPU cores, 38 GPU cores, 64GB of memory, and 2TB of storage is a whopping S$6,013. This is a machine designed for pros and it is priced accordingly. For professionals, many would be quite happy to pay for the MacBook Pros searing performance and high-quality hardware.\nFortunately, even the most affordable versions of the 14 and 16-inch MacBook Pros with M2 Pro chips have decent specs with 16GB of memory and 512GB storage. That should suffice for most users, and at those prices, they are just about attainable without being too ludicrously expensive. Certainly, I think the performance and features justifies their starting price tags. Once you start adding more cores,more memory,and more storage, that's when things get tricky.\nSome might be tempted by the cheaper 13-inch M2 MacBook Pro but Id say forget about it. That comes with the less powerful M2 chip and if you spec it up with 16GB of memory and 512GB of storage, it comes in at S$2,502. Thats only S$399 less than the cheapest 14-inch MacBook Pro which also has 16GB of memory. Id take the 14-inch MacBook Pro in a heartbeat. That extra S$399 gets you a faster chip, a superiordisplay, better connectivity, and speakers, which is well worth it.\nStarting prices & specs of MacBooks\nModel\nS$2,899\nS$3,599\nThe budget-conscious shouldconsider the M2 MacBook Air instead, it has more than enough performance for most people. The display isnt as nice but it counters by being a lot more portable and affordable. The MacBook Air is the Mac notebook for everyone.\nAnd as for owners of the older M1-based MacBook Pros, I see little need to upgrade unless you really need the improved connectivity (the old models couldnt output to an 8K screen), work with really large files and need a system with 96GB of memory, or could really use the additional multi-core performance.\nSo what then is a MacBook Pro? It is as the title of this review suggests, the computing equivalent of a Rolls Royce. Vast amounts of power, beautifully built, it is way more notebook than most of its buyers would ever need. If you do not absolutely have to use a Windows machine andhave deep enough wallets, this is the best ultraportable notebook you can buy today.",
      "snippet": "<b>Apple</b> says the new M2 Pro and M2 Max MacBook Pros can deliver up to 20% more CPU performance and thats true for multi-threaded workloads. The ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "hardwarezone",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.hardwarezone.com.sg/thumbs/703953/og.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hardwarezone",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://hardwarezone.com.sg/review-apple-14-inch-macbook-pro-2023-review-m2-max-singapore-price-specs/performance-conclusion-112"
      }
    },
    {
      "id": "2794064001468568305",
      "title": "Why an earnings beat couldnt stop a Snap share price drop",
      "url": "https://www.cmcmarkets.com/en/opto/why-an-earnings-beat-couldnt-stop-a-snap-share-price-drop",
      "description": "Revenue miss and falling revenue forecast see Snaps share price drop 15% in after-hours trading, despite earnings beat",
      "body": "Snap gave investors an unpleasant surprise in Tuesday by forecasting its first-ever revenue decline. Despite an earnings beat in Q4, shares fell in after-hours trading thanks to a revenue miss and the downbeat forecast, with Apples privacy policies squeezing the sector.\r\n\r\n- Snaps shares slump in after-hours trading on falling revenue forecast.\r\n\r\n- Apples privacy policies are limiting the potential of online advertisers.\r\n\r\n- Global X Social Media ETF is up 21% year-to-date.\r\n\r\nSnaps [SNAP] share price fell as much as 15% in after-hours trading, after the company posted its earnings for the fourth quarter (Q4) of 2022 on Tuesday. The results were mixed, with a revenue miss and downbeat forecasts concerning investors, notwithstanding an earnings beat.\r\n\r\nWhile Snap did not provide guidance (for the third consecutive quarter), the company warned that revenues could fall up to 10% in the current period. A significant headwind appears to be Apples [AAPL] changes to its privacy policies, which have hampered the income of all ad-driven social media platforms.\r\n\r\nThe results rounded off a disappointing year for Snap, which is responsible for Snapchat. The companys stock value has dropped 67.7% in the past 12 months, marking a turbulent year for technology stocks across the board as rising inflation and interest rates hammered performance and valuations.\r\n\r\nWith gains of 29.2% from the start of the year until Tuesday, it had looked as though Snap would fare better in 2023. However, the early indications are that its revenue struggles will undermine much of this early optimism.\r\n\r\n\r\n\r\n  \r\n  SNAP stock chart by TradingView\r\n  \r\n  \r\n  new TradingView.widget(\r\n  {\r\n  \"autosize\": true,\r\n  \"symbol\": \"NYSE:SNAP\",\r\n  \"interval\": \"D\",\r\n  \"timezone\": \"Etc/UTC\",\r\n  \"theme\": \"light\",\r\n  \"style\": \"2\",\r\n  \"locale\": \"en\",\r\n  \"toolbar_bg\": \"#f1f3f6\",\r\n  \"enable_publishing\": false,\r\n  \"allow_symbol_change\": true,\r\n  \"container_id\": \"tradingview_29689\"\r\n}\r\n  );\r\n  \r\n\r\n\r\n\r\nSigns of overvalued shares\r\n\r\nSnaps bottom-line results were, on one level, positive. Non-GAAP earnings per share came in at $0.14, 27.3% above the $0.11 consensus estimate reached by analysts polled by Refinitiv. Nonetheless, this figure reflected a 36.4% year-over-year decline.\r\n\r\nOther results were more overtly disappointing. Revenue of $1.30bn fell slightly short of the $1.31bn that analysts had expected, rising just 0.1% year-over-year. Elsewhere, net income fell from $22.6m to a loss of $288.5m, while adjusted EBITDA fell 28.6% year-over-year.\r\n\r\nThe results give Snap $0.17 earnings per share for fiscal year 2022, 13.3% above the $0.15 that analysts had expected. However, taking the 1 February close, it gives the stock a trailing twelve month price-to-earnings (P/E) ratio of 61, compared to 26.41 for the Nasdaq as a whole.\r\n\r\nAs noted, Snap did not provide detailed guidance. However, its investor letter predicted a year-over-year decline of between 2% to 10% in its upcoming Q1 revenue.\r\n\r\nSnap bulls will point to positive subscription data in the results. Daily active users of the social media platform Snapchat increased 17% year-over-year to 375 million, while Snapchat+, Snaps paid platform, rose to over two million subscribers.\r\n\r\nHowever, it is the companys rate of growth that will concern most investors. Full-year revenue has grown at an average rate of 41.9% over the last four years, but in 2022 this fell to just below 11.8%. Snaps investor letter said this reflected the rapid deceleration in digital advertising growth. Combined with Snaps forecast that revenue is likely to fall for the first time in Q1, its relatively high P/E ratio is increasingly hard to justify.\r\n\r\nPrivacy policies eat into ad earnings\r\n\r\nSnap is not the only company struggling as a result of declining ad revenues. The tough economic conditions of 2022 led to many companies restricting their advertising spend, hitting the top line of ad-dependent companies such as Twitter, Meta [META], and Alphabet [GOOGL].\r\n\r\nCompounding this effect is Apples updated privacy policy, which makes it harder for advertisers to track iOS users across apps and build a targeted ads profile for them. This contributed to a major slump in Metas performance over the past year, reflected in the companys share price being down 52.6% over the past 12 months.\r\n\r\nHowever, Meta released its results after markets closed on Wednesday, and shares for the company rose as high as 20% in after-hours trading. Investors may be wondering whether this indicates that Snaps woes are confined to the company itself, rather than reflecting a deteriorating trend throughout the ad-driven social media industry.\r\n\r\nWhile an Apple privacy policy launched April 2021 has had a major impact on Snap and Metas share price decline, Alphabet shareholders have reason to be even more concerned. Apple is reportedly building an entirely novel online advertising network, which could entirely bypass Google, as part of a thermonuclear war between the two companies originally declared by Apple co-founder Steve Jobs in 2009.\r\n\r\nFunds in focus: Global X Social Media ETF\r\n\r\nBulls may argue that once the current economic conditions ease, the online advertising market will see a return to its previous growth.\r\n\r\nAdvertising demand hasnt really improved, but it hasnt gotten significantly worse either, Snap CEO Evan Spiegel told analysts following the results. Spiegel added that advertisers are managing their spend very cautiously so they can react quickly to any changes in the environment.\r\n\r\nInvestors hoping to capitalise on a potential rebound for Snap can watch the Global X Social Media ETF [SOCL]. As of 31 January, Snap is the fifth-largest holding in SOCL with a 5.72% weighting. Meta is its second largest, with 9.46%, while Alphabet has 4.00%.\r\n\r\nSOCL has fallen 24.7% in the past 12 months, but has gained 20.5% in 2023 to date.\r\n\r\n\r\n\r\n  \r\n  SOCL chart by TradingView\r\n  \r\n  \r\n  new TradingView.widget(\r\n  {\r\n  \"autosize\": true,\r\n  \"symbol\": \"NASDAQ:SOCL\",\r\n  \"interval\": \"D\",\r\n  \"timezone\": \"Etc/UTC\",\r\n  \"theme\": \"light\",\r\n  \"style\": \"2\",\r\n  \"locale\": \"en\",\r\n  \"toolbar_bg\": \"#f1f3f6\",\r\n  \"enable_publishing\": false,\r\n  \"allow_symbol_change\": true,\r\n  \"container_id\": \"tradingview_9ed54\"\r\n}\r\n  );",
      "snippet": "While an <b>Apple</b> privacy policy launched April 2021 has had a major impact on Snap and Metas share price decline, Alphabet shareholders have reason to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "cmcmarkets",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://assets.cmcmarkets.com/images/1675348565_snap_medium.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "cmcmarkets",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.cmcmarkets.com/en/opto/why-an-earnings-beat-couldnt-stop-a-snap-share-price-drop"
      }
    },
    {
      "id": "1830457648316446260",
      "title": "The Apple Watch Ultra is again rumored to get a next-gen microLED display",
      "url": "https://www.macworld.com/article/1501217/apple-watch-ultra-rumors-bigger-microled-display.html",
      "description": "The 2nd generation of Apples biggest watch could tip the scales at 50mm.",
      "body": "FEB 2, 2023 7:32 am PST\nImage: Dominik Tomaszewski / Foundry\nWhen the Apple Watch Ultra arrived last year with a 49mm display, it was Apples biggest watch yet at a full 4mm larger than the 45mm Apple Watch Series 8. When the 2nd generation model arrives, it could be even biggerand a whole lot better.\nWhile Apple isnt expected to update the Apple Watch Ultra until 2024, using the same two-year cadence as the Apple Watch SE, it could have a display thats 10 percent larger than the current model, according to a new report from DigiTimes. While the publication has a somewhat sketchy track record, the prediction lines up with a previous report from analyst Jeff Pu.\nThe Apple Watch Ultra was originally rumored to have a 50mm display, so its possible that Apple decided to scale back a bit with the 1st-gen model due to costs. An increase in screen size to around 50mm could be accomplished without increasing the body of the display since the watch has fairly sizable bezels compared to the Series 8.\nThe DigiTimes report also corroborates previous rumors of a switch to microLED displays. By switching to microLED (a technology that hasnt appeared in any Apple product), the display would be thinner, brighter, and more power efficient than the current OLED screen. MicroLED could also lead to greater resolution with images that appear like its painted on top of the glass, according to a report from Bloomberg.\nIts not clear how these rumors affect the standard Apple Watch. The Apple Watch Ultra currently offers numerous upgrades over the standard model, including longer battery life, a rigged titanium body, better water resistance, and a customizable Action button.",
      "snippet": "By switching to microLED (a technology that hasnt appeared in any <b>Apple</b> product), the display would be thinner, brighter, and more power efficient ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:00:00",
      "provider": {
        "name": "macworld",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.macworld.com/wp-content/uploads/2023/02/Apple-Watch-Ultra_-review_2.jpg?quality=50&amp;strip=all&amp;w=1024",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "macworld",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.macworld.com/article/1501217/apple-watch-ultra-rumors-bigger-microled-display.html"
      }
    },
    {
      "id": "7410447180293314425",
      "title": "Apple",
      "url": "https://en.wikipedia.org/wiki/Apple",
      "description": "An apple is a sweet, edible fruit produced by an apple tree (Malus pumila). Apple trees are cultivated worldwide as a fruit tree, and is the most widely grown species in the genus \"Malus\". The tree originated in Central Asia, where its wild ancestor, \"Malus sieversii\", is still found today. Apples have been grown for thousands of years in Asia and Europe, and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek and European Christian traditions.",
      "body": "",
      "snippet": "<b>Apple</b> trees are cultivated worldwide as a fruit tree, and is the most widely grown species in the genus \"Malus\". The tree originated in Central Asia, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "0001-01-01T00:00:00",
      "provider": {
        "name": "wikipedia",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wikipedia",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://en.wikipedia.org/wiki/Apple"
      }
    }
  ]
}
