{
  "_type": "news",
  "didUMean": "",
  "totalCount": 103,
  "relatedSearch": [],
  "value": [
    {
      "id": "2145464772848840251",
      "title": "Apple VP Matthew Costello Talks HomePod 2  iPhone in Canada Blog",
      "url": "https://www.iphoneincanada.ca/news/apple-hardware-svp-talks-homepod-2/",
      "description": "Apple's second-generation HomePod sports a similar design as its predecessor, has a 4-inch woofer and five tweeters with automatic room sensing.",
      "body": "early hands-on reviews and unboxing videos\nalready hitting the web.\nJust ahead of the official release, Matthew Costello, Apples hardware vice president, has shared how Apple decided to resurrect a product it had discontinued in 2021.\nWe deeply studied the learnings from the first HomePod and HomePod mini, Costello told TechCrunch. We introduced the new HomePod when it was able to achieve our broad range of experience goals.\nCostello highlighted how with support for Thread, the new HomePod can serve as a border router and securely enable communications to Thread-based accessories.\nHomePod features Wi-Fi 4 connectivity that allows us to target exactly what works best in the entire system, Costello added.\nMaking sure Siri requests are responsive, and ensuring a consistent experience for all you are listening to, controlling your smart home accessories and more  all while being energy efficient.\nThe new HomePod delivers immersive, room-filling sound users love  with even more detail, clarity and layers than the original HomePod.\nApples HomePod 2 sports a similar design as its predecessor, has a 4-inch woofer and five tweeters (down 2 from before), with a built-in temperature and humidity sensor.\nThe new HomePod also features automatic room sensing for adjusting audio to your environment. But much like its predecessor, it still leaves stains on wooden tables.\nOther articles in the category: News\nChatGPT Reaches 100 Million Active Users in Record Time\nJust two months after its launch, OpenAI's ChatGPT has reached 100 million monthly active users making it the fastest-growing consumer app ever, Reuters is reporting. In comparison, it took TikTok about nine months after its global launch to reach 100 million users and Instagram 2 and a half years. According to a UBS study citing data...\nUsman Qureshi",
      "snippet": "... official release, Matthew Costello, <b>Apples</b> hardware vice president, has shared how Apple decided to resurrect a product it had discontinued in 2021.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T18:01:01",
      "provider": {
        "name": "iphoneincanada",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.iphoneincanada.ca/wp-content/uploads/2017/09/iic-logo-1.svg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "iphoneincanada",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.iphoneincanada.ca/news/apple-hardware-svp-talks-homepod-2/"
      }
    },
    {
      "id": "4522849795437227167",
      "title": "Apple executives talk new HomePod 2 Wi-Fi 4 limitations",
      "url": "https://bgr.com/tech/apple-executives-talk-new-homepod-2-wi-fi-4-limitations/",
      "description": "Apple's VP of hardware engineering Matthew Costello and product marketing employee Alice Chan talked about the new HomePod 2.",
      "body": "Published Feb 2nd, 2023 12:42PM EST\nImage: Apple Inc.\nThe new HomePod 2 starts being sold tomorrow for $299. While reviewers already praised the second iteration of this smart speaker this week, Apples VP of hardware engineering Matthew Costello and product marketing employee Alice Chan have spoken with TechCrunch and Mens Journal about this new product. Here are the highlights.\nAs you may know, the HomePod 2 looks very similar to its predecessor but has a few internal and external changes. For example, it has a larger edge-to-edge LED touchscreen on top, and from the inside, it has fewer tweeters and microphones  although some reviewers said its sound is still better than its predecessor.\nWith the S7 chip, the same available on the Apple Watch Series 7, some users noted that it supports an old generation Wi-Fi version (4 while the first HomePod supported Wi-Fi 5). Apple VP says this isnt a problem:\nHomePod features Wi-Fi 4 connectivity that allows us to target exactly what works best in the entire system, making sure Siri requests are responsive, and ensuring a consistent experience for all you are listening to, controlling your smart home accessories and more  all while being energy efficient.\nHe also talked about why its impossible to pair the new HomePod 2 with its predecessor:\nWhen creating a stereo pair, its important that the audio characteristics match for an optimal, balanced experience. The new HomePod delivers immersive, room-filling sound users love  with even more detail, clarity and layers than the original HomePod  so we wanted the acoustical imaging to be as pure and consistent as possible from generation to generation. The principle of having audio characteristics match in a stereo pair applies to HomePod mini, the original HomePod and the new HomePod.\nChan, on the other hand, acknowledges the challenges the first iteration of the HomePod suffered and why Apple decided to bet on a bigger size again two years after discontinuing the 2018 model:\nWeve taken all the learnings from the original HomePod as well as HomePod mini and applied them to the new HomePod, shared Chan.",
      "snippet": "Published Feb 2nd, 2023 12:42PM EST Image: <b>Apple</b> Inc. The new HomePod 2 starts being sold tomorrow for $299.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:42:28",
      "provider": {
        "name": "bgr",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bgr.com/wp-content/uploads/2023/01/homepod-2-bgr.jpg?quality=82&strip=all",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "bgr",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://bgr.com/tech/apple-executives-talk-new-homepod-2-wi-fi-4-limitations/"
      }
    },
    {
      "id": "6870213349338190614",
      "title": "The Samsung Galaxy ecosystem may finally be ready to rival Apple",
      "url": "https://www.t3.com/features/the-samsung-galaxy-ecosystem-may-finally-be-ready-to-rival-apple",
      "description": "The arrival of a truly capable, premium laptop may finally allow the Samsung Galaxy range to compete with the MacBook",
      "body": "(opens in new tab)\nand are aged 16 or over.\nFor decades now, Apple and Samsung have spearheaded consumer technology. Like warring factions, the two have gone back and forth in different areas, with neither able to establish a dominant hold over the market.\nPart of that comes down to the product range being equally strong. Sure, there are always going to be those who prefer one or the other, but there has hardly ever been a way to separate iPhones and Samsung phones, for example. Similarly, the Apple Watch and Samsung Galaxy watches offer a broadly similar feature set.\nOne area which hasn't really offered a level playing field, though, is the range of laptops and computers. Historically, MacBook's and iMac's have offered a much higher spec and level of integration with other Apple products, than their Samsung equivalents.\nThat could be partly down to their operating system. Apple computers use their own operating system, meaning they have absolute control over all aspects of their integration. Because Samsung laptops use Windows, they've never been able to have a similar level of integration, in such a seamless way.\nAll that seems to have changed recently though. The Samsung Galaxy Book line has been around for a while now, offering direct, like-for-like competition to the MacBook. And now, with the release of the Samsung Galaxy Book 3 Ultra, the range finally has a device with a spec capable of competing with the MacBook Pro 16-inch.\nI can't oversell just how important that could be for Samsung. As a fairly recent Apple convert, one of the main things I wanted over was a more seamless experience, with devices that worked together well. Because my laptop was the most important piece of the puzzle for me, Apple won.\nBut now, thanks to a spec that tops out at the 13th Gen Intel Core i9 processor and an Nvidia GeForce RTX 4070 GPU, the MacBook finally has a worthy opponent. It's too soon to tell whether that will be enough to topple the Apple Silicon chips, which have proved so fruitful in recent years. But it looks like Samsung's best shot at doing so.\nToday's best Apple MacBook Pro 16-inch M2 Pro (2023) deals\n(opens in new tab)",
      "snippet": "For decades now, <b>Apple</b> and Samsung have spearheaded consumer technology. Like warring factions, the two have gone back and forth in different areas, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:35:41",
      "provider": {
        "name": "t3",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/3wCMDV44eoVXjTWfV43Qim.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "t3",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.t3.com/features/the-samsung-galaxy-ecosystem-may-finally-be-ready-to-rival-apple"
      }
    },
    {
      "id": "604351165621972558",
      "title": "Apple AirPods Are On Sale For $99 At Walmart",
      "url": "https://www.huffpost.com/entry/apple-airpods-sale-walmart_l_63dbdc8fe4b01e92886fbe15",
      "description": "Get the super popular second-generation AirPods for just $99 for a limited time.",
      "body": "Wireless earbuds\nare one of the most versatile kinds of wearable tech  they can be worn while working out, cleaning and taking work calls. And if youve been thinking about grabbing a pair of Apples iconic earbuds, today is a great day to do so, because right now, you can get the second-generation AirPods for $99 (originally $159) at Walmart.\nAdvertisement\nWith the second generation AirPods, you can enjoy five hours of listening per charge and 24 hours of listening when recharged with the included compact charging case. You can also get easy access to Siri by simply saying, Hey Siri.\nAnd if you need a little more motivation to grab a pair, let these glowing reviews further persuade you:\n\nI absolutely love my airpods. I had a first generation pair who eventually lost their ability to hold a charge after a few years so I upgrade to the second generation. They are so comfortable to wear and the charging case is so sleek and easy to use. ",
      "snippet": "Get the super popular second-generation AirPods for just $99 for a limited time.\nWireless earbuds are one of the most versatile kinds of wearable tech they can be worn while working out, cleaning and taking work calls.\nAnd if youve been thinking about grabbing a pair of <b>Apples</b> iconic earbuds, today is a great day to do so, because right now, you can get the second-generation AirPods for $99 (originally $159) at Walmart.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:23:47",
      "provider": {
        "name": "huffpost",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://img.huffingtonpost.com/asset/63dbe5862600001f0018c664.png?cache=CSPfEF0nbQ&amp;ops=1200_630",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "huffpost",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.huffpost.com/entry/apple-airpods-sale-walmart_l_63dbdc8fe4b01e92886fbe15"
      }
    },
    {
      "id": "3357494099574153592",
      "title": ": Apple Amazon and Alphabet earnings are coming. Heres what the stock options market is bracing for.",
      "url": "https://forextv.com/market-news/apple-amazon-and-alphabet-earnings-are-coming-heres-what-the-stock-options-market-is-bracing-for/",
      "description": "The stock options market has priced straddles to imply larger-than-usual post-earnings moves for Apple, Alphabet and Amazon earnings. Read Full Story",
      "body": "The stock options market has priced \"straddles\" to imply larger-than-usual post-earnings moves for Apple, Alphabet and Amazon earnings.\r\nRead Full Story",
      "snippet": "... post-earnings moves for <b>Apple</b>, Alphabet and Amazon earnings. The ... larger-than-usual post-earnings moves for <b>Apple</b>, Alphabet and Amazon earnings.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:16:00",
      "provider": {
        "name": "forextv",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "forextv",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://forextv.com/market-news/apple-amazon-and-alphabet-earnings-are-coming-heres-what-the-stock-options-market-is-bracing-for/"
      }
    },
    {
      "id": "5303676337759883483",
      "title": "First-Gen Apple iPhone Being Sold at Auction",
      "url": "https://gizmodo.com/first-gen-iphone-apple-iphone-auction-tim-cook-1850064877",
      "description": "The 8 gigabyte iPhone originally cost $599 when it was first sold in 2007.",
      "body": "Doctor & The Diva\nin 2019, Green said\nthat she never opened the iPhone because she had just gotten a new phone at the time and thought the iPhone would never go out of date. An appraiser on the show said the phone could be worth $5,000when it originally cost $599 in 2007. But the phone is potentially worth $50,000 and is now being auctioned off by\n, which has seen its fair share of vintage iPhones in the past.\nTreasure Hunt Tuesday With Ph.D Antiques Appraiser Dr. Lori - Episode 2 | Doctor & The Diva\nWe got calls from everybody, but 99% of them didnt have the same thing, said LCG Auctions founder Mark Montero to\n. But Karen had a really unique piece with a great story behind it. It was shocking because we had gotten so many duds.\nAdvertisement\nThe iPhone is an 8 gigabyte first-generation iPhone with the camera, and bidding will start at $2,500. According to Business Insider, Green hung on to the phone after her appearance on Doctor & The Diva until she heard about another unopened, first-generation iPhone\nbeing sold for close to $40,000\nin October of 2022. Green wouldve held out for longer if she wasnt trying to get a new business off the ground.\nIf I could hold off on the phone for like another 10 years, I probably would, Green said to Business Insider. The only reason why I am selling that phone is because I need to support this business.\nG/O Media may get a commission",
      "snippet": "The 8 gigabyte iPhone originally cost $599 when it was first sold in 2007.\nDoctor & The Diva in 2019, Green said that she never opened the iPhone because she had just gotten a new phone at the time and thought the iPhone would never go out of date.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:05:00.877",
      "provider": {
        "name": "gizmodo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/5786150e2408e1dd65266d568e9d4ef6.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "gizmodo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://gizmodo.com/first-gen-iphone-apple-iphone-auction-tim-cook-1850064877"
      }
    },
    {
      "id": "6641253112637039773",
      "title": "Apple, Amazon, Alphabet earnings: What to expect",
      "url": "https://finance.yahoo.com/video/apple-amazon-alphabet-earnings-expect-170309993.html?src=rss",
      "description": "Yahoo Finance Lives Rachelle Akuffo breaks down the expectations for Apple, Amazon, and Alphabet earnings.",
      "body": "Cathie Wood Names the 1 Stock She'd Buy Today If She HAD to Hold It For 10 Years\nWhen Cathie Wood speaks, people listen.  The chief executive of Ark Investment Management has had a far-from-perfect record when it comes to her investment choices -- not to mention not exactly flattering feedback from CNBC's Jim Cramer.  When asked what stock Wood would choose she won a million dollar lottery and was forced to choose a stock for ten years, Wood's pick was just as disruptive as her reputation.\n1h ago\nNasdaq Bear Market: 2 Growth Stocks Down 74% and 95% to Buy in 2023\nThe Nasdaq Composite dipped into a bear market last year, and the tech-heavy index is still 28% off its high.  Investors often overreact to good and bad news, so stocks tend to rise too high during bull markets and fall too far during bear markets.  Warren Buffett hinted at that quirk of human nature when he said, \"Be fearful when others are greedy, and be greedy when others are fearful.\"\n3h ago\nCan SoFi Stock Soar Even Higher in 2023?\nDespite a dismal performance in 2022, shares of all-digital bank SoFi Technologies (NASDAQ: SOFI) climbed 50.3% in January.  There are lots of reasons for the run-up, not least of which were a better-than-expected performance during the fourth quarter of 2022 and an improved outlook.  Will the big gains SoFi made in January fizzle out in February, or is the stock at the beginning of a much longer bull run?\n7h ago\nCarvana stock has crashed back to Earth after a massive run, and these three indicators show just how bad things are.\n2h ago\nAre These 3 Companies Next for Short Squeezes?\nA short squeeze occurs when short-sellers rush to cover their positions on a stock.  The sudden rush of buying can quickly push a stock price higher.  After a tough market year in 2022, some stocks have built up large short-seller followings, potentially priming the pump for a new wave of short squeezes.\n5h ago\n3 Reasons to Love Coinbase Stock\nShares of Coinbase (NASDAQ: COIN) have gotten crushed since hitting public markets, but the business is in better shape than you might think. There's billions of dollars in cash on the balance sheet, and there are growing revenue sources from USDC and Ethereum (CRYPTO: ETH) staking.\n5h ago\nMeta stock soars after hours, analyst warns of 'magnitude' of move\nBrent Thill, Jefferies Equity Research Analyst, analyzes Meta's stock pop after earnings.  You can see the full interview here.  Key video highlights 00:25 On how Instagram has improved 00:40 On better ad targeting 00:55 On other social platforms 01:30 On the stock move\n19h ago\nThese high-octane income stocks, with yields ranging from 4.3% to 15.4%, have been bought hand over fist by billionaire investors.\n7h ago\n3 Ultra-High-Yield Dividend Stocks You Won't Regret Owning in 2023\nDividend stocks are a great way to mitigate downside risk, hedge against inflation, and generate reliable levels of passive income.  Closed-end funds, real estate investment trusts (REITs), and some actively managed diversified holding companies are purpose-built to return an outsize portion of cash flows to shareholders via regular distributions.  Arbor Realty Trust (NYSE: ABR) is a REIT with a current annualized yield of 10.75%.\n1h ago\n2 Dividend Growth Beasts That Have Tripled Their Payouts Within 7 Years\nDid you know that if a company were to increase its dividends by 5% per year, it would take 14 years for its payouts to double?  A couple of stocks with the most aggressive dividend growth records you can invest in today are UnitedHealth Group (NYSE: UNH) and Broadcom (NASDAQ: AVGO).  Health insurance giant UnitedHealth Group may not strike income investors as an ideal dividend stock to buy, as it yields just under 1.4%, which is below the S&P 500's current average yield of 1.7%.\n3h ago\nDividend investors should consider loading up on these stocks as this could be a good year for both of their businesses.\n4h ago\nCathie Wood pours millions into these 2 stocks  this is what makes them attractive buys\nJanuary has now been and gone and turned out to be a nice gift for investors. Battered by 2022s bear, the tech-heavy Nasdaq, in particular, put in an excellent showing, seeing out the month ~11% into the green, in what amounted to its best start to a year since 2001. That signals the appetite for risk is on again and that will be good news for Cathie Wood, the ARK Investment CEO, whose investing style heavily favors disruptors - equities that are naturally positioned at the risky end of the sca\n1d ago",
      "snippet": "... Finance Lives Rachelle Akuffo breaks down the expectations for <b>Apple</b>, Amazon, and Alphabet earnings. not to mention not exactly flattering feedback ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:03:09",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/ny/api/res/1.2/c12fDJQCjnz2vPJDA1yKEw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/hd/cp-video-transcode/production/f6d4dd65-d1fa-3340-ae7b-e1edc005dc00/2023-02-02/17-03-09/bcf35114-2484-52af-abdb-aa38db0c0766/stream_1280x720x0_v2_3_0.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://finance.yahoo.com/video/apple-amazon-alphabet-earnings-expect-170309993.html?src=rss"
      }
    },
    {
      "id": "1558304564777243701",
      "title": "M1 MacBook Air still packs plenty of value with $199 discount",
      "url": "https://9to5mac.com/2023/02/02/apple-m1-macbook-air-homekit-smart-plug-more/",
      "description": "The best value in Apple's entire macOS stable has returned, with a $199 discount on M1 MacBook Air. Plus HomeKit gear and more.",
      "body": "Reddit\nAll of Thursdays best deals are now live and headlined by a chance to save $199 on the still very popular and quite compelling M1 MacBook Air. Its then joined by this VOCOlinc HomeKit Smart Plug, which is worth adding to your Siri setup at just $8. And if you need a workstation upgrade, OWCs metal Thunderbolt docks are now $50 off. Hit the jump for all of the best deals and more in the latest 9to5Toys Lunch Break.\nSave $199 on Apples oh-so popular M1 MacBook Air\nThe dust has settled on all of Apples big reveals for the start of the year, and now Best Buy offers\nat Amazon\n, youre looking at a $199 discount as well as a match of our previous mentions from throughout the holiday shopping season last year. It comes within $1 of that mention which also matches the all-time low, making todays offer the second-best weve seen to date.\nWhile it isnt that all-new version of Apples most portable MacBook, there is still something to be said for just how good of a value the\noriginal M1 MacBook Air\nstill is, especially with as steep of a discount attached as youll find. Centered around a 13-inch Retina display with Apple Silicon under the hood, theres also a pair of Thunderbolt ports supplemented by Wi-Fi 6 as well as 256GB of storage and 8GB of RAM. Get a better idea of its performance in\n.\nIf youre looking for more insight on why the M1 MacBook Air is worth considering over its\nJust $8 scores you this VOCOlinc HomeKit Smart Plug\nAmazon is now offering the\nVOCOlinc HomeKit Smart Plug for$8\n. Normally fetching $13, you can now score a Siri-enabled smart plug for 35% off. This is the second-best weve seen to date at within $0.50 of the all-time low last set in September, and the best since. Delivering an affordable way to have Siri, Alexa, and Google Assistant control lamps and appliances, this smart plug pairs right to your Wi-Fi, ditching the need for an external hub.\nIts quite rare to see an offering anywhere in this price range with HomeKit out of the box, which can be used to schedule and automate the smart plug alongside controlling over voice commands. Weve\nin the past, for a better idea of what to expect from the brand, too.\nOWC now taking $50 off metal Thunderbolt docks\nFrom now through this time next week, OWC is slashing\nAmazon\nbut regularly fetches $280 these days. Youre looking at a match for the Amazon low at $10 under our previous mention and at least $30 in savings.\nDesigned to convert your laptop into a workstation powerhouse, it delivers a pair of Thunderbolt ports, 10Gb/s USB-C, five USB-A ports at 5Gb/s, Mini DisplayPort, micro/SD card readers, 3.5mm audio, Ethernet, and more inside of an aluminum design. Alongside 85W of power passthrough for charging your device, it can also support a single 5K monitor or a pair of 4K displays.\nBest trade-in deals\n9to5Macalso keeps tabs on all the best trade-in deals on iPhone, iPad, MacBook, Apple Watch, and more every month. Be sure to",
      "snippet": "Centered around a 13-inch Retina display with <b>Apple</b> Silicon under the hood, theres also a pair of Thunderbolt ports supplemented by Wi-Fi 6 as well ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:50:37",
      "provider": {
        "name": "9to5mac",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2020/12/Tons-of-Apps-on-MacBook-Air.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "9to5mac",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://9to5mac.com/2023/02/02/apple-m1-macbook-air-homekit-smart-plug-more/"
      }
    },
    {
      "id": "8751048740905991850",
      "title": "Apple to Leave Industrial Design Chief Role Empty for Now: Report  iPhone in Canada Blog",
      "url": "https://www.iphoneincanada.ca/news/apple-to-leave-industrial-design-chief-role-empty-for-now-report/",
      "description": "Back in October, Apple confirmed its head of hardware design, Evans Hankey, was departing from the company after just three years of replacing the famed design chief Jony Ive. Now, Bloombergs Mark Gurman reports Apple wont be replacing the coveted design chief role, but instead having its entire team report to the companys chief operating",
      "body": "Twitter\nReddit\nBack in October, Apple confirmed its head of hardware design, Evans Hankey, was departing from the company after just three years of replacing the famed design chief Jony Ive.\nNow, Bloombergs Mark Gurman reports Apple wont be replacing the coveted design chief role, but instead having its entire team report to the companys chief operating officer, Jeff Williams, according to unnamed sources familiar with the matter.\nApples industrial design team numbers about 20 people and those with the most seniority at the company will gain larger roles. Williams apparently has decided there will not be one lead design chief, but instead, the group will report directly to him. This means the design team will now work more closely with Apples operations team, one of many areas led by Williams. This new setup has apparently caused tension among designers, says Bloomberg.\nApples design team brings together expert creatives from around the world and across many disciplines to imagine products that are undeniably Apple, said an Apple spokesperson in a statement last October. The senior design team has strong leaders with decades of experience. Evans plans to stay on as we work through the transition, and wed like to thank her for her leadership and contributions.\n, after departing from Apple and since then numerous designers from the iPhone maker have followed the iconic designer to his new company.\nBack in December 2021, Apple offered an exclusive behind-the-scenes look at its design studio at Apple Park.\nOther articles in the category: News\nNintendo Resurrects Switch Game Voucher Promotion in North America\nAfter four years, Nintendo is bringing back its game voucher promotion. In Canada, Nintendo Switch Online members can purchase a pair of vouchers and redeem each one for a digital game in order to save a bit of money on each game. A pair of Nintendo Switch game vouchers in Canada is available for $132.99....\nSteve Vegvari",
      "snippet": "Back in October, <b>Apple</b> confirmed its head of hardware design, Evans Hankey, was departing from the company after just three years of replacing the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:50:01",
      "provider": {
        "name": "iphoneincanada",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.iphoneincanada.ca/wp-content/uploads/2017/09/iic-logo-1.svg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "iphoneincanada",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.iphoneincanada.ca/news/apple-to-leave-industrial-design-chief-role-empty-for-now-report/"
      }
    },
    {
      "id": "2707840887793568532",
      "title": "Samsung Galaxy S23 Ultra vs. iPhone 14 Pro Max",
      "url": "https://www.theshortcut.com/p/galaxy-s23-ultra-vs-iphone-14-pro-max",
      "description": "How does Samsung's flagship stack up against Apple's iPhone 14 Pro Max?",
      "body": "Unlocked: Save up to $830 on S23 Ultra\nThe Samsung Galaxy S23 Ultra will be, for most people in the US, the best competitor to the iPhone 14 Pro Max, thanks to similar specs on the whole, a more advanced camera system and extra features like support for its built-in Galaxy S Pen.\nThe Shortcut is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.\nSubscribe\nSamsung arguably offers the closest thing to Apples ecosystem, thanks to tight integration with the companys many gadgets, with similar features that allow for seamless handoff and screen mirroring like that found in the\nbest iPad\n, Macs and iPhones.\nThe Samsung Galaxy S23 Ultra promises an impressive camera, thanks to its 200MP main shooter that enables more detailed zoomed shots than ever. Using pixel-binning to simulate either a 50MP image or a 12.5MP image, depending on the zoom level, this camera is capable of taking far more detailed shots of distant objects than Apples phone, which manages a muddy 30X digital zoom at best.\nThe Samsung Galaxy S23 Ultra features an embedded Galaxy S Pen for stylus support too, making it an excellent note-taking device, sure, but which also allows for finer control that fingers cant manage.\nWhen it comes to the phones guts, the Galaxy S23 Ultra battery and processor arent necessarily a clear homerun versus the iPhone 14 Pro Max, as the Galaxy S23 Ultras Snapdragon 8 Gen 2 processor doesnt quite reach the heights of Apples chip on power or efficiency  but the performance gap is narrower than its been in many years.\nThe Galaxy S23 Ultra's charging speed is faster, at 45W to Apples 20. That said, even Samsungs phone pales in comparison to speeds offered overseas in phones like the Xiaomi Redmi Note 12 Explorer, the current fast-charging champ at a\nT-Mobile: iPhone 14 Pro Max\nThe Apple iPhone 14 Pro Max is a slam dunk for any Apple fan who likes a big phone and seamless integration with Apple devices, but for anyone not deeply invested in the companys ecosystem, the case for it thins. It still has a great camera system thats comparable enough to be subjectively better for normal use, but one which continues to lose ground when it comes to some of the advanced features offered by other phones.\nStill, the Pro Maxs A16 Bionic is arguably the best mobile processor in the game, one which is so efficient that even with a nearly 700mAh deficit versus the 5,000mAh battery in the Galaxy S22 Ultra, it manages to come out ahead in head-to-head testing on prominent phone battery tester\nPhoneBuffs\nYouTube channel. Samsung is likely to improve this time around  I dont expect it to blow the 14 Pro Max out of the water, but well have to wait and see what tests show.\nThe iPhone 14 Pro Max screen brightness hits a higher 2,000 nits than Samsungs phone, which maxes out at 1,750 nits, making it slightly easier to see in daylight. But  its screens pill-shaped camera cutout is a turn-off for some, despite Apple making the most of it by incorporating it into the UI of the phone with some clever notification tricks, compared to Samsungs tiny hole punch.\nIts starting to show its age in connectivity stats, as well, though those things will only matter to professionals, who might use the phone to shoot ProRAW photos or ProRes videos, and who would be hampered by the slower Wi-Fi 6 throughput and lightning port. Samsung debuted its own native version of RAW photography shortly before the announcement of the Samsung Galaxy S22 series phones, lessening the need for a third-party solution to the once-missing feature.\nSubscribe",
      "snippet": "But its screens pill-shaped camera cutout is a turn-off for some, despite <b>Apple</b> making the most of it by incorporating it into the UI of the phone ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:44:22",
      "provider": {
        "name": "theshortcut",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9c9dc63c-ffa4-4666-8e99-4e861b463212_2709x1524.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theshortcut",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.theshortcut.com/p/galaxy-s23-ultra-vs-iphone-14-pro-max"
      }
    },
    {
      "id": "7226906357857953904",
      "title": "Affidavit: Woman stole Ariat jackets, Apple Watches",
      "url": "https://www.lmtonline.com/local/article/affidavit-woman-stole-ariat-jackets-apple-17759495.php",
      "description": "A woman landed behind bars for stealing Ariat jackets from Boot Barn and Apple Watches from Best Buy, according to Laredo police.",
      "body": "A woman landed behind bars for stealing Ariat jackets from Boot Barn and Apple Watches from Best Buy, according to Laredo police. On Jan. 28, Crystal Lizette Regalado, 28, was served with arrest warrants that charged her with two counts of theft of property with two or more previous convictions and engage in organized criminal activity. One case occurred at about 3 p.m. on Dec. 15, when Laredo police officers responded to a theft report at Boot Barn on 7607 San Dario Ave. The store manager stated that on Dec. 8, two females and a male entered the store and walked to the Ariat jackets. The trio grabbed several Ariat jackets. The male would remove the security tags from the jackets while the females would conceal the jackets under their clothing by the stomach area. All then walked to the womens jeans and grabbed three jeans, authorities said. Police said the items stolen were valued at $836.80. Regalado was then identified as one of the suspects. Regalado was involved in another theft reported on Jan. 5 at Best Buy on 7905 San Dario Ave., states the arrest affidavit. A store representative stated that three people were recorded via surveillance video stealing two Apple Watches for a total value of $694.88, according to police. LPDs Crimes Against Property detectives took over the case. Authorities identified one of the suspects as Regalado when they reviewed the surveillance footage, the affidavit states.",
      "snippet": "... Ariat jackets from Boot Barn and <b>Apple</b> Watches from Best Buy, according to ... Ariat jackets from Boot Barn and <b>Apple</b> Watches from Best Buy, according to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:42:59",
      "provider": {
        "name": "lmtonline",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.hdnux.com/photos/01/31/30/12/23429775/5/rawImage.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "lmtonline",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.lmtonline.com/local/article/affidavit-woman-stole-ariat-jackets-apple-17759495.php"
      }
    },
    {
      "id": "1821438611443531897",
      "title": "Apple is making a huge internal change to the way it makes products",
      "url": "https://www.imore.com/apple/apple-is-making-a-huge-internal-change-to-the-way-it-makes-products",
      "description": "Apple has apparently decided not to replace its VP of industrial design Evans Hankey when she leaves later this year.",
      "body": "The Industrial Design Chief Role is no more...\n(opens in new tab)\n(opens in new tab)\n(Image credit: Wallpaper / Future)\nIn a huge shock to the world of Apple, news breaking this week suggests that Apple is not planning to replace its outgoing VP of industrial design, Evans Hankey, when she leaves later this year.\nAccording to\nBloomberg's\n(opens in new tab)\nMark Gurman, Apple \"has decided against naming a new executive to replace its departing top product designer, marking a stark shift for a company long celebrated for the look and feel of its devices.\"\nEvans Hankey, the successor to Apple's design legend Jony Ive, is leaving the company later this year. But rather than replace Hankey, it seems Apple has opted to instead have its group of about 20 industrial designers report to Apple's chief operating officer, Jeff Williams.\nThe end of an era?\nGurman says that Apple's design team has lost a lot of key members, and that linking \"Apples operations group more closely with design\" has \"irked some of Apple's creative staffers.\" It's possible the move away from a creative role to designers reporting to the COO could impact the soul and art of Apple's products, with design decisions being made based on the cost, production, and manufacturing rather than the pure blend of art and functionality Apple has previously been known for.\nWith Tim Cook at the wheel, we've already seen Apple moving away from its original remit as a company transfixed on inspirational design and user experience towards a well-oiled industrial monolith focused on increasing service revenues, supply chain logistics, and arguably quite messy product lineups. While the departure of Hankey and this subsequent decision won't impact Apple's upcoming iPhone 15, expected to be the best iPhone to date, could we see a future where Apple continues to make design decisions based on business rather than artistic value and the user experience? It would be a real shame if we did.\niMore Newsletter",
      "snippet": "<b>Apple</b> has apparently decided not to replace its VP of industrial design Evans Hankey when she leaves later this year. The Industrial Design Chief ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:38:26",
      "provider": {
        "name": "imore",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/255XwmdJ5z8jnW3WZUJFng.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "imore",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.imore.com/apple/apple-is-making-a-huge-internal-change-to-the-way-it-makes-products"
      }
    },
    {
      "id": "7296716172508943080",
      "title": "Apple Watch SE 2022 long term user review: Big things come in small packages",
      "url": "https://www.financialexpress.com/life/technology-apple-watch-se-2022-long-term-user-review-big-things-come-in-small-packagesnbsp-2969850/",
      "description": "Apple has always positioned its smartwatches as real-world everyday devices with utility features rather than gaudy gadgets crammed with unnecessary features.",
      "body": "Apple is known for its premium design and cutting-edge technology, but the company's consistent focus on functional design and utility is what sets it apart from the rest. Apple's devices, including the iPhone, iPad, and Apple Watch, are not just flashy gadgets designed to show off. Instead, they are ergonomically designed to be functional, user-friendly, and accessible to a wider userbase. The Apple Watch SE 2 is a testament to this. Apple's design mantra has always revolved around simplicity and minimalism. The company's devices have an unfussiness to its look and feel. The Apple Watch SE 2 is perhaps the best example of Apple's love for utility. The device is not just a smartwatch that tells time, but a compact health and fitness tracker. The Apple Watch SE 2 is a versatile and affordable smartwatch that has a lot to offer for those looking for a smartwatch. Launched in 2022, the Apple Watch SE 2 comes with a host of features that are designed to help you stay connected, healthy, and productive. I had a chance to use the new Apple Watch SE 2 for few months and here is what I feel about the smartwatch. (Photo credit: Saurabh Singh/Financial Express) The Apple Watch SE is designed to be sleek, stylish and versatile. It has a minimalist look, with a clean and simple interface. The watch is available in two sizes - 40mm and 44mm - and in three finishes - Midnight, Starlight and Silver colour tones. The straps are interchangeable, making it easy to switch up your style depending on your mood and taste. Before I talk more about the design, it is important for us to understand that Apple watches are never about fancy promises. The Apple watch sets itself apart from other smartwatches by focusing on simplicity and functionality over flashy design. It regards user experience over aesthetics, thus, the sleek and minimalist look of Apple Watch SE 2. It is both functional and understated. Instead of incorporating flashy features or eye-popping designs, Apple stresses on the utility of the watch, offering tools and functions that enhance the user's daily life and this is what has helped it mark the Apple watch as a leader in the smartwatch market. I love the design of Apple Watch SE 2. It's sleek and looks great on my wrist. The build quality feels solid and I haven't had any issues with it so far. There were and are still times when I just dump the watch in my jewellery box or amidst my other gadgets but the display never showed signs of any scratch. It always comes out shiny and smooth. The display on the Apple Watch SE is bright and clear, making it easy to use even in direct sunlight or harsh lighting conditions. The Apple Watch SE runs on the latest version of watchOS, which is fast, responsive, and intuitive. The watch is powered by the S8 chip with 64-bit dual-core processor which provides smooth and responsive performance, even when using tough apps. I haven't experienced any lag or slowdown. Coming to the health and fitness, one of the standout features of the Apple Watch SE is its focus on health and fitness. The watch has a built-in heart rate monitor, which allows you to track your heart rate throughout the day. It also has a number of fitness features, such as a step tracker, an activity tracker, and workout tracking. My personal favourite is the Mindfulness feature which is meant for improved mental wellbeing. I love it especially because it simply reminds me to breathe and have my own time which we often miss out on due to the busy lifestyle that most of us have today.  The Watch SE 2022 has advanced fitness tracking features that makes it a great personal coach, inspiring movement and encouraging progress. Each step taken, every calorie burned, and every mile travelled is captured and monitored, painting a vivid picture of one's physical activity. The heart rate monitor takes health monitoring a level up by keeping a watchful eye on my heart beats, giving a beat-by-beat account. The Apple Watch SE is designed to keep you connected, even when you are away from your phone. It has built-in cellular connectivity, allowing you to make and receive calls and access messages. The battery life is where Apple leaves me wanting for more. The Apple Watch SE 2 does not last more than a day for me. I use it as my everyday device and have to charge it everyday to get it going. The charging also takes longer. The watch has a low power mode, which can extend battery life but at the cost of dim screen. With the magnetic charging cable, it is easy to charge the watch when you need to. Apple has always positioned its smartwatches as real-world everyday devices with utility features rather than gaudy gadgets crammed with unnecessary features. Instead of promising fancy things, Apple has emphasized the watch's ability to provide helpful information and tools for daily life. Overall, the Apple Watch SE is a good smartwatch that combines style and functionality at an affordable price (compared to its siblings). Whether you are looking for a way to stay connected and healthy or you simply want a stylish and versatile watch, the Apple Watch SE is a sensible choice. ALSO READ l Apple Watch SE (2022) review: Pocketable and pocket-friendly",
      "snippet": "<b>Apple</b> has always positioned its smartwatches as real-world everyday devices with utility features rather than gaudy gadgets crammed with unnecessary ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:13:52",
      "provider": {
        "name": "financialexpress",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.financialexpress.com/wp-content/uploads/2023/02/watchse21.webp",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "financialexpress",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.financialexpress.com/life/technology-apple-watch-se-2022-long-term-user-review-big-things-come-in-small-packagesnbsp-2969850/"
      }
    },
    {
      "id": "3445965184670459301",
      "title": "Apple is eliminating its iconic 'industrial design chief' position",
      "url": "https://9to5mac.com/2023/02/02/apple-industrial-design-chief-role/",
      "description": "Apple is eliminating one of its most high-profile executive positions. Accoring to a new report today, Apple is eliminating the role of industrial design chief as part of a broader shake-up. This role was once held by Jony Ive, and most recently held by Evans Hankey. Under this new structure, the design team will report []",
      "body": "Reddit\nApple is eliminating one of its most high-profile executive positions. Accoring to a new report today, Apple is eliminating the role of industrial design chief as part of a broader shake-up. This role was once held by Jony Ive, and most recently held by Evans Hankey.\nUnder this new structure, the design team will report to Apples chief operating officer Jeff Williams.\nApple is shaking up the structure of its industrial design team\nHankey has been Apples top product designer, as the vice president of industrial design, since 2019. She is a successor to Jony Ive, who departed Apple in 2019. Under this structure, Hankey is responsible for hardware design, while Alan Dye is responsible for software design and holds the title of VP of human interface design\nHankey, however, is set to leave Apple within the coming months, as previously announced in October, after three years in the role.\nBloomberg\nnow reports that following Hankeys departure, Apple wont name a new executive to fill the industrial design chief role. This is a significant change to Apples leadership structure, as the vice president of industrial design has existed for decades.\nThe report says that Apples core group of industrial designers will now report to Jeff Wiliams, Apples chief operating officer. Under the previous structure, Hankey reported to Williams, but the core design team reported to Hankey.\nWith this change, Apples longest-tenured designers will get larger roles, but none of them will be elevated to the top-level industrial design chief position.\nInstead, the companys core group of about 20 industrial designers will report to Jeff Williams, Apples chief operating officer. The company will also give larger roles to a group of Apples longest-tenured designers. Hankey has reported to Williams since taking the job in 2019, when top designer Jony Ive left to start his own firm.\nThat group will get larger roles as part of the shift. But Williams decided that none would be named the new head and that the entire team will report to him. That move links Apples operations group more closely with design  an arrangement thats irked some of Apples creative staffers. It will also elevate Williams, who is seen as a possible successor to Chief Executive Officer Tim Cook.\nWilliams has an increasingly broad range of responsibilities at Apple. The companys Leadership webpage touts that Williams oversees Apples entire worldwide operations, as well as customer service and support. He also leads Apples health-related projects, pioneering new technologies and advancing medical research.\nWilliams is viewed as a potential successor to Tim Cook for the role of Apple CEO. Apple is reportedly increasingly focused on succession planning internally, and Williams is said to be one of the leading candidates to be the companys next CEO. When asked in 2021 if he would be at Apple in 10 years, Cook said probably not.\n9to5Macs Take\nThe increasing involvement of operations executives with the Apple design process has been criticized by Apple commentators, as well as by designs and creatives inside Apple. The decision to put Williams, a veteran operation executive, is unlikely to ease any of those concerns.\nI think its important to keep in mind, however, that Williams has been involved with the design team for several years at this point. Hankey has reported to Williams since 2019. The difference now is that the middle ground between Williams and the rest of the design team is being removed.\nApples product design has widely been praised since Hankey took the reigns in 2019, with many products eschewing Ives design language of making things as thin and light as possible. Realistically, I think Hankeys departure is likely to have a bigger impact on Apples design team than Williams taking on a bigger role. At this point, however, the two will be conflated from the outside.",
      "snippet": "<b>Apple</b> is eliminating one of its most ... executive positions. Accoring to a new report today, <b>Apple</b> is eliminating the role of industrial design ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:13:35",
      "provider": {
        "name": "9to5mac",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/10/evans-hankey-leaves-apple.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "9to5mac",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://9to5mac.com/2023/02/02/apple-industrial-design-chief-role/"
      }
    },
    {
      "id": "3876117257913071593",
      "title": "Truth Be Told Exclusive Preview: Poppy Learns Who Her Real Father Is",
      "url": "https://hollywoodlife.com/2023/02/02/truth-be-told-preview-poppy-real-father-season-3-video/",
      "description": "Poppy gets confirmation about her real father in this exclusive 'Truth Be Told' preview.",
      "body": "Poppy cuts in, She left us. She left you. Shreve replies, But she came back. Thats what matters. She came back. Poppy doesnt understand how Shreve could take her mother back after what she did.\nRon Cephas Jones in Truth Be Told. (Apple TV+)\nHow could I not? You and I both know the danger of letting one mistake define you, Leander explains. She asked for my forgiveness and I gave it because I loved her and she loved me. And we hung onto that. She wanted to forget about him, and so did I. We kept looking forward to get back to us.\nHe says they redefined our family, our life. Poppy, with tears in her eyes, asks Shreve, Is he my biological father? Shreve replies, Yes.\nArticles Trending Now\nTrending Now\nGisele Bundchen Poses In Pink Chanel Swimsuit After Return To Modeling Following Tom Brady Divorce\nAt the end of season 2, viewers learned that Shreve was not Poppys birth father after he stumbled upon her birth certificate that he kept hidden. Shreve and Poppys relationship has always been complicated. He ended up leaving her in a foster home years ago, but now he wishes he hadnt. Shreve decided to burn the birth certificate.\nThe official synopsis for the February 3 episode reads, Markus tries getting to the bottom of a shocking discovery. Eva makes a startling confession to Poppy.\nRelated Link\nDexter: New Blood Season 2: The Latest On Whether Or Not Its Happening\nOctavia Spencer in Truth Be Told. (Apple TV+)\nIn season 3, Poppy, frustrated by the lack of media attention for several young missing Black girls, teams with an unorthodox principal, played by Gabrielle Union, to keep the victims names in the public eye, while chasing down leads to a suspected sex trafficking ring that may have ensnared them. In addition to Gabrielle and Octavia, season 3 stars returning cast members Mekhi Phifer, David Lyons, Ron Cephas Jones, Merle Dandridge, Tracie Thoms, Haneefah Wood, Mychala Faith Lee, and Tami Roman. New episodes of Truth Be Told season 3 premiere Fridays on Apple TV+.",
      "snippet": "New episodes of Truth Be Told season 3 premiere Fridays on <b>Apple</b> TV+.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T16:07:06",
      "provider": {
        "name": "hollywoodlife",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://hollywoodlife.com/wp-content/uploads/2023/02/Truth-Be-Told-Preview-Apple-ftr.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "hollywoodlife",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://hollywoodlife.com/2023/02/02/truth-be-told-preview-poppy-real-father-season-3-video/"
      }
    },
    {
      "id": "4989853319573066992",
      "title": "Apple Is Dropping Industrial Design Chief Role in Post-Jony Ive Era",
      "url": "https://finance.yahoo.com/news/apple-dropping-industrial-design-chief-160606652.html",
      "description": "(Bloomberg) -- Apple Inc. has decided against naming a new executive to replace its departing top product designer, marking a stark shift for a company long ...",
      "body": "Hong Kong to Give Away 500,000 Air Tickets to Revive Tourism\nThe iPhone makers vice president of industrial design, Evans Hankey, wont be replaced when she leaves the company in the coming months, according to people with knowledge of the decision, who asked not to be identified because the deliberations are private. An Apple spokeswoman declined to comment.\nInstead, the companys core group of about 20 industrial designers will report to Jeff Williams, Apples chief operating officer. The company will also give larger roles to a group of Apples longest-tenured designers. Hankey has reported to Williams since taking the job in 2019, when top designer Jony Ive left to start his own firm.\nFor decades, Apples design czars were some of the highest-profile people at the company. Even before Ive became head of design in 1997  around the time co-founder Steve Jobs returned to Apple  executives like Robert Brunner gained fame for molding the companys products.\nWorking with Jobs, Ive turned Apples design aesthetic into something of a religion. They touted clean lines, simple interfaces and the occasional pop of color  such as the translucent cases on the original iMac.\nBut Apples design group was broken up in 2015, and Ive stepped back from his day-to-day role at the company. The team was split into industrial design, which covers hardware, and a division handling user interfaces  the look of the companys software. Hankey has been in charge of industrial design, while Alan Dye continues to lead the other group.\nStory continues\nHankeys announcement last October that she was leaving  after only three years in the role  was surprising and left Apple with few obvious successors. Her exit is part of a broader exodus within the design team, making it all the harder to find a replacement. About 15 of Apples top designers under Ive have departed the Cupertino, California-based technology giant since 2015. Bloomberg reported in November that this has hindered efforts to replace Hankey.\nSeveral of the companys industrial designers left for LoveFrom, a design and consulting firm founded by Ive and Marc Newson, who formerly did work for Apple. Still, a number of veteran designers have remained at Apple, including Molly Anderson, Duncan Kerr, Bart Andre, Richard Howarth, Peter Russell-Clarke and Ben Shaffer.\nThat group will get larger roles as part of the shift. But Williams decided that none would be named the new head and that the entire team will report to him. That move links Apples operations group more closely with design  an arrangement thats irked some of Apples creative staffers. It will also elevate Williams, who is seen as a possible successor to Chief Executive Officer Tim Cook.\nAside from design, Williams oversees global operations, the supply chain and AppleCare customer support, as well as software engineering for the watch and health efforts. Direct responsibility for hardware engineering for the Apple Watch was reassigned to John Ternus, the companys hardware engineering chief, several months ago.\nHowarth was briefly the head of industrial design between 2015 and 2017  while Ive reduced his involvement following the launch of the original Apple Watch  but he struggled to manage a crew of former peers. Howarth, along with Andre, has been at Apple for nearly three decades. Hankey, meanwhile, was at the company for about 20 years.\nApple eschewed hiring an outsider to take the top role. Taking that step would have been the death of the team, a longtime member of the group told Bloomberg in November. It also didnt want to put Dye in charge of both design groups, which could have ruffled feathers.\nStill, the company could theoretically name a new industrial design head  from either inside or outside the company  if the right candidate emerges one day.\nMost Read from Bloomberg Businessweek",
      "snippet": "<b>Apple</b> Inc. has decided against naming a new executive to replace its departing top product designer, marking a stark shift for a company long . Hong ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:06:06",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.zenfs.com/en/bloomberg_technology_68/407e97f99fdd1b497642adc53dbcfa94",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://finance.yahoo.com/news/apple-dropping-industrial-design-chief-160606652.html"
      }
    },
    {
      "id": "3468682945312049621",
      "title": "Apple VP explains the revitalization of HomePod addresses limitations and more",
      "url": "https://9to5mac.com/2023/02/02/apple-vp-explains-the-revitalization-of-homepod-addresses-limitations-and-more/",
      "description": "The second-generation full-size HomePod is set to hit the market tomorrow. Ahead of that release, a new interview with Apples VP of engineering offers an interesting insight into the timing of this release, some of the limitations of HomePod 2, and more. In an interview with TechCrunch, Matthew Costello, Apples VP of Hardware Engineering and []",
      "body": "Reddit\nThe second-generation full-size HomePod is set to hit the market tomorrow. Ahead of that release, a new interview with Apples VP of engineering offers an interesting insight into the timing of this release, some of the limitations of HomePod 2, and more.\nIn an interview with TechCrunch, Matthew Costello, Apples VP of Hardware Engineering and Operations, discussed why Apple made the decision to reintroduce the full-size HomePod right now. According to Costello, Apple studied the learnings from the first-generation HomePod and introduced the new model when it was able to able to achieve [a] broad range of experience goals.\nWe deeply studied the learnings from the first HomePod and HomePod mini, and we introduced the new HomePod when it was able to achieve our broad range of experience goals, Costello explained.\nCostello also touched on why the new HomePod uses Wi-Fi 4 connectivity, which is a step back from the previous models support for Wi-Fi 5. In his very vague response, Costello said that this shouldnt have an impact on performance:\nHomePod features Wi-Fi 4 connectivity that allows us to target exactly what works best in the entire system, Costello tells TechCrunch, making sure Siri requests are responsive, and ensuring a consistent experience for all you are listening to, controlling your smart home accessories and more  all while being energy efficient.\nHe also explained how Apple worked to make the acoustical imaging consistent across both generations of the HomePod mini:\nWhen creating a stereo pair, its important that the audio characteristics match for an optimal, balanced experience, says Costello of the lack of compatibility. The new HomePod delivers immersive, room-filling sound users love  with even more detail, clarity and layers than the original HomePod  so we wanted the acoustical imaging to be as pure and consistent as possible from generation to generation. The principle of having audio characteristics match in a stereo pair applies to HomePod mini, the original HomePod and the new HomePod.\nAs for the future of the HomePod mini, TechCrunch says that Apple Apple declined to comment on whether it will remain a focus following the re-release of the full-size model. The company, however, said that it is a popular option given its $99 price point.\nThe full interview with Costello, who has been at Apple since 2014 and was at Beats before that, can be found on TechCrunch.",
      "snippet": "... Costello, <b>Apples</b> VP of Hardware Engineering and Operations, discussed why Apple made the decision to reintroduce the full-size HomePod right now.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:05:07",
      "provider": {
        "name": "9to5mac",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/01/homepod-comparison-new-vs-original-mini.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "9to5mac",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://9to5mac.com/2023/02/02/apple-vp-explains-the-revitalization-of-homepod-addresses-limitations-and-more/"
      }
    },
    {
      "id": "8755862909525206374",
      "title": "Apples Virtual Keyboard Patent Makes You Part of the Computer",
      "url": "https://www.reviewgeek.com/144687/apples-virtual-keyboard-patent-makes-you-part-of-the-computer/",
      "description": "In the age of smartphones, everybody is used to the idea of a virtual keyboard. But it only takes a few seconds to realize why it would be a terrible idea on a laptop or desktop computer. However, a recent patent filing reveals that Apple is working on the issue and has a unique solution.",
      "body": "360b/Shutterstock.com\nIn the age of smartphones, everybody is used to the idea of a virtual keyboard. But it only takes a few seconds to realize why it would be a terrible idea on a laptop or desktop computer. However, a recent patent filing reveals that Apple is working on the issue and has a unique solution.\nIf the keyboard on a computer were an enormous, flat touchscreen, it likely would only take a few seconds for typing to become annoying and tiring. Human fingers just dont function the same on a keyboard as they do holding a smartphone.\nApple\nApples solution is for users to wear small, thimbles-like harnesses on their fingers to simulate the tactile feel of pressing a button. Sort of like a magnetic hepatic produced by gently squeezing and shunting your fingers. While this idea is definitely unique, it raises the question of whether its worth the trouble to ditch the physical keyboard in favor of a wearable accessory and make your fingers a defacto part of the computer.\nRELATED\nThe Best Ergonomic Keyboards for Improved Typing and Comfort\nHowever, the finger harnesses would serve another purpose other than simulating the feeling of typing. Mashing your fingers full force on a touchscreen repeatedly would likely wear out the device faster than a conventional keyboard. The harnesses would soften the impact of a finger press on a touchscreen and let the user know they dont have to use as much force as they would on a standard keyboard.\nIts worth noting that just because Apple has been granted this patent doesnt necessarily mean it plans to implement the technology. It simply means the company invented it and wants to guard against other companies using a similar method.\nSource:",
      "snippet": "However, a recent patent filing reveals that <b>Apple</b> is working on the issue and has a unique solution. 360b/Shutterstock.com In the age of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:00:26",
      "provider": {
        "name": "reviewgeek",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.reviewgeek.com/p/uploads/2022/06/0f6cc665.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "reviewgeek",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.reviewgeek.com/144687/apples-virtual-keyboard-patent-makes-you-part-of-the-computer/"
      }
    },
    {
      "id": "7681178471396649542",
      "title": "Apples hardware VP on the HomePods return",
      "url": "https://www.focustechnica.com/apples-hardware-vp-on-the-homepods-return/",
      "description": "Maybe nothing ever truly dies in Apple land. The Mac Pro went on an indefinite hiatus as the hardware design team regrouped and reengineered. MagSafe appeared to be gone forever, only to be reborn in altered form on MacBooks of recent vintage.Various models and sizes across different lines have bee",
      "body": "Apples hardware VP on the HomePods return\nBy Bernice Clark on February 2, 2023\nMaybe nothing ever\ntruly dies in Apple land. The Mac Pro went on an indefinite hiatus as the hardware design team regrouped and reengineered. MagSafe appeared to be gone forever, only to be reborn in altered form on MacBooks of recent vintage.\nVarious models and sizes across different lines have been phased out, only to return again. When the second gen HomePod goes on sale tomorrow, it wont be entirely without precedent. But even so, this one feels different.\nIn March 2021, Apple announced that its premium smart speaker was going away. The statement was uncharacteristically conclusive from the company, even going so far as dropping the d-word. We are discontinuing the original HomePod, it told TechCrunch at the time, it will continue to be available while supplies last through the Apple Online Store, Apple Retail Stores, and Apple Authorized Resellers.\nIt wasnt defeatist, exactly, as the company went on to praise the HomePod Mini in the same statement, but it was clear at first blush that this wasnt the outcome Apple expected when it announced the original device in 2018. Five years ago, the smart speaker market was poised for tremendous growth, following a banner 2017 Q4. And why not? Suddenly the promise of home automation was within grasp for the average consumer. Gone were the days when bringing a little smarts into your house required a lot of money and several contractor hours.\nApple was a relatively late entrant to the space, in spite of having a seven-year-old smart assistant. Amazons first Echo hit the market at the end of 2014. The first Google Home device (now Nest) went up for sale almost exactly two years later. The two companies goals were nearly identical: use hardware as a conduit to get their smart assistant in as many homes as possible.\nThat meant, among other things, racing to deliver the cheapest devices possible. In the years that followed, it was common to see Amazon, Google and their partners giving away Echo Spots and Home Minis for free. It was a loss-leader strategy, a long-tail bet that content would eventually more than pay back the money lost to hardware.\nWhile it was hardly the first to market, the HomePod offered something novel. Google had mined similar territory a year prior, with the $399 Home Max, but Apple had been waiting, watching and building a device that followed its customary approach to the market. Even more so than the Home Max, HomePod was a speaker first and foremost.\nFrom a design perspective, at least, the move paid off. The first HomePod looked and sounded great. In his review, Matthew Panzarino certainly didnt mince words when he declared it easily the best sounding mainstream smart speaker ever. It was a big, definitive statement  the kind one rarely reads in reviews. But you would have been hard-pressed to make a compelling case to the contrary.\nBy August the year of the HomePods debut, analytics declared that just shy of one-third of U.S. consumers had a smart speaker in their home. Two years later, Amazon continued to dominate the category, owning around 70% of the market. Google came in second at a bit over 30%. HomePod, meanwhile, was lumped into a third category that also included the likes of Sonos and Harmon, comprising less than 20% of the market, combined.\nThe numbers were disappointing, if not entirely surprising. Apples no compromise approach meant effectively excluded true mainstream adoption. The $349 launch price (later lowered to $299) immediately ruled it out for a lot of consumers. So, too, did the fact that it required an iOS device for setup. Amazon and Googles respective head starts also worked against the devices market saturation. These are ecosystem plays, above all. If youre already an Alexa or Google Home house, you probably arent going to introduce Siri into the picture.\nThat same year, Apple addressed a number of those complaints with the $99 HomePod Mini. Its not the Echo Spot or Home Minis rock-bottom price, but it opened the line to a broader segment of the public that had gone unaddressed with the original offering. In hindsight, its not entirely surprising the HomePod was discontinued in 2021, but it still felt strange that the company was removing what had previously been the cornerstone of its smart home strategy.\nEarlier this month, the company announced an about-face. HomePod was returning. The speaker looked nearly identical to the product announced in 2018, but Apple promised even better sound, coupled with improved smart home functionality. While the company wont disclose how long its been working on this iteration of the product, a spokesperson confirmed with TechCrunch that the revival is due to customer demand, noting, We really did hear from our customers this growing interest for more powerful and richer acoustics of a larger speaker. In other words, this wasnt part of some secret plan to bring the product back all along.\nThe All-New HomePod arrives in a different world than its predecessor. Amazon, for one, may have sold a hell of a lot of Echoes over the past nine years, but the longer-term gamble has thus far failed to pay off. Prior to the company making massive cuts to the Echo team, it was reported to be operating at a $5 billion a year revenue loss. Googles revelations were less dramatic, but the Nest division was reportedly the subject of a hiring freeze, while home products were conspicuously absent from last years Pixel event.\nWe deeply studied the learnings from the first HomePod and HomePod mini, Matthew Costello, Apples vice president, Hardware Engineering and Operations, told TechCrunch, and we introduced the new HomePod when it was able to achieve our broad range of experience goals. Costello, who heads up the HomePod team, was formerly the CEO of Beats, joining Apple when it acquired the headphone maker in 2014.\nIts a strange time to resurrect the product on the face of it. Thats not to say that Apples timing is bad, necessarily. With Amazon and Google having seemingly taken their eye off the ball in the smart speaker arena, there may be an opening for Apples offerings. Such distractions dovetail nicely for what could well prove a watershed moment for the space, with the ongoing roll out of the Matter standard.\nThe dirty little secret is that none of the smart home on-boarding experiences have been great up to now. Major players took a fragmented approach to the market, whether it was HomeKit or Works With Google/Alexa, many consumers no doubt brought home some shiny new smart home accessory, only to find out that it wasnt compatible with their chosen ecosystem.\nThat, frankly, is a bad experience. At the end of 2019, however, the big players put aside their differences for a moment. Amazon, Apple, Google, Samsung and Zigbee joined forces to create the Connectivity Standards Alliance, Matters parent organization.\nThe IoT started reaching a point where it became obvious to have that r",
      "snippet": "Maybe nothing ever truly dies in <b>Apple</b> land. The Mac Pro went on an indefinite hiatus as the hardware design team regrouped and reengineered.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T15:44:36",
      "provider": {
        "name": "focustechnica",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "focustechnica",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.focustechnica.com/apples-hardware-vp-on-the-homepods-return/"
      }
    },
    {
      "id": "2751284006655284651",
      "title": "Shop Amazon early Presidents Day deals on Apple, Lego, Leesa and Sennheiser",
      "url": "https://news.yahoo.com/shop-amazon-early-presidents-day-153349404.html",
      "description": "Beat the shopping rush with the best early Amazon Presidents Day deals on kitchen appliances, tech and more home essentials.",
      "body": "4 min read\nStart saving early with these Amazon Presidents Day deals available now.\n Recommendations are independently chosen by Revieweds editors. Purchases you make through our links may earn us and our publishing partners a commission.\nPresidents Day 2023\nis less than three weeks away and we are gearing up for another holiday of hot prices. Some of those great deals are already here, especially if you're a fan of Amazon. If you want to get ahead of all the other shoppers this year, we've got you covered with today'sbest early Presidents Day Amazon deals.\nShop Amazon deals\nAs one of the biggestonline retailers, Amazon has a plethora of home essentials on sale well before Presidents Day, on Monday, February 20. You can find savings on furniture, TVs, kitchen appliances and more top-rated products. Whatever your preference, these Amazon deals are at some of the lowest prices of the year.\nSamsung Galaxy S23:\nFeatured Amazon Presidents Day deals\nJallWake Up Light Sunrise Alarm clockdeal\nThis JALL alarm clock help you wake up easier and it's on sale at Amazon now.\nMake your mornings a bit more pleasant with the help of the Jallsunrise alarm clock. Typically listed for $59.99, you can get this compact bedroom essential for as low as $32.88 thanks to a 45% discount. We ranked the JallWake Up as the best affordable sunrise alarm clock for its variety of light options to choose from and the solid quality of said light.\nWaterpik Aquarius Water Flosserdeal\nKeep your teeth clean with this Waterpik water flosser on sale at Amazon now.\nIf you want to avoid pokes and prods at the dentist, keep your teeth healthy with the help of the Waterpik Aquarius water flosser. Normally priced at $99.99, you can get it as low as $73.48 in bluethanks to a 27% discount. As one of our favorite water flossers, the Aquarius wowed us with its 10 different floss and massage modes and the ability to provide 90 seconds of continuous water flow.\nStory continues\nShop Amazon mattress deals\nWhen is Presidents Day 2023?\nPresidents Day historically occurs on the third Monday in February. This year, the federal holiday falls on Monday, February 20.\nWhen do Presidents Day 2023 sales start?\nWhile Presidents Day 2023 officially takes place on Monday, February 20, several retailers have already dropped major sales. In years past, the majority of sales were live the Friday before Presidents Day proper and ran through the weekend.\nEach year retailers launch their Presidents Day sales earlier and earlier, and 2023 is no different. In 2022, we saw the first Presidents Day sales in late January.\nHow long do Presidents Day 2023 sales last?\nTypically, Presidents Day sales end with the culmination of the holiday on Monday night, or in the few days following Presidents Day proper. Some retailers, however, extend their Presidents Day sales significantly. For instance, in 2022, Tuft & Needle, Leesa, Coach, Nordstrom, HP and The Home Depot offered Presidents Day deals through late February. Meanwhile, Beautyrest and Serta concluded their holiday sales in March.\nThis year, like last, we expect to see select Presidents Day sales continue through early March. Although some sales may start earlier and end later, we suggest shopping early to avoid any issues with stock shortages or shipping delays.\nWhat stores offer Presidents Day 2023 deals?\nDozens of can't-miss Presidents Day 2023 deals are already live. If you're looking to refresh your sleep setup, Saatva and\nsome of our favorite mattress brands\ncould be great options. Meanwhile, you can scoop savings on home essentials at Best Buy, Macy's and Walmart, or pick up trendy fashion staples at Nordstrom. Whatever you're shopping for, you're sure to find a deal worth snatching come Presidents Day 2023.\nDoes Amazon have Presidents Day sales?\nYes. Amazon's early Presidents Day 2023 sales are in full swing. In the days and weeks ahead we expect to see even more markdowns across all categories. Be sure to bookmark this page and check back frequently for all the best daily discounts.\nDo I need a Prime membership to access Presidents Day sales on Amazon?\nIn most cases, no, you wont need to have a Prime membership to take advantage of Presidents Day deals atAmazon. That said, there are likely to be a few deals that are Prime-exclusive, and you can always save on shipping costs by purchasing a Prime membership (even a trial) if you shop on Amazon frequently.",
      "snippet": "Beat the shopping rush with the best early Amazon Presidents Day deals on kitchen appliances, tech and more home essentials.\n4 min read Start saving early with these Amazon Presidents Day deals available now.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:33:49",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/ny/api/res/1.2/yTQGm7mRz5br7q9hAhuAtA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/usa_today_money_325/33faf1b28abef1bbcc195f68e72e9bc4",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://news.yahoo.com/shop-amazon-early-presidents-day-153349404.html"
      }
    },
    {
      "id": "6429120769601297546",
      "title": "Samsung is pitting its $2,400 Galaxy Book 3 Ultra against Apple's 2023 MacBook Pro",
      "url": "https://www.ibtimes.co.uk/samsung-pitting-its-2400-galaxy-book-3-ultra-against-apples-2023-macbook-pro-1712239",
      "description": "The rivalry between Samsung and Apple is still alive and kicking and has now moved to their laptops.",
      "body": "The rivalry between Samsung and Apple is still alive and kicking and has now moved to their laptops. While Apple recently unleashed its 2023 MacBook Pro models, Samsung is well-prepared to meet the challenge with its $2,400 Galaxy Book 3 Ultra.There are three primary models for the Samsung Galaxy Book 3. The Galaxy Book 3 Pro, which is available in 14- and 16-inch variants and starts at $1,500, the Galaxy Book 3 Pro 360 (16-inch), which starts at $1,900, and the higher-end Galaxy Book 3 Ultra (16-inch), which starts at $2,400, according to TechCrunch.Among the three models, the Galaxy Book 3 Pro sets itself apart as the thinnest. On the other hand, the Book Pro 360 distinguishes itself from the rest as the swivelling convertible (PC/tablet). Based on its price alone, it is clear to see that the Galaxy Book 3 Ultra is the highest-end model of the bunch and is Samsung's best bet to compete with Apple's latest lineup of MacBook Pros.The Galaxy Book 3 Ultra is powered by the latest Intel Core i9 chip (13th gen) and sports the RTX GeForce 4070, which might not be Nvidia's highest-end mobile GPU but is still a force to reckon with. With these high-end specs and its focus on creative workflows, it seems that Samsung has the MacBook Pros and Microsoft Surfaces in its sights. Of course, it also helps that the Ultra is packed with powerful gaming capabilities, which is \"something Apple's first-party silicon frankly isn't quite ready to compete with.\"Samsung Galaxy Book 3 also adopts the Dynamic AMOLED 2X display found in the Galaxy phone line. The laptops boast of 2880 x 1880 (3K resolution) displays, a refresh rate of 120 Hz, and a 16:10 aspect ratio.Among the three models, only the Pro 360 features a touch screen, which supports the stylus functionality. Meanwhile, the Ultra stands out with its standard 16 GB of RAM, which can be upgraded up to 32 GB, and a storage of 512 GB, which can be upgraded up to 1 TB.",
      "snippet": "The rivalry between Samsung and <b>Apple</b> is still alive and kicking ... their laptops. The rivalry between Samsung and <b>Apple</b> is still alive and kicking and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:27:43",
      "provider": {
        "name": "ibtimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://d.ibtimes.co.uk/en/full/1703014/samsung-galaxy-book-3-ultra.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "ibtimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.ibtimes.co.uk/samsung-pitting-its-2400-galaxy-book-3-ultra-against-apples-2023-macbook-pro-1712239"
      }
    },
    {
      "id": "764111899637337510",
      "title": "TikTok User Goes Off on Apple for \"Cringey\" Black History Month Fitness Challenge",
      "url": "https://www.theroot.com/tiktok-user-goes-off-on-apple-for-cringey-black-histo-1850064261",
      "description": "The tech giant's announcement of a \"Unity Challenge\" fell flat with some users who called it tone-deaf",
      "body": "Black History Month just started and Apple is already in the hot seat. The company is being criticized by some Apple Watch users who are less than thrilled about the companys Black History Month fitness challenge which gives participants a Unity Award for working out seven days in a week. \n\n\nUsers received a push notification which read:\n\nUnity Challenge: Lets come together to honor Black history. Earn this Unity award by closing your Move ring for seven days in a row during February.\n\nOne TikTok user, @prettycritical, was especially disgusted. And she made her feelings known in a January 31 post. \n\nGood morning to everyone, except for Apple, which pushed me this notification this morning, she said. I just think its unbelievable and unacceptable that, especially in the wake of Tyre Nichols murder, the one thing that Apple has to say about honoring black people and black history is use our product, maybe use a little weight. I mean, come on. \n\nAnd because I live for the comments on posts like this, I have to share a few.\n\nSome commenters thought @prettycritical was reaching. One user wrote, Its an Apple Watch lol the point is to be active. Not everything is an attack on your character.\n\nBut others were just as angry. One user wrote, sitting on the couch for 7 days straight to spite them for this. Another wrote, Tell me you have no Black Americans in your marketing dept. And not to be outdone, there was this, brb let me go honor my culture by going for a walk.\n\n\nFull disclosure, I am an Apple Watch user, and I did not receive the push notification in question. And Apple is doing some good things this Black History Month. In a press release, the company announced their plans to honor Black History Month with exclusive content and curated launches celebrating Black culture and community, including a special-edition Apple Watch Black Unity Sport Loop, TV and film collections curated by Dr. Jelani Cobb and a spotlight on apps and games geared towards the Black community. They are also providing grants to organizations committed to providing economic, educational, and creative opportunities in communities of color, including Ghetto Film School (New York, Los Angeles, London), Music Forward (Los Angeles), Shout Mouse Press (Washington, D.C.), and The National Museum of African American Music (Nashville, Tennessee).",
      "snippet": "Black History Month just started and <b>Apple</b> is already in the hot seat. The company is being criticized by some <b>Apple</b> Watch users who are less than ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:05:00",
      "provider": {
        "name": "theroot",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bb5853c3cb8fd18ede6e5464f565268f.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theroot",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.theroot.com/tiktok-user-goes-off-on-apple-for-cringey-black-histo-1850064261"
      }
    },
    {
      "id": "4052722205365512145",
      "title": "Will the Samsung Galaxy S23 have dual SIM?",
      "url": "https://www.theshortcut.com/p/does-samsung-galaxy-s23-have-dual-sim",
      "description": "With Samsung's biggest competitor, Apple, abandoning physical SIM cards, is Samsung following suit?",
      "body": "Not all countries will get dual SIM\nAccording to the Samsung Global\nGalaxy S23 series\npage, not all Galaxy S23 phones will have dual SIM  some only have a single nano SIM card slot. If youve arrived at this site from a country outside the US, check with your preferred cellular provider or the Galaxy S23 tech specs for your country  provided dual SIM is important to you.\nThe benefits of dual SIM\nSamsung keeping dual SIM in the US is great news, and particularly welcome to anyone who travels internationally, as fussing with eSIM can be a headache when moving through the world. Not enough international carriers allow eSIM  and even fewer support a feature called\neSIM quick transfer\n, which allows for easy, on-device carrier-switching.\nEven if youre not much of a traveler, the fact Galaxy S23 phones can be used with two phone numbers  even on separate carriers  simultaneously means you can use one SIM card for official business and the other for personal, or simply use it to widen your phones coverage area.\nThese are benefits conferred by eSIM as well of course, and while eventually support for the feature will be ubiquitous, its generally agreed that Apple jumped the gun when it abandoned physical SIMs, and its good to see Samsung exercising restraint here.\nSubscribe",
      "snippet": "With Samsung's biggest competitor, <b>Apple</b>, abandoning physical SIM cards, is Samsung following suit?. Not all countries will get dual SIM According to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:04:15",
      "provider": {
        "name": "theshortcut",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2bab8a37-3312-4780-a207-0cbc062ea78b_1518x854.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theshortcut",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.theshortcut.com/p/does-samsung-galaxy-s23-have-dual-sim"
      }
    },
    {
      "id": "2772074703270161758",
      "title": "Meta Platforms Blasts Off To The Moon (NASDAQ:META)",
      "url": "https://seekingalpha.com/article/4574589-meta-platforms-blasts-off-to-the-moon?source=feed_all_articles",
      "description": "Meta Platforms stock rallied +20% in the after hours, driven by strong Q4 '22 earnings results. Click here to find out if META stock a buy now.",
      "body": "Meta Platforms stock rallied +20% in the after-hours session, driven by strong Q4 2022 earnings results.\nMeta Platforms is fundamentally undervalued given return to low-single-digit revenue growth and profit recovery.\nWe value the stock at $250 per share following expense/revenue guidance suggesting a path to approximately 5% revenue growth for FY '23.\nWe think the revenue outlook is fairly conservative and beatable by historic standards, assuming we found a bottom in digital ad trends in Q4 2022.\nMeta Platforms is cheaper than Apple stock, as we value both using a comparable method and arrive at Meta Platforms at 12x FY 25 dil. EPS versus Apple at 18.7x.\nMichael M. Santiago/Getty Images News\nMeta Platforms, Inc. (\nQ4 '22 earnings call\nwere also reassuring, as he stated, \"hire less, stay a smaller company for a while longer. Achieve better profitability, and make a better company.\"\nInvestment thesis: We value Meta Platforms, Inc. stock at $250 per share using a combination of EV/EBITDA, P/Sales, and dil. EPS from FY '25 while discounting our estimate by 9.2% based on META's WACC. We believe META stock is heavily undervalued given the tough news environment and temporary overhang in advertising results. We anticipate that META's ad metrics will likely recover.\nRisk factors: Meta Platforms, Inc. is prone to further competition across various digital platforms and a pullback on ad budgets. These trends could worsen, assuming there's a recession over the next 12 months, or there's an unanticipated drop in platform and user-level activity. We think TikTok has taken a sizable chunk of the digital advertising market over the past 12 months, and optics on advertising trends are starting to stabilize even with the entry of more competition.\nWhat drove the 20% share price gain in the after-hours session?\nThe guidance on Q1 '23 revenue of $26 Billion to $28.5 billion turned out a bit better than what analysts were anticipating. With META mostly reporting at the high-end of the estimate range, Meta Platforms, Inc.'s management is indicating a 2% y/y growth rate for Q1 '23. We expect 1H '23 revenue of 2%-3% and expect revenue acceleration in 2H '23 to accelerate and stay above a 5% growth rate for our financial estimate. We believe our estimate on sales growth is very conservative and could be beat on any number of factors as we go through the year.\nWe expect a gradual recovery in revenue, though it's contingent on heightened volumes of ad units from Facebook Reels, and perhaps moderating pricing trends given the added competition with TikTok. Given these factors, we average a 5% y/y sales growth figure into our FY '23 estimate and expect performance to improve by the time we reach Q4 '23 given the trends in ad level metrics over time.\nWe expect META to report revenue of $122.439 billion in FY '23, which compares to consensus estimates of $121.28 billion, which puts us slightly above consensus following the quarterly call by about +$1.15 billion. We think our expectations are extremely conservative and position our financial model for substantial upside as the growth narrative shifts towards better performance from new product segments and profitability.\nMETA reported revenue of $116.609 billion and $8.79 dil. EPS for FY '22. We anticipate a recovery in revenue based upon the outlook and also compute a significant decrease in the total dil. shares outstanding to 2.459 billion, which implies about a 180 million share decrease, a bit more than expected (appx. 100 million share reduction).\nWe expect the company to generate $13.60 dil. EPS for FY '23, which compares to current consensus expectations of $8.00 Dil. EPS for FY '23, which is significantly higher by a wide margin. We think estimates will revise up to an average consensus estimate range of $10 to $14 per share, depending on what analysts want to believe, which is what drove the divergence in estimates upwards, and also the META stock price by a significant amount +20% in Wednesday after-hours trade.\nSummary of price target and financial model\nWe arrive at our FY '23 EPS estimate given total expense guidance of $89 billion to $95 billion, which drove our net income figure to be significantly higher along with the reduced share count driven by share buybacks.\nWe think META communicated a path to mid-single-digit revenue growth, and expect the growth narrative to improve albeit modestly, which is embedded into our gradual revenue growth forecast to $142 billion by FY '25.\nWe expect the EBITDA margin, and net profit margin to be below FY '21 levels throughout our model, as we expect the expense ramp to be more gradual given the ongoing investments into VR. As such, our adj. EBITDA margin exits at 48%, whereas our net profit margin is at 32.31%, and we arrive at a fairly conservative, $68 billion EBITDA figure, and $46 billion profit figure, on a slightly larger base of revenues. We arrive at our $330 FY '25 valuation using a blend of P/E, EV/EBITDA, and P/S, which we discount by 9.2% to arrive at our $250 price target on the stock.\nFigure 1. Financial Model META Platforms 2023-2025\nFinancial Model META (Trade Theory)\nWe estimate that META's profitability could gradually return to its FY '21 levels while growing revenue at a more modest single-digit percentage growth rate. On a strict valuation basis, META stock is heavily undervalued given our inputs of 5%-8% sales growth on a forward basis.\nThese growth rates are relatively conservative and seem achievable given scale of user base and the rollout of additional advertising tools. We attribute a 22x P/E multiple, 12x EBITDA multiple, and 4x sales multiple, which is at the lower-end of the range given our forecasted dil. EPS growth rate for the next 3-year period implies dil. EPS growth CAGR of 14.59%.\nGiven how conservatively we valued Meta Platforms, Inc., and the contribution of very limited growth on top-line and some recovery in profitability, we arrive at the conclusion that it doesn't take much for META to rip higher on any improvement in business setup or outlook as we progress through 2023.\nFinal takeaway from Q4 2022 earnings\nWe think Meta Platforms, Inc. survived a quarter that demanded a lot of scrutiny. Despite the weakening metrics throughout much of the year, revenue started to find a base and is likely to recover. Given the recovery narrative we're working with, we think META stock will trade at $250 over the next 12-month period, giving large-cap investors a viable growth stock to own. We expect +40% upside from the $182 level Meta Platforms, Inc. stock traded at in the after-hours session.\nWe think there's more room for upside revisions in analyst models, and Meta Platforms, Inc. stock could move even higher following the Thursday gap upwards in trade.\nThere's also a lot of Meta Platforms, Inc. negativity that was already priced into the stock. Though many would prefer to not invest into META due to their feelings on ad policy, community, or media portrayal of the company, we think the stock is heavily under",
      "snippet": "Meta Platforms is cheaper than <b>Apple</b> stock, as we value both using a comparable method ... at Meta Platforms at 12x FY 25 dil. EPS versus <b>Apple</b> at 18.7x.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:15:00",
      "provider": {
        "name": "seekingalpha",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445812614/image_1445812614.jpg?io=getty-c-w1536",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "seekingalpha",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://seekingalpha.com/article/4574589-meta-platforms-blasts-off-to-the-moon?source=feed_all_articles"
      }
    },
    {
      "id": "7892251199905670928",
      "title": "Nutrition: Here's Why You Should Add Apple To Your Daily Diet",
      "url": "https://www.ndtv.com/health/nutrition-heres-why-you-should-add-apple-to-your-daily-diet-3747610",
      "description": "Continue reading as we discuss the many benefits of adding apples to your daily diet.",
      "body": "Updated: February 02, 2023 7:32 pm IST\nApples are a great source of nutrients and have ample health benefits\nOne of the most well-liked fruits in the world is this crisp fruit with vibrant colours. Apples are grown all over the world and were first domesticated in Central Asia. They include high levels of vitamin C, fibre, minerals, and several types of antioxidants. Apples will never let you down, whether you consume them as a stand-alone snack in the middle of a hectic day or include them in salads, smoothies, pies, and desserts.\nApples are surprisingly satisfying for their modest calorie content. Apple consumption has been linked to a number of health advantages, according to numerous research. Continue reading as we discuss the many benefits of adding apples to your daily diet.\nHere are reasons why you should add applesto your diet:\n1. Aids weight loss\nApples are full because they are high in fibre and water. An increasing sense of fullness can aid in weight loss because it controls hunger. You might then decide to consume less energy as a result of this. According to a study, compared to drinking apple juice or pure in the same amounts, eating whole apples prolonged feelings of satiety for up to 4 hours. This occurred because entire apples slow down the rate during which your gut removes its contents.\n2. Good for the heart\nHigh soluble fibre consumption has been associatedwith a slower buildup of cholesterol-rich plaque in the arteries. Quercetin and epicatechin, two phenolic chemicals found in apple skin, help maintain normal blood flow by preventing cholesterol buildup on artery walls. Soluble fibre, which is the key to maintaining normal blood glucose levels, is abundant in apples.\n3. Prevents gallstones\nGallstones form when the gallbladder's bile solidifies as a result of too much cholesterol. Doctors advise a high-fiber diet that includes apples to help you control your weight and cholesterol levels to prevent gallstones. Apples are among the finest options for avoiding gallstones because of their high fibre content.\n4. Improves digestion\nDue to their high fibre content, apples can aid in the relief of both constipation and diarrhoea. Apple pectin fibre can either absorb extra water from the stool to slow down the bowels or draw it out of your colon to keep things moving.\n5. Detoxes the liver\nToxins must be removed from the body through the liver. The majority of specialists are skeptical about trendy detox diets and believe they may cause more harm than good. Fortunately, a fruit like an apple is one of the best and simplest meals you can eat to help detoxify your liver. Apples are abundant in polysaccharide pectin, a soluble fibre that aids in the body's removal of toxins and bad cholesterol. Malic acid is a naturally purifying nutrient found in apples that helps to eliminate pollutants from the body.\n6. Boosts immunity\nQuercetin is an antioxidant that is abundant in red apples. Recent research has shown that quercetin helps strengthen and support the immune system, especially during times of stress. One of the most unexpected advantages of eating apples for health is this.\n7. Boosts brain health\nApples' quercetin may shield your brain from oxidative stress-related harm. Additionally, quercetin controls oxidative and inflammatory stress indicators, which may protect against stress-related nerve injury.\nPromoted",
      "snippet": "<b>Apple</b> consumption has been linked to a number of health advantages, according to numerous research. Continue reading as we discuss the many benefits ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:02:23",
      "provider": {
        "name": "ndtv",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://c.ndtvimg.com/apples_625x300_1528453772410.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "ndtv",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.ndtv.com/health/nutrition-heres-why-you-should-add-apple-to-your-daily-diet-3747610"
      }
    },
    {
      "id": "7329057437918186177",
      "title": "Apple's Watch Ultra 2 may even get a more gigantic displayBut at what cost?",
      "url": "https://www.nextpit.com/apple-watch-ultra-2-2024-micro-led-display-what-size",
      "description": "Apple's Watch Ultra 2 (2024) is slated to get an even bigger display than its predecessor. It will also benefit from more efficient and brighter micro-LED.",
      "body": "Apple's unannounced Watch Ultra 2 could get an even wider display.\nThe Watch Ultra 2 is rumored to benefit from a micro-LED panel.\nApple may resort to thinner bezelsand frames to accommodate a bigger display.\nNextPit TV\nThe current Apple Watch Ultra is already one of the bulkiest smartwatches in the market. But that size might be surpassed by the Watch Ultra 2 if Apple will utilize a bigger display and it intends to use a bigger watch chassis.\nWhat will be the Apple Watch Ultra 2 (2024) display size?\nAccording to thesupply chain chatter, Apple is planning to use a micro-LED panel in next year'sWatch Ultra, which is more efficient and brighter compared to current OLEDs. The new display is said to be 10 percent wider compared to the 1.93-inch display in the Watch Ultra. This would put the final screen real estate of the unannounced wearable at 2.1-inch wide.\nApple Watch Ultra uses OLED display /  NextPit\nHowever, the increase in diagonal size would not mean that the watch will become bulkier. Instead, Apple could reduce the bezels surrounding the panel or perhaps combineit with a thinner frame to counterthe resulting extra millimeters. And the fact that Apple loves to tout how its products become thinner orlighter in every new generation, it would only be logical to make some size reduction on 2nd gen Watch Ultraas well.\nAffiliate offer",
      "snippet": "<b>Apple</b> may resort to thinner bezelsand frames to accommodate a bigger display. NextPit TV The current <b>Apple</b> Watch Ultra is already one of the bulkiest ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:00:01",
      "provider": {
        "name": "nextpit",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://fscl01.fonpit.de/userfiles/7446224/image/apple-watch-ultra/NextPit-apple-watch-ultra-compass.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nextpit",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nextpit.com/apple-watch-ultra-2-2024-micro-led-display-what-size"
      }
    },
    {
      "id": "5048074782933051788",
      "title": "Apples Earnings Expectations and Surprises",
      "url": "https://www.marketbeat.com/originals/apples-earnings-expectations-and-surprises/",
      "description": "As one of the largest and most influential tech companies in the world, Apple's earnings are always highly anticipated by investors and industry experts alike.",
      "body": "Apple Inc (NASDAQ: AAPL)\nis set to report earnings for the first quarter of the fiscal year 2023 after this evenings closing bell. As one of the world's largest and most influential tech companies, Apple's earnings report is always highly anticipated by investors and industry experts.\nThere has been a mix of positive and negative news surrounding the company in recent weeks, and given its size, its results can often be viewed as a bellwether for the broader industry. Lets take a closer look at some of the stock-moving headlines from recent days and see if theres a reason for investors to be excited.\nBearish Comments on Apple\nThe most recent news wasnt ideal for any Apple bulls looking forward to the stock adding to its January rally. The team over at Wells Fargo cut its earnings estimates for Apple earlier this week, citing \"increasing consumer demand weakness.\nAnalyst Aaron Rakers lowered his 2023 revenue and EBIT estimates to be 5% and 8% below the consensus as the cost of living crisis continues to bite consumer-focused companies.\nHis stance echoed Wamsi Mohan of Bank of America, who also urged caution heading into the release. He reiterated his Neutral rating on the stock and his price target of $153, which suggests shares are trading at about fair value where they are right now. \\Despite rallying nearly 20% since the start of the year, Mohan sees the report taking the steam out of the run, with the revenue decline for the company's March quarter set to be as much as 20% higher than anticipated.\nThis overarching concern about dampening consumer spending continuing to hurt Apples balance sheet is recurring. In addition to the two aforementioned heavyweights, investment firm Canaccord Genuity lowered its 2023 and 2024 estimates for Apple earlier this month. Analyst T. Michael Walkley couldnt have made his reasoning simpler, noting that \"we believe overall consumer demand is slowing for smartphones.\"\nSo Why The Buying?\nBut for all that, you cant deny that shares have been quite buoyant all month and have held their gains this week. Are we about to see another famous beat from the company that wont stay down? Theyve certainly done it before.\nMorgan Stanleys Erik Woodring is on this side of the fence. He and his team are bullish on the next 12 months, arguing that the hardware sector is entering the \"final innings\" of a late, middling cycle before the start of an industry rebound. An industry rebound that they expect Apple to be at the forefront of.\nHis $175 price target suggests theres at least an upside of 20% to be had from where shares closed on Wednesday, a bullish stance backed up by Marketbeats bullish Marketrank forecast as well. Based on how Apple shares have been performing in recent weeks, it's clear that investors have been buying into the upside potential.\nMany whove urged caution in the past few days have also flagged the decent long-term opportunity still in Apple shares, which could explain why so many have been happy to get involved this month. Apple is still expected to maintain its core market share against the competition and is in as strong a position as ever to take advantage of the consumer rebound when it happens.\nThe braver investor will be dipping their toe in and backing the company to give us the year's biggest surprise. Those with a lower risk tolerance might prefer to take the wait-and-see approach.\nNext week could get very interesting, depending on what those numbers are tonight. Investors and industry experts alike will be closely watching the company's results and guidance to get a better understanding of where the tech sector as a whole is heading. Stay tuned.\nShould you invest $1,000 in Apple right now?\nBefore you consider Apple, you'll want to hear this.\nMarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Apple wasn't on the list.\nWhile Apple currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.",
      "snippet": "<b>Apple</b> Inc (NASDAQ: AAPL) is set to report earnings for the first quarter of the fiscal year 2023 after this evenings closing bell. As one of the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:00:00",
      "provider": {
        "name": "marketbeat",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.marketbeat.com/logos/articles/small_stock-image_67667681_S.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "marketbeat",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.marketbeat.com/originals/apples-earnings-expectations-and-surprises/"
      }
    },
    {
      "id": "3572849140240556437",
      "title": "This refurbished Apple Macbook Pro 13.3\" is now under $300 for Valentine's Day",
      "url": "https://www.popsci.com/sponsored-content/refurbished-macbook-pro-valentines-sale/",
      "description": "Order by February 3rd to have it arrive before the big day.",
      "body": "Learn more \nFinding the perfect Valentines Day gift for your loved one (or yourself) can often seem daunting. Go-to gifts can be underwhelming, consisting of chocolates or teddy bears bound to end up in a closet. The refurbished Apple MacBook Pro 13.3 Intel Core i5 4GB 500GB HDD in silver is an excellent contender for those tech-loving individuals that need an updated high-performance device. Best yet, the MacBook is now price-dropped even further in time for the upcoming, romance-fueled holiday.\nWhether working from home, on personal projects, or needing a portable device, this laptop covers all the bases. With a 500GB hard drive and a 2.5GHz processor, the MacBook Pro can easily handle large files and multitask to fit your needs. At the same time, its 13.3 screen boasts a 25601600 display, providing ultimate clarity to all your images and videos.\nYou can easily take it with you for work or to stream your favorite apps. The MacBook Pro also features wireless technology, such as Bluetooth 4.0, and is compatible with various power ports and expansions, making it easy to connect to other devices and peripherals. And with a long-lasting battery, you wont have to worry about your work or entertainment being interrupted by a dying battery.\nNot only is this laptop a state-of-the-art device with excellent performance, but its also an eco-friendly option. The rise of recycled and refurbished products is taking over the market, with statistics stating over 251 million refurbished smartphones shipped globally in 2021. These lower price point refurbished products ultimately help to reduce electronic waste and sustainability in tech.\nNormally retailing for $349, you can now purchase this\nrefurbished MacBook Pro for only $254.99\nsavings of nearly 30 percent with no coupon code needed. Take advantage of this limited-time Valentines Day deal, and give the gift of technology to your loved one or treat yourself to an upgrade. But hurry, Feb. 3 is the last day to order with a guarantee to arrive on time for Valentines Day, while the price drop deal ends on Feb. 6.\nPrices are subject to change.\nCommerce",
      "snippet": "The refurbished <b>Apple</b> MacBook Pro 13.3 Intel Core i5 4GB 500GB HDD in silver is an excellent contender for those tech-loving individuals that need an ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:00:00",
      "provider": {
        "name": "popsci",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.popsci.com/uploads/2023/01/30/image-3.jpeg?auto=webp",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "popsci",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.popsci.com/sponsored-content/refurbished-macbook-pro-valentines-sale/"
      }
    },
    {
      "id": "2270255287564130679",
      "title": "Apple's iOS 16.3 fixed a bug which allowed apps to track your location",
      "url": "https://www.phonearena.com/news/ios-16.3-fixed-a-bug-which-allowed-apps-to-track-your-location_id145342",
      "description": "Apple's latest iOS and iPadOS update fixes a major privacy concern that somehow went unnoticed.",
      "body": "suffered from this exploit\n. The user in question  running iOS 16.2 at the time  was quick to notice that the app iFood was seemingly tracking their location, despite that being explicitly forbidden through Privacy Settings.\nAn important note is to be made here: there's no proof of malicious intent, and the company behind the app mightve done this completely unintentionally. As of now, they havent come forward with a statement, and that may very well be because they never noticed the data coming in.\nAfter installing the latest version of iOS and a quick reset, the user didnt encounter any similar issues. As such, if youd like to evade potentially risky situations like this, make sure to update your firmware as soon as possible.\nThe update is available now as both iOS and iPadOS for the following devices:\niPhone 8 and later\niPad Air 3rd Gen and later\niPad 5th Gen and later\niPad mini 5th Gen and later\nNew reasons to get excited every week\nGet the most important news, reviews and deals in mobile tech delivered straight to your inbox\nSubscribe\nAll comments need to comply with our\nCommunity Guidelines\nPhonearena comments rules\nA discussion is a place, where people can voice their opinion, no matter if it        is positive, neutral or negative. However, when posting, one must stay true to the topic, and not just share some        random thoughts, which are not directly related to the matter.\nThings that are NOT allowed:\nOff-topic talk - you must stick to the subject of discussion\nTrolling - see a\nOffensive, hate speech - if you want to say something, say it politely\nSpam/Advertisements - these posts are deleted\nMultiple accounts - one person can have only one account\nImpersonations and offensive nicknames - these accounts get banned\nModeration is done by humans. We try to be as objective as possible and moderate with zero bias. If you think a            post should be moderated - please, report it.\nHave a question about the rules or why you have been moderated/limited/banned? Please,            contact us.\nJoin the discussion...",
      "snippet": "<b><b>Apple</b>'s</b> latest iOS and iPadOS update fixes a major privacy concern that somehow went unnoticed.\nsuffered from this exploit .\nThe user in question running iOS 16.2 at the time was quick to notice that the app iFood was seemingly tracking their location, despite that being explicitly forbidden through Privacy Settings.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T13:52:08",
      "provider": {
        "name": "phonearena",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://m-cdn.phonearena.com/images/article/145342-wide-two_1200/Apples-iOS-16.3-fixed-a-bug-which-allowed-apps-to-track-your-location.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "phonearena",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.phonearena.com/news/ios-16.3-fixed-a-bug-which-allowed-apps-to-track-your-location_id145342"
      }
    },
    {
      "id": "4308604406150393604",
      "title": "All eyes on Apple ahead of earnings today; here's what the analysts expect",
      "url": "https://macdailynews.com/2023/02/02/all-eyes-on-apple-ahead-of-earnings-today-heres-what-the-analysts-expect/",
      "description": "Apple on Thursday reports fiscal first quarter 2023 (calendar fourth quarter 2022) after market close, right around 1:30pm PT / 4:30pm ET",
      "body": "All eyes on Apple ahead of earnings today; heres what the analysts expect\nThursday, February 2, 2023 8:51 am\nNews\nApple on Thursday reports fiscal first quarter 2023 (calendar fourth quarter 2022) after market close, right around 1:30pm PT / 4:30pm ET. The compnany will follow the release with a conference call with analysts scheduled to begin at 2pm PT / 5pm ET.\nEric J. Savitz for Barron;s\n:\nThe consensus view on Wall Street is that Apple (ticker: AAPL) will report sales of $121.7 billion for its fiscal first quarter, down 1.8% from the year-earlier quarter, marking the first year-over-year quarterly decline since 2019. Profits are projected at $1.95 a share, down from $2.10 a year earlier.\nAlso keep in mind that this time around, the December quarter had 14 weeks, rather than the usual 13. That was widely known, but an extra week can sometimes distort the Streets estimates.\nThe biggest swing factor is likely to be iPhone sales, where the Street is anticipating a hit from the companys well known production problems for the iPhone 14 Pro and Pro Max. The wild card is how the weakening economy has affected demand for those high-end phones.\nWall Street analysts tracked by FactSet expect iPhone revenue in the quarter of $68.3 billion, down 4.6% from a year earlier with Mac revenue of $9.3 billion, off 14%. The Street sees iPad revenue of $7.9 billion, up 9.6%. Wearables, home, and accessories revenue is projected to be $15.2 billion, up 3.4%. Analysts project services revenue of $20.5 billion, up 5%.\nMacDailyNews Note:\nAs usual, well have Apples results for you right around right around 1:30pm PT / 4:30pm ET and then cover the companys Q123 conference call with live notes starting at 2pm PT / 5pm ET.\nPlease help support MacDailyNews.",
      "snippet": "<b>Apple</b> on Thursday reports fiscal first quarter 2023 (calendar fourth ... right around 1:30pm PT / 4:30pm ET. All eyes on <b>Apple</b> ahead of earnings today.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T13:51:49",
      "provider": {
        "name": "macdailynews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://149359564.v2.pressablecdn.com/wp-content/uploads/2022/03/220328_logo.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "macdailynews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://macdailynews.com/2023/02/02/all-eyes-on-apple-ahead-of-earnings-today-heres-what-the-analysts-expect/"
      }
    },
    {
      "id": "1553400947243423555",
      "title": "How to print from iPhone wirelessly using AirPrint",
      "url": "https://www.geeky-gadgets.com/how-to-print-from-iphone-02-02-2023/",
      "description": "If you are lucky enough to own an Apple iPhone and the wondering how you can print physical copies of documents from your mobile phone. You will be",
      "body": "Julian Horsey\nIf you are lucky enough to own an Apple iPhone and the wondering how you can print physical copies of documents from your mobile phone. You will be pleased to know that this can be accomplished wirelessly thanks to Apples AirPrint technology. If you are wondering how to print from iPhone devices wirelessly this quick guide will take you through the complete process.\nThose of you not familiar with AirPrint you will be pleased to know the technology has been created by Apple to provide its customers with an easy way to print high quality documents wirelessly. Without the need to download or install drivers to connect to printers. AirPrint is supported by a wealth of different printers and print servers and allows you to print from your desktop Mac, MacBook, iPad or iPhone depending on your needs.\niPhone supported printers\nThe Apple AirPrint printing technology features include easy discovery, automatic media selection, and enterprise-class finishing options says Apple. For a complete list of all the available AirPrint devices supported by the technology jump over to the official Apple support website here. Printers from Hewlett-Packard, Epson, Dell, Canon and many more are supported and the list is regularly updated by Apple, although if you are specific printer is not listed it might be worth checking with the manufacturer for more information on whether it supports wireless printing from iPhone devices.\nAs explained Apple has made it possible to print from iPhone without the need to install any applications, additional drivers or other software. To learn more about how you can quickly and easily transform a digital document into a physical printed copy follow the instructions below.\nHow to print from iPhone\n1. Once you have confirmed that your printer supports Apple AirPrint.\n2. Go to the document that you would like to print\n3. Select the print option by pressing the Share button while viewing the document.\n4. From the presented options scroll down and select Print. If you cannot see a print option for the document or application within the apps Share menu, it might be worth checking that the application supports printing, and some do not.\n5. Make sure the printer you would like to print to is shown next to the Printer heading. If No Printer Selected is shown as in the image above pick the arrow on the right to see the available wireless AirPrint supported printers within range of your iPhone.\n6. Next choose the number of copies that you would like to print and any options such as paper size, range and layout.\n7. Once you are happy with your selection press the Print button in the top right-hand corner of the share screen.\n8. The iPhone application will now start printing your document using AirPrint\nOnce your printer has started spooling your request to print a document from your iPhone, you can view or cancel the print job using the App Switcher on your iPhone. By opening the App Switcher you will be able to view the current print document and by tapping on the arrow to the right of the document name you will be able to see its progress or cancel the print by pressing on the red Cancel Printing option at the bottom of the Print Summary page.\nOpening the App Switcher to view the print queue\nTo open the App Switcher on your iPad or iPhone device, simply swipe up from the bottom to see a list of all previously opened applications on your iOS device. If you own an older iPhone with a Home button simply double-click it to see the App Switcher. Scroll through until you see Print Centre for an update of all the documents currently in the print schedule.\nIt is also worth mentioning that you can also print using AirPrint from devices connected to the USB port an Apple AirPort Base Station or AirPort Time Capsule or using a Bluetooth connection if AirPrint is not available for your printer. If you are still experiencing issues trying to print from your iPhone, it might be worth jumping over to the official Apple online support site, contacting your IT technician or booking an appointment with an Apple Genius Bar representative to take you through the process of printing through your home network or supported AirPrint printer.",
      "snippet": "... you are lucky enough to own an <b>Apple</b> iPhone and the wondering how you can ... you are lucky enough to own an <b>Apple</b> iPhone and the wondering how you can ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T13:15:54",
      "provider": {
        "name": "geeky-gadgets",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.geeky-gadgets.com/wp-content/uploads/2023/02/How-to-print-from-iPhone.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "geeky-gadgets",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.geeky-gadgets.com/how-to-print-from-iphone-02-02-2023/"
      }
    },
    {
      "id": "3720650380754115517",
      "title": "Soccer fans: How to avoid paying full price for MLS Season Pass",
      "url": "https://niuenews1.com/soccer-fans-how-to-avoid-paying-full-price-for-mls-season-pass/",
      "description": "MLS Season Pass, Apple's groundbreaking approach to live soccer streaming, is now available for the 2023 season. I am here to implore you not to pay full",
      "body": "Get your Apple TV+ trial\nJared Newman / Foundry\nAssuming you dont already have an active Apple TV+ subscription, your first stop should be either Best Buy or Target. Both Retailers offer three-month free Trials for Apple TV+, available to new and returning subscribers alike. (Note that the latter requires a free Target Circle membership.)\nIf youve redeemed one of these offers before, consider having a family member sign up instead. Youll then be able to share both Apple TV+ and MLS Season Pass Subscriptions by setting up Apple Family Sharing.\nIf youre ineligible for those three-month trials, youll instead need to hand over $5 for a one-month Apple TV+ subscription, which still nets you a $15 savings. You can sign up through the TV app on your iOS device or on the Apple TV website.\n2.\nCancel Apple TV+\nJared Newman / Foundry\nNo matter how you sign up for Apple TV+, make sure to immediately cancel after doing so:\nLike most other streaming services, Apple TV+ gives you the full trial period even after you cancel, and yes, you can still sign up for MLS Season Pass at the discounted rate during the trial period. Only now, you wont get automatically billed at the end.\n3.\nSign up for MLS Season Pass\nJared Newman / Foundry\nNow that youve activated Apple TV+, youll be eligible for $20 off a full year of MLS Season Pass. To sign up, use this link, or click the Subscribe on Apple TV button on the MLS website.\nAt this point, you should see the discounted price of $79 for the full season of MLS Season Pass. If not, make sure youre signed into the same account you used for your Apple TV+ subscription.\nNote that if you had a family member sign up for Apple TV+, theyll need to sign up for MLS Season Pass through their own account, which they can then share with you through Apple Family Sharing.\n4.",
      "snippet": "Both Retailers offer three-month free Trials for <b>Apple</b> TV+, available to new and returning subscribers alike. (Note that the latter requires a free ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T13:15:44",
      "provider": {
        "name": "niuenews1",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.techhive.com/wp-content/uploads/2023/02/mlbseasonpasssub.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "niuenews1",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://niuenews1.com/soccer-fans-how-to-avoid-paying-full-price-for-mls-season-pass/"
      }
    },
    {
      "id": "3207751231162011265",
      "title": "Parks Associates: Apple is the Leading Ecosystem With Nearly 20% of US Internet Households Owning 3+ Apple-Brand Device Types",
      "url": "https://whatsuppub.com/news/national/article_00de6685-691f-581c-b666-1b69e7cbc4f9.html",
      "description": "Strong growth in the smart watch category has increased Apple's stickiness, with its base of ecosystem loyalists growing by 15% since 2019",
      "body": "Copy article link\nSave\nStrong growth in the smart watch category has increased Apple's stickiness, with its base of ecosystem loyalists growing by 15% since 2019\nDALLAS\n,\nFeb. 2, 2023\n/PRNewswire/ -- Parks Associates' new research from its quarterly survey of 10,000 internet households shows that Apple is leading the ecosystem among connected consumers, with nearly 20% of US internet households owning three or more Apple-brand device types. The research study Quantifying Brand Loyalty: Connected Device and Platform Ecosystems evaluates the devices and ecosystems developed by the four leading brands among consumer devices: Apple, Amazon, Google, and Samsung.\n\"The Apple ecosystem centers on its iPhone and iPad products- nearly all Apply Loyalists own these devices,\" said\nJennifer Kent\n, Vice President, Research, Parks Associates. \"Apple benefits from having the most tech-forward user base and highest perception of quality across these brands.\"\nThe study defines Brand Loyalists as households with three or more devices from the same brand. The following devices were counted as products within a brand's ecosystem:\nAppleApple desktop/laptop, Apple tablet, Apple smartphone, Apple TV streaming media player\nAmazonAmazon tablet, Amazon smartphone, Amazon Fire Stick or Fire TV streaming media player\nGoogle/AndroidAndroid computer stick, Android tablet, Android smartphone, Chromecast/Nexus Player/NVIDIA Shield with Google TV\nSamsungSamsung desktop/laptop, Samsung tablet, Samsung smartphone, Samsung TV\n\"Google is a solid second place in terms of ecosystems; its footprint has been growing at a much slower pace than Apple,\" Kent said.\nThis research explores the demographic distinctions between these brand loyalists and examines differing usage patterns, with particular attention given to the use of online content services such as music, video, gaming, and other subscriptions.\nFor more information on Quantifying Brand Loyalty: Connected Device and Platform Ecosystems, contact sales@parksassociates.com. To schedule an interview with an analyst or to request specific data, please contact Rosey Ulpino at rosey.ulpino@parksassociates.com or 972-490-1113.\nAbout Parks Associates\nParks Associates, a woman-founded and certified business, is an internationally recognized market research and consulting company specializing in emerging consumer technology products and services. Founded in 1986, Parks Associates provides business intelligence and research services through its proprietary methodologies developed over decades, including quarterly surveys of 10,000 internet households.\nThe company's expertise crosses many industries: home security and smart home, streaming video, broadband and pay-TV services, digital media and platforms, gaming, Wi-Fi and home networks, connected health, support, consumer electronics, home control systems, energy management, and tech solutions for the multi-dwelling (MDU), small-to-medium business (SMB), and commercial building markets.\nEach year, Parks Associates brings thousands of leaders together for its webinars and annual events. The firm hosts the annual executive research and strategy conferences CONNECTIONS, Connected Health Summit, Smart Energy Summit, Smart Spaces, and Future of Video.\nFollow Parks Associates on LinkedIn, Twitter, Facebook, and Instagram.\nContact:",
      "snippet": "... from its quarterly survey of 10,000 internet households shows that <b>Apple</b> is leading the ecosystem among connected consumers, with nearly 20% of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T13:00:00",
      "provider": {
        "name": "whatsuppub",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bloximages.newyork1.vip.townnews.com/whatsuppub.com/content/tncms/assets/v3/editorial/7/e5/7e59734f-ddf7-5177-a9dd-5316abdc7ba2/63dbb52e8cdab.image.jpg?crop=340%2C340%2C92%2C0&amp;resize=200%2C200&amp;order=crop%2Cresize",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "whatsuppub",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://whatsuppub.com/news/national/article_00de6685-691f-581c-b666-1b69e7cbc4f9.html"
      }
    },
    {
      "id": "795580447637946848",
      "title": "Samsung Galaxy S23 vs iPhone 14: How do they compare?",
      "url": "https://www.trustedreviews.com/versus/samsung-galaxy-s23-vs-iphone-14-4299461",
      "description": "The Samsung Galaxy S23 is official, but how does it compare to Apples similarly priced iPhone 14? Here we'll compare all.",
      "body": "The Samsung Galaxy S23 is official, but how does it compare to Apples similarly priced iPhone 14?\n\n\n\nBoth premium smartphones share a number of similarities but there are key differences between the two that might influence your buying decision one way or another. Heres all you need to know.\n\n\n\nDesign and screen\n\n\n\nThe Samsung Galaxy S23 and iPhone 14 have different yet similar approaches to design  some might even argue that the Galaxy S23 is more iPhone-like than ever before, with rounded corners, flat aluminium sides and a camera setup that doesnt look too dissimilar to the iPhone 8  aside from the additional lenses, of course.\n\n\n\nImage Credit (Trusted Reviews)\n\n\n\nThats largely down to Samsungs decision to remove the contour camera housing from the rear, instead opting for a minimalist finish that ditches the camera housing altogether. Its done in a bid to make the Galaxy S23 and S23 Plus look more like the high-end Galaxy S23 Ultra, as the top-end model looked vastly different to the standard models in the S22 range.\n\n\n\nThe iPhone 14, on the other hand, sports the same design as the iPhone 13 and iPhone 12, with an industrial angular design reminiscent of the iPhone 5 which, personally, is my favourite design of all the early iPhones. The camera setup on the rear is embedded within a raised glass housing, with various colour options available including Midnight, Purple, Starlight, Product Red and Blue.\n\n\n\nThe Galaxy S23, on the other hand, is only available in somewhat muted Phantom Black, Cream, Green and Lavender finishes.\n\n\n\nBoth are just as durable as one another with near-identical IP68 water resistance thatll survive a dunk in 1.5m of water for up to 30 minutes, along with enhanced display protection. Samsung uses Cornings latest Gorilla Glass Victus 2 while Apple opts for its own Ceramic Shield, but both essentially aim to reduce the chance of completely shattering your device if you drop it.\n\n\n\nImage Credit (Trusted Reviews)\n\n\n\nBoth the Galaxy S23 and iPhone 14 offer a 6.1-inch display, though there are crucial differences between the two. While the iPhone 14s Super Retina XDR display isnt to be sniffed at, with a high resolution, support for Dolby Vision HDR and other tech that delivers a great viewing experience when watching TikToks and scrolling through social media - the big differentiator is refresh rate.\n\n\n\nApple still insists that a high refresh rate is a pro feature and is thus only available in the Pro and Pro Max models of iPhone. Android makers have a very different opinion with even some budget-focused Android phones offering either a 90- or 120Hz refresh rate, while some high-end gaming phones go up to 165Hz.\n\n\n\nMore specifically, the Galaxy S23 boasts a Dynamic AMOLED 2X display with a super smooth 120Hz refresh rate, HDR10+ support and an embedded fingerprint reader that make it truly stand out from the entry-level iPhone. It also supports facial recognition via the selfie camera, but its not quite as advanced as the Face ID on offer from the iPhone.\n\n\n\nTheres also a different port offering, with Apple using the ageing Lightning port while the Galaxy S23 sports a USB-C port.\n\n\n\nCameras\n\n\n\nThe Samsung Galaxy S23 comes with a decent 50MP main snapper alongside a 12MP ultrawide snapper and a 10MP 3x optical zoom, while the iPhone 14 comes with a smaller 12MP main and 12MP ultrawide, with the optical zoom exclusive to the Pro models of iPhone.\n\n\n\nImage Credit (Trusted Reviews)\n\n\n\nBoth Apple and Samsung take image quality very seriously, with a lot of R&D put into the AI algorithms that help enhance the shots taken on each smartphone. That said, even with a smaller 12MP sensor, both the S23 and iPhone 14 should be on par with one another, though the pixel binning on offer from Samsungs snapper could give it the edge in terms of detail and low-light photography.\n\n\n\nItll certainly be interesting to see how the two compare side-by-side.\n\n\n\nFlip the phones over and youll find a 12MP snapper on both - up from the 10MP snapper on the S22 - with support for advanced features like 4K video recording, autofocus and portrait photography.\n\n\n\nOn the topic of video, the Galaxy S23 tops out at 8K@30fps while the iPhone 14 is capable of up to 4K@60fps with support for Dolby Vision HDR.\n\n\n\nPerformance\n\n\n\nBoth the Samsung Galaxy S23 and the iPhone 14 are powerhouses when it comes to mobile performance, with both at the top of their game.\n\n\n\nImage Credit (Trusted Reviews)\n\n\n\nThe iPhone 14 sports the A15 Bionic in place of the A16 Bioni",
      "snippet": "Samsung uses Cornings latest Gorilla Glass Victus 2 while <b>Apple</b> opts for its own Ceramic Shield, but both essentially aim to reduce the chance of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:53:23",
      "provider": {
        "name": "trustedreviews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.trustedreviews.com/wp-content/uploads/sites/54/2023/02/Samsung-S23-vs-iPhone14.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "trustedreviews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.trustedreviews.com/versus/samsung-galaxy-s23-vs-iphone-14-4299461"
      }
    },
    {
      "id": "6950923535532162417",
      "title": "Little-known iPhone menu lets you edit or unsend almost any text",
      "url": "https://www.dailystar.co.uk/tech/news/little-known-iphone-menu-lets-29114822",
      "description": "The iPhone is packed full of special features Apple don't advertise - including a 'secret' menu that you can use to edit, unsend, or copy any message you send over text or via iMessage",
      "body": "Privacy Notice\nIf you've ever sent something by accident, you'll know what a godsend being able to edit or unsend texts on platforms like WhatsApp and Facebook Messenger can be.\nIt's proved so popular, in fact, that Apple introduced the feature to iMessage with its recent iOS 16 update.\nThat means you now have access to a hidden menu on iMessage which gives you much more control over what you send.\nREAD NEXT: Free iPhone update hides your photos and videos from hackers, the police, and even Apple\nIt not only lets you 'undo send' or 'edit' your texts, but also lets you reply to specific messages from friends or even translate them if they're in a different language.\nYou'll have 15 minutes to edit any texts you send on iMessage using the feature\n(Image: Apple)\nTo edit a text on iPhone's iMessage, or to use any of the other options, all you have to do is press and hold down on any message.\nThis will bring up the menu and give the opportunity to edit or unsend it.\nIt's important to note that you only have a time limit of 15 minutes to make any changes to your messages. After that point, the option will run out.\nYour contacts will also be notified if you've edited a text, although unlike Facebook, they won't be able to see what changes you've made one you've made them.\niOS 16 was released with the new iPhone 14 - but earlier iPhone models can get it too\n(Image: Getty Images)\nJeff Bezos had to rename Amazon after morbid original name 'freaked out' lawyer\nYou need to install the iOS 16 update for the feature to be activated.\nTo do this, just tap the Settings app icon on your iPhone home screen then go to General > Software Update.\nMake sure your phone is plugged in and backup any important files before you begin installing the update.\nThe most recent version of iOS 16 is iOS 16.2. As well as introducing the text editing feature, it also brings a lot of important new security updates. So, make sure it's installed to protect your data from hackers.\nREAD MORE:",
      "snippet": "The iPhone is packed full of special features <b>Apple</b> don't advertise. including a 'secret' menu that you can use to edit, unsend, or copy any message ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:49:16",
      "provider": {
        "name": "dailystar",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i2-prod.dailystar.co.uk/incoming/article29115069.ece/ALTERNATES/s1200/0_Image.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "dailystar",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.dailystar.co.uk/tech/news/little-known-iphone-menu-lets-29114822"
      }
    },
    {
      "id": "8477455055753152863",
      "title": "Before the Bell: So Much Love for Just $40 Billion; Amazon, Apple, Google Earnings Coming in Just 12 Hours  24/7 Wall St.",
      "url": "https://247wallst.com/investing/2023/02/02/before-the-bell-so-much-love-for-just-40-billion-amazon-apple-google-earnings-coming-in-just-12-hours/",
      "description": "After markets closed Wednesday, Meta Platforms salved a loss with the promise of a massive share buyback. What will three $1 trillion+ tech giants do this afternoon to top that?",
      "body": "Paul Ausick\nFebruary 2, 2023 7:32 am\nPremarket action on Thursday had the three major U.S. indexes trading mixed. The Dow Jones industrials traded down 0.11%, while the S&P 500 was up 0.53% and the Nasdaq Composite was 1.4% higher.\nTen of 11 market sectors closed higher on Wednesday, with technology (2.29%) and consumer cyclicals (1.89%) posting the largest gains. Energy (1.89%) was the days only loser. The Dow closed up 0.02%, the S&P 500 up 1.05% and the Nasdaq up 2%. As expected, the Federal Reserve raised the federal funds rate by 25 basis points to a new range of 4.5% to 4.75%. Fed Chair Jerome Powell said the central bank has more work to do.\nWednesdays trading volume was well above the five-day average. New York Stock Exchange winners led losers by 2,227 to 855, while Nasdaq advancers led decliners by more than 2 to 1.\nThe weekly report on claims for unemployment benefits will be released before U.S. markets open. Economists expect new claims to total 201,000, up from 186,000 in the prior week. The preliminary fourth-quarter nonfarm productivity and unit labor costs also will be released before the opening bell. Productivity is expected to rise by 2.5%, compared to a third-quarter increase of 0.8%, and unit labor costs are projected to fall from the prior quarters 2.4% to 1.5%. If that works out, Thursday could deliver another boost to stocks.\nAmong S&P 500 stocks, chipmaker Advanced Micro Devices Inc. (\n) dropped 12.67%, after missing consensus profit and sales estimates and withdrawing guidance.\nSince posting a 52-week low in early November, shares of Meta Platforms Inc. (\nNASDAQ: META\n) have fallen by about 54%. Thanks to a surprisingly upbeat earnings report late Wednesday, the stock was on its way to a share price gain of around 20% on Thursday. If that happens, Meta will have doubled its share price since posting that low. The companys secret sauce is massive layoffs seasoned with less capital spending ($4 billion) and a $40 billion (10% of Metas market cap) share buyback. CEO Mark Zuckerberg said that 2022s decline in revenue (the companys first-ever year-over-year slide) simply forced us to basically take a step back and say, OK, we cant just treat everything like its hyper growth.\nGet Our Free Investment Newsletter\nI have read, and agree to the\nTerms of Use\nNow that Zuckerberg has declared 2023 the year of efficiency, all that remains is for Meta to deliver. Capex is still estimated to rise to a range of $30 billion to $33 billion this year, but that is $4 billion less on each end than the companys previous plan. The companys Reality Labs, the virtual reality R&D bit, accounted for $13.7 billion in spending last year and Meta expects to continue to invest meaningfully in Reality (but perhaps not in reality).\nNASDAQ: AAPL\n) are all reporting quarterly earnings after markets close Thursday. Based on premarket action investors are expecting a strong showing from all three. Amazon and Alphabet traded up about 4% with about three hours to go until the opening bell, while Apple traded about 1% higher.\nSponsored: Tips for Investing\nA financial advisor can help you understand the advantages and disadvantages of investment properties. Finding a qualified financial advisor doesnt have to be hard. SmartAssets free tool matches you with up to three financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you. If youre ready to find an advisor who can help you achieve your financial goals, get",
      "snippet": "... with about three hours to go until the opening bell, while <b>Apple</b> traded about 1% higher. Sponsored: Tips for Investing A financial advisor can help ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:32:50",
      "provider": {
        "name": "247wallst",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://247wallst.com/wp-content/uploads/2022/08/imageForEntry19-hb9.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "247wallst",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://247wallst.com/investing/2023/02/02/before-the-bell-so-much-love-for-just-40-billion-amazon-apple-google-earnings-coming-in-just-12-hours/"
      }
    },
    {
      "id": "1379163392129031471",
      "title": "Batterygate lawsuit failed in South Korea despite US win",
      "url": "https://9to5mac.com/2023/02/02/batterygate-lawsuit/",
      "description": "The US Batterygate lawsuit resulted in Apple agreeing to pay up to $500M to settle the case, but an equivalent case in South Korea has been dismissed  for what the plaintiffs lawyers say are unfair reasons. Both cases relate to Apples decision to throttle the performance of older iPhones with fading batteries, in order []",
      "body": "Reddit\nThe US Batterygate lawsuit resulted in Apple agreeing to pay up to $500M to settle the case, but an equivalent case in South Korea has been dismissed  for what the plaintiffs lawyers say are unfair reasons.\nBoth cases relate to Apples decision to throttle the performance of older iPhones with fading batteries, in order to prevent unexpected shutdowns. The problem was not what Apple did, but how the company did it \nBackground\nThe older a battery gets, and the more charge cycles it has been through, the worse its performance gets. This not only affects how far a phone can make it through a day without running out of power, but can also mean it can no longer cope with the power demands of high-performance tasks.\nApple found that some older iPhones were experiencing this, leading them to shutdown unexpectedly, even though the battery still had remaining power available. The company decided to fix this by monitoring battery health, and then throttling the performance of a phone when it was at risk of a shutdown.\nSo far, so good. The problem was that Apple didnt tell anyone it was doing this. Owners of older iPhones found their phones were getting slower, and believed this meant that the phone  rather than just the battery  needed to be replaced. The Cupertino company was accused of doing this deliberately, to encourage people to buy a new iPhone.\nThe issue turned into a media firestorm, with Apple forced to\n; and pay compensation to affected US iPhone owners.\nBatterygate lawsuit failed in South Korea\nHowever, The Korea Herald reports that a similar class action lawsuit in South Korea has been thrown out by a judge.\nASouth Korean court ruled on Thursday that Apple did not deliberately slow down the performance of its iPhone handsets, dismissing some 9,800 Korean smartphone buyers lawsuit for 2 billion won ($1.64 million) against the United States electronics giant.\nThe lawsuit is dismissed, a court judge briefly said, without elaborating as to the reason for the ruling. The ruling also indicated the plaintiffs are responsible for the entirety of attorneys fees.\nThe report doesnt directly indicate the reason for the ruling, but does give a clue, suggesting that the decision was based on strict legal requirements in South Korea  which the lawyers say are unfair.\nHannuri, the law firm representing the users, said in a statement Thursday that the ruling highlighted the need for changes in Koreas judicial system such that all of those aggrieved by wrongful conduct do not have to be present at the suit, as well as a discovery process to force plaintiffs and defendants to reveal evidence to be presented from the beginning of the trial.\nIts hard to see how a court can reasonably expect 9,800 iPhone owners to turn up for the case, let alone the 64,000 who originally filed a claim. Especially as the likely payout would struggle to cover the cost of getting to and from the courthouse, with US owners receiving just $25 each. But that appears to be the law, so ",
      "snippet": "The US Batterygate lawsuit resulted in <b>Apple</b> agreeing to pay up to $500M to settle the case, but an equivalent case in South Korea has been dismissed ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:10:09",
      "provider": {
        "name": "9to5mac",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/09/ios-16-battery-life.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "9to5mac",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://9to5mac.com/2023/02/02/batterygate-lawsuit/"
      }
    },
    {
      "id": "5543036047571454199",
      "title": "Apples, onions and other food items that are low in calories| Times Now",
      "url": "https://www.timesnownews.com/web-stories/lifestyle/food-with-low-calories-to-lose-weight/photostory/97554651.cms",
      "description": "Food with low calories to lose weight: Watermelon, apples, onions and other food items are low in calorie.",
      "body": "Feb 2, 2023\nApples\nApples are not only low in calories but also a good source of nutrients, such as fiber, vitamin C, and potassium.\nCredit: Unsplash\nOnions\nOnions have been linked to several health benefits as they are low calorie vegetables. It may reduce the risk of certain health conditions like heart and kidney disease.\nCredit: Unsplash\nCucumbers\nCommonly found in salads, cucumbers make a low calorie base for high protein dishes like chicken or tuna salad.\nCredit: Unsplash\nPapaya\nApart from being low in calories, papaya is high in a number of vitamins and minerals, including provitamin A, vitamin C, folate, and potassium.\nCredit: Unsplash\nStrawberries\nSweet and highly nutritious, strawberries are amongst the food items which has lower calories as compared to others.\nCredit: Unsplash\nSpinach is low in calorie and loaded with vitamins and minerals.\nCredit: Unsplash\nTomatoes\nTomatoes are amongst the food items which is low in calorie. They are also rich source of protective plant compounds like lycopene.\nCredit: Unsplash\nWatermelon\nWatermelon is a good source of many nutrients, including vitamin C. It is also low in calorie.\nCredit: Unsplash\nDISCLAIMER\nTips and suggestions mentioned in the article are for general information purposes only and should not be construed as professional medical advice. Always consult your doctor or a dietician before starting any fitness programme or making any changes to your diet.\nCredit: Unsplash",
      "snippet": "Food with low calories to lose weight: Watermelon, <b>apples</b>, onions and other food items are low in calorie.\nFeb 2, 2023 Apples Apples are not only low in calories but also a good source of nutrients, such as fiber, vitamin C, and potassium.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:03:02",
      "provider": {
        "name": "timesnownews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.toiimg.com/thumb/msid-97554714,width-900,height-1200,resizemode-6.cms",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "timesnownews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.timesnownews.com/web-stories/lifestyle/food-with-low-calories-to-lose-weight/photostory/97554651.cms"
      }
    },
    {
      "id": "6192948719204521651",
      "title": "The $10 Trillion Case For Decentralized Cybersecurity",
      "url": "https://www.forbes.com/sites/lawrencewintermeyer/2023/02/02/the-10-trillion-case-for-decentralized-cybersecurity/",
      "description": "Technology innovation is moving at a pace that only innovators and cyber criminals can keep up with. Web3 will not safely scale without a dramatic shift in our thinking to decentralized networks, which require decentralized cybsecurity solutions  - and greater digital education for our leaders, now.",
      "body": "Smart city and IoT (Internet of Things) concept. ICT (Information Communication Technology).\ngetty\nWith historic inflation, rising prices, the escalating Ukraine conflict, and massive job losses in banking and tech, policymakers and executives are stretched to deliver a recovery agenda to get the world back to normal. Most have little bandwidth for yet more problems to solve, like the impending perils faced by cyber threats.\nSadie Creese, a Professor of Cyber Security at the University of Oxford, said, There's a gathering cyber storm and it's really hard to anticipate just how bad that will be.\"\nSpeaking at the World Economic Forum in Davos in January, she was joined by other heavy hitters sounded alarm bells like Jrgen Stock, Secretary-General of the International Criminal Police Organization (INTERPOL) who said, This is a global threat, and it calls for a global response and enhanced and coordinated action.\nTheir concern cannot be understated. Fortunately, heads are becoming unstuck from the sand pile of cyber threat denial, albeit slowly. We are facing an estimated $10 trillion, or eight percent of global GDP, cyber damage headache by the year 2025 if we continue to take a business as usual approach to cybersecurity.\nThe statistics make grim reading. A 2021 CyberEdge report stated that 85 percent of the surveyed organisations in the report were aected by a successful cyberattack. Ransomware attacks have increased by 80% year-over-year with over 37,700 ransomware attacks happen every hour globally, that is about 578 ransomware attacks each minute.\nPutting the size of the cyberthreat problem into context is a herculean task. With global GDP\nat $94 trillion, eight percent, or $7.5 trillion, is a hefty sum of money to put at risk to criminals.\nMORE FOR YOU\nThe Digital Determinants Of Health: How To Narrow The Gap\nCurrently, the combined market value of FAANG (Facebook, Amazon, Apple, Netflix, and Google exceeds $3 trillion. If you compare this to the GDP of a country, Apples market cap is 2.1 times higher than Mexicos GDP, and Amazon's market cap is 4 times the GDP of Austria.\nAdd Microsoft into the mix, and its $1.8 trillion market cap would make it one of the richest countries in the world, with a value larger than the GDPs of Canada, Russia and Spain combined, even then however, the market cap of FAANG and Microsoft combined would only amount to $4.8 trillion.\nSome of the best criminal minds are poised to control more money than the largest companies and countries in the world, and many criminal syndicates are state-sponsored.\nThis money will not be invested in new infrastructure, job creation, poverty alleviation, food security, or the environment. The money is lining the pockets of a cohort that are not acting in the best interests of \"team humanity\" or democracy.\nThe Cost Of Convenience And Connected Devices\nThe Internet of Things (IoT) has been an incredible contributor to humanity, but it comes at a cost. According to Statista the global number of connected IoT devices is expected to grow to 30 billion connections by 2025. Everything from car keys to baby monitors, laptops to mobiles are all potential single points of failure as their internet connectivity opens back doors to vulnerable networks.\nIn the past, enterprise and institutional security was ring-fenced, and could be managed within the walls of the organization, but with servers moving to the cloud, remote workers, and a proliferation of IoT devices creating a huge mesh of interconnectivity, borders are no longer identifiable or defensible.\nThis glaring weakness has been swept under the rug or at least underestimated by both Web2 and Web3 enterprises. Until there is a monumental major shift in our understanding and thinking of both cybercrime and cybersecurity, institutions and private citizens will continue to be victims relentless criminal hackers.\nMonica Oravcova, co-founder and COO of Naoris Protocol says, When the World Economic Forum and the head of INTERPOL state that cybersecurity is in a crisis, its time that we change our approach and embrace new technologies like decentralized solutions, that remove the single points of failure [from traditional cybersecurity solutions] with the ability to identify and mitigate threats in real time.\nThe Centralized Status Quo\nCurrent cybersecurity is centralized, it configures every device to be a single point of risk to the network its connected to. Cybersecurity software lives in a black box controlled by the cybersecurity company, it is opaque and centrally owned and governed.\nCloud services used by companies, institutions and governments are also centralized, so its a challenge to trust the service when we cannot see or audit how it operates and performs. Any device is a point of entry for an attacker and any centralised system is vulnerable.\nWe are only now beginning to spotlight the weaknesses that exist in the current cybersecurity arena. Many organisations are realizing that they are working off outdated cybersecurity models and practices that are no longer fit for purpose, with some systems and processes dating back 40 years.\nToday, a professional hacker can breach a system in less than 12 hours, using software that they can buy off the dark web for a few hundred dollars. Hackers are forming cohesive and organised businesses, with their own marketing departments and administrative systems, for the purpose of selling ransomware-as-a-Service (RaaS).\nInstitutions Are Slow To Move And Are Losing The Battle\nWe are only now beginning to spotlight the weaknesses that exist in the current cybersecurity arena. Many organizations are realizing that they are working off outdated cybersecurity models and practices that are no longer fit for purpose, with some systems and processes dating back 40 years.\nThe cybercrime space is as at least as well funded as the cybercrime prevention space  but the criminals are winning. The fight is not against a band of hooded teenagers grappling with existential malaise, cybercrime is a multi-billion-dollar industry run by some of the many brilliant minds on the planet, and often incentivized by malevolent governments.\nDespite a global cybersecurity spend of $1.75\ntrillion\nin 2022, companies are still losing the battle, not because they are being outsmarted, but because they have been riding horses to tank battle. There needs to be stronger intervention and more innovation in the technology used to fight cybercrime.\nAccording to Microsoft, the average cost of a data breach is touching $4.25 million, and username and password attacks amount to 921 attacks every second, a 74 percent increase in 12 months, from July 2021 to June 2022. Their digital defense teams blocked 34.7 billion identity threats and 37 billion email threats in 2022.\nIts not difficult to understand why so much money is being thrown at the problem. IBM reports current detection time for a reported breach is 280 days on average, its little wonder that chief information and risk officers are be",
      "snippet": "... Of Health: How To Narrow The Gap Currently, the combined market value of FAANG (Facebook, Amazon, <b>Apple</b>, Netflix, and Google exceeds $3 trillion.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:00:45",
      "provider": {
        "name": "forbes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imageio.forbes.com/specials-images/imageserve/63dba0b222c014eec9e6ed8c/0x0.jpg?format=jpg&width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "forbes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.forbes.com/sites/lawrencewintermeyer/2023/02/02/the-10-trillion-case-for-decentralized-cybersecurity/"
      }
    },
    {
      "id": "8710583232487512276",
      "title": "Galaxy XR: Samsung is ready to challenge Apple in the virtual reality field",
      "url": "https://www.nextpit.com/samsung-xr-reality-headset-rumor-challenge-apple-vr",
      "description": "Samsung has announced that it is launching its XR headset powered by Android and Qualcomm soon. But will this be enough to challenge Apple's Reality Pro?",
      "body": "Samsung confirms it is developing XR devices.\nThe company is collaborating with Google and Qualcomm for its XR software and hardware.\nSamsung's CEO says the Galaxy XR headset will be ready in the near future.\nNextPit TV\nTowards the end of the Unpacked event, Samsung's TM Roh was joined by Qualcomm CEO Cristiano Amon and Android SVP Hiroshi Lockheimer. The latter revealed they are working on a next-genimmersive experience such as XR (extended reality)but noted the challenges to achieve this will require advanced solutionsthat all strategic partners involved will help fillin.\nGalaxyXR headset powered by aSnapdragon chip and running on an Android OS\nIn a separate interview, Roh confirmed that they are already working on an XR headset. The Samsung's mobile president didn't give any release timeline or additional details, but he says it will be ready in a foreseeable future. He also added that they chose Google as a software provider while Qualcomm will supply the chipset for this unannounced GalaxyXR device or whichever it will be called.\nSamsung Odyssey Plus VR headset and controllers /  NextPit\nSamsung is not a fresh name in the world of 'realities'. It has been offering a Samsung Gear VR accessory for several years ago. It has so far expanded in the mixed reality territory with the PC-poweredHMD Odyssey Plus (review). Interestingly, it's unclear how the Koreans will market the upcoming GalaxyXR headset. But it notes that it will tap Microsoft and Meta for the services.\nGalaxy XR vs Apple Reality Pro\nWith Samsung utilizing XR or extended reality, it is obviously planningto take on Apple. The Cupertino giant is scheduled to introduce the premiumReality Pro running on XR platform called Reality OS this summer. The rumored AR Apple Glasses was reported to be not in Apple's top priority as it intends to unveil a cheaper version of Reality headset first.\nAnd if you're confused on how the terms AR, VR, MR, and XR differ to each other, our reliable Matt Zellmer's ultimate virtual reality glasses comparison can provide enlightenment.\nAffiliate offer",
      "snippet": "The rumored AR <b>Apple</b> Glasses was reported to be not in <b><b>Apple</b>'s</b> top priority as it intends to unveil a cheaper version of Reality headset first. And ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T12:00:00",
      "provider": {
        "name": "nextpit",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://fscl01.fonpit.de/userfiles/7611461/image/samsung-odyssey-plus/samsung-odyssey-plus_16.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nextpit",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nextpit.com/samsung-xr-reality-headset-rumor-challenge-apple-vr"
      }
    },
    {
      "id": "9129743572585816710",
      "title": "Taylor Schilling Unpacks Dear Edward, Its Raw Emotions, and Overcoming Hardship",
      "url": "https://www.shondaland.com/inspire/a42723135/taylor-schilling-unpacks-dear-edward-its-raw-emotions-and-overcoming-hardship/",
      "description": "The actor is stepping into the role of an unexpected parent in the new Apple TV+ series.",
      "body": "Nadja Sayej\nPublished: Feb 2, 2023\nTaylor Schilling is funny. Like, slap-on-the-knee, outrageously funny. She is well known for her Emmy-nominated role as Piper Chapman on the Netflix series Orange Is the New Black, and as Erica Gauthier in Hulus Pam & Tommy. But turn back the dial, and the SAG Award-winning actor is even more hilarious in her film roles, such as her performance in the 2017 screwball comedy Take Me, and 2018s Family, in which she stars alongside Kate McKinnon as an unlikely parent. Theres also The Overnight, a 2015 sex comedy starring Jason Schwartzman.\nNow, Schilling stars in Dear Edward, a new series premiering on Apple TV+ on February 3. But it isnt a comedy. Its a drama adapted from Ann Napolitanos namesake best-selling novel Dear Edward, which follows a 12-year-old boy named Edward Adler (Colin OBrien), who is the only person to survive a plane that crashes in Colorado, outliving his older brother and his parents. He goes to live with his Aunt Lacey (Schilling), who has been trying to get pregnant for nine years with her partner, John (Carter Hudson).\nAs the showrunner, Jason Katims, says in the press notes: Every single scene shes in, it feels like youre living with his woman at that moment.\nIts a heart-wrenching series about love, loss, and piecing your life together after a major tragedy. Schilling spoke to Shondaland about this chilling series, transitioning from comedy to drama, and working with a 13-year-old scene partner.\nNADJA SAYEJ: We are used to seeing you in comedy roles. What was it like digging into the raw emotion of this series?\nTAYLOR SCHILLING: It was really very satisfying to play Lacey as a character. She wasnt super-connected to the whole [of me], but me in my lane as an actor  did you see it?\nNS: Yes! I saw it. I liked the corn dog scene. It was funny.\nTS: Yeah! I really enjoyed it. I really enjoyed the process.\nNS: What was it about Lacey that you identified with the most?\nTS: I think there were two things about her. One thing was the project as a whole. There was this notion of life, our best-laid plans of what one wants, and what ends up happening. The reality of a situation. Theres some kind of loss. Whether its a person, a job, or a dream  something shifts. To me, Lacey is resisting all of that, until theres this surrender and acceptance.\nThis content is imported from youTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\nDear Edward  Official Trailer | Apple TV+\nWatch on\nThen, theres a celebration of a new experience. Thats just so brave to me. Im just so curious about when humans do that. When you say to yourself: I just really wanted that thing. I thought life was going to be this. But with the reality of life, be it a system I cant change by myself, or the reality of my family, or whatever it is, I have to operate inside what is real. She has to do that in some way.\nNS: How does Lacey do that?\nTS: She experiences that through the lens of motherhood. I thought it was good for her. It was compelling. I was interested in the journey of miscarriage, and what it was like for her.\nNS: Was there any parallel to your own life, something you had to overcome through your own bravery or perseverance?\nTS: I think on a regular basis, I have ideas of what I want life to be. Then, Im faced with the reality. There can be tension there, or maybe I just listen to life rather than impose my will on life. I dont know if thats too esoteric, but yeah. I feel that every day thats my experience of being alive.\nNS: What was it like working with 13-year-old Colin OBrien, who stars as Edward in the series?\nTS: His heart is so open. Hes so good at what he does, and he cares so much. I really couldnt have asked for a better scene partner.\nNS: What was a difficult aspect of portraying Lacey on-screen?\nTS: Lacey inherited a machine shop that her father and grandfather ran, while her sister was able to make a creative career for herself. Lacey was faced with not having achieved her potential. She didnt create her life; she was given her life, and for whatever reason, she couldnt follow her dreams. Now, shes confronted with the responsibility of Edward, and like any parent, shes figuring it out as each day comes. She realizes that in accepting herself, other people can accept her as she is, and shes able to find a family.\nNS: What was it like working with the showrunner, Jason Katims?\nTS: I felt a sense of stability and security in his work. His work speaks to me, and when we met, he was excited because he felt this was something I could do. I felt the same way. The show is a true ensemble, and we were all involved in such deep, exquisite personal stories that are so nuanced and so full of sorrow and so full of joy. It makes you realize that even in the real world, were all connected.\nNadja Sayej is an arts and culture journalist based in New York City who has written 5 books, including Biennale Bitch and The Celebrity Interview Book.\nGet Shondaland directly in your inbox:",
      "snippet": "... actor is stepping into the role of an unexpected parent in the new <b>Apple</b> TV+ series. Nadja Sayej Published: Feb 2, 2023 Taylor Schilling is funny.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T12:00:00",
      "provider": {
        "name": "shondaland",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://hips.hearstapps.com/hmg-prod/images/entertainment-taylor-schilling-qa-longform-2500x1406-2223-ddm-1675189371.jpeg?crop=1xw:0.8890469416785206xh;center,top&amp;resize=1200:*",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "shondaland",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.shondaland.com/inspire/a42723135/taylor-schilling-unpacks-dear-edward-its-raw-emotions-and-overcoming-hardship/"
      }
    },
    {
      "id": "7946113798370244490",
      "title": "Earnings Results: Apple Alphabet Amazon to release their latest quarterly reports today",
      "url": "https://www.financialexpress.com/investing-abroad/featured-stories/earnings-results-apple-alphabet-amazon-to-release-their-latest-quarterly-reports-today/2969571/",
      "description": "Meta shares rose 20% after the company reported fourth-quarter revenue that exceeded expectations.",
      "body": "Some of the top US companies with global presence will be announcing their earnings results for the previous quarter. The market is highly focused on these companies' management outlook in addition to understanding the financial performance of the most recent quarter. Apple, Alphabet, Amazon, Merck & Company, Gen Digital, Royal Dutch Shell Intercontinental Exchange, Ford Motor ING Group and Starbucks Corporation are among those declaring their quarterly results today on February 2, 2023. Sanofi and Cigna Corporation will be announcing quarterly results on February 3. Nigel Green, CEO and founder of deVere Group, one of the world's largest independent financial advisory, asset management, and fintech organisations had made an observation ahead of a big week of earnings reports from tech heavyweights such as Amazon, Apple, Alphabet, and Meta - Investors shouldnt bet against big tech in the longer term. Meta stock price performance shows exactly that. In extended trading on Wednesday, Meta shares rose 20% after the company reported fourth-quarter revenue that exceeded expectations and announced a $40 billion stock buyback. The quarterly earnings for Meta Platforms Inc. fell by 55% as a result of a sizable charge due to cost-cutting measures like layoffs, office closures, and a rethinking of its data centre strategy. In the quarter that ended on December 31, net income decreased to $4.65 billion, or $1.76 per share, from $10.29 billion, or 3.67 per share, a year earlier. On Thursday, February 2, Apple Inc. will release its first-quarter financial results. Apple's conference call for the first fiscal quarter results and business updates is scheduled for Thursday, February 2, 2023 at 2:00 p.m. PT / 5:00 p.m. ET. Before the Q1 FY23 results, Apple's stock price is around $145, and the share is down nearly 16% year on year. However, 2023 has been a good start for Apple, with the stock up 12% in January. The impact from weakness seen in dollar in recent times may go against the global giants. FactSet in a recent study finds S&P 500 companies with more international revenue exposure reporting lower earnings and revenues in Q4 2022 than S&P 500 companies with more domestic revenue exposure. By January end, Domestic blended earnings decline was -3.5% while international blended earnings decline was more at -7.3%. Overall, 29% of the companies in the S&P 500 have reported actual results for Q4 2022 till January 27th. Of these companies, 69% have reported actual EPS above estimates, which is below the 5-year average of 77% and below the 10-year average of 73%.",
      "snippet": "<b>Apple</b>, Alphabet, Amazon, Merck & Company, Gen Digital, Royal Dutch Shell Intercontinental Exchange, Ford Motor ING Group and Starbucks Corporation ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:57:00",
      "provider": {
        "name": "financialexpress",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.financialexpress.com/wp-content/uploads/2023/02/19-2.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "financialexpress",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.financialexpress.com/investing-abroad/featured-stories/earnings-results-apple-alphabet-amazon-to-release-their-latest-quarterly-reports-today/2969571/"
      }
    },
    {
      "id": "2509317790935956239",
      "title": "Apple Dropping Product Design Chief Role Team to Report to COO Jeff Williams",
      "url": "https://www.macrumors.com/2023/02/02/apple-jeff-williams-to-lead-product-design-team/",
      "description": "Apple does not plan to name a replacement for vice president of industrial design Evans Hankey when she departs the company in the coming months,...",
      "body": "Joe Rossignol\nApple does not plan to name a replacement for vice president of industrial design Evans Hankey when she departs the company in the coming months, according to Bloomberg's Mark Gurman. Instead, the report claims that Apple's product design team will report directly to the company's operations chief Jeff Williams, in what is a major internal shift.\nApple plans to give key product designers larger roles within the team, but the new arrangement has still \"irked\" some of the employees, according to the report. Alan Dye will continue to lead Apple's software design team, the report adds.\nA spokesperson for Apple confirmed that Hankey would be leaving the company in a statement shared with Bloomberg last October.\n\"Apple's design team brings together expert creatives from around the world and across many disciplines to imagine products that are undeniably Apple,\" the statement said. \"The senior design team has strong leaders with decades of experience. Evans plans to stay on as we work through the transition, and we'd like to thank her for her leadership and contributions.\"\nHankey succeeded Jony Ive as Apple's de-facto design chief after he left the company in 2019, reporting to Williams. The report notes that Apple could eventually choose to hire a new industrial design chief, but as of now the company has no such plans.\nApple has placed more of an emphasis on function over form since Ive left the company, although it's unclear if his departure directly led to such a change. For example, Apple brought back ports like MagSafe, HDMI, and an SD card reader on the high-end MacBook Pro, and Apple also revamped the Siri Remote with a more traditional touchpad and button layout after some Apple TV users complained about the previous remote's design.\nTags: Jeff Williams,",
      "snippet": "<b>Apple</b> does not plan to name a replacement for ... departs the company in the coming months,. Joe Rossignol <b>Apple</b> does not plan to name a replacement for ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:37:26",
      "provider": {
        "name": "macrumors",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.macrumors.com/t/fA8JAuQKC-pd-tgbrw9NvuEv8cM=/1600x/article-new/2022/11/Apple-Design-Team.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "macrumors",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.macrumors.com/2023/02/02/apple-jeff-williams-to-lead-product-design-team/"
      }
    },
    {
      "id": "3703897469122297638",
      "title": "Imminent revenue downturn for Apple",
      "url": "https://www.itworldcanada.com/post/imminent-revenue-downturn-for-apple",
      "description": "Experts predict Apple to report its first quarterly revenue downturn in nearly four years after strict COVID-19 lockdowns and related protests in China impeded iPhone production at its largest assembler Foxconn during the quarter.",
      "body": "Print\nExperts predict Apple to report its first quarterly revenue downturn in nearly four years after strict COVID-19 lockdowns and related protests in China impeded iPhone production at its largest assembler Foxconn during the quarter.\nWith supply chain challenges largely normalized, we now believe Apple is entering a period of slower demand due to macro factors, said Cowen analyst Krish Sankar, adding that he expects 2 per cent fewer iPhone units to be sold in 2023.\nAccording to Refinitiv, Apple is supposed to announce on Thursday that iPhone sales fell about 5 per cent in the crucial holiday quarter. The last time iPhone sales fell was in August-October of 2020, months before the COVID-19 pandemic. While according to BofA analyst Wamsi Mohan, some demand for the iPhone will likely be pushed into the current quarter due to supply constraints in the first quarter and some demand lost due to a lack of product availability during the holiday season.\nThe disruption at the worlds largest iPhone plant in Zhengzhou, China, prompted Apple to issue a rare warning in November and limited stocks of its higher-end iPhone 14 models during what is typically its best-selling quarter, driven by product launches and the holidays.\nAll of these are the factors that drove Apple to the verge of reporting its first quarterly revenue downturn in nearly four years.\nThe sources for this piece include an article in Reuters.\nTags",
      "snippet": "Experts predict <b>Apple</b> to report its first quarterly revenue downturn in nearly four years after strict COVID-19 lockdowns and related protests in ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:37:17",
      "provider": {
        "name": "itworldcanada",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "itworldcanada",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.itworldcanada.com/post/imminent-revenue-downturn-for-apple"
      }
    },
    {
      "id": "6765550389372666441",
      "title": "The Apple Watch Ultra could get even bigger in 2024",
      "url": "https://www.t3.com/news/the-apple-watch-ultra-could-get-even-bigger-in-2024",
      "description": "Apple's largest smartwatch shows no signs of slimming down, according to rumours",
      "body": "(opens in new tab)\nand are aged 16 or over.\nWhen it was unveiled last year, the Apple Watch Ultra quickly took its status at the head of Apple's smartwatch line-up. Designed to go toe-to-toe with go-anywhere, do-anything watches like the Garmin Fenix 7, the Ultra built on the success of the Apple Watch series, while adding ruggedness and dependability.\nIt won a wide range of fans, too. Hikers and divers were the target market, but the Ultra found itself at home with a much wider range of fans, including pop icon, and watch aficionado, John Mayer.\nIt's not for the feint of heart though  or at least, not for the slim of wrist. The Ultra has a case diameter of 49mm, which is positively gargantuan. For reference, traditional watches tend to range from around 36-44mm. The Apple Watch Series 8 tops out at 45mm.\nNow, rumours are suggesting that the Ultra could be set to get even bigger, by around 10%. That's according to\nMacRumors\n(opens in new tab)\n, who cite Taiwanese publication, DigiTimes, as their source. The report states that a new 2.1-inch (53mm) Apple Watch Ultra model looks set for a 2024 release.\nThat would make it the largest Apple Watch ever, and larger even than most of the Garmin watches it looks to compete with. The report also suggests that it could be the first Apple Watch to feature a\n(opens in new tab)\n.\nI'm all for new and innovative products, but the suggestion of a larger Apple Watch Ultra seems like an odd one from Apple's perspective. Their entire business model is based around having mass-market appeal  we've seen beloved phones like the iPhone 13 Mini canned for this exact reason.\nThe current size is already prohibitive, with swathes of people online who want a pro-variant Apple Watch in a regular size. Driving further into the niche without addressing those consumers doesn't seem like the Apple we've come to know.\nToday's best Apple Watch Ultra deals\n(opens in new tab)",
      "snippet": "... it was unveiled last year, the <b>Apple</b> Watch Ultra quickly took its status ... built on the success of the <b>Apple</b> Watch series, while adding ruggedness and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:33:51",
      "provider": {
        "name": "t3",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.mos.cms.futurecdn.net/aF3GPyJCVRNhC58Q7Nvvjf.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "t3",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.t3.com/news/the-apple-watch-ultra-could-get-even-bigger-in-2024"
      }
    },
    {
      "id": "3802325399373232291",
      "title": "Apple store is a source of bogus software, according to Sophos",
      "url": "https://www.thenews-chronicle.com/apple-store-is-a-source-of-bogus-software-according-to-sophos/",
      "description": "The cybersecurity company Sophos has published new research on the sophisticated financial fraud schemes known as CryptoRom scams, which take",
      "body": "The cybersecurity company Sophos has published new research on the sophisticated financial fraud schemes known as CryptoRom scams, which take advantage of and dupe users of dating apps into making fictitious cryptocurrency investments.\r\n\r\nThe first bogus CryptoRom apps, Ace Pro and MBM BitScan, allegedly managed to get past Apple's stringent security measures, according to Sophos' most recent research, \"Fraudulent Trading Apps Sneak into Apple and Google App Stores.\"\r\n\r\nIt claims that in the past, fraudsters persuaded users to download unauthorized iPhone apps that were not authorized by the Apple App Store using workaround approaches.\r\n\r\nAccording to Sophos, both Apple and Google were instantly contacted about the phony apps and both companies have now taken them down from their respective stores.\r\n\r\nJagadeesh Chandraiah, Senior Threat Researcher, Sophos, said: In general, its hard to get malware past the security review process in the Apple App Store. Thats why, when we originally began investigating CryptoRom scams targeting iOS users, the scammers would have to persuade users to first install a configuration profile before they could install the fake trading app.\"\r\n\r\nThis obviously involves an additional level of social engineeringa level thats hard to surmount. Many potential victims would be alerted that something wasnt right when they couldnt directly download a supposedly legitimate app. By getting an application onto the App Store, the scammers have vastly increased their potential victim pool, particularly, since most users inherently trust Apple.\r\n\r\nChandraiah added: Both apps are also not affected by iOS new Lockdown mode, which prevents scammers from loading mobile profiles helpful for social engineering. In fact, these CryptoRom scammers may be shifting their tacticsi.e., focusing on bypassing the App Store review processin light of the security features in Lockdown.\r\n\r\nHe explained that the con artists constructed and actively maintained a bogus Facebook profile and persona of a woman who was purportedly leading a luxurious lifestyle in London in order to entice the victim, who was duped by Ace Pro, for example.\r\n\r\nAfter building a rapport with the victim, the scammers suggested the victim download the fraudulent Ace Pro app and the cryptocurrency fraud unfolded from there.\r\n\r\nAce Pro is described in the app store as a QR code scanner but is a fraudulent crypto trading platform. Once opened, users see a trading interface where they can supposedly deposit and withdraw currency. However, any money deposited goes directly to the scammers, he contuned.\r\n\r\nSophos thinks the scammers made the program connect to a remote website when it was first submitted for review in order to get past the App Store security.\r\n\r\nTo provide the domain a credible appearance to app reviewers, the domain also contained QR scanning code. However, after the app was accepted, the fraudsters changed its URL to point to a site registered in Asia. This domain makes a request, to which another server responds with content, ultimately delivering the phony trading interface.\r\n\r\nMBM BitScan is also available as an Android app, although it is listed on Google Play under the name BitScan, claims Sophos.\r\n\r\nAccording to the research, two apps connect with the same Command and Control (C2) infrastructure, which then does so with a server that appears to be a server for a real Japanese crypto company.\r\n\r\nBecause everything else is done through a web interface, it is challenging for Google Play's code reviewers to identify it as fraudulent.",
      "snippet": "According to Sophos, both <b>Apple</b> and Google were instantly contacted about the phony apps and both companies have now taken them down from their ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:28:21",
      "provider": {
        "name": "thenews-chronicle",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.thenews-chronicle.com/wp-content/uploads/2023/02/sophos.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "thenews-chronicle",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.thenews-chronicle.com/apple-store-is-a-source-of-bogus-software-according-to-sophos/"
      }
    },
    {
      "id": "6636076907627723170",
      "title": "The surprising reason behind Apple's iconic name as Steve Jobs 'wanted to be first'",
      "url": "https://www.dailyrecord.co.uk/lifestyle/surprising-reason-behind-apples-iconic-29113137",
      "description": "Almost everyone knows the popular tech firm's name and branding, but some may not know about the stories behind it.",
      "body": "Met Office confirms Scotland will be battered by monster rain storm as flood alerts issued\nSteve Jobs himself explained why he opted for the name in a 1981 press conference, saying: \"I love apples and like to eat them. But the main idea behind Apple is bringing simplicity to the public, in the most sophisticated way, and that's it, nothing else.\"\nAs part of Walter Isaacson's 2011 book 'Steve Jobs' the tech entrepreneur elaborated on his decision to opt for the name Apple.\nIn the spirit of competition, Jobs explained: \"It sounded fun, spirited, and not intimidating. Apple took the edge off the word 'computer'. Plus, it would get us ahead of Atari in the phone book.\"\nJobs also added that he wanted to steer clear of the \"boring\" names popular in tech such as \"Executek\" and \"Personal Computers Inc\".\nSteve Jobs was responsible for some of the early briefings\n(Image: David Paul Morris/Getty Images)\nAs for the logo, the brief came from Steve jobs to designer Rob Janoff - and the reason there's a bite missing is so that it's clearly an apple and not a cherry.\nAs reported by CNN, this was a 'happy coincidence' as the designer was told soon after that 'bytes' are a cornerstone of computing. And the rainbow pattern - which has now been ditched - was requested by Jobs to humanise the brand.\nHowever, there were earlier drafts including one designed by Apple co-founder Ron Wayne which showed Sir Issac Newton sitting under a tree, according to The Logo Creative.\nTop Trending Stories Today",
      "snippet": "But the main idea behind <b>Apple</b> is bringing simplicity to the public, in the most ... entrepreneur elaborated on his decision to opt for the name <b>Apple</b>.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:19:02",
      "provider": {
        "name": "dailyrecord",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i2-prod.dailyrecord.co.uk/incoming/article29113407.ece/ALTERNATES/s1200/0_JS217227298.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "dailyrecord",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.dailyrecord.co.uk/lifestyle/surprising-reason-behind-apples-iconic-29113137"
      }
    },
    {
      "id": "4950679300694681329",
      "title": "Democratic senator urges Apple and Google to ban TikTok from their app stores",
      "url": "https://www.cnn.com/2023/02/02/tech/senator-apple-google-tiktok-ban/index.html",
      "description": "A member of the Senate Intelligence Committee is calling on Apple and Google to remove TikTok from their app stores over concerns about national security, in the latest indication of mounting scrutiny on the short-form video app from members of Congress.",
      "body": "A member of the Senate Intelligence Committee is calling on Apple and Google to remove TikTok from their app stores over concerns about national security, in the latest indication of mounting scrutiny on the short-form video app from members of Congress.  In a letter sent to the two tech giants on Thursday, Colorado Democratic Sen. Michael Bennet calls TikTok an unacceptable threat to the national security of the United States and cites the same concerns that have prompted the federal government and more than half of US states to restrict TikTok from official devices and networks.  Writing to Apple CEO Tim Cook and Google CEO Sundar Pichai, Bennet highlighted fears that China could use its national security laws to force TikTok or its parent, ByteDance, to hand over the personal information of the apps US users. The laws in question, Bennet wrote, require organizations in the country to cooperate with state intelligence work and to allow the government to access company resources. ByteDances founder is Chinese and the company has offices in China. TikTok has also disclosed to European users that their data may be accessed by employees based in China.  China could potentially try to shape what US users see on the app, Bennet warned, with possible implications for foreign policy and democracy.  We should accept the very real possibility that [China] could compel TikTok, via ByteDance, to use its influence to advance Chinese government interests, Bennet wrote, for example, by tweaking its algorithm to present Americans content to undermine U.S. democratic institutions or muffle criticisms of Chinas handling of Hong Kong, Taiwan or ethnic minorities.  Apple, Google and TikTok didnt immediately respond to a request for comment. TikTok CEO Shou Zi Chew is expected to testify before a House committee in March to discuss the companys data security practices. There is no evidence that the type of spying or manipulation US officials fear has actually occurred, but security experts have warned that it is a possibility.  TikTok has denied that it would ever hand over US user data to the Chinese government. It has increasingly moved to wall off its US operations from the rest of its business, technologically and organizationally  part of what the company has described as a good-faith effort to address the national security concerns.  TikTok has also spent years negotiating a potential national security deal with the US government that would seek to resolve some of the concerns, but the talks have been mired by delays, leading to frustration among some members of Congress. In recent months, multiple US lawmakers have introduced bills that would ban TikTok from all US devices, including personal ones. Some other US officials have also called on Apple and Google to voluntarily remove TikTok from their app stores.  Last year, Brendan Carr, a commissioner at the Federal Communications Commission, wrote a letter to the companies urging them to de-list TikTok. The FCC does not regulate app stores, but Carr has said that his agencys experience dealing with Chinese telecom companies has informed his views on the matter. The FCC has moved to block Chinese firms including Huawei and ZTE from the US market, over fears that their wireless networking equipment could be used to collect information on US communications. Although the leading members of the Senate Intelligence Committee, Virginia Democrat Mark Warner and Florida Republican Marco Rubio, have also been outspoken critics of TikTok, the two lawmakers had not been invited to co-sign Bennets letter before it was sent, according to a spokesperson for Bennet. Rubio is an author of one of the bills seeking to ban TikTok from the United States, while Warner has said he would prefer to see a bill that targets a broader category of worrisome apps, rather than a single app such as TikTok.",
      "snippet": "A member of the Senate Intelligence Committee is calling on <b>Apple</b> and Google to remove TikTok from their app stores over concerns about national ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:07:17",
      "provider": {
        "name": "cnn",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.cnn.com/api/v1/images/stellar/prod/230201123756-colorado-sen-michael-bennett-1108-file.jpg?c=original",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "cnn",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.cnn.com/2023/02/02/tech/senator-apple-google-tiktok-ban/index.html"
      }
    },
    {
      "id": "516971151109899299",
      "title": "Eli Apple reflects on two best years of career with Bengals",
      "url": "https://www.cincyjungle.com/2023/2/2/23581694/eli-apple-reflects-on-two-best-years-of-career-with-bengals",
      "description": "Apple found love for his profession again playing for the Bengals.",
      "body": "Photo by Michael Owens/Getty Images\nFor a second consecutive offseason, Eli Apples future in the NFL hangs in the balance.\nThe polarizing cornerback is entering free agency once more after spending his second season with the Cincinnati Bengals. Though there have been notable ups and downs during this two-year run, Apple has fit in with the Bengals defense more than he performed like a liability.\nThe seventh-year veteran didnt hold back when describing what coming to Cincinnati meant to him.\nIt definitely brought back the love for the game feeling, especially leaving New Orleans the way I did, Apple said to Geoff Hobson of Bengals.com. And then going to the Panthers and not making it there and coming here and not knowing what to expect and then having the two best years ever in my life.\nThe burned bridges of Apples past made him a villain in the eyes of most fans and players alike. But the Bengals fed off his energy, as did the fans during the franchises most successful two-year run in history.\nIts hard to predict whether or not Apple returns for a third year in the Queen City, but the door is definitely open on his end.\nIts a beautiful city. (Cincinnati) is underrated. Ill definitely come back, Apple said of a possible visit. I want to go anywhere Im wanted. No team like (this one). Cant catch that feel anywhere else. Maybe you could, but I dont know, Ive been a lot of other places. Its rare.\nMore From\nThe Bengals have nothing to apologize for\nCam Taylor-Britt speaks on improvement plan for big offseason\nThe good, the bad and the ugly in Bengals loss to Chiefs\nJoe Burrow shares his thoughts on Chiefs comments following AFC Championship\nPotential Solutions for NFL Officiating Issues\nTalking Football with Bengal Jim and Friends: Geoff Hobson re-joins the program!\nMost Read\nJoe Burrow shares his thoughts on Chiefs comments following AFC Championship\nSafe to say you have to be able to take it if you are going to give it.\nThe Bengals have nothing to apologize for\nAfter two years of winning, Cincinnati has every right to talk its talk.\nLoading comments...",
      "snippet": "<b>Apple</b> found love for his profession again playing for the Bengals. Photo by Michael Owens/Getty Images For a second consecutive offseason, Eli <b><b>Apple</b>s</b> ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T11:00:00",
      "provider": {
        "name": "cincyjungle",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/81R-CWlMxoLNp__EMlq9Tu9u7zY=/0x0:4770x2497/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24403334/1461198429.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "cincyjungle",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.cincyjungle.com/2023/2/2/23581694/eli-apple-reflects-on-two-best-years-of-career-with-bengals"
      }
    },
    {
      "id": "8121986523349953097",
      "title": "Apple Explains Why HomePod Was Released Again Wi-Fi 4 Limitation and More",
      "url": "https://www.macrumors.com/2023/02/02/apple-new-homepod-interviews/",
      "description": "Apple's VP of hardware engineering Matthew Costello and product marketing employee Alice Chan recently spoke with Men's Journal and...",
      "body": "Joe Rossignol\nApple's VP of hardware engineering Matthew Costello and product marketing employee Alice Chan recently spoke with Men's Journal and TechCrunch about the new second-generation HomePod in wide-ranging interviews about the smart speaker.\nApple discontinued the original full-size HomePod in March 2021 after multiple reports indicated that sales of the speaker were lackluster, but Chan told Men's Journal that Apple has since \"heard more interest than ever for the acoustics of a richer larger speaker,\" leading the company to release another larger HomePod.\nThe new HomePod looks virtually identical to the original, although it is 0.2 inches shorter and has a larger edge-to-edge LED touchscreen on top. Costello told TechCrunch that Apple's teams \"really love\" this shape and form for the full-size HomePod and \"were able to create a wonderful system within that structure.\"\nCostello explained why the new HomePod is limited to the older Wi-Fi 4 standard, compared to Wi-Fi 6 on other modern Apple devices:\n\"HomePod features Wi-Fi 4 connectivity that allows us to target exactly what works best in the entire system,\" Costello tells TechCrunch, \"making sure Siri requests are responsive, and ensuring a consistent experience for all you are listening to, controlling your smart home accessories and more  all while being energy efficient.\"\nHe also elaborated on the inability to pair a new HomePod with an original HomePod:\n\"When creating a stereo pair, it's important that the audio characteristics match for an optimal, balanced experience,\" says Costello of the lack of compatibility. \"The new HomePod delivers immersive, room-filling sound users love  with even more detail, clarity and layers than the original HomePod  so we wanted the acoustical imaging to be as pure and consistent as possible from generation to generation. The principle of having audio characteristics match in a stereo pair applies to HomePod mini, the original HomePod and the new HomePod.\"\nApple told both media publications that the HomePod mini is \"popular,\" but did not provide any additional details or comment on the future of the smaller speaker.\nThe new HomePod is available to pre-order for $299 and launches this Friday in the U.S. and select other countries. Check out our new HomePod review roundup for a hands-on look at the speaker, which many reviewers found to have largely the same sound quality as the original.\nRelated Roundup:",
      "snippet": "... older Wi-Fi 4 standard, compared to Wi-Fi 6 on other modern <b>Apple</b> devices. \"HomePod features Wi-Fi 4 connectivity that allows us to target exactly ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T10:57:05",
      "provider": {
        "name": "macrumors",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.macrumors.com/t/ZmUXy3n2RSG0kjeMsH0VGLIARKQ=/2500x/article-new/2023/01/HomePod-2-White-and-Midnight-Feature-Purple-Blue.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "macrumors",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.macrumors.com/2023/02/02/apple-new-homepod-interviews/"
      }
    }
  ]
}
