{
  "_type": "news",
  "didUMean": "",
  "totalCount": 204,
  "relatedSearch": [],
  "value": [
    {
      "id": "990788891652291961",
      "title": "GoldenEye cheats unlock times for Xbox Switch and N64",
      "url": "https://www.polygon.com/guides/23572410/goldeneye-007-cheat-codes-xbox-switch-n64-unlock-times",
      "description": "How to unlock cheats in GoldenEye 007 on Xbox, Switch and N64, including all unlock times, and the Aztec and Egyptian levels.",
      "body": "Email\nCredit: Nintendo / Rare / MGM\nGoldenEye 007 cheats allow you to unlock new weapons, characters, and levels across both the story and multiplayer.\nSome draw from iconic James Bond films over the years  such as the Golden Gun, and a bonus level inspired by Moonraker  while others are more original, from firing paintball rounds to handing every enemy a rocket launcher.\nIn the N64 original of GoldenEye 007, cheats could be unlocked one of two ways  by entering a cheat code, or by completing levels under certain conditions.\nWhile this still applies on Switch  which is essentially the same as the N64 version, albeit with some caveats when it comes to registering inputs  entering codes on Xbox does not work, meaning you must rely on unlocking each cheat the normal way.\nGoldenEye 007 cheat unlock times\nWhether you are playing on Xbox, Switch, or N64, you can unlock cheats by completing levels under certain conditions.\nIf you are struggling with any particular unlock  including completing the infamous Facility on 00 Agent in around two minutes  this playlist by Graslu00 on YouTube shows you the best routes for each one.\nGoldenEye 007 cheats\nJanuary 27, 2023\nHow to unlock Aztec and Egyptian in GoldenEye 007\nFor those focused on single-player, there are two bonus levels to unlock  Aztec and Egyptian  which require you to complete every main story mission on a certain difficulty:\nAztec unlock requirement: Complete all main levels on Secret Agent difficulty or above\nEgyptian unlock requirement: Complete all main levels on 00 Agent difficulty or above\nFor those on Switch and N64, there is an additional cheat code to unlock Aztec, but reportedly this only works once you have unlocked all main story levels first.\nAs for Egyptian, there is no code  meaning you have to put in the legwork.\nHow do GoldenEye 007 cheat codes work on Xbox and Switch?\nAs mentioned, in the N64 original, cheats could be unlocked by entering a code as well as completing certain in-game requirements.\nHowever, codes are not in the Xbox version, as confirmed by our own tests and the following comment from an Xbox spokesperson to Polygon: This version of GoldenEye 007 is, for the majority, as players know and love from the 1997 version. Specifically for cheats, these can be unlocked by completing levels in the required time, rather than with the button codes previously used.\nFor those on Switch, you can view the full list of these cheats on GameFAQs, However, in our experience, these are difficult to activate, in part because you must translate the N64 inputs to Switch controls.\nOn Switch, the C buttons are mapped to the right analog stick, and the Left, Right, Up and Down inputs are assigned to the D-pad, and not the left analog stick. You can take your time entering each command, but know for the final one, you might have to hold on for several seconds for it to work. Even then, it might not - so take your time and keep trying until you see results.\nPaintball mode in action.\nImage: Rare/MGM via Polygon\nIf youre struggling, double-check where you need to input each specific cheat  such as during gameplay or in the multiplayer menu  and know that if you are using the mission unlock cheats, it appears they only work in sequence, starting with Facility, then Runway, and so on.\nIf you cant get these codes to activate (we struggled in most instances), then you have to do things the old fashioned way.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "... our own tests and the following comment from an Xbox spokesperson to <b>Polygon</b>: This version of GoldenEye 007 is, for the majority, as players know and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T13:25:16",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/ih43fp7drOSIrawXIlPnRFiXiXI=/0x0:981x514/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24386976/goldeneye_007.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23572410/goldeneye-007-cheat-codes-xbox-switch-n64-unlock-times"
      }
    },
    {
      "id": "2089831886139900891",
      "title": "Polygons Gains Network DEX volume crosses $1.5B as Polygon price reclaims $1",
      "url": "https://coinjournal.net/news/polygons-gains-network-dex-volume-crosses-1-5b-as-polygon-price-reclaims-1/",
      "description": "The price of Polygon (MATIC) has been steadily rising in recent weeks and it has regained the $1.0 level as the broader crypto market continues to recover.",
      "body": "Subscribe to our newsletter\nKeep updated with our round the clock and in-depth cryptocurrency news\nPlease be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates and/or business partners of this site and/or its owners, operators and affiliates. We may receive financial compensation from these third parties. Notwithstanding any such relationship, no responsibility is accepted for the conduct of any third party nor the content or functionality of their websites or applications. A hyperlink to or positive reference to or review of a broker or exchange should not be understood to be an endorsement of that broker or exchanges products or services.\nRisk Warning: Investing in digital currencies, stocks, shares and other securities, commodities, currencies and other derivative investment products (e.g. contracts for difference (CFDs) is speculative and carries a high level of risk. Each investment is unique and involves unique risks.\nCFDs and other derivatives are complex instruments and come with a high risk of losing money rapidly due to leverage. You should consider whether you understand how an investment works and whether you can afford to take the high risk of losing your money.\nCryptocurrencies can fluctuate widely in prices and are, therefore, not appropriate for all investors. Trading cryptocurrencies is not supervised by any EU regulatory framework. Past performance does not guarantee future results. Any trading history presented is less than 5 years old unless otherwise stated and may not suffice as a basis for investment decisions. Your capital is at risk.\nWhen trading in stocks your capital is at risk.\nPast performance is not an indication of future results. Trading history presented is less than 5 years old unless otherwise stated and may not suffice as a basis for investment decisions. Prices may go down as well as up, prices can fluctuate widely, you may be exposed to currency exchange rate fluctuations and you may lose all of or more than the amount you invest. Investing is not suitable for everyone; ensure that you have fully understood the risks and legalities involved. If you are unsure, seek independent financial, legal, tax and/or accounting advice. This website does not provide investment, financial, legal, tax or accounting advice. Some links are affiliate links. For more information please read our full risk warning and disclaimer.\nWe use cookies to personalise content & ads, provide social media features and offer you a better experience. By continuing to browse the site or clicking \"Continue\" you are consenting to the use of cookies on this website.\nContinue",
      "snippet": "The price of <b>Polygon</b> (MATIC) has been steadily rising in recent weeks and it has regained the $1.0 level as the broader crypto market continues to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T12:50:43",
      "provider": {
        "name": "coinjournal",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://coinjournal.net/wp-content/uploads/1970/01/1674819769900-3093a63d-611b-46d3-9e6e-9a68752b2368.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "coinjournal",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://coinjournal.net/news/polygons-gains-network-dex-volume-crosses-1-5b-as-polygon-price-reclaims-1/"
      }
    },
    {
      "id": "8631987862071621123",
      "title": "GoldenEye controls better on Xbox than on Switch can they be changed?",
      "url": "https://www.polygon.com/23573980/goldeneye-controls-switch-xbox",
      "description": "Rares classic James Bond shooter has been released on Game Pass and Nintendo Switch Online, but while only Switch has online multiplayer, the Xbox version has the advantage of modern FPS controls",
      "body": "Email\nImage: Rare/Microsoft\nThe long, long awaited reissue of Rares classic 1997 James Bond shooter GoldenEye 007 is available on Nintendo Switch and Xbox consoles today  and you might want to carefully consider which version you play.\nAs announced earlier this week\n, only GoldenEye on Switch has online multiplayer. But it turns out the Xbox version of the game also has an exclusive feature which might have an even bigger impact on your enjoyment: modern first-person shooter controls.\nNintendo has taken a purist approach with the Switch version of GoldenEye. The game doesnt support any inputs which didnt exist on the original Nintendo 64 controller, which means no right trigger to fire from. The various control options available in the game  all carried over from the original, with their Bond-inspired names like Honey, Solitaire, and Goodnight  only allow fire to be assigned to the left trigger or the A button.\nThe N64 controller also only had a single analog stick. Nintendo does map the four yellow C buttons, which formed a kind of secondary D-pad, onto the Switchs right stick, but none of the available control maps correspond to the modern standard for twin-stick first-person controls, with move and strafe on the left stick, and aim and turn on the right. Theres also no custom control option.\nDoubtless the game will feel great if you have one of Nintendos classic N64 controllers  or even better, two, so you can use one of its dual-wield options  but as it stands, on a standard Switch or a Pro Controller, the options all feel quite ungainly and will take some getting used to. (\nThere is a workaround\nthat involves swapping the Switchs Joy-cons, but its a bit of a fiddle and not that comfortable, plus it isnt an option for Switch Lite owners or handheld play.)\nThe Xbox version, by contrast, adds two new control options to the original games eight (though even these reassign fire from the left trigger to the right). Diamond is a classic modern FPS setup, with move and look operating as normal on the sticks, and fire on the right trigger. The game plays effortlessly this way. The other option is a fully customizable control map, which is a win for accessibility.\nWhat about other differences between the two versions? The Switchs exclusive online multiplayer mode works via the Switch Online lobby interface: create a room with some friends there, then jump in and play together as if playing locally. Yes  that means youll still be able to see each others screens in split-screen. Theres no matchmaking with randoms available. Its not exactly elegant, but if its your only way to play with friends, its a huge bonus.\nAdditionally, the Switch version of GoldenEye allows the games cheats (additional modes, characters, weapons, and levels) to be unlocked by entering cheat codes, as did the original. The Xbox version doesnt appear to support this, and cheats need to be unlocked the hard way through gameplay. For its part, the Xbox version has 55 new achievements to go for.\nGoldenEye is available in the Nintendo 64 collection that forms part of the Nintendo Switch Online + Expansion Pack subscription on Switch. On Xbox, its included in an Xbox Game Pass subscription, or as a free update to the Rare Replay collection. It cant be bought separately on either system.\nSo: modern controls and achievements, or online multiplayer and cheat codes? In an ideal world wed have them all in a single version, but we dont. The choice is yours.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Rares classic James Bond shooter has been released on Game Pass and Nintendo Switch Online, but while only Switch has online multiplayer, the Xbox version has the advantage of modern FPS controls.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T12:35:41",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/ov4GKKUIh2diyjBLoofZpmGYDQQ=/2x96:3707x2036/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24389513/apps.17151.14024294433653017.302463a3_0acd_42dc_8d12_ec1245167809.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23573980/goldeneye-controls-switch-xbox"
      }
    },
    {
      "id": "8816159490949523170",
      "title": "Polygon's MATIC Value Rises as Covo Finance Joins Its Ecosystem",
      "url": "https://www.prnewswire.co.uk/news-releases/polygons-matic-value-rises-as-covo-finance-joins-its-ecosystem-301732361.html",
      "description": "/PRNewswire/ -- Polygon's Matic price has recently experienced a significant rise in value. One potential reason for the surge in Polygon's price is the...",
      "body": "rise\nin value. One potential reason for the surge in Polygon's price is the increasing interest in decentralized finance (DeFi) projects. Polygon is quickly becoming a go-to destination for DeFi projects looking to build on a fast and efficient blockchain network. The network's low transaction fees and high throughput make it an ideal choice for DeFi projects, and many projects are migrating to Polygon from other blockchain networks.\nCovo Finance Debuts its Decentralized Perpetual Exchange on Polygon\nThe recent launch of Covo Finance on the Polygon network is continuously getting MATIC community attention. Covo Finance is a decentralized spot and perpetual swap exchange that allows users to trade Bitcoin, Ethereum, and other popular cryptocurrencies directly from their crypto wallets. The platform offers low-fee swap trades and leveraged trading of up to 50x, making it a popular choice for traders looking for an alternative to centralized exchanges.\nCovo Finance offers a unique trading experience for users, as it is 100% decentralized. It allows users to trade Bitcoin (BTC), Ethereum (ETH), and other popular cryptocurrencies directly from their crypto wallets without needing to hold their assets in the custody of a centralized exchange. The added security due to decentralization is a major draw for investors and traders looking for safer alternatives to centralized exchanges.\nOne of the significant draws of Covo Finance is the liquidity rewards program. Users who\nto the platform will receive a\n70% reward\nfrom all leverage trading and trading fees. Liquidity is added in a multi-asset pool called COVOLP, which comprises 50% stablecoins and 50% of other currencies (such as Bitcoin, Ether, Matic, and Chainlink). This pool acts as a counterparty to traders on the Covo platform, and money for trades for leverage is sourced from the liquidity pool.\nCovo Finance also offers low-fee swap trades and leveraged trading of up to 50x, allowing for even bigger investment returns. In addition, the platform has a utility and governance token called\n, which rewards users with various incentives. 30% of the generated protocol fees will be available as rewards in Matic, and stakers can also earn esCOVO tokens, which can be staked or vested and converted to COVO over 365 days.\nPolygon Matic DeFi Ecosystem on The Rise in 2023\nThe launch of Covo Finance on the Polygon blockchain is a significant milestone for the DeFi space. It demonstrates the potential of decentralized finance and provides a simple-to-use platform that puts user money security at the forefront. Covo Finance provides an excellent opportunity for investors and traders who want to invest and trade cryptocurrencies without fearing their funds getting hacked or compromised. With the launch of Covo Finance, Polygon (MATIC) is set to become a hub for decentralized finance projects, and the price of MATIC is expected to continue to rise as more investors and traders flock to the platform.\nfrom 8 AM - 5:30 PM GMT",
      "snippet": "<b>Polygon</b> is quickly becoming a go-to destination for DeFi ... DeFi projects, and many projects are migrating to <b>Polygon</b> from other blockchain networks.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T12:31:00",
      "provider": {
        "name": "prnewswire",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://mma.prnewswire.com/media/1991102/Covo_Finance_Logo.jpg?p=facebook",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "prnewswire",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.prnewswire.co.uk/news-releases/polygons-matic-value-rises-as-covo-finance-joins-its-ecosystem-301732361.html"
      }
    },
    {
      "id": "8657077365703163827",
      "title": "Altcoins to Consider in 2023 -Big Eyes Coin Polygon and Dogecoin",
      "url": "https://euroweeklynews.com/2023/01/27/altcoins-to-consider-in-2023-big-eyes-coin-polygon-and-dogecoin/",
      "description": "With the rise of cryptocurrency, more people are searching for suitable coins to invest in than ever. As the global economy weakens and we risk moving",
      "body": "In terms of investing, we highly recommend the Big Eyes Coin (BIG). In the first 24 hours alone, the coin raised over $1 million, and there are no signs of it slowing down!\nSpeeding up transactions with Polygon (MATIC)\nMatic is Polygons cryptocurrency, and it is one of the most popular choices for people to invest in. The coin is used for paying fees on the Polygon network, staking, and making decisions. One of the major benefits of investing in MATIC is that it is widely available on most crypto exchanges, which makes buying and selling simple.\nPolygon employs various modern technologies to create a parallel blockchain while linking it primarily to Ethereum. However, unlike Ethereum, MATIC is much faster and has lower fees. Its use case drives its demand and is a popular choice for investors.\n>>BUY BIG EYES COIN NOW!<<\nOur Favorite Meme Coin, Doge Coin (DOGE)\nIts 2023, and you may have heard of Dogecoin (DOGE). This coin is the highest-ranking meme coin on the market and is always in the public eye. Meme coins are a type of cryptocurrency that use memes and other forms of humor from the internet and record them on a blockchain.\nDogecoin revolutionised the meme coin segment since it was started in 2013 as a silly joke against bitcoin. However, it turned into one of the highest trading coins in crypto history and continues to see large gains on the market frequently. The coin frequently receives support from large corporations like Tesla, which has propelled its value.\n>>BUY BIG EYES COIN NOW!<<\nHow to pick the right cryptocurrency?\nPicking the right cryptocurrency to invest in can be difficult, especially if youre a beginner. Here are a few tips you can follow to ensure youre going in the right direction:\nLook at market capitalisation: Market capitalisation measures the product of the current price and the circulating supply. Its a great way of determining the worlds view of that particular currency.\nGo through the currencys white paper: Every cryptocurrency on the market has a white paper. It is an important document that covers all the details of the coin, which includes its purpose and technology. Moreover, it also gives a brief of what the creators envision accomplishing with their project.\nConsider Use Cases: Within the white paper, there is a section that covers the use case of the currency. This should give you a good idea of the cryptocurrencys practical use, which will be a big factor in driving its demand.\nFinal Thoughts\nIf youre new to cryptocurrencies, we congratulate you on making the big leap! Investing may seem tricky, but we highly recommend that you check out the Big Eyes Coin (BIG) Presale. You can find more information about this project at:\nFor more about BIG:",
      "snippet": "... there are no signs of it slowing down! Speeding up transactions with <b>Polygon</b> (MATIC) Matic is <b><b>Polygon</b>s</b> cryptocurrency, and it is one of the most ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T10:45:25",
      "provider": {
        "name": "euroweeklynews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.euroweeklynews.com/wp-content/uploads/2023/01/Polygon-Shutterstock-1-scaled.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "euroweeklynews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://euroweeklynews.com/2023/01/27/altcoins-to-consider-in-2023-big-eyes-coin-polygon-and-dogecoin/"
      }
    },
    {
      "id": "449730316187820902",
      "title": "Cryptocurrency prices: Check today's rates of Bitcoin, Ethereum, Solana, BNB",
      "url": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-27-01-2023-rates-of-bitcoin-ethereum-solana/story",
      "description": "Bitcoin has lost 1.4% in the last 24 hours, trading at $22,859.05",
      "body": "Bitcoin has lost 1.4% in the last 24 hours and is trading at $22,859.05. It is 8.4% up compared to last week.    The second most popular token, Ethereum, is down 2.9% from yesterday and is trading at $1,569.64. From last week, it is up 1.2%.    The market capitalization of Bitcoin and Ethereum is now at $440.4 billion and $189.07 billion, respectively. BNB is trading at $302.80, which is 1.5% down from yesterday and 2.7% up from last week.    XRP's price today is $0.44 after falling 2.2% in the last 24 hours. Compared to last week, it is 2.9% up.    Cardano and Dogecoin are trading at $0.33 (down 1.9%) and $0.088 (down 1.9%), respectively. Solana, Polka Dot, Shiba Inu, and Polygon are currently trading at $23.78 (down 4.2%), $6.38 (down 1.1%), $0.000011 (down 2.2%), and $1.10 (up 9.3%), respectively.    Looking at the weekly chart, Solana is 11.0% up, while Polka Dot has moved up by 9.9%.    Shiba Inu's value has declined by 0.6% in the last seven days, whereas Polygon has gained 15.3%. The top five gainers based on the 24-hour movement are Fantom, eCash, Polygon, Bitcoin SV, and Toncoin. They are trading at $0.44 (up 13.63%), $0.000044 (up 10.17%), $1.09 (up 9.04%), $44.56 (up 7.57%), and $2.42 (up 3.31%), respectively. A stablecoin is a cryptocurrency with extremely low volatility. Its value is linked to a physical asset such as fiat currency or gold.    Among the popular tokens, Tether, USD Coin, and Binance USD are trading at $1 (flat), $1 (flat), and $1 (flat), respectively. Terra Classic is listed at $0.00011 (down 2.49%). The biggest losers of the day are Threshold, Optimism, Lido DAO, Frax Share, and Mina. They are trading at $0.055 (down 10.75%), $2.14 (down 10.57%), $2.27 (down 9.43%), $9.92 (down 9.02%), and $0.66 (down 8.87%), respectively. Based on traffic, liquidity, trading volumes, and confidence in the legitimacy of trading volumes, the top three cryptocurrency spot exchanges are Binance, Coinbase Exchange, and Kraken.    In the last 24 hours, Binance and Coinbase Exchange recorded a volume of $19.27 billion (down 17.87%) and $1.97 billion (down 15.26%), respectively. Meanwhile, Kraken saw a volume of $0.64 billion, which is down 7.52% from yesterday. DeFi or decentralized finance is an umbrella term for global, peer-to-peer financial services on public blockchains.    Some of the popular DeFi tokens are Dai, Avalanche, Uniswap, Wrapped Bitcoin, and Chainlink. They are trading at $0.99 (down 0.03%), $17.87 (down 2.37%), $6.62 (up 0.32%), $22,746.85 (down 1.62%), and $7.09 (up 1.64%), respectively. Non-fungible tokens (NFTs) are cryptocurrencies that lack the attribute of fungibility, due to which they cannot be exchanged for one another.    Some of the popular NFT tokens are ApeCoin, Decentraland, Axie Infinity, Flow, and The Sandbox. They are currently trading at $6.20 (down 0.81%), $0.66 (down 4.60%), $11.41 (down 5.21%), $1.07 (down 6.89%), and $0.77 (down 4.65%), respectively. The current global crypto market cap is $1.05 trillion. The total crypto market volume over the last 24 hours is $61.95 billion. Both the metrics have remained flat over the last day.    The global crypto market cap was $814.9 billion last month, while three months ago, the total capitalization stood at $1.0 trillion.",
      "snippet": "Solana, Polka Dot, Shiba Inu, and <b>Polygon</b> are currently trading at $23.78 (down 4.2%), $6.38 (down 1.1%), $0.000011 (down 2.2%), and $1.10 (up 9.3%), ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T06:06:32",
      "provider": {
        "name": "newsbytesapp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cdn.newsbytesapp.com/images/l74620230127111424.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsbytesapp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-27-01-2023-rates-of-bitcoin-ethereum-solana/story"
      }
    },
    {
      "id": "5310316977777394076",
      "title": "Crypto Price Today: Bitcoin Down 2%, Ethereum Moves Lower, Polygon Up 8%",
      "url": "https://www.cnbctv18.com/photos/cryptocurrency/crypto-price-today-27-jan-bitcoin-ethereum-dogecoin-shiba-inu-solana-fall-polygon-jumps-15777581.htm",
      "description": "Most cryptocurrencies extended losses on Friday. The global crypto market cap stood at $1.03 trillion, with a volume of $55.1 billion in the past 24 hours.",
      "body": "/\n8\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, fell 1.7 percent to $22,760.1. Its market value stood at $438.2 billion. The trade volume was at $26.3 billion. The token has jumped over seven percent in the last seven days.\n2\n/\n8\nEthereum | The second largest virtual currency, Ethererum or Ether, fell 2.9 percent to $1,567.1 with a market capitalisation of $191.9 billion. The trade volume of Ethereum was $8.6 billion in the last 24 hours. The token has gained 0.9 percent in the last seven days.\n3\n/\n8\nDogecoin | Meme-based virtual currency, Dogecoin, fell 2.5 percent on Friday. Its market value stood at $11.2 billion. The trade volume was at $447.9 million.\n4\n/\n8\nSolana | Solana fell 4.3 percent to $23.7 with a market capitalisation of $8.8 billion. The trade volume of Solana was $809.3 million in the last 24 hours.\n5\n/\n8\nShiba Inu | Shiba Inu fell 2.3 percent with a market capitalisation of $6.3 billion. The trade volume was $229.5 million in the last 24 hours.\n6\n/\n8\nPolygon | Polygon jumped 8.1 percent to $1.1 with a market capitalisation of $9.4 billion. The trade volume was $1.1 billion in the last 24 hours.\n7",
      "snippet": "6 / 8 <b>Polygon</b>.\n<b>Polygon</b> jumped 8.1 percent to $1.1 with a market capitalisation of $9.4 billion.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T02:41:59",
      "provider": {
        "name": "cnbctv18",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://images.cnbctv18.com/wp-content/uploads/2022/09/cryptocurrency-1-1019x573.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "cnbctv18",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.cnbctv18.com/photos/cryptocurrency/crypto-price-today-27-jan-bitcoin-ethereum-dogecoin-shiba-inu-solana-fall-polygon-jumps-15777581.htm"
      }
    },
    {
      "id": "6114245645630249717",
      "title": "Buy MATIC & These Cryptos in 2023",
      "url": "https://augustafreepress.com/commercial/polygon-price-prediction-dot-these-cryptos-will-explode-in-2023/",
      "description": "This post discusses Polygons price prediction as well as other investment-worthy cryptos to consider in 2023.",
      "body": "Buy New Cryptos Now\nPolygon Price Predicition and Analysis\nThe best way to make a precise and valid Polygon price prediction is by conducting an in-depth analysis.\nAccording to the Polygon MATIC price graph below, Polygon hasnt been on the market for very long. Its only been around for about two years. As such, it is difficult to predict the future of MATIC accurately.\nWhile the bull run enabled Polygon MATIC to reach an All-Time High of $2.92, the bear market has made it lose over 60% in value and is currently trading around $1. These price movements make it challenging to figure out MATICs precise price potential.\nNotwithstanding, there are specific observations to be noted. First, from Polygons creation until the beginning of 2021, MATIC has been selling between $0.01 to $0.02. Like many other cryptos, MATIC exploded in May 2021, and reaching above $2 was a great leap for the asset. However, Polygon is affected by Ethereum and Bitcoins price and is incapable of providing gains on its own.\nHere is an expert prediction of MATIC price between 2025 and 2030.\nYear\n:The most popular metaverse platform\nApeCoin: Most Efficient Utility Token\nMeta Masters Guild (MEMAG)\nMeta Masters Guild\naims to revolutionize the Play-To-Earn space by providing several mobile games to its users to enjoy playing while earning rewards. One of its games is Meta Karts, where users can engage in PVP and single modes to enjoy quality gaming and earn crypto.\nWhile in-game rewards are in GEMS, they can be converted to the platforms native token, MEMAG. MEMAG is selling out fast in its presale. Users can utilize it in staking systems and trading digital assets in the MEMAG ecosystem. This token is a must-have in your portfolio.\nRobotEra\nis an appealing crypto metaverse platform with futuristic elements players will love. It takes place on Taro, a planet that has been through a lot when the war between locals and robots broke out. Although the robots won, the material consequences are enormous. So, players will dive into rebuilding the planet and exploring the depths of this metaverse platform.\nThe $TARO token will be the means for the players throughout the game to explore various features, and since it is a P2E (play-to-earn) platform, it is the token they will use to make progress and increase earnings. Players can make a profit by selling robots, which are NFTs, and also by advertising or staking tokens.\nThe $TARO token presale is ongoing, and now is the best time to purchase these tokens at a discounted price, as the price is expected to increase when the presale ends!\nBuy RobotEra Now\nApeCoin (APE)\nThis crypto project was launched in the first quarter of 2022 as the native token of Bored Ape Yacht Club, developed by Yuga Labs.  Its an ERC-20 governance and utility token of the APE ecosystem. APE token holders can vote for any governance-related decisions.\nIn addition, ApeCoin allows holders to participate in the DAO governance, and access other exclusive features like events and merchandise.\nConclusion\nAside from the MATIC coins bullish run, many factors influence the coins future, from the acceptance of the cryptocurrency market to its adoption level and the overall macroeconomic environment. Despite the markets volatility, it is certain that MATIC will attain higher price levels in the future.\nTill then, it is beneficial to consider new altcoins that can provide better gains in 2023 and beyond, thanks to their amazing use cases. Interestingly these cryptos, MEMAG, CCHG, FGHT, and TARO, discussed in this post are presently running their presale. As such, it gives you an incredible opportunity to purchase these cryptos now before future exchange listings and full launch of their use cases.\nThere is no reason to stay on the sidelines.",
      "snippet": "While the bull run enabled <b>Polygon</b> MATIC to reach an All-Time High of $2.92, the bear market has made it lose over 60% in value and is currently ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T00:06:18",
      "provider": {
        "name": "augustafreepress",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://augustafreepress.com/wp-content/uploads/2023/01/polka.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "augustafreepress",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://augustafreepress.com/commercial/polygon-price-prediction-dot-these-cryptos-will-explode-in-2023/"
      }
    },
    {
      "id": "3490188728536570563",
      "title": "Does GTA Trilogy work yet? Is Grand Theft Auto: The Trilogy worth it?",
      "url": "https://www.polygon.com/23573243/grand-theft-auto-gta-trilogy-definitive-edition-work-yet",
      "description": "Grand Theft Auto: The Trilogy  Definitive Edition is out now on Steam, two years after its disastrous 2021 launch. So, does the GTA Trilogy work yet?",
      "body": "Grand Theft Auto: The Trilogy - The Definitive Edition\nlaunched on Steam on January 19, after a long period of exclusivity in the Rockstar Games store for PC players. Featuring remastered versions of Grand Theft Auto 3, Grand Theft Auto: Vice City, and Grand Theft Auto: San Andreas, the bundle launched back in late 2021 in not-so-ideal shape. Multiple performance and visual issues plagued each entry, and while Rockstar has released some patches since, this re-release demands caution.\nAt the moment, its not possible to purchase the original versions of the three games on Steam, which means the Definitive Edition package is now the solely available bundle on the store. After some hands-on time with each title, here is a breakdown of what you can expect (or rather what to prepare for) from the GTA Trilogys Steam version.\nImage: Rockstar via Polygon\nDoes the GTA Trilogy work yet?\nWell, the answer is complicated. Yes, you can largely boot up the GTA Trilogy on Steam and play each one of the games without that many issues. At least from my experience, I didnt encounter any particular bug that prevented me from going to point A to B without that many issues (Ill tell you more about the hostile car drivers later on). Glitches such as the heavy rain that made it almost impossible to see are no longer present.\nThat said, Grand Theft Auto: The Trilogy - The Definitive Edition is largely from being in an optimal state. In all three cases, the games get stuck loading during the first boot-up. After the Rockstar Games launcher opens  which, yes, continues to run in the background even with the Steam version  I get a black screen and the games process doesnt respond. So each time I have to open up the task manager, end the process, and open the game again. All games also asked for firewall permission, too, in case youre interested in knowing.\nPresentation-wise, the games are a mixed bag. I went with GTA Vice Citys Steam version first, and to my surprise, the top right corner of the UI was present throughout the whole starting cutscene. This didnt repeat itself afterward, but it wasnt the best first impression. In terms of interface, all three games share the same structure  the options are displayed on the left side of the screen, while the background itself is the games map. You can use your mouse to drag it around, but its not until you actually select the map button that you get to see the icons or place waypoints. In addition, sometimes hovering over this menu with the mouse selected the button above where my mouse cursor was pointing towards. While not a deal breaker, the presentation as a whole feels unpolished.\nIn terms of visuals its complicated. None of the three games defaulted to my PCs standard resolution, which is 1080p, and they had black bars on the side until I changed the setting and restarted them. In-game, some cutscenes showcased characters with blank or outright clipped eyes, and a few models looked blurry when seen up close. A few other times, the position of NPCs or key objects  such as the bomb that goes off at the start of GTA III  was clearly in a different position than intended. Again, while these issues wont prevent you from playing the GTA Trilogy per se, they add up to become a constant distraction.\nYour mileage will vary in terms of the new overall aesthetic of each game, both due to the different use of lighting and the different model designs. But even if you dont mind everybodys faces looking like a mixture of a surprised baby and a squashed clay figure, some lighting effects are distracting at best and disruptive at worst.\nFloating items such as police stars or quest markers emit their own light, and its incredibly bright, to the point where you can see their reflections on fences or other nearby objects. Shadows have the opposite problem, especially during cutscenes, where characters are often obscured (although this is sometimes related to the current in-game time of day). In other cases, its the reflections that can hide characters, such as in the drive-through scene in San Andreas where the group is picking up food. The glare against the front windscreen was so intense that I could only see CJ clearly inside the car.\nImage: Rockstar via Polygon\nIs the GTA Trilogy Definitive Edition worth playing?\nTruth be told, revisiting GTA III or GTA Vice City in this day and age feels inevitably clunky, and most of the small additions are merely subtle changes, such as the radio channel wheel from Grand Theft Auto 5 now present in all three games. Its also worth mentioning that there is a decent amount of accessibility options present compared to the original releases.\nThere were, however, some odd instances here and there. For example, sometimes hitting police cars or bikes doesnt immediately lead to having a wanted star. Sure, this is helpful, but off-putting still. Driving in general just seems to be chaotic  in GTA III, I couldnt go traverse for more than a few blocks without seeing a car crash or a killed pedestrian on the floor blocking a street.\nIn San Andreas, sometimes drivers will just enrage themselves and start hitting you, over and over, for no reason. During one particular instance, they managed to flip my car around, so I got out before it exploded. But even after the deed was done, the driver continued to reverse slowly and then marched against the wreckage in an endless loop.\nUnfortunately, performance can be quite arbitrary as well. Using an RTX 2060, i7 8700k, and 16 GB of RAM, I was on the 60 FPS mark most of the time running the highest settings. But the framerate dropped often across all three games, sometimes without a specific reason. DLSS is an option at least, but overall, it seems like the games are acting in a much more demanding way than they should, and impacting performance as a result. (The fans of my PC did a strange, continuous noise while playing them, which I had never heard before.)\nAll in all, if youre planning to see all three games through, youre bound to encounter issues and glitches such as the ones described above. If you really want the GTA Trilogy on Steam, theyre the only sole option available, and the presentation leaves much to be desired. But if you have a PS2 laying around still, that might be your best bet to soak into nostalgia without being horrified or disappointed every ten minutes.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Image: Rockstar via <b>Polygon</b> Does the GTA Trilogy work yet? Well, the answer is complicated. Yes, you can largely boot up the GTA Trilogy on Steam and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T22:36:08",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/K22qkjmP5yn-GqHRcjJY_jauDIc=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24388577/grand_theft_auto_the_trilogy_definitive_edition_steam_2.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23573243/grand-theft-auto-gta-trilogy-definitive-edition-work-yet"
      }
    },
    {
      "id": "1078465798079293931",
      "title": "Xbox and PC Game Pass February 2022 games: Grid Legends GoldenEye 007 and Hot Wheels",
      "url": "https://www.polygon.com/23573364/xbox-game-pass-pc-february-2023-games-release-date",
      "description": "2022s Grid Legends and 2021s Hot Wheels Unleashed arrive to the Xbox Game Pass library on Feb. 2 and Feb. 7, 2023, along with Hi-Fi Rush (Jan. 26) and GoldenEye 007 (Jan. 27)",
      "body": "and Hi-Fi Rush\nin the Xbox Game Pass Ultimate and PC Game Pass libraries over the next two weeks, Microsoft said on Thursday. Speed demons can plunge into the narrative-driven world of Codemasters Grid Legends, or shrink down to die-cast toy size in Milestones Hot Wheels Unleashed  Game of the Year Edition.\nGrid Legends is available to Xbox Game Pass Ultimate subscribers, who get access to the EA Play catalog of games. Codemasters driving game launched in February 2022. We were rather fond of it, especially for its wonderfully hallucinated international racing series, in which Ncuti Gatwa (Netflixs Sex Education) and Natsumi Kuroda are both rivals and teammates of the player character, facing down the ruthless Ravenwest Motorsport racing team. Grid Legends joins the Xbox Game Pass/EA Play lineup on Feb. 2.\nHot Wheels Unleashed, which launched in September 2021, was likewise one of our favorite racing games of that year. The Game of the Year edition, which includes three post-launch car collections, arrived in September 2022. Milestones title marries high-fidelity racing physics with arcade action, plastic tracks and candy-flake paint jobs spanning 30 years of the classic collectible cars. Its available via cloud, console, and PC on Feb. 7.\nThe other games coming to Xbox/PC Game Pass, and their dates, are:\nHi-Fi Rush (Cloud, PC, and Console). Available Jan. 26.\nGoldenEye 007 (Cloud and Console). Jan. 27\nRoboquest (Game Preview, Console). Jan. 30\nAge of Empires 2: Definitive Edition (Cloud and Console). Jan. 31.\nInkulinati (Game Preview, Cloud, Console and PC). Jan. 31.\nJoJos Bizarre Adventure All-Star Battle R (Cloud, Console, and PC). Jan. 31\nDarkest Dungeon (Cloud, Console and PC). Feb. 2\nLeaving Xbox and PC Game Pass on Jan. 31 are:\nDonut County (Cloud, Console, and PC)\nTaiko no Tatsujin: The Drum Master (Console and PC)\nTelling Lies (Cloud, Console, and PC)\nWorms WMD (Cloud, Console, and PC)\nThose who want to keep playing those titles can pick them up at discounts up to 20% off from the Microsoft Store before they leave the Game Pass library.\nXbox Game Pass\nand PC Game Pass both cost $9.99 a month. PC Game Pass includes EA Play access, which offers another 70 games on PC. Xbox Game Pass Ultimate, at $14.99 per month, gives subscribers access to everything  the PC Game Pass and Xbox Game Pass libraries, EA Play on both console and PC, and the Cloud Gaming beta  as well as Xbox Live Gold membership, which is needed for online multiplayer.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "2022s Grid Legends and 2021s Hot Wheels Unleashed arrive to the Xbox Game Pass library on Feb.\n7, 2023, along with Hi-Fi Rush (Jan.\n26) and GoldenEye 007 (Jan.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T22:08:23",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/BVKy_1QZaoG3ndOYnstHOGsN7R0=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22890212/HWU_Screenshots__3_.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23573364/xbox-game-pass-pc-february-2023-games-release-date"
      }
    },
    {
      "id": "973269911080772866",
      "title": "Shazam! Fury of the Gods trailer feels like the end of the DCEU",
      "url": "https://www.polygon.com/23573025/shazam-fury-gods-2-trailer-dceu-new-movies-black-adam",
      "description": "Now that James Gunn and Peter Safran have taken over, Shazam! Fury of the Gods feels feels like the end of the DCEU, even if Aquaman 2 and the Flash are still set to come out.",
      "body": "Flipboard\nEmail\nThe DC movie universe has been dying for a long time now. Ever since the original Justice League, its been clear things werent quite working, and that the overarching vision for the future of these franchises was never coming to pass. And while every movie since then has felt like it could easily be the ending of the cinematic universe or a new beginning for it, especially since James Gunn and Peter Safran officially took over DC movies and started crafting their new version of the universe, it finally feels like things are coming to a close. Which might be why Shazam! Fury of the Gods new trailer feels so weird.\nShazam! 2s latest trailer was released on Thursday and it appears to give away almost the entire movie. There are big reveals and huge brawls, lots of jokes, and even what looks to be the movies climactic fight. But none of it quite feels like it matters, either dramatically or as part of a larger world.\nAs recently as San Diego Comic-Con 2022, Warner Bros. was all in on the old new-version of the DCEU. This time things would be centered around the Shazam family, with Black Adam coming in as an anti-hero, or maybe even a villain, and the Justice Society playing an important role. But after Black Adams disappointing run at the box office, and with the new regime taking over the cinematic reins, we know none of that is still in the cards.\nDespite the feeling of the DC universe coming to an end, it technically isnt the last gasp. In fact, theres still a Flash movie that will supposedly come out one day, and Aquaman and the Lost Kingdom is set for the end of 2023.\nEven if the first Shazam! proved to be one of the more fun and effective recent DC efforts, its hard not to feel like the sequel is the accidental last episode of a TV series that was canceled in the middle of a season. Sure, it could still be enjoyable, but its hard to be more excited about whats next than whats never going to be.\nShazam! Fury of the Gods is set for release in theaters on March 17.\nNext Up In",
      "snippet": "Now that James Gunn and Peter Safran have taken over, Shazam! Fury of the Gods feels feels like the end of the DCEU, even if Aquaman 2 and the Flash are still set to come out.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T21:43:09",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/v1lZ1cTBx_1uHe87K2-M9jQqMlo=/234x0:1760x799/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24388169/image_2023_01_26_152904236.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23573025/shazam-fury-gods-2-trailer-dceu-new-movies-black-adam"
      }
    },
    {
      "id": "8282683472196808518",
      "title": "Polygon (MATIC) 24 Hour Trading Volume Hits $958.53 Million",
      "url": "https://www.themarketsdaily.com/2023/01/26/polygon-matic-24-hour-trading-volume-hits-958-53-million.html",
      "description": "Read Polygon (MATIC) 24 Hour Trading Volume Hits $958.53 Million at Markets Daily",
      "body": "Polygons\nlaunch date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. The official message board for Polygon is blog.polygon.technology. The official website for Polygon is polygon.technology.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nPolygon Coin Trading\nIt is usually not currently possible to purchase alternative cryptocurrencies such as Polygon directly using US dollars. Investors seeking to acquire Polygon should first purchase Bitcoin or Ethereum using an exchange that deals in US dollars such as Changelly, Gemini or Coinbase. Investors can then use their newly-acquired Bitcoin or Ethereum to purchase Polygon using one of the aforementioned exchanges.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> (MATIC) 24 Hour Trading Volume Hits $958.53 Million at Markets Daily. <b><b>Polygon</b>s</b> launch date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T21:38:42",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/01/26/polygon-matic-24-hour-trading-volume-hits-958-53-million.html"
      }
    },
    {
      "id": "3534651496218873291",
      "title": "Polygon (MATIC) Price Tops $1.08",
      "url": "https://www.themarketsdaily.com/2023/01/26/polygon-matic-price-tops-1-08.html",
      "description": "Read Polygon (MATIC) Price Tops $1.08 at Markets Daily",
      "body": "Polygons\ngenesis date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. The official website for Polygon is polygon.technology. Polygons official message board is blog.polygon.technology. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nBuying and Selling Polygon\nIt is usually not currently possible to buy alternative cryptocurrencies such as Polygon directly using U.S. dollars. Investors seeking to acquire Polygon should first buy Bitcoin or Ethereum using an exchange that deals in U.S. dollars such as GDAX, Coinbase or Gemini. Investors can then use their newly-acquired Bitcoin or Ethereum to buy Polygon using one of the aforementioned exchanges.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> (MATIC) Price Tops $1.08 at Markets Daily. <b><b>Polygon</b>s</b> genesis date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T21:38:42",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/01/26/polygon-matic-price-tops-1-08.html"
      }
    },
    {
      "id": "2814912130073868663",
      "title": "Prime Gaming is giving away free games heres what you can get",
      "url": "https://www.polygon.com/gaming/23573102/prime-gaming-free-games-elder-scrolls-morrowind",
      "description": "Prime Gaming subscribers can get nine free games in February. Games include classics like Morrowind in The Elder Scrolls III: Morrowind and indies like Aerial_Knights Never Yield and Space Warlord Organ Trading Simulator.",
      "body": "Email\nImage: Aerial_Knight/Headup\nAmazon Prime subscribers will be able to download nine games for free in the month of February. The list includes a classic like The Elder Scrolls III: Morrowind Game of the Year Edition as well as a batch of delightful indie titles like the endless platformer Aerial_Knights Never Yield and the collecting game Space Warlord Organ Trading Simulator.\nThe first batch of games will be available to download and keep, for Amazon Prime subscribers, on Feb. 2. The special will kick off by offering The Elder Scrolls III: Morrowind Game of the Year Edition and the management game Onsen Master. Each set of freebies will drop weekly on Thursday on Amazons Gaming.\nThe Elder Scrolls III: Morrowind Game of the Year Edition\nbrings the classic 2002 RPG to modern consoles. This special edition includes all of Morrowind in addition to the Bloodmoon and Tribunal expansions. (It usually costs $14.99 on Steam so its a nice treat to Elder Scrolls fans.)\nBeyond that, the offers are a great excuse to play a lovely list of indies. Created by Aerial_Knight and published by Headup, Never Yield is an endless platformer that takes place in a Tokyo-inspired version of Detroit. Space Warlord Organ Trading Simulator will have you trading organs like you would Pokmon cards from Strange Scaffold.\nThe Amazon Gaming app and its games are available on Windows PC. Here is the full list of whats coming and when:",
      "snippet": "Prime Gaming subscribers can get nine free games in February.\nGames include classics like Morrowind in The Elder Scrolls III: Morrowind and indies like Aerial_Knights Never Yield and Space Warlord Organ Trading Simulator.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T21:24:37",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/9YdPtLisltk6Rag7IRSTbuBcM4c=/113x0:1792x879/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24388339/ss_e51c685ef277096d316e6524b82ff3d1d7abb0bc.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/gaming/23573102/prime-gaming-free-games-elder-scrolls-morrowind"
      }
    },
    {
      "id": "6024773771897473826",
      "title": "Forspoken purple magic best skills and spells to unlock",
      "url": "https://www.polygon.com/guides/23571792/forspoken-purple-magic-best-spells-frey-disperse-prime-tendril-ps5-pc",
      "description": "Forspoken gives you a variety of elemental spells. But the first type you get is purple magic, also known as Freys magic. Here are the best skills to unlock.",
      "body": "Forspoken\ndoesnt care about subtlety. Defeating bosses in Square Enixs open-world action game expands the categories of elemental magic you can use. These varieties are conveniently color-coded in obvious ways  red for fire spells, blue for water spells, and so on. But the first type of magic you start with is purple magic, for, uh... rock spells. (Rocks in Athia, Forspokens mystical setting, are brown.)\nPurple magic is also referred to in menus as Freys magic, and is about, as Frey so eloquently phrases it in an early cutscene, [moving] shit with my freakin mind. You start with three projectile attack spells  the fully automatic Scattershot, the shotgun-like Shield Shot, and the precision-based Burst Shot  and a support spell.\nBest Forspoken purple magic spells\nAs you play Forspoken, youll earn mana, both through leveling up and through natural exploration. You can use mana to power-up your attack spells. But youre better off unlocking support spells. You can ultimately unlock eight support spells per element; the more support magic you have, the better situated youll be for Forspokens more chaotic fights. Plus, some of them are extremely overpowered.\nHere are the four purple magic support spells you should unlock first:\nDisperse: This spell is essentially an automated turret. Disperse is invaluable against bosses, since it can continuously deal damage while you focus on dodging attacks.\nPrime: When you cast Prime, youll place a proximity mine where youre standing. Any enemies caught in the blast will get knocked over, remaining immobile for a few seconds  if they survive in the first place.\nLeach: Activating Leach will remove any poison effects enemies may have afflicted you with. (You can eventually render this spell useless by applying the immune to poison effect to your cloak at a crafting station.)\nGenesis Lv. 2: Surge magic is the most powerful type of spell in Forspoken, allowing you to deal a ton of damage over a wide area. Unlocking the second level of Genesis means you can cast it twice in a row by continuing to hold down the DualSenses triggers.\nIf you unlock a spell you dont end up liking, Forspoken allows you to undo your choices. In the Magic menu, hover over the spell you want to refund and hold the Triangle button (on PlayStation 5). Itll refund the mana you spent.\nTo unlock some spells, youll need to visit hidden locations in Athia.\nImage: Luminous Productions/Square Enix via Polygon\nHow to level up Forspoken purple magic spells\nAt Pilgrims Refuges  the rest spots strewn around Athia  you can access the spellcraft library. Spellcraft libraries allow you take on challenges affiliated with a certain spell; usually, these involves killing a certain number of enemies in a certain way with that particular spell. Once you complete a challenge, youll be able to increase the spells power from the Magic menu.\nWhat Forspoken enemies are vulnerable to purple magic?\nIn general, Forspokens flying enemies take extra damage from purple magic. Disperse is particularly effective here; in fact, the spellcraft challenge for Disperse requires you to use the spell to defeat flying enemies. Poison enemies also tend to be weak to purple magic.\nAt any time, you can press up on the directional pad to scan nearby enemies. Pressing up again while looking an enemy will pause time and display a list of their vulnerabilities.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Image: Luminous Productions/Square Enix via <b>Polygon</b> How to level up Forspoken purple magic spells At Pilgrims Refuges the rest spots strewn around ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T20:24:43",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/csWTHO7GK-5nygEUPCzVHDmLoMA=/0x95:3840x2105/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24380013/Forspoken_MarchTrailerScreen_05.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23571792/forspoken-purple-magic-best-spells-frey-disperse-prime-tendril-ps5-pc"
      }
    },
    {
      "id": "1036394273145160079",
      "title": "GTA Online has a major security vulnerability (again)",
      "url": "https://www.polygon.com/23573029/gta-online-security-vulnerability-corrupted-accounts-cheaters",
      "description": "Rockstar tweeted that they would be releasing a fix for a GTA Online security vulnerability. Fans reported on the issue, which allows hackers to corrupt other players accounts.",
      "body": "This is not the first security vulnerability to afflict GTA Online\n, nor is it the only problem the MMO is currently experiencing. Other community creators took the opportunity to highlight long-standing bugs, exploits, and hacks that are relatively easy for bad actors to access and execute. This includes invulnerability via God modes, a glitch that removes the cooldown on the powerful orbital cannon strike, and other ways to harass fellow players.\nRockstar released a tweet stating they intend to resolve these issues in a security-related update. There is no timeframe on when this update will arrive.\nWe are aware of potential new exploits in GTA Online for PC, which we aim to resolve in an upcoming planned security-related Title Update.\nIf you think you might have experienced any related issues, please reach out to Rockstar Support:\nGTA Online is a fun and bombastic crime sandbox\n, and Rockstar updated the game over the summer of 2022 to allow users to complete their business missions in private lobbies, which affords some measure of protection from hackers and bad agents. But the game continually struggles due to its online infrastructure (or lack thereof). Rockstar has recently added a taxi business and acid deals to the game, so theres plenty of content to enjoy. Unfortunately, hell is other people, and the continual hacking and exploiting means that the game is currently a gamble.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Rockstar tweeted that they would be releasing a fix for a GTA Online security vulnerability.\nFans reported on the issue, which allows hackers to corrupt other players accounts.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T20:06:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/MxtinkDnbDPCqTOHLVUEng-Sitw=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23905198/gta5_online.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23573029/gta-online-security-vulnerability-corrupted-accounts-cheaters"
      }
    },
    {
      "id": "7501849256744674713",
      "title": "Logan Lerman is not Poseidon in the Disney Plus Percy Jackson series",
      "url": "https://www.polygon.com/23571468/percy-jackson-poseidon-casting-disney-plus",
      "description": "Logan Lerman originally played Percy Jackson in the Lightning Thief movie and many wanted him to play Poseidon. But Toby Stephens was officially announced as the sea god in the upcoming Disney Plus series, with Lance Reddick as Zeus.",
      "body": "Logan Lerman as Percy Jackson in 2010\nImage: 20th Century Fox\nI am so so sorry, Percy Jackson stans  but Logan Lerman will NOT be making a cameo as Poseidon, god of the sea and Percys dad, in the upcoming Disney Plus series.\nThe official Disney Plus twitter announced that English actor Toby Stephens, known for Netflixs Lost in Space and Starz Black Sails, will portray the oceanic deity. Additionally, Lance Reddick of the John Wick series will play Zeus, King of the Gods. They join the three young leads  Walker Scolbell as Percy, Leah Sava Jeffries as Annabeth, and Aryan Simhardi as Grover  along with Lin-Manuel Miranda as the messenger god Hermes and Jason Mantzoukas as god of wine Dionysus.\nNews from Mount Olympus: meet Zeus and Poseidon.\n @lancereddick as Zeus\nJanuary 26, 2023\nMany fans were hoping that Lerman would make a cameo in the series. Lerman portrayed Percy back in 2010, in the critically-panned and generally unfaithful film adaptation of the book. Still, his acting was on point and his baby-blue eyes charmed a generation of fans who still strongly associate him with the character. And those fans loved idea of Lerman appearing as Percys godly parent.\nBut alas, Lerman spoke to Esquire recently about his involvement  or lack thereof  with the upcoming Disney Plus series.\nNo ones hit me up about it, and I dont think Im right for that anyways. But I also just dont even know if its interesting to me, in terms of: I dont even know what that would be. But theres not a secret thats waiting to be announced or something like that. I do get asked a lot about it, and I hate to disappoint and be like, no, I dont know anything, and Im not involved, but thats the truth. I dont know anything about it.\nAnd sure, we do live in the same world where Andrew Garfield repeatedly denied being in Spider-Man: Far From Home for two years, even while set photos of him emerged, but with this casting officially out, its time to accept that if Lerman does end up in the new show, it will likely be in a much smaller role than the driving force behind Percys motivations.\nLerman made another good point in the Esquire interview about this potential dream cast.\nI get people asking me all the time if Im gonna play Poseidon, and Im like, am I old enough to play Poseidon? he said. I dont think Im old enough for that one!\nWhile 31 year-old Lerman could conceivably be the father of a 12 year-old, especially if hes playing an immortally hot god, it does make more sense for an older, more mature actor to take on the role.\nPercy Jackson and the Olympians is expected to hit Disney Plus sometime in 2024. Filming started this summer. Unlike with the movie, author Rick Riordan will be heavily involved in every step of the project.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Logan Lerman originally played Percy Jackson in the Lightning Thief movie and many wanted him to play Poseidon.\nBut Toby Stephens was officially announced as the sea god in the upcoming Disney Plus series, with Lance Reddick as Zeus.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T20:02:25",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/OFPwNR9sHGL_eOKVgkCKJyyQJSE=/0x148:2070x1232/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19978609/200514_logan_lerman_percy_jackson.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23571468/percy-jackson-poseidon-casting-disney-plus"
      }
    },
    {
      "id": "8989344877375819316",
      "title": "GoldenEye 007 composer gets some well-deserved love on TikTok",
      "url": "https://www.polygon.com/23572694/goldeneye-007-nintendo-switch-xbox-pause-music-tiktok-n64",
      "description": "Retro multiplayer classic GoldenEye 007 comes to the Nintendo Switch and Xbox on Jan. 27, and the pause music has been going viral on TikTok. The songs composer Grant Kirkhope has revealed the process behind his masterpiece.",
      "body": "Email\nImage: Rare Ltd.\nEven before the announcement that retro multiplayer classic GoldenEye 007 will come to Nintendo Switch and Xbox on January 27, fans were already celebrating its soundtrack  especially the song that plays when you hit the pause button. After a viral TikTok bit about that song made the rounds last December, fans everywhere have been doing finger-gun dances in their living rooms. (Or maybe thats just me?) This week, the songs composer Grant Kirkhope revealed the process behind his masterpiece  and that the real difficulty wasnt the composition, but getting the song onto the Nintendo 64.\n@bigtimemaca\n#foryoupage\n GoldenEye 007, 007 Watch Theme - Arcade Player\nKirkhopes dive into the songs history began when Nintendo of Americas official Twitter account shared a clip of the song, in anticipation of the games release on the Switch. The composer then shared Nintendos tweet, saying, haha ... glad you like it! Could this piece rival the DK Rap??? After that, he described the process of composing and programming the song:\nI can remember the first day starting work on Goldeneye and @norgans showing me how the N64 dev kit worked and what I had to do to get just one single sample into it! I'm guessing it was around November 1995.\n Grant Kirkhope (@grantkirkhope)",
      "snippet": "Retro multiplayer classic GoldenEye 007 comes to the Nintendo Switch and Xbox on Jan.\n27, and the pause music has been going viral on TikTok.\nThe songs composer Grant Kirkhope has revealed the process behind his masterpiece.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T19:51:11",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/6eN-DTtM6JfbmTQY5W-s86_MYp0=/90x0:2443x1232/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24388041/goldeneye_007_2.JPG",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23572694/goldeneye-007-nintendo-switch-xbox-pause-music-tiktok-n64"
      }
    },
    {
      "id": "1611198255842086852",
      "title": "Spotify down for thousands of users",
      "url": "https://news.yahoo.com/spotify-down-thousands-users-downdetector-194558865.html",
      "description": "In the second such outage within two weeks, nearly 35,000 Spotify users reported on Downdetector.com they were having issues with the streaming platform...",
      "body": "This Crypto Will Be the Ethereum of 2023\nWhile it's uncertain which investments will be the most successful, there's one crypto that could be the Ethereum (CRYPTO: ETH) of 2023: Polygon (CRYPTO: MATIC).  Polygon is a Layer 2 solution, or sidechain, that's built on top of Ethereum.  In other words, it processes multiple transactions for Ethereum and then bundles and transfers them onto Ethereum's blockchain.\n9h ago\nBusiness Insider\nThis was one of many work-related ChatGPT topics discussed recently in an Amazon internal Slack channel.\n10h ago\n3 Potentially Explosive Cryptocurrencies to Buy in 2023\nGeneral economic woes last year crushed many of the world's most promising cryptocurrencies. That's because, in times of uncertainty, investors tend to favor the safest investments. Cryptocurrency is pretty new, and it's too early to know exactly how big its role will be in areas like finance and entertainment a few years from now.\n9h ago\nMarketWatch\nGoogles U.S. layoffs affect nearly 3,000 employees on both coasts, from data scientists to massage therapists\nGoogle parent Alphabet Inc. has slashed nearly 3,000 jobs in California and New York as part of its recently announced layoffs, cutting a broad range of positions, from data scientists to massage therapists.  The biggest cuts were at Googles  (GOOGL) (GOOG)  multiple offices in Mountain View, Calif., the search giants Silicon Valley headquarters.  A total of 1,436 employees have lost their jobs there, including more than 100 at Moffett Field, according to filings with the states Economic Development Department.\n1d ago\nEthereum posts a lukewarm response to this week's successful test of the blockchain's upcoming Shanghai upgrade.\n1d ago\nNvidia CEO says AI will need regulation, social norms\nNvidia Corp Chief Executive Officer Jensen Huang on Tuesday said that the burgeoning field of artificial intelligence will create powerful tools that require legal regulation and social norms that have yet to be worked out.  Huang is one of the most prominent figures in artificial intelligence because Nvidia's chips are widely used in the field, including in a supercomputer that Microsoft Corp built for startup OpenAI, in which Microsoft said Monday it was making a multibillion-dollar investment.\n2d ago\nChiron Investigation crypto recovery solutions unleashes new strategies to tackle with related cases.\n2d ago\nUK competition watchdog probes $61 billion Broadcom-VMware deal\nThe Competition and Markets Authority (CMA) said in November it was investigating whether the deal between the two U.S.-listed companies could substantially hurt competition in Britain, adding that it had until March 22 to decide.  Broadcom and VMware did not immediately respond to Reuters' requests for comment.\n1d ago\nA network of knockoff apparel stores exposed 330,000 customer credit cards\nIf you recently made a purchase from an overseas online store selling knockoff clothes and goods, there's a chance your credit card number and personal information were exposed.  Since January 6, a database containing hundreds of thousands of unencrypted credit card numbers and corresponding cardholders' information was spilling onto the open web.  At the time it was pulled offline on Tuesday, the database had about 330,000 credit card numbers, cardholder names, and full billing addresses  and rising in real-time as customers placed new orders.\n23h ago",
      "snippet": "... which investments will be the most successful, there's one crypto that could be the Ethereum (CRYPTO: ETH) of 2023: <b>Polygon</b> (CRYPTO: MATIC).",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T19:45:58",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.zenfs.com/en/reuters.com/3a85feb14b1a5d1ce79127de49b7f437",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://news.yahoo.com/spotify-down-thousands-users-downdetector-194558865.html"
      }
    },
    {
      "id": "1276784428248050633",
      "title": "Last of Us Part 3 might not happen says Naughty Dogs Neil Druckmann",
      "url": "https://www.polygon.com/23572852/the-last-of-us-part-3-release-naughty-dog-announcement-story",
      "description": "The Last of Us will only return if Naughty Dog knows exactly the right story to tell, says HBO series cocreator and game creative director Neil Druckmann.",
      "body": "Email\nImage: Naughty Dog/Sony Interactive Entertainment\nHBOs adaptation of The Last of Us is just ramping up, but that hasnt stopped fans from being excited about where the video game series could go next after 2018s The Last of Us Part 2. During his press tour for the show, game series creative director and HBO show cocreator Neil Druckmann updated everyone on the status of Part 3, and the fact that it might not happen at all.\nIn an interview with Buzzfeed, Druckmann said that Naughty Dog hasnt made a decision yet about whats next for the mainline The Last of Us series, and it doesnt feel pressured to either.\nWere very privileged that our publisher is Sony, Druckmann said. They have supported us every step of the way to follow our passions  meaning that just because something is successful, people think theres all this pressure and we have to make a sequel. Thats not the case. For us, Uncharted was insanely successful  Uncharted 4 was one of our best selling games  and were able to put our final brushstroke on that story and say that were done. Were moving on. Likewise, with The Last of Us, its up to us whether we want to continue or not.\nThat doesnt mean the series is done for sure though. According to Druckmann, the team is batting story ideas back and forth all the time in hopes that something sticks. But until they have the perfect one, we shouldnt expect another entry in the franchise.\nOur process is the same thing we did when we did Part 2, Druckmann said to Buzzfeed. Which is if we can come up with a compelling story that has this universal message and statement about love  just like the first and second game did  then we will tell that story. If we cant come up with something, we have a very strong ending with Part 2 and that will be the end.\nWhatever happens next with The Last of Us games, Druckmann has at least made it clear that it will be a while before the next numbered entry, if it happens at all. Until then, Naughty Dog is currently working on a Last of Us multiplayer spinoff and hasnt officially said what its next big single-player project will be.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Last of Us will only return if Naughty Dog knows exactly the right story to tell, says HBO series cocreator and game creative director Neil Druckmann.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T18:57:19",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Y9sMBfmdea7pqkAtqgiqhAmfHO0=/0x0:3840x2010/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19545666/LastofUsPart2.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23572852/the-last-of-us-part-3-release-naughty-dog-announcement-story"
      }
    },
    {
      "id": "2334857231454931234",
      "title": "Teen Wolf: The Movie kills a franchise but Wolf Pack revives it",
      "url": "https://www.polygon.com/23571587/teen-wolf-movie-review-wolf-pack-season-1",
      "description": "Paramount Plus released the Teen Wolf sequel movie (without Dylan OBrien) and not quite a spinoff series Wolf Pack,  on the same day. From Teen Wolf creator Jeff Davis, both reinvent the MTV show to varying results.",
      "body": "Teen Wolf\nfirst premiered in 2011, as Twilight (2008) and The CWs The Vampire Diaries (2009) helped the teen fantasy craze reach its apex. The message to Hollywood was clear: Young audiences wanted shows with sexy teenagers, supernatural powers and villains, and forbidden love. Teen Wolf checked all the boxes, making it a massive success for MTV. The show ran for six seasons, ending in 2017. In the five years since the finale, television made for young adults has moved away from vampires and werewolves, but it hasnt strayed far from the horror-fantasy model the series (and contemporaries like Pretty Little Liars and Scream Queens) popularized. In theory, now is the perfect time for a revival  which is why this week, were getting two attempts: The creatively titled Teen Wolf: The Movie, and a new series, Wolf Pack, which is only spiritually connected.\nCreated by Jeff Davis, Teen Wolf: The Movie and Wolf Pack premiere on Paramount Plus on Jan. 26, but other than a common genre element and entangled advertising (including\nshared panels at SDCC and NYCC earlier this year\n), the two properties have nothing to do with one another, at least based on the two episodes of Wolf Pack previewed for critics. And while fans of the original series might find the lack of context alarming, the divorce provides an opportunity the franchise so desperately needs: an offramp and a fresh start.\nPreviously, on Teen Wolf The Movie\nPhoto: Curtis Bonds Baker/MTV Entertainment\nTeen Wolf started as a show about Scott (Tyler Posey), a teenage boy bitten by a werewolf who must figure out how to balance lacrosse games with supernatural threats, all while falling in love with the daughter of a werewolf hunter. The world quickly expanded. The town of Beacon Hills was revealed to be full of otherworldly creatures  banshees, werecoyotes, kitsune, hellhounds  and the villains became more and more dangerous. Subsequent seasons got darker, more serious, and mythology-driven, though the core was always the relationship between Scott and his human best friend, Stiles (Dylan OBrien). Scott and Stiles bond made the show relatable despite the fact that one was a werewolf. No matter how nonsensical the plots, or how disturbing the villain, the pair were always there to bring Teen Wolf back to reality.\nThis was especially evident in season 3, arguably the series best season, and  coincidentally, the season Teen Wolf: The Movie borrows most from. Season 3s antagonist, a kitsune-esque nogitsune trickster spirit that thrives off of chaos and pain and temporarily possessed Stiles, was the series scariest villain and also its most emotionally effective. So it makes sense that Teen Wolf: The Movie would want to revisit the arc to strike a similar human-relationship-to-supernatural-action ratio. Theres just one small problem: OBrien chose not to return for the film. And without Stiles, The Movie lacks both the heart and the humor that made the show so addictive.\nLike Scott, the Teen Wolf franchise becomes consumed in slo-mo action shots without an emotional anchor. And with more plot than character, Teen Wolf: The Movie falters. This is clear in how the film borrows heavily from the action of season 3  the nogitsune and his shadow henchmen, the oni, were villains in the second part of the season  but reclaims almost none of the heart, sacrificing it to make room for dramatic entrances. But simply getting a beloved character like Peter (Ian Bohen) to walk out of the shadows and light a cigar with a blow torch doesnt make up for the fact that the film isnt additive.\nBy being so nostalgic, its unclear who Teen Wolf: The Movie is even for. New viewers would be completely lost without the context of season 3, and its not satisfying to this longtime fan hoping to experience the humor and heart of the original series. Between all the forced action, the closest The Movie comes to a real relationship is Derek (Tyler Hoechlin) and his teenage son, Eli (Vince Mattis), who struggles to access his werewolf powers and feels insecure around his dad. But that storyline is left underdeveloped as it takes a backseat to a main plot about Allisons (Crystal Reed) resurrection as her season 1, werewolf-hating self, and Scotts desperate attempt to remind her of who she had grown into before she died.\nPhoto: Matt MIller/MTV Entertainment\nSuperfans will see things they missed from the original: The brilliance of Allisons BFF turned banshee turned Stiles love interest, Lydia (Holland Roden), Dereks stern dad vibes, Scotts himbo energy, and, yes, even the action. But theyll also be left scratching their heads about glaring plot holes. What happened to Monroe and the werewolf hunters, who ended the finale as Scotts main rivals? Why is Scott out of touch with all the members of the pack he was so close to at the end of the series? For all the surface-level callbacks, this is not a movie looking to put a bow on the series.\nOn top of it all, Teen Wolf: The Movie disrespects Kira (Arden Cho), who was introduced in season 3 as a new love interest for Scott. Her character drove the season 3 plot revived by the film. The nogitsune villain, for example, was born from her mothers trauma in a Japanese American internment camp during WWII. This background is never addressed in the film. In fact, Kiras name doesnt even come up. This is unsurprising given how the show casually abandoned her character in season 5, and then reportedly offered Cho less than her white co-stars to appear in the movie.\nThe glaring omission is more evident in how the movie essentially replaces Kira with Hikari Zhang (Amy L. Workman), a new kitsune who is barely introduced as Liams girlfriend or friend (their relationship is never defined) and only has a handful of lines. Its hard not to see her character as an attempt by Davis to justify the films use of Japanese folklore, and its a huge miscalculation for the film. Fans want to see that Teen Wolf can evolve, but The Movie feels stuck in the past.\nA new generation in Wolf Pack\nPhoto: Steve Dietl/Paramount Plus\nWhile Teen Wolf: The Movie disappoints, the best thing that may happen to Davis original series is the decision to start over again with Wolf Pack, which is actually based on a series of books by Edo van Belkom. The show begins with Everett (Armani Jackson), a loner who kicks off the episode mid-panic attack before he  spoiler alert  gets bitten by a mysterious creature while evacuating from a fire. The next thing he knows, hes in the hospital being treated for a mysterious animal bite and receiving threatening phone calls warning him that people are out to kill him. His only ally is Blake (Bella Shepard), a classmate he also saw get bit during the evacuation.\nDespite confusino, theres no connection to Teen Wolf  even a pandering one that current cinematic universes might invite  in Wolf Pack. Davis doesnt stretch to feature overlapping characters. There are no lines drawn, at least in the first two episodes, to Beacon Hills. And ",
      "snippet": "Paramount Plus released the Teen Wolf sequel movie (without Dylan OBrien) and not quite a spinoff series Wolf Pack, on the same day.\nFrom Teen Wolf creator Jeff Davis, both reinvent the MTV show to varying results.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T18:15:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Od7KGt9JF-8M_cvg5-23pFl7Ms0=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24385803/TWM_DAY27_050322_CBB_00234_RT.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23571587/teen-wolf-movie-review-wolf-pack-season-1"
      }
    },
    {
      "id": "1902540526279692315",
      "title": "Life DeFi Wallet Integrates Polygon Blockchain to Bring",
      "url": "https://www.globenewswire.com/news-release/2023/01/26/2596372/0/en/Life-DeFi-Wallet-Integrates-Polygon-Blockchain-to-Bring-Scalable-User-Friendly-Decentralized-Applications-to-Its-DeFi-Ecosystem.html",
      "description": "Polygons layer 2 scaling platform unlocks thousands of digital assets and decentralized applications that can now be natively accessed by users in Life...",
      "body": "Life DeFi Wallet\nVictoria, Seychelles\nVictoria, Seychelles, Jan.  26, 2023  (GLOBE NEWSWIRE) --  Life DeFi Wallet, the worlds first multi-blockchain non-custodial digital wallet service that allows users to transact directly through usernames, has integrated the Polygon blockchain to bring digital assets leveraging the popular layer 2 scaling solutions increased speed, lower fees and strong security, as well as the expansive suite of dApps built on the Polygon blockchain and to Life DeFi Wallets rapidly expanding platform. The development was overseen by GDA International, which provides digital asset companies with access to growth capital and financial advisory services that help stakeholders navigate the digital asset landscape.\nAs the first layer two solution for Ethereum, which emerged to provide faster transactions and lower costs for users, Polygon acts as a speedy sidechain running alongside the main Ethereum blockchain. Polygon uses the same proof of stake algorithm of the Ethereum blockchain, as well as the same Ethereum Virtual Machine (EVM), so that developers can quickly and easily migrate applications and digital assets between both protocols, but with fees that are a fraction of the cost to Ethereum and transactions that process at near instant speed.\nPolygon has over 135 million unique addresses, over 34 thousand decentralized applications built on the protocol, has completed over 1.8 billion transactions and boasts a suite of solutions that provide custom scaling and privacy functionality with modular development frameworks available. The applications built on Polygon include everything from decentralized exchanges, bridges and lending and borrowing protocols, to metaverses, play to earn games, NFT platforms and more. Integrating the Polygon blockchain represents a big step forward in making all digital assets and DeFi functionality accessible to the Life ecosystem.\nLife DeFi Wallet has streamlined digital asset transfers, making it possible for users to send and receive such assets using simple @usernames in place of complicated public keys. This will help to onboard new users into the blockchain and Web3 spaces and significantly reduces the adoption hurdles that currently face users in the digital assets space. As part of this initiative, the Life DeFi Wallet team will reserve the @polygon username within the Life ecosystem for the Polygon Foundation.\nAccording to Life DeFi Wallet Founder Patrick Andras: The Polygon blockchain is one of the most widely used protocols and powers many of the most used dApps in the world. Integrating Polygon opens up thousands of new dApps to become available from Lifes upcoming dApp browser and millions of users of digital assets on their protocol will now have access to a simple to use and highly secure non-custodial wallet they can send any token issued on polygon to others using an @username.\nMichael Gord, CEO of the GDA Group of Companies, said: The objective of Life DeFi Wallet is to make using digital assets simple and accessible to everyone. Integrating Polygon is a big step forward towards being able to have the users of Life take advantage of all the decentralized applications built on the Polygon blockchain and to be able to store and send all digital assets issued on Polygon.\nLife DeFi Wallets integration with Polygon comes only days after the application was publicly released on the Android Play Store. GDA Group, Life DeFi Wallet, and Polygon are setting the stage for delivering meaningful advancements for users in the areas of convenience, value generation, and outreach in a wide range of industry verticals. To learn more about Life DeFi Wallets suite of services, how to obtain your personal @username, or for the Life DeFi Wallet project roadmap, please visit https://lifecrypto.life/ or download the Life DeFi Wallet on the Play Store.\nAbout Life DeFi Wallet",
      "snippet": "... emerged to provide faster transactions and lower costs for users, <b>Polygon</b> acts as a speedy sidechain running alongside the main Ethereum blockchain.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T18:04:59",
      "provider": {
        "name": "globenewswire",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "globenewswire",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.globenewswire.com/news-release/2023/01/26/2596372/0/en/Life-DeFi-Wallet-Integrates-Polygon-Blockchain-to-Bring-Scalable-User-Friendly-Decentralized-Applications-to-Its-DeFi-Ecosystem.html"
      }
    },
    {
      "id": "1339971910017343484",
      "title": "Whats different between the Dead Space remake and the original?",
      "url": "https://www.polygon.com/guides/23571515/dead-space-remake-biggest-differences-graphics-update-isaac-voice-story-maps-ending",
      "description": "The Dead Space remake is mostly similar to the original, but still has some changes. Here are the major differences between Dead Space 2008 and Dead Space 2023.",
      "body": "Email\nImage: Visceral Games/Electronic Arts via Polygon\nIts been almost 15 years since the original Dead Space came out. The new Dead Space is a remake, but its rebuilt from the ground up. If youre a returning veteran of the Dead Space franchise, youre going to notice a lot of minor changes and a couple substantial ones.\nOur guide to the biggest changes in Dead Space will prepare you to return to the USG Ishimura.\nUpdated graphics through the Frostbite Engine\nObviously, 15 years of improvements and EAs Frostbite Engine allows for a lot of visual improvements. Everything from character models to the ship itself got a dramatically updated look.\nArriving at the USG Ishimura in the old and new Dead Space.\nImage: Visceral Games/Electronic Arts via Polygon\nLighting in the game also got a pretty big overhaul. Its a lot more atmospheric (and spooky) now with volumetric lighting. Theres also just generally less light to go around  entire rooms will be almost completely dark, forcing you to rely on your weapons flashlight.\nNo more loading screens\nThe move to current hardware also means Dead Space can ditch loading screens. Removing them keeps the story (and anxiety) flowing a lot more smoothly.\nCharacters (and characterization) are more fleshed out\nThe cast of characters you know and love are unchanged  with one exception. Theres a new member on the crew of the Kellion. She mostly just stays on the ship, though.\nGunnar Wright of the original Dead Space reprised his role as Isaac for the remake. The larger story is untouched and there were no dramatic edits to the script, but its not a line for line remake.\nThe dialogue isnt exactly the same, but it says the same thing.\nImage: Visceral Games/Electronic Arts via Polygon\nMore specifically, though, Isaac is no longer an all-but-silent protagonist  and he takes his helmet off a lot more often. Hes got a lot more dialogue now, too, bringing his character a lot more in line with Dead Space 2 and 3.\nNew floorplans and objectives\nWe mentioned this in our beginners guide as well, but a ground-up redesign means that the exact layout of the Ishimura isnt identical to the original. Its nothing as big as an entirely new floor, but more like zigs where there used to be zags.\nNew objectives often involve turning out the lights.\nImage: Visceral Games/Electronic Arts via Polygon\nRelated to that, some objectives are different or modified. These dont change anything about the game, really, but they might be enough to make those old walkthroughs pretty confusing. For example, the first chapter has Isaac retrieving a data board. In the original, this involved grabbing a keycard off a corpse. In the remake, it requires you to reroute a circuit breaker from the lights to the door (see our note about darkness above).\nSide missions exist now\nWhile the larger story hasnt changed, a new layer of the narrative has been added in the form of side missions. These are smaller tasks that have you exploring the Ishimura and filling in some of the world building details through gameplay (rather than just audio and text logs).\nThe side mission menu.\nImage: Visceral Games/Electronic Arts via Polygon\nSide missions will show up in your RIG HUD under the Missions tab. Selecting one and tracking it will make your Locator guide you there.\nImage: Visceral Games/Electronic Arts via Polygon\nTheres an alternate ending\nArguably the biggest change is the addition of an alternate ending to Dead Space. Per the official Dead Space Twitter account, this is a New Game+ ending. Well provide details about how to see it in the coming days.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Email Image: Visceral Games/Electronic Arts via <b>Polygon</b> Its been almost 15 years since the original Dead Space came out. The new Dead Space is a ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T17:48:23",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/MEwPiPJk-JDZHRbZkbJd5LFzxGU=/0x0:2880x1508/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24385743/Dead_Space_beginners_1.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23571515/dead-space-remake-biggest-differences-graphics-update-isaac-voice-story-maps-ending"
      }
    },
    {
      "id": "8090427005236719052",
      "title": "Poker Face review: Natasha Lyonne Rian Johnsons new mystery show rules",
      "url": "https://www.polygon.com/reviews/23569789/poker-face-review-natasha-lyonne",
      "description": "The new Peacock series plugs a cast of famous guest stars into a case-of-the-week comedy thriller for a show thats just like Columbo or Murder, She Wrote. Episodes release each week after the premiere on January 26.",
      "body": "Poker Face\ns accidental sleuth Charlie Cale (Natasha Lyonne) zips around the American Midwest in a beaten-up Plymouth Barracuda. As one mechanic (and murderer) scathingly notes, Itd run amazing if you took better care of it. One cant resist the symbolism: Like the 1969 muscle car, Poker Faces weekly mysteries are built on an episodic television structure that feels reliable but anachronistic. The case-of-the-week format isnt entirely dead, but its practically nonexistent amid streaming originals, especially ones with a team and cast as prestigious as this.\nCreated by Rian Johnson (with some episodes written and directed by him) with showrunners Lilla and Nora Zuckerman (previously writers on Fringe), the 10-episode Peacock series finds the Knives Out director grappling yet again with the tropes of detective fiction. Brick riffed on hard-boiled detective noir, the Benoit Blanc films on the whodunits of Agatha Christie, and Poker Face falls right in line with TV mainstays like Columbo (the show even replicates the title font of Tumblrs favorite 1970s crime series). Johnsons films and TV work have become known for being rather aggressively postmodern, so its sort of surprising in itself to watch a show thats so classicist in its storytelling, with only occasional offhand  and genuinely funny  references to contemporary cultural ephemera. Even the cut-to-commercial-break moments (which may not have ads depending on your Peacock plan) hit with a classic cadence. And whereas Knives Out and Glass Onion reveled in social commentary, even with its own pockets of satire, Poker Faces number-one priority seems to be falling in love with Lyonnes Charlie. She works for everyone but answers to no one. She solves mysteries because its the right thing to do.\nCharlies aimless drifting, fueled by a bloody inciting incident in the pilot and the isolated nature of each case, means that the show can, technically, be watched in any order following the first episode; every new stop brings with it a new story and new cast of characters. Its a canny choice of adapting the stray ideas that have circulated\nabout how good it would be if Lyonne played such a type of investigator. Turns out, it is very good.\nPhoto: Evans Vestal Ward/Peacock\nLike Columbo, each episode of Poker Face begins with a murder, with a victim, perpetrator, and smoking gun all in plain sight. Before long, the clock rewinds to discover how Charlie fits into the proceedings, and ultimately utilizes her uncanny gift of knowing whenever someone is lying.\nThe fun of Poker Face is in seeing every time Lyonne is able to call bullshit (literally), which is often. Both Poker Face and Columbo find intrigue in the execution of murder and investigation, and delight in the idiosyncratic way that their sleuths follow the trail, instead of leaving breadcrumbs of evidence for the satisfaction of solving the mystery at home. And in Poker Faces cleverest twist, each episode connects Charlie to the victims and perpetrators through whatever odd jobs she takes to survive on the road, and thrives on the ripple effects of the murder.\nWhile the formula is familiar, it doesnt feel old-fashioned, thanks to charming production design, energetic camerawork, and the right dramatic complications. The big twist is that Charlie is not a cop, which changes how the bumbling detective with a winningly husky voice approaches each murder. By the time an episodes target is murdered, Charlie is usually already connected to everyone involved by way of side gigs or detours. The investigations become personal, giving each episode a strong emotional hook as well as the goofy comedy of watching Lyonne interacting with small-town weirdos. And her status as a (framed) fugitive means that police assistance is out of the question; she has to rely on the relationships shes struck up, and usually on some form of citizens justice. It feels in line with what Johnson called in interviews the paternal state of detective fiction, something Poker Face often sidelines. Charlies brand of justice is usually the denouement, with the implication that arrest probably isnt far behind.\nSuch instances become part of the intrigue and ritual of watching Poker Face: Rather than impressing yourself by immediately guessing that the murderer is the prolific guest star, that work is already done. Instead you wonder: How does Charlie know this person? Where does she fit in? What service industry job is she working behind the scenes this time? And how can she make them culpable for their acts when shes a fugitive from the law herself, with only inadmissible evidence to work with? The show sometimes finds poetic and surprising answers to that last question; sometimes its a little more conventional.\nSuch rituals feel somewhat absent from what many consider prestige television. Though serialized storytelling isnt a bad thing, its too often mistaken for prestige itself (which is most apparent when filmmakers and showrunners call their series eight-hour movies). So it feels like a breath of fresh air that Poker Face fills a niche of one-and-dones, and has a lot of fun doing so as it rotates through an astounding guest list. Adrien Brody is fueled by a Succession-esque mix of overconfidence and desperation in the premiere as the failson heir to a casino; Chlo Sevigny lets decades of frustration rip as a washed-up rocker; Lil Rel Howery and Danielle Macdonald channel Macbeth as the owners of a brisket place; and in one case, Hong Chau plays (with hilarious, awkward forthrightness) a strange, lonely trucker mistaken for a murderer.\nPhoto: Sara Shatz/Peacock\nbuddy and cinematographer Steve Yedlin on camera duty\n), the first episode, Dead Mans Hand, is tragic and compelling as it establishes not only Charlies backstory but also the structure and style of every subsequent episode, as Charlie investigates her friends murder in the casino in which they both work while grinding on a card shark scheme. Episode 3, The Stall, directed by Iain B. MacDonald and written by Wyatt Cain, might be the best of the first six episodes previewed for critics, handily the funniest and the zippiest the scripting has felt as it delves into a murder over a brisket business, catalyzed by, of all things, a DVD of Okja. (A non-Criterion Netflix disc release? Unheard of.)\nThe team behind Poker Face telegraphs that, while the formula goes down easy, everything can change. In the fifth episode, The Time of the Monkey, surly geriatric hippies commit a murder against an old man for unknown reasons  a crime that creates a mystery within the mystery. (The episode also features one of the most surprising end-credits needle-drops Ive experienced: a Zamrock song by my fellow countrymen Ngozi Family, pioneers of a music movement with roots in Zambian independence.) Still, episode 6 might be the juiciest murder setup of them all, an hour loaded with twists and turns and suspense in seeing who is going to fall victim to a decades-old spat between f",
      "snippet": "The new Peacock series plugs a cast of famous guest stars into a case-of-the-week comedy thriller for a show thats just like Columbo or Murder, She Wrote.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T17:32:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Wazc18XStk9xhTCcNuTgWKdZKnY=/0x0:1000x524/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24385716/NUP_197727_00906.JPG",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/reviews/23569789/poker-face-review-natasha-lyonne"
      }
    },
    {
      "id": "6590811331026248330",
      "title": "Formula 1: Drive to Survive season 5 trailer stars world champ Max Verstappen",
      "url": "https://www.polygon.com/23572795/formula-1-drive-to-survive-season-5-release-date-netflix-trailer",
      "description": "Formula 1: Drive to Survive season 5 premieres Feb. 24 on Netflix, covering the 2022 F1 championship season won by Max Verstappen and Red Bull Racing.",
      "body": "Flipboard\nEmail\nThe fifth season of Netflixs acclaimed Formula 1: Drive to Survive documentary premieres on Feb. 24, and this trailer gets to the point immediately: Max Verstappen, the double-defending World Drivers Championship winner, is back in the interview chair, cooperating with the shows producers.\nVerstappen had quietly boycotted the Netflix series over its last three seasons, feeling the first year didnt fairly present him or his team. (His boss, Christian Horner, husband of Spice Girl Geri Halliwell, handled all of the PR in his absence.) As they say, however, winning cures just about everything. After his second straight world title, the 25-year-old Belgian-Dutch racing prodigy seems a little more secure in his place in F1, regardless of what Netflixs filmmakers do or say.\nFormula 1: Drive to Survive will recap a consequential year for the sport, whose popularity in the United States has surged over the past five years. Last year saw a new set of construction regulations that completely remade the look and aerodynamic performance of F1 cars.\nCoupled with research & development spending limits (which Red Bull\nviolated anyway\n), the new rules were intended to bring parity to a sport dominated by Red Bull, Mercedes, and Ferrari over most of the past decade. And yet, those same three teams still took every podium position except one (McLarens Lando Norris placed third at Imola).\nSo, despite the fact Verstappen coasted to a lopsided world championship, there should still be plenty of tasty paddock intrigue, and arch comments coming from fan favorites like Haas team principal Guenther Steiner and bitter sourpusses like Otmar Szafnauer, now managing Alpine/Renault. AlphaTauris Yuki Tsunoda is also sure to provide a steady stream of bleeped-out race radio invective.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Formula 1: Drive to Survive season 5 premieres Feb.\n24 on Netflix, covering the 2022 F1 championship season won by Max Verstappen and Red Bull Racing.\nFlipboard Email The fifth season of Netflixs acclaimed Formula 1: Drive to Survive documentary premieres on Feb.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T17:27:56",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/YOxqcdGKpcrvo1mN-UO2HEXVq1I=/0x0:5281x2765/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24387534/1245510146.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23572795/formula-1-drive-to-survive-season-5-release-date-netflix-trailer"
      }
    },
    {
      "id": "4414189571657023785",
      "title": "Netflixs We Have a Ghost trailer casts David Harbour as Casper",
      "url": "https://www.polygon.com/23572786/we-have-a-ghost-netflix-trailer-release-date",
      "description": "Netflix revealed the first trailer for We Have a Ghost on Thursday. Directed by Happy Death Days Christopher Landon, the film follows a teenager who must help a mute middle-aged ghost in a bowling shirt elude the CIA and find  peace.",
      "body": "Flipboard\nEmail\nNetflix revealed the first trailer for its upcoming fantasy comedy-drama We Have a Ghost on Thursday, and its got a ghostly, balding David Harbour in a bowling shirt running from the CIA.\nDirected by Christopher Landon (Happy Death Day, Freaky), the films follows Kevin (Jahi DiAllo Winston), a teenager who discovers and befriends Ernest (David Harbour), a mute ghost haunting the old house that his family has just moved into. When news of Ernests existence spreads across social media, it attracts the attention of both opportunistic hucksters and the Federal government, who will stop at nothing to apprehend and experiment on him. Fulton will have to embark on a road trip to help Ernest elude the authorities while helping put his soul to rest.\nLandon has proven to be a capable director when it comes to riffing off of older horror-comedy films and putting a contemporary spin on them. From the trailer, We Have a Ghost certainly feels like a mash-up of 1995s Caspar by way of 1982s E.T. the Extra-Terrestrial. Well have to see how successfully it turns out, but from what weve seen so far, it looks great.\nWe Have a Ghost is coming to Netflix on Feb. 24.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Netflix revealed the first trailer for We Have a Ghost on Thursday.\nDirected by Happy Death Days Christopher Landon, the film follows a teenager who must help a mute middle-aged ghost in a bowling shirt elude the CIA and find peace.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T17:09:24",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/UjtA3vLtP991VrqRti47XcvAH1w=/385x0:3456x1608/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24387520/We_Have_a_Ghost_00_41_55_17_R.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23572786/we-have-a-ghost-netflix-trailer-release-date"
      }
    },
    {
      "id": "3815835051196223116",
      "title": "Midnight Suns Deadpool DLC review: Wade Wilson brings the queer chaos",
      "url": "https://www.polygon.com/reviews/23571777/midnight-suns-deadpool-dlc-review-marvel-release-date",
      "description": "Marvels Midnight Suns brings Deadpool to the game in the first DLC release. Nolan North reprises the obnoxious loudmouth role, but this time, Wade Wilson is just as queer as he is in the comic books.",
      "body": "Flipboard\nEmail\nForget everything you think you know about Deadpool from Ryan Reynolds star turn. Or at least, forget some of it. Yes, he breaks the fourth wall, and yes, hes extremely annoying  but along with those well-known character traits, he also experiences attraction to people all over the gender spectrum. Although the recent live-action movies have tiptoed around it, the comic book canon has long since confirmed Deadpool as a queer character. So, given the diverse sexuality thats already on display in Marvels Midnight Suns, I hoped that Deadpools DLC appearance would be a rainbow-filled delight  and I was not disappointed.\nThe queer representation in Marvels Midnight Suns is refreshingly understated and mundane (not the way Id normally describe Deadpool, but well get to him in a bit). For example, the game gender-swaps Caretaker and puts her in a long-term sapphic romance with Agatha Harkness. Thats right, the witch made famous on Wandavision is dating a lady in Midnight Suns. (I use the present tense here because, although Agatha is dead at the games outset, she doesnt exactly stay dead for long.)\nRelated\nReview: Marvels Midnight Suns isnt just XCOM with superheroes (and thats a great thing)\nDespite that inclusivity in Midnight Suns, I wasnt sure what to expect of Firaxis Games take on Deadpool, since his representation in the comic books has been anything but consistent. I love that his crush on Cable goes beyond platonic bromance in Cable & Deadpool #20, and since then I have clung to the canonicity of Wades queer identity, even though many writers have ignored it over the years. Deadpools appearances in other media have not typically referred to his queerness either, and I dont just mean the Ryan Reynolds movies. Deadpools cameos in the Marvel vs. Capcom games, and even the High Moon Studios game Deadpool (2013), make him a flirt and a womanizer, but not so much a gender-doesnt-matter-izer.\nThere is one thing about Deadpool thats been consistent over many years and many adaptations: Nolan North is the go-to voice for the character. Even Ryan Reynolds performance seems to take inspiration from Norths version, especially the very first time that North voiced Deadpool, in a direct-to-video animated movie called Hulk Vs. (2009). That movie isnt good  I should know, I recently rewatched it for my X-Men podcast  but Nolan Norths performance as Deadpool remains a silver lining. It makes sense, then, that after that scene-stealing turn, North played the role across several more video games and reprises it once more in Midnight Suns. Ive played or seen almost all of these adaptations of Wade Wilson, and the Midnight Suns version is  so far  as queer as Deadpools ever been.\nImage: Firaxis Games via Polygon\nImage: Firaxis Games via Polygon\nImage: Firaxis Games via Polygon\nImage: Firaxis Games via Polygon\nI guess I should also note that, as a queer person myself, I do have mixed feelings about the Extreme Omnisexual trope, which Wade Wilson fits to a T. Hes not only queer, hes also evidence that the superheroes in Midnight Suns should have a human resources department (and several sexual harassment seminars). But because this game includes extremely normal queer characters alongside the ridiculousness of Wade, Ive given myself permission to enjoy him and his over-the-top obnoxiousness. Hes my deliciously problematic fave.\nFiraxis DLC inducts the Merc with a Mouth into the Midnight Suns via three new story missions. Deadpool gets his own customized lineup of attack cards, and hes not hard to learn; between his dual pistols and katanas, he has lots of quick short-range attacks that make him better against individuals rather than enemy swarms. His story arc also introduces its own supervillain  Sin, the goofy vampiress daughter of Red Skull  and a new enemy type called Vampyres. In addition to providing an opportunity for the characters to crack jokes about having to spell vampires with a Y, the Vampyres also have some fun and challenging new combat mechanics (they can tack on self-inflicted Bleed damage to your attacks  meaning, your own attacks will start inflicting Bleed damage on you, rather than your enemies).\nIts not all sunshine and rainbows, of course. Some of Deadpools jokes ring a bit hollow. In a mission with the Hulk, I had to endure Deadpool making a comment about how the big green guys testicles were falling out of his briefs. (Why, Wade? Why?) Also, Deadpool periodically shouts insert catchphrase here! It gets old.\nImage: Firaxis Games via Polygon\nImage: Firaxis Games via Polygon\nThat said, I spent the DLC chuckling far more often than rolling my eyes. Wade Wilson hits on the disciplined vampire hunter Blade in basically every mission. Blade responds with exhausted irritation, but not disgust or homophobia (thank goodness). The main problem that Blade and the other superheroes have with Deadpool is that the infamous mercenary has been secretly working with Doctor Doom, and thats way more annoying than his goofball flirtations.\nBest of all is the weird and unlikely friendship that develops between the player character (The Hunter) and Deadpool. I didnt expect to feel sorry for Wade, ever in my life, but the way he hangs his head in shame after getting reamed by Blade left me feeling strangely endeared to him. Wade also gently mocks the Hunter for making friends with every single team member, regardless of their personality or politics (very typical of a video game protagonist). His reluctance to get close makes the eventual connection all the more meaningful, and the jokes along the way felt earned  especially Wades jokes about how much he hates himself, and how he uses humor as a defense mechanism.\nAlthough Midnight Suns has its hits and misses when it comes to character development  I may have leveled up my friendship with Tony Stark, but I didnt enjoy a single minute  the Deadpool DLC finds the mark well, emphasizing this characters most annoying qualities while also letting his inner softie burst through. His playstyle in combat didnt exactly blow my mind, but his personality was the real draw for me, and the writers got that part right. Firaxis has three more DLC packs on the way, each featuring a new character, and after Deadpools arc, I cant wait to spend more time with the next weirdo who joins the squad.\nMarvels Midnight Suns: The Good, The Bad, and The Undead\nDLC will be released on Jan. 26 on\nPlayStation 5",
      "snippet": "Image: Firaxis Games via <b>Polygon</b> Image: Firaxis Games via <b>Polygon</b> That said, I spent the DLC chuckling far more often than rolling my eyes. Wade ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T17:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/6BiMBAdcgKK4kpN5vWGRui59uKA=/0x11:2560x1351/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24386039/20230123134154_1.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/reviews/23571777/midnight-suns-deadpool-dlc-review-marvel-release-date"
      }
    },
    {
      "id": "2729561361836026675",
      "title": "Succession season 4 trailer: The rich kids are still fighting",
      "url": "https://www.polygon.com/2023/1/26/23572706/succession-season-4-trailer-promises-at-least-one-rich-person-will-throw-something",
      "description": "The trailer for HBOs Succession season 4 gives viewers their first hints for whats in store for the Roy family after season threes surprise betrayal.",
      "body": "the reason for loving it\n: Its about the petty disputes between a family of rich jerks and the company theyre jockeying for control over. Like a lot of straight dramas, this doesnt necessarily make for an exciting trailer, but Succession sure does try. The trailer for its fourth season has someone throwing some papers and jogging through an office corridor!\nThere are jokes though, which is another good thing to remember: Sucession is funny! And season 4 is picking things up after whats maybe\nthe goofiest status quo shift yet\n: The Roy siblings iced out from their father Logans (Brian Cox) company following a secret alliance between him and his sycophantic idiot son-in-law, Tom Wamsgams (Matthew Macfadeyn). Given this sly maneuver, a major part of this seasons arc will likely revolve around determining whether or not Tom is still, in fact, an idiot  although ending the trailer with him comparing his situation to Israel and Palestine, but harder, and much more important does not inspire confidence.\nSuccession returns to HBO on March 26.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The trailer for HBOs Succession season 4 gives viewers their first hints for whats in store for the Roy family after season threes surprise betrayal.\nthe reason for loving it : Its about the petty disputes between a family of rich jerks and the company theyre jockeying for control over.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T16:43:26",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/OCU3WVZ1RmDX-tVaQ2MrLQaXtUw=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24387450/brian_cox.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/2023/1/26/23572706/succession-season-4-trailer-promises-at-least-one-rich-person-will-throw-something"
      }
    },
    {
      "id": "871029822862130845",
      "title": "Sci-fi RTS Chaotic Era released on Early Access for PC and Mac",
      "url": "https://www.polygon.com/23572580/chaotic-era-sci-fi-rts-early-access-release-trailer-pc-mac",
      "description": "Chaotic Era, the new sci-fi RTS from Toronto game developer Bobby Technology, has been release on Early Access for PC and Mac. Players will navigate a strange, minimalist world in a fierce resource-scarce world in the future.",
      "body": "Flipboard\nEmail\nChaotic Era, one of Polygons most anticipated indie titles of 2021, was released on Thursday for PC and Macintosh. A debut title from Toronto-based developer Bobby Technology, the game is described as an atmospheric strategy game inspired by classic science fiction, following a crew of human colonists in the late 28th century who flee a war-torn solar system to find themselves stranded on a hostile alien world.\nTo survive, players will have to build bases, allocate energy reserves to maintain life support, build weapons and defenses, explore the planet, and fend off its hostile inhabitants. The game features procedurally generated solar systems, allowing players to traverse new environments filled with unique enemies and challenges to interact with. The game is currently in Early Access, with additional updates and content set to be released later throughout the year.\nImage: Bobby Technology\nThe main thing that immediately distinguishes Chaotic Era apart from its sci-fi RTS contemporaries is the games distinctive art style; a minimalist latticework of sleek wire-frames, pulsing topographic texture maps, and white hot explosions. Chaotic Eras UI design takes cues from the in-universe computer graphics of sci-fi films like Alien, Blade Runner, and Total Recall, drawing inspiration from that abstract yet distinct aesthetic and translating it into an interface that is as pleasing to look at as it is gratifying to manipulate.\nHaving had a bit of time to play around with it myself, the game feels at once like combination of a resource management RTS in the vein of Introversion Softwares Darwinia and the combat of Ritual Entertainments Dawn of War series, and an aesthetic sibling to the experimental games like 2017s mobile space exploration game Verreciel.\nChaotic Era is available to purchase on Itch.io for $4.99 USD on PC and Mac and is scheduled to be released on Steam, iOS, and Android later this year.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Chaotic Era, the new sci-fi RTS from Toronto game developer Bobby Technology, has been release on Early Access for PC and Mac.\nPlayers will navigate a strange, minimalist world in a fierce resource-scarce world in the future.\nFlipboard Email Chaotic Era, one of <b>Polygons</b> most anticipated indie titles of 2021, was released on Thursday for PC and Macintosh.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T16:32:38",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/9RRD-c7uuduFBgzAMkr41nS-TyA=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24387416/_7ZVmQ.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23572580/chaotic-era-sci-fi-rts-early-access-release-trailer-pc-mac"
      }
    },
    {
      "id": "7089508852179413943",
      "title": "Dead Space remakes content warnings are an amazing tool",
      "url": "https://www.polygon.com/23571524/dead-space-remake-accessibility-content-warnings-hide-disturbing-imagery-settings",
      "description": "Dead Spaces remake is a fantastically scary game, but Motive Studio added accessibility options for content warnings and hiding disturbing imagery that make the story much more accessible.",
      "body": "Email\nImage: Motive Studio/Electronic Arts\nThe original Dead Space is a classic survival-horror experience, thanks to its gratuitous use of guts, gore, and highly disturbing imagery. The 2008 game doesnt hold back on the punches, and this is all part of the draw for its proponents  the stranger and scarier the visuals, the better. And in the new remake, which will be released on Jan. 27, developer Motive Studio has added some accessibility options that keep the bite of the original game while broadening the appeal.\nDead Space starts off with a content warning: Dead Space contains graphic violence, including explicit depictions of dismemberment, impalement, blood, gore, vomit, and death. Gameplay and cinematic scenes depict numerous traumatic events and portray harmful behaviors associated with mental health. Topics include self-harm and suicidal ideations, death of colleagues and relatives, claustrophobia, psychosis, visual/auditory delusions, and obsessive behaviours.\nThis is, in and of itself, a pretty good content warning! Compare and contrast to The Medium, a 2021 horror game, which opens with a brief trigger warning: The Medium was designed and developed by a diverse team of various beliefs, political views, and ideologies. It touches upon highly sensitive subjects with the intent of treating them seriously. Despite this, some players may find certain scenes and themes triggering.\nThis is well-meaning, but essentially useless  the equivalent of an allergy warning on a food product that says it was prepared by a diverse team of chefs. Cool, I guess. But that doesnt actually tell me whether the product is safe to consume.\nImage: Motive Studio/Electronic Arts\nMotive and publisher Electronic Arts go even deeper than that initial, specific warning, with an in-game toggle that shows content warnings before various scenes. In the infamous moment where Isaac hears a dull thud, thud, thud in the distance, you may rightfully assume its a nasty beastie, only to approach and find a poor Ishimura employee slamming their face into the window. If you turn on the accessibility toggle, you will see a warning that says, The upcoming section contains depictions of self-inflicted death.\nFurthermore, a second toggle exists to hide disturbing scenes. This will blur out these scenes (although the audio is not affected). It also blacks out Isaac Clarkes death animations, which can be truly graphic and gruesome. While some fans delight in the horror of seeing Isaac pulled limb from limb or brutally decapitated, others might find that a bit too spicy for their tastes.\nElectronic Arts has an external site that catalogs the system\nand even includes a chapter-by-chapter breakdown of each in-game warning and the content it covers. Some of the warnings are for things as obvious as suicide or amputation, whereas others are for more specific triggers, like medical malpractice or needles.\nThese options are entirely optional, and its possible that most players wont even look for these toggles  for them, the murder, mayhem, and discomfort are all part of the fun. But Dead Space is a fantastic game absolutely dripping with tension, atmosphere, and mystery apart from the gory aspects. Now, more players will be able to explore the Ishimura and help Isaac escape; I havent seen this before in a game of this scope and scale. And thats great.\nHow to turn on content warnings in the Dead Space remake\nIn the pause menu, head to Settings, and then Accessibility. The fourth and fifth options relate to content and warnings. Toggle Show Content Warning for the in-game warnings to appear in the top right of your screen, and Hide Disturbing Scenes to place a window that hides the games most graphic content. Both of these options are disabled by default, and they can be turned on at any point throughout a playthrough.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Dead Spaces remake is a fantastically scary game, but Motive Studio added accessibility options for content warnings and hiding disturbing imagery that make the story much more accessible.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T16:01:12",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/qm1NdP-d-l0ZqbgVWaC5Ym5_iWA=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24385620/wewe.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23571524/dead-space-remake-accessibility-content-warnings-hide-disturbing-imagery-settings"
      }
    },
    {
      "id": "5032357743510647352",
      "title": "Dead Space remake review: The best the franchise has ever been",
      "url": "https://www.polygon.com/reviews/23571676/dead-space-remake-review-release-date-ps5-xbox-series-x-pc",
      "description": "EA and Motives remake of sci-fi horror classic Dead Space lives up to its groundbreaking source material. The Dead Space remake, out Jan. 27 on PS5, Xbox Series X, and PC, is one of the best games of 2023.",
      "body": "Flipboard\nEmail\nIn the 15 years since Dead Space was released, it has cemented in my brain as a masterpiece of science-fiction horror. Its unmatched atmosphere, its visceral, lead-footed combat, and its cosmic terrors still hold up, through rose-tinted memories.\nThe new Dead Space is faithful to those memories. Its world, the space-zombie-infested, planet-harvesting vessel named the USG Ishimura, is a cold, industrial maze lit by flickering halogen lamps, where every machine is broken down or on the verge of flying apart. Metal clangs, steam hisses, and morbid screams bounce through its hallways. The Ishimura is a terrifying, immersive graveyard of a ship.\nImage: James Bareham\nWhat to Watch\n.\nThis remake brings the Ishimura back to life in visually stunning ways. Its decks, quarters, and airlocks have been rebuilt in painstaking detail. It is undoubtedly the star of developer Motive Studios remake, a more believable and varied ship than the one seen in the original game. But it is just a part of Motives re-engineering: Weapons, characters, and progression have all been rethought, resulting in the best possible version of Isaac Clarkes trek through a veritable hell  and hopefully the revival of a horror game franchise that flamed out too soon.\nThe story of Dead Space, heavily inspired by sci-fi horror films Alien, Event Horizon, and Sunshine, is mostly unchanged. A small crew employed by the Concordance Extraction Corporation is sent to investigate why the Ishimura has gone dark, only to find it in great distress. The ship has been overtaken by terrifying creatures called Necromorphs, and the rescue team is promptly separated from one another. As engineer Isaac Clarke, you fight to survive the Necromorph infestation as you search for an escape  and for Dr. Nicole Brennan, Isaacs estranged romantic interest and the real reason he signed on for the Ishimura mission.\nImage: Motive Studio/Electronic Arts\nDespite its general adherence to the original plot, Motive has updated major aspects of Dead Spaces structure. For one, Isaac speaks. A silent protagonist in the original game, he now converses with his shipmates and the few survivors aboard the Ishimura. His more prominent role in dialogue, combined with updated text logs and audio recordings, makes for a more elegant story overall; it introduces the trilogys theme of religious fanaticism, and the role of alien artifacts, much earlier, and in a less jarring fashion. The impact of that alien technology on Isaac and his allies psyche plays out in refreshing new ways, lending new weight to the characters relationships and their inevitable deaths.\nGunnar Wright, the voice of Isaac Clarke in the Dead Space sequels, returns to voice him here. His brand-new voiceover makes Isaac sound not like a put-upon errand boy, but a capable engineer unperturbed by shit going sideways every 15 minutes. The rest of the cast comprises new actors who bring solid performances: Brigitte Kali Canales in particular brings more nuance to computer specialist (and frequent task-giver) Kendra Daniels, and Faran Tahir (Iron Man, Star Trek) drips pure evil as Dr. Challus Mercer.\nIsaac plays much like he did in the original game: Hes a systems engineer, not a hardened soldier, and he relies on what are ostensibly construction tools  laser cutters, sawblades, torches, and force fields designed for work in zero-gravity environments  to fight the Necromorphs. Dead Spaces combat garnered acclaim for flipping video game conceits by prioritizing limb removal, not headshots or body shots, as the best way to fight enemies. Chop off an enemys legs, and youll slow it down. Amputate its arms and it has no way to fight. Slice off its head? That will only make it angrier.\nImage: Motive Studio/Electronic Arts\nFar from feeling like a dated gimmick, limb removal is still grisly, satisfying, and tactical. If two or more Necromorphs are bearing down on you, whats your plan? Hit one with a movement-slowing stasis field, cripple the other so it has to crawl its way toward you, then shoot out a saw blade to slice em both up? Thatll work. Or should you lay down a proximity mine and just lead them into a death trap? Like the original game, the remake demands constant reconsideration of your approach, with continual shifts in the Ishimuras environment and variations in Necromorph mobs.\nIsaacs everyman arsenal provides plenty of options, especially with new features that make each tool more useful. For example, the flamethrower, which serves Isaac well in more panicked moments, originally had an alternative-fire mode that launched an explosive fireball. In the remake, it instead builds a two-meter-wide wall of fire  anything that walks through it is burned to a crisp. The reliable rapid-fire pulse rifle also has a new alt-fire mode: a proximity mine thats instrumental when Necromorphs surround Isaac.\nDead Space captures the soul of its source material in the vein of Capcoms Resident Evil remakes\nWeapon upgrades like these are scattered throughout the game, both as collectible items and purchases from shop stations. Some are tucked away behind locked doors, and a new tiered security clearance system gives the Dead Space remake a more Metroid-like feel; theres some backtracking to be done through the Ishimura, and a sense of risk versus reward for doing so. Is it worthwhile to double back to a previously inaccessible area, when Necromorphs have a habit of bursting forth from hatches? Maybe!\nMotive has also retrofitted Dead Space with quality-of-life changes its sequels introduced. In the 2008 game, Isaac hopped from point to magnetized point in zero-gravity environments. However, he can now float and fly freely. Zero-G encounters have been summarily reworked, turning boss battles and minigame-like puzzles into tense, topsy-turvy situations. Appropriately, these spectacle-filled moments can be quite disorienting, even confusing, in keeping with the survival-horror uneasiness elsewhere.\nImage: Motive Studio/Electronic Arts\nMotives Dead Space remake also lives up to the impressive audio work of its source material. The sounds of the Ishimura are richly layered  the din of machinery and otherworldly screams are a constant amplifier of fear. There are also frequent audio feints and genuine shocks; Im not afraid to admit I was jump-scared a handful of times by the developers tricks, despite being vigilant throughout.\nBeyond the audiovisual upgrades, Dead Space shows that its developer is acutely aware of its impact on modern games, particularly in the horror genre. The remake captures the soul of its subject in the vein of Capcoms Resident Evil remakes, delivering a meaty, memorable single-player horror game unmarred by tacked-on multiplayer or microtransactions.\nDead Space is also replete with accessibility features, including multiple colorblind modes, input options, and even content warnings and an option to hide disturbing scenes. Yes, this is a game slathered in gore and visceral body horror, but mo",
      "snippet": "EA and Motives remake of sci-fi horror classic Dead Space lives up to its groundbreaking source material.\nThe Dead Space remake, out Jan.\n27 on PS5, Xbox Series X, and PC, is one of the best games of 2023.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T16:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/uU3zKrwSwI3dIqKuNUaH349JD1I=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24385891/DS_LAUNCH_TRLRSCREEN_06.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/reviews/23571676/dead-space-remake-review-release-date-ps5-xbox-series-x-pc"
      }
    },
    {
      "id": "11683069626745435",
      "title": "Call of Dutys DMZ mode is getting a big nerf plus more changes to Warzone 2.0",
      "url": "https://www.polygon.com/23572556/call-of-duty-modern-warfare-2-warzone-2-0-season-2-patch-notes",
      "description": "Call of Duty Season 2 patch notes start rolling out: The new DMZ mode is getting nerfed, Warzone 2.0 players will loose those big backpacks, and loot crates are changing.",
      "body": "Call of Duty: Modern Warfare 2\nand Warzone 2.0 will see loads of changes on Feb. 15 when the Season 2 patch loads in. That includes the nascent DMZ mode, which has been in beta since the games launched in November. The scope and scale of these updates was made clear in an announcement by the Call of Duty studios on Wednesday.\nDetails on coming changes to the Call of Duty platform itself look pretty straightforward, including user interface, user experience, and audio and other bug fixes. But things start to get wild in Warzone 2.0s Battle Royale modes. The Jailer in the Gulag is out, and Domination-style gameplay  as well as rifles and other long guns  are back. Cash drops will also be increased all across Al Mazrah. Loot boxes will also behave differently. Instead of forcing players to root around in the menus while under fire, stuff will just drop on the ground now. That should help speed up gameplay.\nPerhaps the biggest change, however, is that medium and large backpacks will no longer be made available.\nEvery Player will have the same Backpack throughout the entire game which will subsequently reduce the impact of stacking medical supplies, Equipment, and Killstreaks, developers said. We will continue to look for feedback and provide updates that streamline the looting experience for everyone.\nAdditionally, everyone will now start with a three-plate vest. This standardization will bring a more reliable feel to each engagement from the get-go, developers said.\nFinally, in DMZ, developers have made a concession to solo players and will rebalance the AI difficulty overall  including their accuracy at range. Spawn points are being tweaked of course, but by far the biggest change will be in overall mission difficulty. As someone with more than 70 exfils and a DMZ-earned prestige rank under their belt, I still havent managed to unlock my second insured weapon slot. Seems Im not alone:\nData and feedback reinforced that the Faction Mission difficulty ramp was too aggressive for many Players, and that the demanding scale ultimately made it very challenging to unlock the second Insured Weapon Slot (completing all Tier 3 Missions) in Season 01. We have adjusted the overall scaling of difficulty in Missions as the Tiers progress. Later Tier Missions will still be quite challenging even for the experienced Operator, but we believe more straightforward access to an additional Insured Slot will provide a better path forward for all Players.\nPlenty of other changes are teased in the post, but we expect a more full and thorough set of patch notes on or around Feb. 14.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Call of Duty Season 2 patch notes start rolling out: The new DMZ mode is getting nerfed, Warzone 2.0 players will loose those big backpacks, and loot crates are changing.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T15:24:09",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/TBaDLonPqVw-eI-a0MviZiw1uwY=/211x0:1920x895/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24387258/MWII_S01_RELOADED_015.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23572556/call-of-duty-modern-warfare-2-warzone-2-0-season-2-patch-notes"
      }
    },
    {
      "id": "3529916093650877755",
      "title": "Noah Schnapp hid a wild Stranger Things Easter egg in his yearbook quote",
      "url": "https://www.polygon.com/23571569/noah-schnapp-stranger-things-clip-senior-quote-yearbook",
      "description": "Stranger Things star Noah Schnapps senior yearbook quote includes a Stranger Things timestamp, according to a TikTok video. The scene features Gaten Matarazzo and has strong words for his teachers.",
      "body": "#fyp\n original sound - stuff\nThe scene itself is an otherwise fairly innocuous one of Dustin (Gaten Matarazzo) telling Ted Wheeler (Joe Chrest) Son of a bitch you know youre really no help at all you know that?\nSo Schnapp's full quote is closer to To all the teachers that never taught me a thing: Son of a bitch you know youre really no help at all you know that?\nClever bits of trickery, word play, and shenanigans are a classic part of senior quotes, and in fact so are sneaking swears in there by subterfuge. But its rare that someone can do all of that at the same time by throwing in a timestamp to one of the most popular shows in the world, which they also happen to star in. Then again, Schnapps not the only Stranger Things star popping up on TikTok at the moment. Theyre a crew that knows a thing or two about going viral.\nNext Up In",
      "snippet": "Stranger Things star Noah Schnapps senior yearbook quote includes a Stranger Things timestamp, according to a TikTok video.\nThe scene features Gaten Matarazzo and has strong words for his teachers.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T15:05:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/f1Y27CMFTCta_ljWZrPh29-mS7U=/0x0:1845x966/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24387147/noah_schnapp_stranger_things_season_4_01_copy.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23571569/noah-schnapp-stranger-things-clip-senior-quote-yearbook"
      }
    },
    {
      "id": "8888401735208749996",
      "title": "Season: A Letter to the Future review: A bold pre-apocalypse road trip",
      "url": "https://www.polygon.com/reviews/23569855/season-a-letter-to-the-future-review-ps5-ps4-pc-release-date-genre",
      "description": "Season: A Letter to the Future, which will be released on PC and as a PlayStation console exclusive on Jan. 31, combines exploration and photography to excellent effect.",
      "body": "Flipboard\nEmail\nWhen a dream crawls back out of your throat, it hurts, says Maytora, an elderly woman hiding away from the world in a forest. She faces mandatory evacuation in the face of a looming disaster, and she seems almost relieved to leave behind the junk sculptures shes painstakingly made throughout her life  to shed the burden of an unrecognized artist. But then I tell her Id like to photograph them, so that they live on in a museum vault for future generations. She becomes giddy, then sighs as she reflects on her artistic regrets. Yet shes surely more alive than shes been in years.\nImage: James Bareham\nWhat to Watch\n.\nScavengers Studios Season: A Letter to the Future is about those moments when were most alive. As protagonist Estelle leaves home for the first time, shes captivated by the sights and people of Tieng Valley, alive and hurting and transforming as they face the threat of an incoming cataclysm. The 10-hour journey consistently left me speechless and overwhelmed by the beauty of it all.\nThe gameplay loop in Season consists of taking pictures and recording the sounds of the world around you, amassing your collection of observations in the pages of a journal. At times, these pages guide you toward solving scripted mysteries  but most of the time, youre filling out these pages simply to learn about the game world on your own terms. When you complete a page, youll find out more about Tieng Valley, Estelle, and this strange world perpetually shaped and reshaped by smaller-scale apocalypses, which mark the different eras, otherwise known as seasons. Its Estelles job to document the world as we know it in the current season, so that its history lives on in the next. That world is stunning, filled with mysteries that expertly pull you toward a litany of beautiful moments and locales.\nImage: Scavengers Studio via Polygon\nSimilar beauty is present in Seasons writing, which consists of some of the most gorgeous prose I have encountered: Sentences are deeply poetic, flowing seamlessly like the passage of time. A poem at the beginning of the game left me so stunned that I needed to pause in order to fully process it. Characters speak about loss, regret, and loneliness  combined with the core loop of exploration, photography, and journaling, these moments weave a tapestry as melancholic as it is engrossing. You can physically sense its beauty as well, when the DualSense controller vibrates as you bike on gravel, or record and play melodies and innocuous noises.\nSeasons world is stunning, filled with mysteries that expertly pull you toward a litany of beautiful moments and locales\nMy gripes with Season are so minimal as to be inconsequential. I didnt enjoy having to constantly toggle the sprint button after I took my camera out or quickly interacted with something. The HUD image reminding you how to accelerate your bike is also intrusive, taking far too much space away from the stunning world (though this default setting can be turned off). Lastly, the story would work just as well without a ham-fisted plot point about time-related diseases.\nBut these nitpicky issues pale in comparison to Seasons potent sense of place, and the story it mines from this vibrant little valley. This beautiful project emerged from the workers at Scavengers, despite reports of toxic leadership that arose in 2021. They have created something wonderful and thought-provoking despite reported conditions no one should have to endure.\nImage: Scavengers Studio via Polygon\nAfter spending a lifetime trying to control everything and never reaching the artistic heights she desired, Maytora decides to relinquish control when it comes to choosing the items that will represent Tieng Valley in Estelles journal. Lets follow our intuition, gather some pieces and see what happens, she says. What magic might be hiding in this day which will pass and never return?\nSeason is your journey of finding that ephemeral magic and making it permanent. Even as we stand outside in the rain, waiting for god or whoever is behind that door to let us inside, there is no other day exactly like today and there never will be again  and that alone makes it worth cherishing. Season is about every little thing we can value in a life as fleeting as the seasons, and its one of my favorite games in years.\nSeason: A Letter to the Future\nwill be released on Jan. 31 on PlayStation 4, PlayStation 5, and Windows PC. The game was reviewed on PS5 using a pre-release download code provided by Scavengers Studio. Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. You can find",
      "snippet": "Image: Scavengers Studio via <b>Polygon</b> Similar beauty is present in Seasons writing, which consists of some of the most gorgeous prose I have ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-26T15:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/NH4-8mSoizPH9kJcGiQ_nlr4bZk=/0x0:3100x1623/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24385274/season3.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/reviews/23569855/season-a-letter-to-the-future-review-ps5-ps4-pc-release-date-genre"
      }
    },
    {
      "id": "2736614618463924241",
      "title": "How Disneys movie empire survived 100 years of near disaster",
      "url": "https://www.polygon.com/century-of-disney/23559556/disney-100-year-history",
      "description": "The Disney of Snow White and Cinderella is completely different than the one of Pinocchio, Little Mermaid, The Lion King, Frozen, and Encanto fame. For Disneys 100th anniversary, we break down the history.",
      "body": "Flipboard\nEmail\nThe Walt Disney Companys massive modern empire is a far cry from the small animation studio Walt Disney and his brother Roy founded in 1923. One hundred years ago, the two brothers took a train from their hometown of Kansas City, Missouri, to Los Angeles, where they worked out of their uncles garage before purchasing a tiny studio space on Kingswell Avenue. In the beginning, the Disney brothers mostly made animation for other studios. It wasnt till Walt Disney Studios was about to lose half its staff and its first successful character, Oswald the Lucky Rabbit, to Universal Studios that Walt and his most loyal animators created Mickey Mouse and began to carve out a legacy of their own.\nIn 2023, Disney is much more than animation, or even movies: It is theme parks, superheroes, Star Wars, Hulu, National Geographic, and more. The company has expanded into a multi-billion-dollar dominant force in world entertainment. But even so, the Disney name still brings to mind the animation that the company started with. How the world felt about those animated movies, however, has drastically changed over the past century.\nIn the beginning\nImage: Disney\nWhen Walt and his peers first started making animated shorts, the entire field was new and exciting. Back in the 1920s and 1930s, animation hadnt yet evolved a reputation as a childrens medium. It was still a very new art form, which made it a draw for adults and children alike. And because it was so novel, animation was also seen as high art. Disneys Silly Symphony shorts, a series of 75 musical films released from 1929 to 1939, drew significant of praise for their innovation, particularly the use of Technicolor and multiplane cameras.\n1932s short Flowers and Trees, which follows two trees falling in love, was the first commercially released movie in Technicolor  and audiences adored it. Film Daily extolled it as a genuine novelty that bids fair to put the cartoon on a new plane of importance. Disney continued to outdo itself with 1937s The Old Mill, a charmingly detailed short about a group of animals living in a dilapidated windmill and weathering a fearsome thunderstorm. Democrat and Chronicle reported it to be as beautiful as old Dutch masters.\nSo when Disney released Americas first ever full-length animated feature (20 years after the first ever full-length animated feature,\nArgentinas El Apostol\n), audiences and critics alike werent expecting a childrens movie. They expected high art  and the critical response suggests that Snow White and the Seven Dwarfs delivered.\nMr. Disney and his technical crew have outdone themselves, critic Frank Nugent wrote for the New York Times. The picture more than matches expectations. It is a classic, as importantly [sic] cinematically as The Birth of a Nation or the birth of Mickey Mouse. Nothing quite like it has been done before; and already we have gone impolite enough to clamor for an encore.\nWartime struggles\nImage: Walt Disney Productions\n1940s Pinocchio, Snow Whites immediate successor, was released to critical acclaim, with The Hollywood Reporter even calling it infinitely superior to Snow White. But before Walt Disney Studios could fully capitalize on its early successes, World War II greatly affected the studios output  and the reception of its movies. Fantasia and Bambi followed Pinocchio to a lukewarm reception. Fantasia, in particular, was outright contentious: Some critics loved it, while others called it kitchsy.\n1941s Dumbo, however, was a smashing success  partly because it was significantly cheaper to make than the other movies. The character became so popular that in 1941, Time Magazine almost made the elephant the Mammal of the Year  a spoof on the magazines annual Man of the Year issue. (Since 1999, its been Person of the Year.) A full magazine cover was drawn up, but plans shifted after the Dec. 7, 1941, attack on Pearl Harbor, and the magazine decided to reexamine the tone of the year-end issue. Disney, too, shifted priorities once the reality of war started to dawn upon America.\nImage: Walt Disney Animation\nBy 1943, 90% of Disneys work as a company had been redirected to aid the war effort. Disney created military insignia, made training and informational videos, and produced propaganda films. Donald Duck made fun of Hitler. The Seven Dwarfs adorned war bonds. Mickey Mouse appeared on Remember Pearl Harbor posters. While Walt himself was initially reluctant to get involved in the war effort, the companys involvement reportedly increased morale across troops and on the homefront. The company rarely acknowledges this period today, but the impact was monumental, establishing Disney as a cornerstone of the American experience.\nBut the focus on war-related films and shorts meant that the studio had little time to focus on creative efforts. The solution was a series of package films  original shorts compiled into feature-length compilations, such as The Adventures of Ichabod and Mr. Toad and The Three Caballeros. They were cheaper, quicker alternatives to big-budget, labor-intensive movies like Pinocchio and Fantasia. Most of these package films stayed away from the war-heavy topics of the companys other ventures and kept to lighthearted fare.\nCritics consensus on the package films is that they were entirely OK; perfectly acceptable, and usually mediocre. The highest praise in reports from the era usually amounts to That was fun. And honestly? When people went to the theaters in 1943 to escape the tragedy of the war, maybe thats all they needed.\nChasing the Golden Age\nImage: Disney\nIn 1950, Cinderella became Disneys first great financial success since Snow White  and, some critics argued, its first artistic success since then, too. Many reviewers used Snow White as a touchpoint when talking about the artistry in Cinderella, which had the twofold effect of solidifying Disney as a fairy-tale master and making Snow White the standard for future comparisons, the bar Disney had to live up to. During this time period, Disney movies were consistently seen as good, solid all-ages entertainment, albeit not as ambitious or groundbreaking as the Golden Age films.\n1959s Sleeping Beauty got the worst of the comparison to Snow White, since its also a fairy tale about a beautiful princess who passes out due to a poisoned item given to her by a high-cheekboned witch and then gets revived by a kiss from a handsome prince. The Snow White comparison continued to haunt Disney movies basically until the Disney Renaissance, even in otherwise positive reviews. Many critics pointed to the Golden Age movies as the pinnacle of artistic success  even though they werent critical darlings when they came out. Still, Disneys focus on familiar stories and the nostalgia for its early industry-changing movies kept its reputation positive. The sheer euphoria of seeing the theatrical-length animation couldnt be dismissed.\nFrom a modern lens, the obsession over Snow White as Disneys f",
      "snippet": "The Disney of Snow White and Cinderella is completely different than the one of Pinocchio, Little Mermaid, The Lion King, Frozen, and Encanto fame.\nFor Disneys 100th anniversary, we break down the history.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T14:32:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/w9zZi2pDP-WLG8WMunIJ8BwavzU=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24385845/Disney_100_years_of_near_implosions.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/century-of-disney/23559556/disney-100-year-history"
      }
    },
    {
      "id": "2695184421265699902",
      "title": "The Next Generation of Blockchain: Polygon (MATIC) Avalanche (AVAX) and Orbeon Protocol (ORBN)",
      "url": "https://euroweeklynews.com/2023/01/26/the-next-generation-of-blockchain-polygon-matic-avalanche-avax-and-orbeon-protocol-orbn/",
      "description": "Polygon (MATIC), Avalanche (AVAX), and Orbeon Protocol (ORBN) are leading the way in the next generation of blockchain technology. These platforms are",
      "body": ">>BUY ORBEON TOKENS HERE<<\nPolygon (MATIC)\nPolygon (MATIC) is a Layer 2 scaling solution supported by Binance and Coinbase. Polygon (MATIC) intends to increase cryptocurrency adoption by addressing scalability challenges that many blockchains experience by integrating the Plasma Framework with the proof-of-stake blockchain architecture. Polygon (MATIC) can now do 65,000 transactions per second (TPS) on a single sidechain.\nDevelopers may use Polygon (MATIC) to receive rapid, inexpensive transactions that are secured by Ethereums infrastructure. Anyone with an Ethereum wallet may access the Polygon (MATIC) network and engage with Polygon-built applications at a fraction of the cost of building on Ethereum.\nPolygon (MATIC) has amassed an outstanding roster of collaborations with some of the worlds leading corporations. Starbucks, Meta, Stripe, and Reddit have picked Polygon (MATIC) as a public blockchain tool.\n>>BUY ORBEON TOKENS HERE<<\nAvalanche (AVAX)\nAvalanche (AVAX) is a decentralised platform for developing and deploying DeFi apps and smart contracts. Avalanche (AVAX) is intended to be quick, secure, and scalable, with the goal of serving as a platform for developing a wide range of financial applications.\nThe native coin of Avalanche (AVAX), AVAX, is used to pay transaction fees and participate in the platforms governance process. Avalanche (AVAX) may be purchased and traded on cryptocurrency exchanges, and it is also used to engage inside the Avalanche (AVAX) ecosystem.\nAvalanche (AVAX) has witnessed unique addresses on the blockchain expand from 1.45 million at the end of 2021 to 4.52 million at the end of 2022, a year-on-year increase of more than 200%, showcasing the adaption of Avalanche (AVAX) and future potential.\n>>BUY ORBEON TOKENS HERE<<\nOrbeon Protocol (ORBN)\nOrbeon Protocol (ORBN) makes it easier for businesses to get secure funding. Instead of going the traditional venture capital path, companies that need a funding round can use Orbeon Protocol (ORBN) to mint and fractionalise their equity to raise the necessary capital.\nEach investment opportunity is turned into an NFT and then split into smaller pieces using Orbeon Protocol (ORBN). This makes it possible for anyone to invest in a business they believe in with as little as $1.\nThe utility token, ORBN, is at the heart of the Orbeon Protocol (ORBN). Investors who own Orbeon Protocol (ORBN) tokens can stake them to make passive income, vote on important decisions and upcoming projects, get discounts and get rewards for staking.\nVIP investors who are part of the Winners Circle get extra benefits like access to private funding rounds and face-to-face meetings with the projects creators.\nExpert analysts think that the price of Orbeon Protocol (ORBN) will go up by 6000% soon because it has a unique use and is becoming more popular. Orbeon Protocol (ORBN) is currently living up to the analysts predictions, as Orbeon Protocol (ORBN) has skyrocketed over 1400%, currently in phase 4 of the presale.\nFind Out More About The Orbeon Protocol Presale\nWebsite:",
      "snippet": "<b>Polygon</b> (MATIC), Avalanche (AVAX), and Orbeon ... blockchain technology. >>BUY ORBEON TOKENS HERE<< <b>Polygon</b> (MATIC) <b>Polygon</b> (MATIC) is a Layer 2 scaling ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T09:00:46",
      "provider": {
        "name": "euroweeklynews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "euroweeklynews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://euroweeklynews.com/2023/01/26/the-next-generation-of-blockchain-polygon-matic-avalanche-avax-and-orbeon-protocol-orbn/"
      }
    },
    {
      "id": "5721372687938068581",
      "title": "Cryptocurrency prices: Today's rates of Bitcoin, Ethereum, Solana, Shiba Inu",
      "url": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-26-01-2023-rates-of-bitcoin-ethereum-solana/story",
      "description": "Bitcoin has climbed 2.2% in the past 24 hours, trading at $23,189.67",
      "body": "Bitcoin has climbed 2.2% in the past 24 hours, trading at $23,189.67. It is 11.9% higher than last week.    The second most popular token, Ethereum, has gained 4.4% from yesterday and is trading at $1,617.13. From the previous week, it is up 6.6%.    The market capitalization of Bitcoin and Ethereum is now at $447.08 billion and $194.99 billion, respectively. BNB is trading at $307.45, up 1.5% from yesterday and 6.9% up from last week.    XRP is currently trading at $0.44 after moving up 1.9% in the last 24 hours. It is 9.3% up from last week.    Cardano and Dogecoin are trading at $0.33 (up 7.5%) and $0.088 (up 2.9%), respectively. Solana, Polka Dot, Shiba Inu, and Polygon are currently trading at $24.81 (up 7.9%), $6.46 (up 4.2%), $0.000011 (up 4.0%), and $1.01 (up 4.7%), respectively.    On the basis of the weekly chart, Solana has moved up by 19.0%, while Polka Dot has moved up by 14.2%.    In the last seven days, Shiba Inu has gained 5.0% of its value, whereas Polygon is 6.7% up. Looking at the 24-hourly movement, the top five gainers are Aptos, Mina, STEPN, Threshold, and Optimism. They are trading at $19.13 (up 46.60%), $0.77 (up 28.62%), $0.66 (up 25.05%), $0.066 (up 23.28%), and $2.39 (up 18.80%), respectively. A stablecoin is a cryptocurrency that has very little volatility. Its value is linked to a real-world asset such as fiat currency or gold.    Talking about some of the prominent tokens, Tether, USD Coin, and Binance USD are trading at $1 (flat), $1 (up 0.1%), and $1 (up 0.1%), respectively. Terra Classic is listed at $0.00011 (up 2.31%). The biggest losers of the day are Bitcoin SV, Fei USD, Gemini Dollar, USDD, and Binance USD. They are trading at $41.38 (down 2.57%), $0.99 (down 0.65%), $0.99 (down 0.37%), $0.99 (down 0.04%), and $1 (down 0.02%), respectively. Looking at the traffic, liquidity, trading volumes, and confidence in the legitimacy of trading volumes, the top three cryptocurrency spot exchanges are Binance, Coinbase Exchange, and Kraken.    Binance and Coinbase Exchange had a 24-hour volume of $22.01 billion (up 15.95%) and $2.32 billion (up 0.18%), respectively. Kraken's volume was $0.68 billion, which is down 0.29% from yesterday. DeFi or decentralized finance is an umbrella term for global, peer-to-peer financial services on public blockchains.    Dai, Avalanche, Uniswap, Wrapped Bitcoin, and Chainlink are some of the popular DeFi tokens. They are currently trading at $1 (down 0.03%), $18.20 (up 6.93%), $6.60 (up 4.91%), $23,128.70 (up 2.40%), and $6.98 (up 3.76%), respectively. Non-fungible tokens (NFTs) are cryptocurrencies that do not possess the property of fungibility, meaning they cannot be exchanged for one another like other tokens.    Some of the popular NFT tokens are ApeCoin, Decentraland, Axie Infinity, Flow, and The Sandbox. They are currently trading at $6.24 (up 14.18%), $0.66 (up 5.34%), $12.02 (up 7.31%), $1.14 (up 6.76%), and $0.77 (up 3.81%), respectively. The current global crypto market cap is $1.02 trillion. The total crypto market volume over the last 24 hours is $55.23 billion. They have remained flat over the last day.    The global crypto market cap was $810.08 billion last month, while three months ago, the total capitalization stood at $970.41 billion.",
      "snippet": "Solana, Polka Dot, Shiba Inu, and <b>Polygon</b> are currently trading at $24.81 (up 7.9%), $6.46 (up 4.2%), $0.000011 (up 4.0%), and $1.01 (up 4.7%), ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T06:01:47",
      "provider": {
        "name": "newsbytesapp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cdn.newsbytesapp.com/images/l50520230126110545.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsbytesapp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-26-01-2023-rates-of-bitcoin-ethereum-solana/story"
      }
    },
    {
      "id": "3178055662039883359",
      "title": "ZenGo Brings Seedless Wallets to Polygon to Address Security Vulnerability",
      "url": "https://www.tipranks.com/news/article/zengo-brings-seedless-wallets-to-polygon-to-address-security-vulnerability",
      "description": "Interest in self-custody and extra security via non-custodial wallet solutions has surged after the failures of many centralized crypto exchanges and lending protoc...",
      "body": "ZenGos latest wallet integration with Polygon is intended to answer user demand for crypto self-custody while making it easier to double-check transactions before sending tokens to other addresses.\nInterest in self-custody and extra security via non-custodial wallet solutions has surged after the failures of many centralized crypto exchanges and lending protocols lately. Indeed, the risks of trusting custodial wallets to safeguard user crypto holdings came to light.\nA custodial wallet refers to a type of cryptocurrency wallet where the private keys are held by a third-party service provider, known as a custodian. With this approach, the custodian is responsible for securing a cryptos private keys and protecting them from theft or loss, meaning users of the wallet do not have direct control over their own private keys and must trust the custodian to manage their funds appropriately.\nUsers are withdrawing large amounts of cryptocurrency from custodial wallets at centralized exchanges and lending protocols amid heightened anxiety about digital asset security. As a result, non-custodial solutions, whereby users secure and store their own digital assets, have experienced a sharp uptick in new users.\nTo offer more friendly and intuitive wallet solutions to meet growing user demand and rising digital asset security concerns, non-custodial wallet provider ZenGo has integrated its wallet solution with Polygon (MATIC).\nThe fresh integration gives Polygon users the first seedless self-custody option for Ethereum (ETH-USD), Polygon, Bitcoin (BTC-USD), and other digital assets available within the ecosystem.\nThrough its wallet offering, ZenGo employs multiple security measures that reduce the complications of securely accessing a wallet and safely using it to transact, including ClearSign, which acts as a transaction firewall to help users safely navigate blockchain transactions. The decision to integrate with Polygon reflects the ecosystems strong growth, especially among Web2 brands like Nike (NYSE:NKE) and Starbucks (NASDAQ:SBUX) entering the Web3 universe of products and services like NFTs, the Metaverse, and other related offerings.\nThe reason custodial wallets remain popular is that they remove many of the complicated activities that involve managing a crypto wallet. Private key management and recovery-seed phrases rank among the problematic elements that prevent mass market accessibility, making an exchange-based wallet a much simpler proposition for many crypto users.\nStill, trusting third-party service providers like centralized exchanges with private keys to cryptos can result in their total loss. The phrase not your keys, not your crypto best describes the idea that whoever controls the private keys controls the crypto. Therefore, a custodian managing crypto access can also theoretically move the digital assets without user permission, like the case with FTX.\nOne of the main advantages of non-custodial wallets is that users exert full control over their own funds and take full responsibility for the security of their own private keys. However, this also means that users must be diligent in securing their private keys and protecting them from theft or loss, and there is also a vulnerability that arises from the seed phrase.\nSeed phrases are a common feature designed to help users recover access to cryptocurrencies if they lose their private keys. Despite their usefulness, if an attacker can obtain a users seed phrase, they can use it to gain access to the users funds and steal their cryptocurrency. This vulnerability can occur if a user writes down their seed phrase and stores it in an insecure location or shares it with an untrusted third party..\nTo sidestep the seed phrase point of failure, ZenGo employs a seedless technique called multi-party computation (MPC) to secure wallet access and sign blockchain transactions. This approach to security splits the private key into two or more parts held in separate locations. In ZenGos case, half of the password is stored on a users device, with the other half stored on ZenGos servers..\nWhen both halves of the passphrase are activated, the user can access the holdings contained in their wallets. The benefit is that no seed passphrase is involved, reducing security vulnerabilities while also assisting with any wallet recovery if a device is lost or compromised for any reason.\nWith the renewed spotlight on the safety and security of assets, ZenGos decision to integrate with Polygon reflects the crypto industrys response to the risks of centralized service providers. As Web2 firms enter the crypto space to capitalize on its incentivization models, user-friendly and approachable wallet solutions will play a large role in establishing a more secure avenue to interact with Polygons growing ecosystem of products and services.\nDisclosure",
      "snippet": "ZenGos latest wallet integration with <b>Polygon</b> is intended to answer user demand for crypto self-custody while making it easier to double-check ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T00:47:42",
      "provider": {
        "name": "tipranks",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://blog.tipranks.com/wp-content/uploads/2023/01/shutterstock_1690123846-750x406.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "tipranks",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.tipranks.com/news/article/zengo-brings-seedless-wallets-to-polygon-to-address-security-vulnerability"
      }
    },
    {
      "id": "6810931688378086894",
      "title": "Polygon (MATIC) Price Up 5.1% This Week",
      "url": "https://www.wkrb13.com/2023/01/26/polygon-matic-price-up-5-1-this-week.html",
      "description": "Read Polygon (MATIC) Price Up 5.1% This Week at WKRB News",
      "body": "Polygon\nlaunched on March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here. Polygons official message board is blog.polygon.technology. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. The official website for Polygon is polygon.technology.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nBuying and Selling Polygon\nIt is usually not possible to buy alternative cryptocurrencies such as Polygon directly using US dollars. Investors seeking to trade Polygon should first buy Ethereum or Bitcoin using an exchange that deals in US dollars such as Changelly, Coinbase or Gemini. Investors can then use their newly-acquired Ethereum or Bitcoin to buy Polygon using one of the exchanges listed above.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> (MATIC) Price Up 5.1% This Week at WKRB News. <b>Polygon</b> launched on March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-26T00:32:42",
      "provider": {
        "name": "wkrb13",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wkrb13",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wkrb13.com/2023/01/26/polygon-matic-price-up-5-1-this-week.html"
      }
    },
    {
      "id": "139419725134865943",
      "title": "Polygon",
      "url": "https://en.wikipedia.org/wiki/Polygon",
      "description": "In elementary geometry, a polygon () is a plane figure that is bounded by a finite chain of straight line segments closing in a loop to form a closed polygonal chain or \"circuit\". These segments are called its \"edges\" or \"sides\", and the points where two edges meet are the polygon's \"vertices\" (singular: vertex) or \"corners\". The interior of the polygon is sometimes called its \"body\". An \"n\"-gon is a polygon with \"n\" sides; for example, a triangle is a 3-gon. A polygon is a 2-dimensional example of the more general polytope in any number of dimensions.",
      "body": "",
      "snippet": "In elementary geometry, a <b>polygon</b> () is a plane figure that is bounded by a finite chain of straight line segments closing in a loop to form a closed ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "0001-01-01T00:00:00",
      "provider": {
        "name": "wikipedia",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wikipedia",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://en.wikipedia.org/wiki/Polygon"
      }
    }
  ]
}
