{
  "_type": "news",
  "didUMean": "",
  "totalCount": 204,
  "relatedSearch": [],
  "value": [
    {
      "id": "6975266120852136499",
      "title": "bnb: Crypto Price Today: Bitcoin below $24k Polygon BNB shed up to 4%",
      "url": "http://economictimes.com/markets/cryptocurrency/crypto-price-today-bitcoin-below-24k-polygon-bnb-shed-up-to-4/articleshow/97573713.cms",
      "description": "The total volume in DeFi is currently $5.86 billion, 9.65% of the total crypto market 24-hour volume. The volume of all stablecoins is now $55.19 billion, which is 90.83% of the total crypto market 24-hour volume.",
      "body": "Explore Now\nNew Delhi: The cryptocurrency market was trading mixed on Friday. Bitcoin, Ethereum, BNB and Polygon were trading with cuts, while Polkadot, Shiba Inu and Tron witnessed gains.\nBitcoin (BTC) fell 1.35% to $23,546, whereas Ethereum (ETH) was below the $1,650 level. BTC volume in the last 24 hours stood at approximately $29.49 billion, falling 2.03% in the last 24 hours.\n\"Bitcoin jumped above the $24,000 level in the past 24 hours as markets continued to react to the latest Federal Reserve's policy. BTC briefly hit this level for the first time since August but quickly dropped back to $23,500 due to volatility. Ethereum also rose, with prices nearly reaching $1,700, its highest since September. The immediate resistance for Ethereum is near $1,700, with the next major resistance at $1,720. If it doesn't clear the $1,700 resistance, a correction may occur,\" Edul Patel, Co-founder and CEO at Mudrex, said.\nThe global cryptocurrency market cap was trading lower around $1.08 trillion, falling 1.16% in the last 24 hours.\n\nThe total volume in DeFi is currently $5.86 billion, 9.65% of the total crypto market 24-hour volume. The volume of all stablecoins is now $55.19 billion, which is 90.83% of the total crypto market 24-hour volume.\nThe market cap of Bitcoin, the world's largest cryptocurrency, was around $453.9 billion, with a dominance of about 42.05%, a decrease of 0.08% over the day, according to CoinMarketCap.\n\"Bitcoin briefly crossed the $24,000 mark to touch a 6-month high. Ethereum which follows the BTC trend witnessed a healthy jump and is exchanging hands at the $1641 level. The momentum in the digital asset market is expected to continue with macroeconomic factors becoming less hostile,\" Shivam Thakral, CEO of BuyUcoin, said.\nCrypto Cart: Quick\n(Source: coinmarketcap.com, data as of 11.42 hours, IST on February 03, 2023)\nBitcoin $ 23,546 -1.35%",
      "snippet": "Bitcoin, Ethereum, BNB and <b>Polygon</b> were trading with cuts, while Polkadot, Shiba Inu and Tron witnessed gains. Bitcoin (BTC) fell 1.35% to $23,546, ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T07:34:00",
      "provider": {
        "name": "economictimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://img.etimg.com/thumb/msid-97573858,width-1070,height-580,imgsize-182758,overlay-etmarkets/photo.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "economictimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://economictimes.com/markets/cryptocurrency/crypto-price-today-bitcoin-below-24k-polygon-bnb-shed-up-to-4/articleshow/97573713.cms"
      }
    },
    {
      "id": "5512597481951392696",
      "title": "Polygon (MATIC) Trading 8.2% Higher  Over Last Week",
      "url": "https://www.themarketsdaily.com/2023/02/03/polygon-matic-trading-8-2-higher-over-last-week.html",
      "description": "Read Polygon (MATIC) Trading 8.2% Higher  Over Last Week at Markets Daily",
      "body": "Polygons\nlaunch date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. Polygons official message board is blog.polygon.technology. The official website for Polygon is polygon.technology. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nPolygon Coin Trading\nIt is usually not currently possible to purchase alternative cryptocurrencies such as Polygon directly using U.S. dollars. Investors seeking to trade Polygon should first purchase Bitcoin or Ethereum using an exchange that deals in U.S. dollars such as Coinbase, GDAX or Gemini. Investors can then use their newly-acquired Bitcoin or Ethereum to purchase Polygon using one of the aforementioned exchanges.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> (MATIC) Trading 8.2% Higher Over Last Week at Markets Daily. <b><b>Polygon</b>s</b> launch date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T06:08:41",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/02/03/polygon-matic-trading-8-2-higher-over-last-week.html"
      }
    },
    {
      "id": "1309990376634135213",
      "title": "Cryptocurrency prices: Today's rates of Bitcoin, Ethereum, Polygon, Shiba Inu",
      "url": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-03-02-2023-rates-of-bitcoin-ethereum-polygon/story",
      "description": "Bitcoin has slipped 1.36% in the past 24 hours to trade at $23,553.95",
      "body": "Bitcoin has slipped 1.36% in the past 24 hours to trade at $23,553.95. It is 3.18% higher than the week before.    The second most popular token, Ethereum, is down 1.74% from yesterday and is trading at $1,644.88. From last week, it is up 4.85%.    The market capitalization of Bitcoin and Ethereum stands at $454.11 billion and $201.28 billion, respectively. BNB is trading at $323.30, which is 2.20% lower than yesterday and 6.83% up since last week.    XRP's price today is $0.44 after falling 0.50% in the last 24 hours. Compared to last week, it is 2.07% up.    Cardano and Dogecoin are trading at $0.44 (down 1.16%) and $0.099 (down 2.15%), respectively. Solana, Polka Dot, Shiba Inu, and Polygon are currently trading at $24.680 (down 3.22%), $6.8908 (up 3.62%), $0.000011 (up 2.07%), and $1.19 (down 4.01%), respectively.    Based on the weekly chart, Solana has moved up by 4.44%, while Polka Dot has moved up by 4.44%.    Shiba Inu's value has risen by 2.58% in the last seven days, whereas Polygon has gained 8.31%. The top five gainers on the basis of the 24-hourly movement are EthereumPoW, Huobi Token, Fantom, Terra Classic, and Optimism. They are trading at $4.78 (up 19.96%), $5.89 (up 11.34%), $0.66 (up 9.49%), $0.00011 (up 4.96%), and $2.87 (up 4.77%), respectively. A stablecoin is an extremely low volatile cryptocurrency. Its value is tied to a physical asset like fiat currency or gold.    Some of the popular tokens, Tether, USD Coin, and Binance, are trading at $1 (down 0%), $0.99 (down 0.01%), and $1 (down 0.01%), respectively. Terra Classic is listed at $0.00011 (up 4.96%). The biggest losers of the day are dYdX, Synthetix, Aptos, Curve DAO Token, and ApeCoin. They are trading at $3.23 (down 8.52%), $2.52 (down 6.76%), $16.88 (down 6.68%), $1.07 (down 5.67%), and $5.92 (down 5.31%), respectively. Based on traffic, liquidity, trading volumes, and confidence in the legitimacy of trading volumes, the top three cryptocurrency spot exchanges are Binance, Coinbase Exchange, and Kraken.    Binance and Coinbase Exchange saw 24-hour volumes of $22.51 billion (down 12.35%) and $1.53 billion (down 27.17%), respectively. Kraken recorded a volume of $0.77 billion, which is down 5.45% from yesterday. DeFi, short for decentralized finance, is an umbrella term for global, peer-to-peer financial services on public blockchains.    Avalanche, Dai, Uniswap, Wrapped Bitcoin, and Chainlink are among the most popular DeFi tokens. They are trading at $21.28 (down 4.47%), $1 (up 0.01%), $7.14 (up 1.41%), $23,519.14 (down 1.48%), and $7.11 (down 2.96%), respectively. Non-fungible tokens or NFTs are cryptocurrencies that cannot be exchanged for one another like other tokens due to their lack of fungibility.    ApeCoin, Decentraland, Flow, The Sandbox, and Axie Infinity are some of the prominent NFT tokens. They are currently trading at $5.92 (down 5.17%), $0.77 (down 2.14%), $1.14 (down 0.81%), $0.77 (down 1.24%), and $11.23 (down 1.93%), respectively. The current global crypto market cap is $1.08 trillion. The total crypto market volume over the last 24 hours is $55.91 billion. They have remained flat over the last day.    The global crypto market cap was $805.99 billion last month, while three months ago, the total capitalization stood at $994.16 billion.",
      "snippet": "Solana, Polka Dot, Shiba Inu, and <b>Polygon</b> are currently trading at $24.680 (down 3.22%), $6.8908 (up 3.62%), $0.000011 (up 2.07%), and $1.19 (down ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T05:53:24",
      "provider": {
        "name": "newsbytesapp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cdn.newsbytesapp.com/images/l47520230203110346.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsbytesapp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-03-02-2023-rates-of-bitcoin-ethereum-polygon/story"
      }
    },
    {
      "id": "1010044813088146232",
      "title": "BTC, ETH Maintain Risen Values Despite Minor Losses, Stablecoins Record Profits",
      "url": "https://www.gadgets360.com/cryptocurrency/news/bitcoin-price-today-usd-23527-ether-losses-stablecoins-gains-cryptocurrency-3749097",
      "description": "The overall crypto market valuation stooped by 1.22 percent in the last 24 hours. A big bunch of cryptocurrencies including Bitcoin, Ether, Polygon, Solana, ad Litecoin recorded losses on Friday, February 3. Stablecoins such as Tether and USD Coin did manage to retain small but significant profits.",
      "body": "The crypto price charts reflected losses next to several cryptocurrencies on Friday, February 3. Bitcoin opened with a small loss of 1.26 percent. Despite the minor crunch, the oldest cryptocurrency did see some loss in its price, which, at the time of writing stood at $23,527 (roughly Rs. 19.3 lakh). In the last 24 hours, the value of BTC dropped by $357 (roughly Rs. 29,320). The most expensive cryptocurrency saw similar small losses on international exchanges such as Binance and Coinbase among others.\r\n\r\nFollowing Bitcoin's trajectory, Ether also opened with losses. ETH slipped in value by 1.43 percent to trade at $1,641 (roughly Rs. 1.34 percent), according to the crypto price tracker by Gadgets 360.\r\n\r\nSeveral popular altcoins opened with losses alongside BTC and ETH on Friday. These include Binance Coin, Cardano, Polygon, Solana, and Litecoin.Reliance Retail to Accept Digital Rupee CBDC Payments in Mumbai, Details Here\r\n\r\nAfter recording more profits than losses in recent days, meme coins Dogecoin and Shiba Inu both, opened with price dips.\r\n\r\nThe prices of Avalanche, Uniswap, Cosmos, Chainlink, Monero, and Bitcoin Cash also witnessed losses.\r\n\r\nStablecoins Tether, USD Coin, and Binance USD meanwhile, managed to retain profits on the otherwise rough market day.Over 70 Percent Investors Are Now Scared of Crypto Commitment: JP Morgan\r\n\r\nThey were further joined by Polkadot, Tron, Leo, Elrond, and Dash.\r\n\r\nThe overall crypto market valuation stooped by 1.22 percent in the last 24 hours to stand at $1.07 trillion (roughly Rs. 88,54,664 crore), as per CoinMarketCap.\r\n\r\nThere has been a definitive shift in the Federal Reserve's interest rate hike cycle, with a lower 25 bps increase in their latest meeting. Crypto markets have re-gained most of their FTX related losses and have settled much higher. In token specific action, MATIC has been on a phenomenal run, up by 25 percent last week, Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch told Gadgets 360.\r\n\r\nIt is however noteworthy, that there are still other factors that could pull down the crypto market in the coming times. These include the impact of inflation and the ongoing Ukraine-Russia conflict. In addition, India's silence around reducing crypto taxes despite repeated outcry from industry insiders, may result in lowered crypto interest in the world's most populated nation.\r\n\r\nThe crypto industry was expecting relief from the aggressive tax introduced in the last budget, but there was no mention of any changes in Finance Minister Nirmala Sitharaman's union budget speech. However, the government has clarified penalty provisions on crypto TDS. This will be a significant hit to investor sentiment. In addition to a hefty penalty, failing to pay TDS can land a person in prison for up to three months to seven years. Investors will need to re-evaluate their trading activities, Punit Agarwal, Founder, KoinX told Gadgets 360.\r\n\r\n\r\nThe Infinix Zero Ultra has a decent set of specifications on paper, but does the phone justify its high asking price? We discuss this and more on Orbital, the Gadgets 360 podcast. Orbital is available on Spotify, Gaana, JioSaavn, Google Podcasts, Apple Podcasts, Amazon Music and wherever you get your podcasts.\r\n\r\n\r\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.&nbsp;Affiliate links may be automatically generated - see our ethics statement for details.",
      "snippet": "A big bunch of cryptocurrencies including Bitcoin, Ether, <b>Polygon</b>, Solana, ad Litecoin recorded losses on Friday, February 3. Stablecoins such as ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T05:25:29",
      "provider": {
        "name": "gadgets360",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.gadgets360cdn.com/large/india-btc_eth_pixabay_Dean_Crosby_101_large_1652675059057.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "gadgets360",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.gadgets360.com/cryptocurrency/news/bitcoin-price-today-usd-23527-ether-losses-stablecoins-gains-cryptocurrency-3749097"
      }
    },
    {
      "id": "7958471096348861542",
      "title": "Pokemon: Detective Pikachu 2 May Still Be in the Works",
      "url": "https://in.ign.com/detective-pikachu-the-movie/178952/news/pokemon-detective-pikachu-2-may-still-be-in-the-works",
      "description": "Sounds like a case for Detective Pikachu himself.",
      "body": "India.\nIt turns out the potential sequel to Pokemon: Detective Pikachu may still be in the works.\nThe sequel was officially announced in 2019 months before Detective Pikachu even hit theaters, with Oren Uziel attached to write the script. However, there were no updates that signaled positive development after that, with star Justice Smith saying in a 2021 interview, \"I think we have to just kind of bury our hopes. I don't think it's going to happen.\".\nWell, maybe it's time to dig up those hopes. A spokesperson for Legendary, the studio behind Detective Pikachu, told Polygon that a sequel is still in \"active development.\" When reached by IGN, a Legendary spokesperson said they \"can only confirm that we are in active development as was reported by Polygon,\" but shared no further details.\nDetective Pikachu writers Benji Samit and Dan Hernandez previously suggested to Polygon that they were not involved with the sequel, adding that the situation was complicated\" with a lot of big studio, corporate Pokmon rights things that were not privy to..\nIts an ongoing conversation that is still not over to this day, Samit said.\nPokemon: Detective Pikachu, also starring Ryan Reynolds as the voice of the titular electric mouse, pulled in solid box office results with $433 million worldwide. In his 8/10 review for IGN, Joshua Yehl wrote, \"while video game movies havent had the best track record, this movie is by and far the best example of how to do one right.\".\nAlex Stedman is a News Editor for IGN, overseeing entertainment reporting. When she's not writing or editing, you can find her reading fantasy novels or playing Dungeons & Dragons.",
      "snippet": "Detective Pikachu writers Benji Samit and Dan Hernandez previously suggested to <b>Polygon</b> that they were not involved with the sequel, adding that the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-03T01:18:10",
      "provider": {
        "name": "ign",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://sm.ign.com/t/ign_in/news/p/pokemon-de/pokemon-detective-pikachu-2-may-still-be-in-the-works_wzk5.1200.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "ign",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://in.ign.com/detective-pikachu-the-movie/178952/news/pokemon-detective-pikachu-2-may-still-be-in-the-works"
      }
    },
    {
      "id": "6523154563120784223",
      "title": "The Sims 4s latest expansion gives you even more family options to play God with",
      "url": "https://www.polygon.com/23583427/sims-4-growing-together-expansion-pack-trailer-release-date",
      "description": "The new Sims 4 expansion pack is called Growing Together and it adds a lot of new content for infants, toddlers, children, and elders, as well as a new neighborhood and more family interactions. Check out the first trailer now.",
      "body": "Flipboard\nEmail\nThe newest expansion pack for the Sims 4 is centered around family interactions and dynamics  which is perfectly timed to the games big infant update coming out in March. Titled Growing Together, the expansion back will not only add a brand new neighborhood, but more importantly more interactions and moments for Sim families.\nThe big infant update hits on March 14, and gameplay mechanics like breastfeeding, crawling, and more will be available to all Sims players. The Growing Together pack, however, will add some new objects for infantas, like a changing station, as well as infant milestones, which will unlock new abilities and interactions.\nBut infants arent the only lifestage getting special attention in this pack  toddlers, children, and elders will also be getting more to do. (Those young adults, adults, and teenagers have had too much cool content for too long!) Additionally, the pack will also introduce a social compatibility feature to deepen the different types of relationships that Sims can have, as well as a more complex family tree. Does this mean my Sims vampire husband will recognize that her brothers husband is his brother-in-law and not just a dude living in the same house? I cant say for certain, but I really hope so because their relationship is on thin-ice.\nYou can find out more about all the new features in The Sims 4: Growing Together on the EA website. More information about the infant update and the new pack will be available on March 3, during a first look stream on Twitch and YouTube.\nThis isnt the first Sims 4 pack to focus on the family. The 2017 game pack, The Sims 4: Parenthood, introduced a lot of parenting and child-rearing mechanics, including curfews, school projects, and parental discipline.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The new Sims 4 expansion pack is called Growing Together and it adds a lot of new content for infants, toddlers, children, and elders, as well as a new neighborhood and more family interactions.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T21:30:17",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/z7FekvuR0cGjV-M9lViTSOfSGeQ=/0x26:1635x882/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24405278/Screen_Shot_2023_02_02_at_4.10.13_PM.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23583427/sims-4-growing-together-expansion-pack-trailer-release-date"
      }
    },
    {
      "id": "8934122155904821233",
      "title": "Ten Indigenous filmmakers screen their personal works at The Polygon",
      "url": "https://www.pentictonherald.ca/spare_news/article_5a09d17e-db68-55ef-bf3e-fc8a2e0fac6a.html",
      "description": "For the ten filmmaker artists at the centre of the Response: Resonance exhibition, finally showcasing their films within The Polygon's esteemed gallery is like reaching the peak of a mountain",
      "body": "Copy article link\nSave\nFor the ten filmmaker artists at the centre of the Response: Resonance exhibition, finally showcasing their films within The Polygon's esteemed gallery is like reaching the peak of a mountain following a long and challenging hike.\nNot simply because the exhibition is the culmination of months of work  weekly workshops with artists and gallery curators  but because, for some, it is a long awaited opportunity to have their often underrepresented stories showcased to a wider audience.\nThe Polygons Response is an annual program led by Indigenous artists and gallery curators. Over the course of the summer artists come together to discuss and workshop how they would interpret the programs theme, before creating that piece for a joint show in the fall.\nThis year, the theme was Resonance.\nThis years Response theme Resonance focused on sound and voice, said The Polygons assistant curator Nicole Brabant. These films present a wide range of experiences and experimentation inspired by the generous mentorship of the artists, and the Knowledge Holders, who led the 2022 workshop series.\nWith each artist approaching the theme of sound their own way, the end result is a collection of related but differing pieces: documentary, creative film, soundscapes, singing circles and monologues. Some pieces touch on the relationship between resonance and knowledge transfer among indigenous cultures, while others delve into sound within ceremony.\nOthers, like the video created by KJ Edwards, a Kanienkeh:ka and mixed settler filmmaker and video editor, use resonance in the context of healing. Edwards film, about her late mother, is entitled istn:a  my mother in Mohawk (Kanienkha).\nI have a lot of dreams about her, and this is a piece Ive been thinking about for a while, she said.\nThere was one dream in particular where she visited me, and she was in a greenhouse surrounded by flowers. My sister had a very similar dream around the same time, and for both of us, her visiting us in our dreams was a huge part of our healing during the grieving process.\nEdwards longed to create some sort of visual response to the dream, brainstorming ideas before landing on the mediums of analog and digital film because of their ability to represent dream and memory well.\nAs for how the film affects its viewers, Edwards hopes gallery guests will feel encouraged to express their own spirituality and belief system, in a way that she, and the other nine artists featured in the program, have been encouraged to do.\nI want them to feel at peace with their own experiences that might be similar, or to just be reminded of that beautiful relationship and that tethering we have to our parents and to our mothers, she said.\nI think that we dont often get to see a lot of narratives that are created from an Indigenous lens, said Edwards, adding how she remains grateful for Brabant and the other gallery curators for taking a culturally sensitive and supportive approach when piecing together each of the artists stories.\nThey were able to really just take these filmmakers, some people who had never made a visual work before in their life, and really support them to make their vision a reality.\nWhen: Until Feb. 12.\nWhere: The Polygon Gallery\nWhat: More information, including the full list of participating artists, can be found on The Polygon's website.\nMina Kerr-Lazenby is the North Shore News Indigenous and civic affairs reporter. This reporting beat is made possible by the Local Journalism Initiative.",
      "snippet": "Where: The <b>Polygon</b> Gallery What: More information, including the full list of participating artists, can be found on The <b><b>Polygon</b>'s</b> website. Mina ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T20:24:21",
      "provider": {
        "name": "pentictonherald",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bloximages.newyork1.vip.townnews.com/pentictonherald.ca/content/tncms/custom/image/580620b2-214c-11e7-a0a7-e318d9632e72.jpg?resize=600%2C148",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "pentictonherald",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.pentictonherald.ca/spare_news/article_5a09d17e-db68-55ef-bf3e-fc8a2e0fac6a.html"
      }
    },
    {
      "id": "596418963834699288",
      "title": "Polygon Price Tops $1.23 on Major Exchanges (MATIC)",
      "url": "https://www.themarketsdaily.com/2023/02/02/polygon-price-tops-1-23-on-major-exchanges-matic.html",
      "description": "Read Polygon Price Tops $1.23 on Major Exchanges (MATIC) at Markets Daily",
      "body": "Polygon\nwas first traded on March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. Polygons official message board is blog.polygon.technology. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here. The official website for Polygon is polygon.technology.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nPolygon Coin Trading\nIt is usually not presently possible to buy alternative cryptocurrencies such as Polygon directly using U.S. dollars. Investors seeking to trade Polygon should first buy Bitcoin or Ethereum using an exchange that deals in U.S. dollars such as Changelly, Coinbase or Gemini. Investors can then use their newly-acquired Bitcoin or Ethereum to buy Polygon using one of the exchanges listed above.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> Price Tops $1.23 on Major Exchanges (MATIC) at Markets Daily. <b>Polygon</b> was first traded on March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T20:22:41",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/02/02/polygon-price-tops-1-23-on-major-exchanges-matic.html"
      }
    },
    {
      "id": "5797580586041664299",
      "title": "The Last of Us Nick Offerman hasnt picked up game since Banjo-Kazooie",
      "url": "https://www.polygon.com/23583217/the-last-of-us-nick-offerman-video-games-banjo-kazooie",
      "description": "On Jimmy Kimmel Live, Nick Offerman talks about his role in HBOs adaptation of zombie survival game The Last of Us and why he hasnt played a video game since Banjo-Kazooie.",
      "body": "Flipboard\nEmail\nNick Offerman, best known for his role as the gruff parks department head in Parks and Rec, most recently starred as Bill in last weeks episode of The Last of Us. The surprisingly poignant love story told in the third episode of the HBO zombie survival series is a departure from Bill and Franks original storyline in the game. Offerman sat down on Jimmy Kimmel Live on Wednesday to talk about the role and about singing a Linda Ronstandt song for his performance.\nNaturally, Kimmel asked Offerman if he had ever played the game The Last of Us. While the answer to that question was a quick no, Offerman explained why. Turns out, hes not entirely a stranger to video games. He just made the deliberate choice never to pick one up again after losing two weeks of his life to Rares 1998 platformer Banjo-Kazooie.\nI decided Im never going to do that again, Offerman declared to Kimmel, after recounting the sweet dopamine rush and subsequent fall that came after beating Banjo-Kazooie. Thankfully, because games have gotten so good... that I think Id be in a basement and I wouldnt even be going to audition for shows like [The Last of Us].\nThough Bill probably wont appear in further episodes of The Last of Us, new episodes drop on Sundays.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "On Jimmy Kimmel Live, Nick Offerman talks about his role in HBOs adaptation of zombie survival game The Last of Us and why he hasnt played a video game since Banjo-Kazooie.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T19:31:04",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/0_9Nf7mENrh8ySnySGIq9txZSgc=/0x137:1920x1142/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24404793/Untitled_design__4_.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23583217/the-last-of-us-nick-offerman-video-games-banjo-kazooie"
      }
    },
    {
      "id": "2707785444499711531",
      "title": "AI generated Seinfeld is taking over Twitch",
      "url": "https://www.polygon.com/23582937/ai-seinfeld-twitch-stream",
      "description": "A Twitch channel called watchmeforever is streaming an artificial intelligence generated version of Seinfeld online. The infinite stream has already found viral success.",
      "body": "Watchmeforever\nIn a twist of technology that only 30 Rock could have predicted, an AI-generated version of Seinfeld is now taking over Twitch. The stream, hosted by a channel called watchmeforever, uses generative artificial intelligence to create an infinite stream of Seinfeld-esque content online. The novel idea has taken root on the platform, and at time of publication, the stream has roughly 15,400 concurrent viewers.\nThe content comes at a time when generative AI seems to be cropping up everywhere. Heres what you need to know about AI Seinfeld on Twitch.\nWhat is AI Seinfeld?\nAI Seinfeld is a Twitch stream that plays AI-generated content based on Jerry Seinfeld and Larry Davids 90s comedic sitcom, Seinfeld. The characters are rendered with chunky 3D pixels, and look like they are in a video game version of the show. The voices are AI generated as well, and while they do bear some similarities with the original actors voices, they ultimately sound more like an auto-reader on a computer.\nThis AI-generated version of Seinfeld doesnt really compare to the original, but you can definitely see the influence of the original show in snippets of this version. In one part of the stream I watched, the characters started talking about creating a place where they could make their own pizza crust, which appears to be connected to a bit in Seinfeld where Kramer gets a business idea to open a pizzeria where guests make their own pizzas.\nOne popular clip actually has decent dialogue. Its titled, Elaine goes out with a guy who hates fruit. In it, Jerry, Elaine, Kramer, and George wander around Jerrys apartment and talk about Elaines boyfriend who hates fruit and might be a fruit-a-phobe. However, the AI generation isnt able to mimic the color and delivery of the actors, and it can be very difficult to tell who is saying what at points. You can view in the clip below.\nWho is making the AI Seinfeld show?\nThe group making it is called Mismatch Media, and the people behind it describe themselves as scientists, entrepreneurs, engineers, technology professionals, and more, on their website. Otherwise, the group appears somewhat reclusive, and its not clear who are the actual people behind the stream.\nThe group takes a rather pessimistic tone to the content it creates. On the Twitch page, a description of the stream reads, Nothing, Forever is a show about nothing, that happens forever. Kinda like popular sitcoms of the past, except that it never stops. The channel description promises to run 365 days a year and deliver new content every minute.\nPolygon has reached out to Mismatch Media for comment, and will update the article if we receive a response.\nWhy are people watching the AI Seinfeld show?\nSeinfeld is one of the most beloved and recognizable sitcoms of the past few decades, but the appeal goes beyond that. Viewing the AI generated show on Twitch allows people to partake in a unique online communal experience that can feel like live television, as people watch the characters act and react to the various scenarios in the world. Additionally, we get to watch and participate in the Twitch chat, which makes it more fun. (Like, yes, please spam the chat with the KomodoHype each time a character complains about a girlfriend or boyfriend.)\nThe stream also shows off what generative AI is capable of. Its one in a long series of recently popular AI applications. ChatGPT, which can be used for a variety of applications like writing essays, became an overnight sensation due to its natural-language output. Other software like DALL-E, Midjourney, and Free AI Art Generator is being used to create memes and recreate the look of certain directors films. AI Seinfeld is just the next cursed step in the evolution of consumer AI.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "<b>Polygon</b> has reached out to Mismatch Media for comment, and will update the article if we receive a response. Why are people watching the AI Seinfeld ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T19:03:54",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/l3YE_CVFzfUj3BLI7lOGRYmGwdE=/0x502:2176x1641/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24404018/Screen_Shot_2023_02_02_at_10.17.28_AM.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23582937/ai-seinfeld-twitch-stream"
      }
    },
    {
      "id": "5715901463505322135",
      "title": "Polygon Achieves Market Capitalization of $10.40 Billion (MATIC)",
      "url": "https://www.com-unik.info/2023/02/02/polygon-achieves-market-capitalization-of-10-40-billion-matic.html",
      "description": "Read Polygon Achieves Market Capitalization of $10.40 Billion (MATIC) at Community Financial News",
      "body": "Polygons\ngenesis date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here. Polygons official website is polygon.technology. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. The official message board for Polygon is blog.polygon.technology.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nBuying and Selling Polygon\nIt is usually not presently possible to buy alternative cryptocurrencies such as Polygon directly using US dollars. Investors seeking to acquire Polygon should first buy Ethereum or Bitcoin using an exchange that deals in US dollars such as Coinbase, Changelly or GDAX. Investors can then use their newly-acquired Ethereum or Bitcoin to buy Polygon using one of the exchanges listed above.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> Achieves Market Capitalization of $10.40 Billion (MATIC) at Community Financial News. <b><b>Polygon</b>s</b> genesis date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T19:02:41",
      "provider": {
        "name": "com-unik",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "com-unik",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.com-unik.info/2023/02/02/polygon-achieves-market-capitalization-of-10-40-billion-matic.html"
      }
    },
    {
      "id": "8915814294387551105",
      "title": "Overwatch 2 season 3 adding new Control map Antarctic Peninsula",
      "url": "https://www.polygon.com/23582019/overwatch-2-season-3-control-map-antarctic-peninsula-mei",
      "description": "Antarctic Peninsula is a new Control map for Overwatch 2 coming in season 3, which launches Feb. 7. The new OW2 map will include some Mei history and Overwatch Easter eggs.",
      "body": "Overwatch 2\nseason 3 kicks off Feb. 7, and will introduce an all-new map to Blizzards hero shooter: Antarctic Peninsula. The map should feel both new and familiar to Overwatch players; theyve been fighting in a slice of that icy continent since 2016, when Blizzard added the Ecopoint: Antarctica arena map to the original Overwatch.\nAntarctic Peninsula will expand on that tiny map, and on the games lore, by giving players a new battleground that offers hints about Meis past in the region, the fate of her former co-workers, and hints of things even more exciting about the story to come in Overwatch 2, Blizzard says.\nAntarctic Peninsula is a Control-type map, the first new map of that type for Overwatch 2 and the first built expressly with the games 5v5 team structure in mind. Like other Control maps (e.g. Busan, Ilios, Nepal), Antarctic Peninsula is spread across three locations. Theres the lab, where Mei and her former team worked; an icebreaker ship, which was sent by the original Overwatch team to rescue Mei and her colleagues, but got stuck in the ice; and an underground tunnel system where the centerpiece is a massive drill that has bored a network of tunnels through the ice.\nAs players battle in and explore the lab area of Antarctic Peninsula, theyll get to see what Mei and her colleagues were up to before most of them met a terrible fate. Players will also experience new levels of verticality and new control point layouts, both on the icebreaker and in the sub-level map components, according to Overwatch art director Dion Rogers.\nImage: Blizzard Entertainment\nIts just super rad to fight inside an abandoned ship as large as an icebreaker, Rogers said in a group interview this week. Weve got cool tunnels and the engine room  you can get a lot of direction from it, because you can see the bow of the ship and you can see where the captains chamber is. If youre working together, you can call out a lot of very key areas where people are. Its very clear to understand where that might be, especially if you understand the language of boats. We studied icebreakers pretty well to try to integrate this into the level.\nRogers added, Theres a lot of protection from flying characters on this particular level. So youve got to be careful when you do a peekaboo take strategy  you might catch a rocket from Pharah.\nLevel designer Trey Spisak pointed out that the space surrounding the icebreakers control point and the point near the drill will feature a layout that players havent really seen in previous Control maps. Spisak said that theres a narrow roof above the ships control point, which we havent really messed with on a control point [before] and a platform above the drills point, an additional piece [of the map] you have to control on top the of the standard stuff youd have to deal with while playing on a control point.\nSpisak also said that Blizzard experimented with having Antarctic Peninsulas big drill actively drilling and being an environmental hazard, like Oasis deadly highway or Busans bullet train, but decided against it. Thematically, we did talk about maybe having the drill do damage But no, we kind of tried it and thought it wasnt going to quite work out, Spisak said. Those sorts of things dont work on every map. Some people love the Busan barriers, some people dont like it. But its good to try stuff and always kind of push the boundary.\nImage: Blizzard Entertainment\nPlayers will have something important to interact with on the games new map, though: penguins. Antarctic Peninsula will be rife with penguins, and yes, you can shoot them. You can shoot the penguins, but you cannot kill them, Rogers clarified. Its similar to some of the other NPCs in the game [like pigeons]. The penguins of Overwatch 2 have incredible bullet-dodging skills, Blizzard says.\nAntarctic Peninsula will also help answer some questions about Meis past, five long years after the heros animated short film, \nRise and Shine.\n Lead narrative designer Gavin Jurgens-Fyhrie explains, One of the questions that Ive heard from the public and Ive always been excited to answer is, Hey, Mei and her friends/coworkers were frozen for ages. Why did no one ever come to rescue them? Its sort of a sad question, but the answer is that Overwatch tried. One of the things thats so exciting about this map is you get to see a huge part of the story that weve never talked about before or shown. You can see the Overwatch icebreaker ship that tried to come and rescue Mei and our team, but failed. [...] Overwatch disbanded before anyone could ever get back there.\nJurgens-Fyhrie hinted that theres also a tease of Overwatch 2s future hidden in Antarctic Peninsula: You can see some hints about what Mei and her team were trying to find out there. And maybe there are some sort of secrets. I dont know, maybe you can find something in the map that will tell you something even more exciting about the story to come.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Antarctic Peninsula is a new Control map for Overwatch 2 coming in season 3, which launches Feb.\nThe new OW2 map will include some Mei history and Overwatch Easter eggs.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T19:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/xgXO9SXdzXAFUnsVVBZW92Ph5oA=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24402549/Antarctic_Peninsula_4.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23582019/overwatch-2-season-3-control-map-antarctic-peninsula-mei"
      }
    },
    {
      "id": "2014394951306929253",
      "title": "Can you play Fortnite Battle Royale in first-person?",
      "url": "https://www.polygon.com/fortnite-guide/23582992/how-to-play-fortnite-battle-royale-in-first-person",
      "description": "Its not really Fortnite in first-person, but it does change to a first-person perspective when you scope in on some specific guns.",
      "body": "Email\nImage: Epic Games via Polygon\nYou can start playing Fortnite Battle Royale in first-person now, kind of. Its a little janky, and its not 100% in first-person: Rather, some guns will change your perspective to first-person when you scope in. It seems like a proper first-person mode may be on the way Battle Royale, but for now, you can test out this funky first-person camera option.\nDue to the buggy nature of\nFortnite Battle Royale\ns first-person camera, we dont think this is an intended feature, so it may get removed. Camera angles when dropping from the bus, sprinting, and doing other actions warped into weird perspectives, making us believe that this feature isnt really ready for use. As of this writing, we can confirm that the method below does work for enabling it.\nThis feature does not turn the game into full first-person mode. It just makes some of the guns change to first-person when you scope. Some guns, like the Red-Eye Assault Rifle, already do this in the normal third-person mode. However, this adds more guns to the list, like the Machine SMG.\nRelated\nTo do this, youll need access to Save the World, Fortnites PvE component. If youve ever bought specific skin bundles, you may already own Save the World, but if not, youll need to buy it.\nImage: Epic Games via Polygon\nOnce you own Save the World, you can change to first-person by doing the following:\nChange your gamemode from the main Fortnite screen to Save the World and load in.\nOpen the settings.\nIn the game settings, toggle to turn on the first-person camera under the extra game options.\nLeave Save the World and reselect a Battle Royale gamemode from the menu.\nOnce you jump in to your Battle Royale game, youll notice something off about the animation when your character is jumping off the bus. If they look a little funny, like the image below, that means that its working.\nImage: Epic Games via Polygon\nTo disable the first-person camera, you can just head back into Save the World and turn it off.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Email Image: Epic Games via <b>Polygon</b> You can start playing Fortnite Battle Royale in first-person now, kind of. Its a little janky, and its not 100% ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T18:45:43",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Xj4gyKy2gbq3_um05TMepd8DRLk=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24404347/FortniteClient_Win64_Shipping_2023_02_02_12_18_25.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/fortnite-guide/23582992/how-to-play-fortnite-battle-royale-in-first-person"
      }
    },
    {
      "id": "2600615601777202432",
      "title": "Birdemic the infamous horror franchise gets trilogy box set",
      "url": "https://www.polygon.com/23582803/birdemic-blu-ray-box-set-trilogy-third-movie",
      "description": "Birdemic, the cult-favorite bad and amazing horror franchise, is getting a new film this year that will be included in a new full trilogy box set released by Severin Films on Feb. 28.",
      "body": "Flipboard\nEmail\nOne of the strangest and most oddly subversive horror franchises ever is getting a special new Blu-ray release. Wings of Disaster: the Birdemic Trilogy, a new box set from Severin Films, includes all three of writer and director James Nguyens Birdemic movies as well as 13 hours of special features.\nThe Birdemic films, which started in 2010 with Birdemic: Shock and Terror (a movie not infrequently cited as both one of the worst movies ever made and as a cult classic) is unlike just about anything else in the horror genre or otherwise. Self-labeled as a romantic thriller, the film is an off-beat mix of satire and earnestness inspired by Alfred Hitchcocks The Birds, which follows a software salesman and a lingerie model who are vacationing in a small town when its suddenly overrun with an onslaught of killer birds.\nImage: Severin Films\nNguyen went on to make a sequel in 2013, bringing back the stars of the original movie. Now, the director is back with third and final entry in the trilogy (which will also get a standalone release outside of the box set). Birdemic 3: Sea Eagle leans into the global warming-related reasons birds have taken to attacking humans, and how it could lead to the extinction of all life on Earth.\nSeverin Filmss new box set of the full trilogy will be released on Feb. 28.\nNext Up In",
      "snippet": "Birdemic, the cult-favorite bad and amazing horror franchise, is getting a new film this year that will be included in a new full trilogy box set released by Severin Films on Feb.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T18:14:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/PXxd9X7ElGAEO6W1GpYnXXJ0c_U=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24404447/Birdemic_5.1.00_50_20_06.Still016.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23582803/birdemic-blu-ray-box-set-trilogy-third-movie"
      }
    },
    {
      "id": "9079743165332879555",
      "title": "How to get a ton of legendary engrams in Destiny 2",
      "url": "https://www.polygon.com/23582776/destiny-2-hotfix-patch-blues-legendary-engrams-farm-guide",
      "description": "Blue engrams have been replaced with legendary drops in the latest Destiny 2 hotfix leading up to the release of Lightfall, giving players a great resource to farm legendary shards.",
      "body": "Press F to dismantle\nImage: Bungie\nIf you need to farm legendary shards in Destiny 2, now is the time to do it. A recent hotfix implemented by Bungie effectively replaces all blue drops in the game with Legendary purple engrams instead, giving players a great way to tank up on resources leading up to this months release of Lightfall.\nRolled out on Jan. 31, this hotfix is a temporary solution to the issue of blues that Bungie had planned to implement last week but instead ended up causing some players to lose progress, eventually causing Bungie to take its servers offline for around 24 hours for maintenance.\nIn the lead-up to Lightfall, we've implemented some changes:\nBlue Engrams no longer drop at soft Power cap\nWhere Blue gear would drop, now Purples do\nGunsmith rep gains from other sources +25%\n When Lightfall arrives, these engrams will transform into Glimmer\nFebruary 1, 2023\nBlue engrams are basically useless and the bane of existence for many players in the Destiny 2 community, as they end up taking up valuable space in your inventory and eventually consuming space in your postmaster, which could otherwise be used to catch valuable items like enhancement prisms and other useful loot. Purple engrams, on the other hand, can be dismantled for legendary shards, providing you with some basic currency to trade in for some of the more valuable resources like ascendant cores and enhancement prisms.\nThe temporary fix doesnt address the overcrowding issue in the postmaster, but following the release of the massive Lightfall expansion on Feb. 28, blue engrams will simply result in extra glimmer drops instead of additional legendaries. However, if your coffers are looking a bit sparse right now, and youre planning to jump into the new expansion on day one, the next four weeks are a great chance to prep.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Blue engrams have been replaced with legendary drops in the latest Destiny 2 hotfix leading up to the release of Lightfall, giving players a great resource to farm legendary shards.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T18:09:23",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/pFKx6w4NWI5Gk5nsfN_K8wHKCsg=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24404284/umbral_engram_destiny_2k_feature.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23582776/destiny-2-hotfix-patch-blues-legendary-engrams-farm-guide"
      }
    },
    {
      "id": "405496427810288446",
      "title": "5 Dave Bautista movie deep cuts you need to watch",
      "url": "https://www.polygon.com/what-to-watch/23579525/best-dave-bautista-movies-watch-stream-action-fights",
      "description": "The best Dave Bautista movies you can watch at home beyond his big hits like Glass Onion and Drax. With Knock at the Cabin out, watch some of Dave Bautistas best action movies at home.",
      "body": "Image: Well Go USA Entertainment\nThis story is part of a group of stories called\nYour time is precious, and your options are endless. The good news: We watch it all so you dont have to. Polygons What to Watch highlights the best, the funniest, the scariest, and the most exciting in movies, TV, and everything in between. Stop scrolling, start watching!\nHappy Dave Bautista has a new movie out week, Polygon readers. Were extremely excited about the new M. Night Shyamalan movie Knock at the Cabin, starring Bautista, Jonathan Groff, and Rupert Grint. What better time to look back at one of WWEs most successful alumni actors and his best roles?\nWe know youre familiar with his turns as Drax in the Marvel Cinematic Universe, or as the Extremely Dad Scott Ward in Zack Snyders casino-heist-meets-zombies thriller Army of the Dead, or as the mens rights influencer Duke Cody in Glass Onion, or even as the terrifying assassin Mr. Hinx in Spectre (which resulted in a broken nose for ol Dave).\n(And dont come at me with Dune. The movie is certainly good enough to make the cut here, but Bautistas barely in it.)\nBut what about beyond that? Before his current run of big-budget movies, Bautista made plenty of low-budget, straight-to-video action fare, and other movies that may have flown under your radar. And plenty of them are definitely worth your time.\nWeve wrapped up the best of the best of Bautistas under-the-radar roles. Each of them capitalize on his unique charisma and charm, and plenty use his fighting skills as well. (Like Dave, were waiting for his rom-com role.)\nLets get into it!\nMaster Z: Ip Man Legacy\nImage: Well Go USA Entertainment\nFor my money, this is Dave Bautistas best movie, and one of his very best roles. Getting to play the bad guy foreigner in a Hong Kong action movie is a right of passage for many Western action stars, and it does not get better than getting to do so under the tutelage of legendary fight choreographer and director Yuen Woo-Ping. He told EW he felt completely lost at the start of shooting, but quickly adjusted.\nI was struggling at first, and they wanted to kind of adjust things and I said, Dont! I will adjust to you, because I want to learn this. Im here to work with Woo-Ping, and watch him, and study him, and see how he works.\nA spinoff of the Donnie Yen-led Ip Man franchise (in which every single entry is a banger), Master Z focuses on Max Zhangs character, Cheung Tin-Chi, from Ip Man 3. You dont have to see Ip Man 3 to follow this, although you should, because its great. Zhang is a young father humiliated by his defeat at the hands of Ip Man (spoilers, I guess, but the franchise is named after him) and who runs into the wrong crowd. Bautista plays the burly owner of a restaurant, and Michelle Yeoh plays the leader of an organized crime syndicate who now wants to go legit. I can not stress this enough: Master Z rules. Pete Volk\nMaster Z: Ip Man Legacy is available to stream on Peacock and Hi-Yah!, for free with ads on Tubi, Pluto TV, Plex, The Roku Channel, Freevee, and Crackle, for free with a library card on Kanopy or Hoopla, or for digital rental or purchase on Amazon, Apple TV, Google Play, and Vudu.\nKickboxer: Vengeance\nImage: Radar Pictures\nA reboot of the Jean-Claude Van Damme-led Kickboxer franchise, Vengeance is basically a remake of the original movie. A young man (Alain Moussi) travels across the world and trains to take vengeance on the fighter who killed his brother.\nVengeance is filled with DTV martial arts stars  Moussi (Jiu Jitsu) is one of the best cinematic kickers working today, and the movie also features Darren Shahlavi (Ip Man 2), pro fighters like Georges St-Pierre (who has a delightful intoxicated fight at the beginning) and Cain Velasquez, and, of course, a fedora-sporting Van Damme.\nVengeance is solid DTV martial arts revenge fare with good fights (the movies fight choreography was done by the very talented Larnell Stovall) and great fighters. There are better actors in the DTV space than Moussi, but few better kickers. He is able to draw dynamic, perfect lines with his kicks, which is always visually pleasing. Theres also a post-credits dance sequence where Moussi imitates JCVDs famous dancing from the original Kickboxer.\nBut it all leads to Bautista, who plays the iconic villain Tong Po (a role Michel Qissi played in the original). Tong Po is a brutal Muay Thai expert, and Bautista is fierce and intimidating  amid a stable of incredible fighters, he stands out because of his massive frame and his intense stare. He flexes his pecs, he throws mean elbows, and he has absolutely no mercy. Its a departure from many of Bautistas recent roles as a big guy with a heart of gold, letting him flex some of his other acting muscles instead. Seemingly invincible, hes a lethal killer in the ring, setting him up perfectly for a final showdown with our hero.\nAnd while Bautista doesnt have tiny glasses in this one, he does drink out of a tiny teacup. And whats better than that? PV\nKickboxer: Vengeance is available to stream for free with ads on Tubi, Pluto TV, and The Roku Channel, for free with a library card on Hoopla, or for digital rental or purchase on Amazon, Apple TV, Google Play, and Vudu.\nHotel Artemis\nImage: Ink Factory\nDrew Pearces dystopian crime drama Hotel Artemis was widely praised when it was released in 2018 for its world-building and performances. One of the best of the latter is courtesy of none other than Bautista, who brings a hulking presence and acerbic sense of humor to the role of Everest, the assistant to Nurse Jean Thomas (Jodie Foster). Bautista is easily the breakout performance of the film, delivering hilarious one-liners (I will hunt you down and un-heal the shit out of you) and colder-than-ice threats (Because Junior, youre a slow code) with a sense of intimidating charm and personality that is all his own. Hotel Artemis is a great film even apart from Bautistas Everest, but itd be worth seeing just on the strength of his performance alone. Toussaint Egan\nHotel Artemis is available to stream on Showtime, for free with a library card on Hoopla, or for digital rental or purchase on Amazon, Apple TV, Google Play, and Vudu.\nRiddick\nImage: Universal Pictures\nAs I recently wrote for our list of the best movies leaving streaming in January, 2013s Riddick is the series answer to Mad Max: Fury Road: a back-to-basics soft reboot that pits the films eponymous antihero in a battle against mercenaries and the elements of an inhospitable alien planet. Dave Bautistas character, Diaz, a dreadlock-haired killer-for-hire, is the films equivalent of Pitch Blacks antagonist Johns: a corrupt, self-serving bounty hunter who double-crosses Riddick in the hopes of killing him to claim his bounty and securing his own escape off-world. Where Bautistas performance exceeds Cole Hausers Johns is in his physicality, posing a legitimate threat to Riddick as the two clash over the fuel nodes necessary to power. Riddick naturall",
      "snippet": "Stop scrolling, start watching! Happy Dave Bautista has a new movie out week, <b>Polygon</b> readers. Were extremely excited about the new M.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T18:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/_3CwD6fMfP2R2v7WD8UgVjyt7A4=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16025084/Still_2.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/what-to-watch/23579525/best-dave-bautista-movies-watch-stream-action-fights"
      }
    },
    {
      "id": "4149650461000673547",
      "title": "Polygon, Avalanche, and Aptos surge double digits",
      "url": "https://fortune.com/crypto/2023/02/02/alt-coins-polygon-avalanche-aptos-surge-stock-market-rallies-fed-news/",
      "description": "The cryptocurrencies were all up double digits on Thursday.",
      "body": "MATIC\n, the cryptocurrency associated with the Polygon blockchain, saw a 14% increase to $1.24 over the past day as its NFT ecosystem sees strong growth.\nThe blockchain was able to steal away two of the top NFT collections on the Solana blockchain, y00ts and DeGods, in December thanks in part to a $3 million grant to the developers. While Ethereum has traditionally been the most popular blockchain for NFTs, Polygon has quickly made a name for itself in the space.\nNgl I more bullish on @y00tsNFT than Degods rn. Not saying y00ts will have higher FP, but I am loving the move to Polygon. We can be kings there. We can be the OG collection like punks on eth. Cant wait\n RealDealDc (33.3%) (@Therealdealdc27)\nFor the second straight month, the biggest secondary NFT marketplace, OpenSea, recorded more sales for Polygon-based NFTs than Ethereum-based NFTs. The marketplace sold 1.5 million Polygon NFTs, as opposed to 1.1 million Ethereum NFTs, Decrypt reported.\nPolygons NFT trading volume skyrocketed 124% in January, reaching $46 million, according to a report by DappRadar.\nAptos token, APT, was the most profitable cryptocurrency for traders to invest in last month, according to CoinMarketCap. The crypto started the month at $3.50 and is up about 368% over the past 30 days, trading at about $18 on Thursday. The token is up 14% over the past 24 hours, riding the wave of the most recent rally.\nThe two most popular cryptocurrencies, Bitcoin and Ethereum, on Thursday were up 3.6% to $23,800 and 6.3% to $1,600, respectively.\nLearn how to navigate and strengthen trust in your business with The Trust Factor, a weekly newsletter examining what leaders need to succeed.",
      "snippet": "MATIC , the cryptocurrency associated with the <b>Polygon</b> blockchain, saw a 14% increase to $1.24 over the past day as its NFT ecosystem sees strong ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:47:19",
      "provider": {
        "name": "fortune",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://content.fortune.com/wp-content/uploads/2023/02/Coins-Avalanche-10.jpg?resize=1200,600",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fortune",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://fortune.com/crypto/2023/02/02/alt-coins-polygon-avalanche-aptos-surge-stock-market-rallies-fed-news/"
      }
    },
    {
      "id": "5794422816862371342",
      "title": "Pokmon: Detective Pikachu 2 still coming out studios insist",
      "url": "https://www.polygon.com/entertainment/23560467/pokemon-detective-pikachu-2-release-update",
      "description": "The sequel to the live-action Pokmon movie starring Ryan Reynolds blew up at the box office in 2019 but theres been no word on a sequel. Heres a release update.",
      "body": "Pokmon: Detective Pikachu\ndid the thing. Those heralding HBOs The Last of Us as finally lifting the video game adaptation curse must forget Legendary Entertainment and Warner Bros. Pictures 2019 release, which brought the Pokmon game franchise to live-action for the first time, and to the tune of positive reviews and $430 million worldwide. (Though in fairness to the critics, most things before March 2020 are a bit of a blur.) Overflowing with Pokmon of every type, director Rob Lettermans movie would seem like an obvious candidate for a bigger, battle-heavier sequel in the vein of the games  the endings Ryan Reynolds twist be damned.\nBut years later, even after announcing a sequel before the original movies release, a Pokmon: Detective Pikachu 2 is nowhere to be seen. Is everyones favorite furry electric pal down for the count or preparing for his next battle?\nAccording to a representative for Legendary Entertainment, the project is still in active development, but they could not confirm who was currently working on it. The Pokmon Company declined to comment when Polygon asked about its involvement with the development of the film or other projects that may have spun off since the release of the first Detective Pikachu.\nIn a recent conversation for their animated series Koala Man, Detective Pikachu writers Benji Samit and Dan Hernandez suggested they were not involved, but would love to be.\nIts an ongoing conversation that is still not over to this day, Samit said, adding that the situation was complicated and involved a lot of big studio, corporate Pokmon rights things that were not privy to.\nWhen Legendary made the pre-release announcement in January 2019 that Detective Pikachu 2 was already in development, Oren Uziel, who had then written 22 Jump Street and  a draft of Sonic the Hedgehog, was the one trying to catch the perfect Pikachu sequel idea. But representatives for Uziel tell Polygon that though he wrote an outline and screenplay for the movie, he is no longer working on the film and its unclear who has taken over.\nIn 2021, Detective Pikachu star Justice Smith was not optimistic about a sequels fate.\nI would love to participate in Detective Pikachu 2, he told Inverse while promoting his HBO Max series Generation. I dont know if its going to happen. I think we have to just kind of bury our hopes. I dont think its going to happen. I really hope so though. Honestly, Im such a huge fan, who knows, who knows? I hope so.\nBut as Samit suggests, there may be larger corporate hurdles now in play. In June 2021, news broke that Netflix was in development on a live-action Pokmon series, a logical next step to the streamers relationship with The Pokmon Company, which allows previous seasons of the Pokmon anime to live on the platform. And perhaps in more seismic events, November 2022 saw Legendary Entertainment sign a worldwide film distribution partnership with Sony Pictures, ending the long run with Warner Bros. Pictures. While Legendary and WB will continue to work together on a few ongoing franchises like Dune and the Godzilla/King Kong Monster-verse, its unclear whether a Detective Pikachu 2 (which WB co-financed) would move forward in the same way or be a victim of new relationships.\nThe word everyone comes back to is hope. For Samit and Hernandez, theyd settle for just watching it in the audience.\nWhether its us or someone else that takes up the mantle, we hope it happens because we love it, Hernandez said. I think its still a TBD, but... theres hope.\nWhat the future holds for Pokmon: Detective Pikachu and fans dreaming of another round of live-action Pok-fun is unclear. But the good news is theres a new Detective Pikachu game on the horizon. Announced in [checks notes] 2019? With no updates since? Another mystery is afoot...\nNext Up In",
      "snippet": "The Pokmon Company declined to comment when <b>Polygon</b> asked about its involvement with the development of the film or other projects that may have spun ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:14:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/7DEe7z8yy4lXzqm5CC6i4X7u_pw=/0x28:1284x700/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24368511/pokemon_detective_pikachu_magnifying_glass.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/entertainment/23560467/pokemon-detective-pikachu-2-release-update"
      }
    },
    {
      "id": "4186259275331953874",
      "title": "To prepare for the D&D movie you should play these two adventures",
      "url": "https://www.polygon.com/23581742/dungeons-dragons-dnd-adventures-to-play-before-honor-among-thieves-movie",
      "description": "D&Ds highly-anticipated anthology, Keys from the Golden Vault, is a big book of heists. It also reveals a key location from the upcoming movie, Dungeons & Dragons: Honor Among Thieves.",
      "body": "Dungeons & Dragons: Honor Among Thieves\narrives in theaters on March 31, hopefully clearing the extremely low bar set by previous D&D-themed movies. While fans of the seminal role-playing game are still a little bent out of shape by Hasbros recent spate of unforced errors, the non-gaming public seems pleasantly surprised by Sophia Lillis owlbear costume and\nMichelle Rodriguez\ns flaming axe. Now, with less than two months until the premiere, we finally know which officially licensed adventure books will tie in to the Chris Pine vehicle  Icewind Dale: Rime of the Frostmaiden and the soon-to-be released anthology Keys from the Golden Vault, due out beginning Feb. 7.\nAmong the major locations from the Forgotten Realms that will be included in the upcoming movie is Revels End, a maximum-security prison located in the frozen wilds of Icewind Dale. Revels End was introduced in Rime of the Frostmaiden, and it turns out that publisher Wizards of the Coast built its towering edifice with a particular audience in mind.\nI worked with the writers, directors to come up with a location in the Forgotten Realms that would serve the needs of the movie, said Chris Perkins, game design architect for D&D, in a promotional video released on Thursday. Rime of the Frostmaiden was released in 2020, meaning that Perkins has been whispering in the ear of writers Michael Gilio, John Francis Daley, Chris McKay, and Jonathan Goldstein for some time now.\nRime of the Frostmaiden borrows from elements of psychological horror, including films like John Carpenters 1982 horror classic The Thing. Ive played a fair bit of it, and it lives up to its reputation as a mechanically challenging experience for players and Dungeon Masters alike. Revels End is an optional mid-level dungeon that players can explore, a panopticon built around a central, all-seeing tower. In that book, it gets a fancy bit of art from Titus Lunter, and a map by Stacey Allan and Will Doyle.\nA glimpse of Revels End as seen in the most recent trailer for Dungeons & Dragons: Honor Among Thieves\nImage: Paramount Pictures\nYou can also see a version of it breaking through the clouds in the most recent trailer for Honor Among Thieves.\nRevels End key art from Keys from the Golden Vault.\nImage:\nKent Davis\n/Wizards of the Coast\nThursdays video, also accompanied by a news release, details how Revels End will play a role in Keys from the Golden Vault. Players will receive a key from the Vault, a benevolent organization hell-bent on securing McGuffins for various reasons and secreting them away. That key, once placed into a magical music box, will relay a mission from the partys handler. Next, players will use an in-fiction map to plan their heist.\nKeys from the Golden Vault will be filled with these kinds of heists, 13 in total. In a nod to 5th editions penchant for numerology, the quest involving Revels End is titled Prisoner 13. Rime of the Frostmaiden sent players after prisoner 237, a relative newcomer in that facility, which makes me think that the eponymous prisoner number 13 has been on ice for quite a long while indeed.\nKeys from the Golden Vault is available in a few formats, including a traditional hardcover book and a Roll20 virtual tabletop supplement. Like last years Dragonlance reboot, it will also be sold as a physical/digital combo. Those who purchase the combo pack will get access to the Roll20 supplement two weeks earlier, on Feb. 7. Keys from the Golden Vault hits the street, including Amazon and your friendly local game store, on Feb. 21. The United Kingdom and the rest of Europe, the Middle East, and Africa will have to wait until Mar. 24.\nIf youre interested, you can download the relevant adventure from Keys from the Golden Vault for free right now on D&D Beyond, Hasbros digital companion for D&D, which it acquired in April.\nKeys from the Golden Vault\n$45\nPrices taken at time of publishing.\n$45",
      "snippet": "D&Ds highly-anticipated anthology, Keys from the Golden Vault, is a big book of heists.\nIt also reveals a key location from the upcoming movie, Dungeons & Dragons: Honor Among Thieves.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T17:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/MHrXDqSk3-zGfQVe2-4qrsrIwn4=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24402442/330596_INTRO_HEIST_PLANNING__Art_by_Alexandre_Honor__copy.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23581742/dungeons-dragons-dnd-adventures-to-play-before-honor-among-thieves-movie"
      }
    },
    {
      "id": "5147944293403005340",
      "title": "James Gunns DCU will kick off with Frankensteins monster",
      "url": "https://www.polygon.com/23581858/creature-commandos-dc-comics-gods-and-monsters-james-gunn",
      "description": "Grant Morrison and artist Doug Mahnke made Mary Shelleys monster  also called Frankenstein  into a secret agent with an angels sword. Hell be back in the animated series Creature Commandos, as part of James Gunns larger plan for the DCU.",
      "body": "Email\nImage: Warner Bros. Animation\nStrange but true: The new DC Comics cinematic universe will begin with Frankenstein. According to James Gunn himself, the first installment of the new interconnected franchise of films, television, animation, and video games based on DC Comics characters will be Creature Commandos. And smack in the middle of our first look at the animated series is a familiar figure that looks a lot like Frankensteins monster.\nAnd thats because he just is Frankensteins monster. The DC comics universe version of the monster isnt licensed from the rights holders of Mary Shelleys Frankenstein; or the Modern Prometheus. But he also isnt a ripoff or an inside joke. Hes an undead being who was created 200 years ago by Doctor Victor Frankenstein, who sewed together several corpses and brought the results to life. The monster  who goes by the name Frankenstein, dont get at me in the comments  was later lost in the arctic of the DC Comics universe for a long time, and when he thawed out, he became a secret agent.\nYou see, Frankenstein; or the Modern Prometheus is in the public domain.\nImage: Patrick Gleason, Mick Gray, John Kalisz/DC Comics\nFrankenstein-the-monster as a character recurs surprisingly often in DC Comics, both as a one-off and more recently with his own intermittently ongoing continuity. Hes got an extra heart, for example, in case one of them gets torn out. His sword used to belong to an angel.\nHe owes his modern editorial (un)life to writer Grant Morrison, artist Doug Mahnke, and their mid-00s web of Seven Soldiers books, in which Frank battled supernatural horrors as only an undead creature with no conscience can. 2011s New 52 Reboot saw Frank re-imagined as a fully fledged agent of SHADE, the Super Human Advanced Defense Executive. Via the convergent evolution of cool and obvious ideas, hes developed something of a Hellboy-like niche.\nIts that niche that makes it possible for DC to publish him, much less for Warner Bros. to put him in an animated series. Because while Mary Shelleys Frankenstein; or the Modern Prometheus  in which Dr. Frankensteins monster is articulate, even erudite, and winds up frozen in the arctic  is in the public domain, Universal Pictures 1931 classic Frankenstein  in which the monster is a monosyllabic hulk who burns alive in a windmill  is not.\nAnd so Frankenstein joins the list of public-domain literary figures who are oddly significant to our modern superhero universes. Over in Marvel Comics, for example, Sherlock Holmes and Dracula are both kind of vital to X-Men continuity. Which raises a question that can only be answered by courage and daring.\nI ask the world: What brave writer and which brave artist will make Jay Gatsby an indelible part of a superhero universe? Personally, I think hed make a great Batman villain.\nNext Up In",
      "snippet": "Grant Morrison and artist Doug Mahnke made Mary Shelleys monster also called Frankenstein into a secret agent with an angels sword.\nHell be back in the animated series Creature Commandos, as part of James Gunns larger plan for the DCU.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:41:16",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/0hqWH0gClDF6hLUoDvzDNdQ6V_w=/0x0:2792x1462/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24402251/Screen_Shot_2023_02_01_at_3.33.09_PM.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23581858/creature-commandos-dc-comics-gods-and-monsters-james-gunn"
      }
    },
    {
      "id": "5401972781073552561",
      "title": "Dwarf Fortress creators made over $7M in one month from Steam launch",
      "url": "https://www.polygon.com/23582737/dwarf-fortress-2022-steam-version-success",
      "description": "The brothers behind developer Bay 12 Games, who spent 20 years making Dwarf Fortress for donations before putting a new 2022 Steam version on sale, have revealed how much money they game has made since launch",
      "body": "Email\nImage: Bay 12 Games/Kitfox Games\nBrothers Tarn and Zach Adams, creators of the legendary colony simulation game Dwarf Fortress, have revealed that they made $7.2 million in January 2023, following the release of the Steam version of the game in December 2022.\nThe Adams brothers have worked on the game for 20 years, mostly without help, and first released it to the public in 2006. But until the Steam release, Dwarf Fortress was always free to download, and their work was supported purely by donations and a Patreon.\nIn his post on the official forums of Bay 12 Games  the name of the brothers development studio  Tarn Adams noted that the the company was bringing in between $14,000 and $16,000 per month prior to the Steam release. So its quite a big jump in revenue!\nIts also a life-changing amount of money for the Adams brothers, after decades of toil on the game. A little less than half will go to taxes, and were continuing to pay people and new business expenses and such, so its not all personal money, but a lot of it is, Tarn said. Enough that weve solved the main issues of health/retirement that are troubling for independent people, as well as safeguarded the future of the game well enough. The brothers said they now felt comfortable putting another coder to work full-time on the game.\nIn a previous post in early January, Tarn said that the game sold almost half a million copies in December, and its likely the revenue from these sales  minus Steams cut, and the cut taken by Bay 12s publisher Kitfox Games  that has just landed in Bay 12s bank account.\nDespite the games famous impenetrability  somewhat alleviated by the actual graphics of the Steam version (previously, the game used text-based ASCII art)  the Steam version of Dwarf Fortress has been warmly received. Steam reviews are overwhelmingly positive, and fans are quick to say how happy they are to pay for a game theyd been playing for free previously.\nWhat is Dwarf Fortress, exactly? Its not an easy question to answer  but we tried.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The brothers behind developer Bay 12 Games, who spent 20 years making Dwarf Fortress for donations before putting a new 2022 Steam version on sale, have revealed how much money they game has made since launch.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T16:28:27",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/1feYYeqVeU39BWW_XXhPwuLd0rs=/0x75:1920x1080/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24245100/Dwarf_Fortress_KeyArt_1920Horizontalnologo.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23582737/dwarf-fortress-2022-steam-version-success"
      }
    },
    {
      "id": "9164071242352840506",
      "title": "The studio that made Wallace and Gromit is coming for Star Wars",
      "url": "https://www.polygon.com/star-wars/23582777/star-wars-visions-volume-2-release-date-aardman-cartoon-saloon",
      "description": "Aardman (Wallace and Gromit), Studio Mir (The Legend of Korra), Cartoon Saloon (Wolfwalkers), and more studios across the globe team up for the second volume of Star Wars: Visions, the animated anthology series on Disney Plus.",
      "body": "Email\nImage: Lucasfilm Ltd./Disney Plus\nA new volume of Star Wars: Visions will hit Disney Plus in May, the streaming service announced today. The animated anthology series has been a showcase for different animation studios world to craft short films set in the Star Wars universe. And while the first volume showcased Japanese animation, this second one will tap animation houses from around the world, such as Aardman  the studio behind Wallace and Gromit and Chicken Run  and Cartoon Saloon  best known for The Secret of the Kells and Wolfwalkers.\nStar Wars: Visions Volume 2 starts streaming May 4 on #DisneyPlus, featuring nine new animated shorts from nine studios from across the globe.\n; and Dart Shtajio, an American-owned Japanese animation studio.\nThe full list of shorts is as follows:\nEl Guiri: Sith, written and directed by Rodrigo Blaas\nCartoon Saloon: Screechers Reach, directed by Paul Young\nPunkrobot: In the Stars, written and directed by Gabriel Osorio\nAardman: I Am Your Mother, directed by Magdalena Osinska\nStudio Mir: Journey to the Dark Head, diercted by Hyeong Geun Park\nStudio La Cachette: The Spy Dancer, written and directed by Julie Chheng\n88 Pictures: The Bandits of Golak, directed by Ishan Shukla\nDart Shtagjio in partnership with Lucasfilm LTD: The Pit, written and directed by LeAndre Thomas, co-directed by Justin Ridge\nTriggerfish: Aaus Song, written and directed by Nadia Darries and Daniel Clarke\nThe season of Star Wars: Visions is currently available to stream on Disney Plus, and the second season will join the service on May 4, i.e., Star Wars Day. Time will tell just how much stars, wars, and visions are in these new installments.\nNext Up In",
      "snippet": "Aardman (Wallace and Gromit), Studio Mir (The Legend of Korra), Cartoon Saloon (Wolfwalkers), and more studios across the globe team up for the second volume of Star Wars: Visions, the animated anthology series on Disney Plus.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:52:19",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/_TVnoq15DfwQ_kZsugLwMN_J9-A=/178x0:1695x794/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22870257/star_wars_visions_ronin.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/star-wars/23582777/star-wars-visions-volume-2-release-date-aardman-cartoon-saloon"
      }
    },
    {
      "id": "8416949957120374256",
      "title": "Nintendos discounted Switch game vouchers are back",
      "url": "https://www.polygon.com/deals/2023/2/2/23582037/nintendo-switch-online-game-digital-vouchers-discount",
      "description": "With a Switch Online subscription, you can get two digital Nintendo Switch games for $100  about a $20 off the normal cost of two games.",
      "body": "announced an even bigger perk yesterday\n: discounted game vouchers.\nAll subscribers can buy a two-pack of these vouchers for $99.98, and a huge range of first-party (in other words, typically discount-averse) Nintendo games are looped in. I encourage you to check out the full list, but some highlights include the brand-new Fire Emblem Engage, Kirbys Return to Dream Land Deluxe, Bayonetta Origins: Cereza and the Lost Demon, Metroid Dread, Splatoon 3, The Legend of Zelda: Breath of the Wild, and Pokmon Scarlet and Violet. Important note: you both have to be a subscriber to buy and use these vouchers.\nPaid #NintendoSwitchOnline members can buy a pair of #NintendoSwitch Game Vouchers and redeem each one for a digital game in the voucher catalog to score savings!\nTitles such as #Splatoon3, #PokmonScarletViolet, and more are included!\nLearn more: https://t.co/Rb4JpzgotN\nFebruary 1, 2023\nIts great that this list is more expansive than Nintendos first swing at this deal in 2019. But this perk could actually turn Switch Online into a must-have service because it allows you to pre-purchase up to four sets of vouchers (totaling eight games), and keep them for 12 months from the date of purchase. With $20 in savings with each pair of vouchers, buying four bundles will save you up to $80, assuming that each title normally costs $59.99. If you buy a lot of games, this is a smart way to save a little bit of money on every forthcoming purchase.\nI know what you might be thinking: Can I use one on\nThe Legend of Zelda: Tears of the Kingdom\n? Nintendo has not currently listed the deliriously anticipated sequel to Breath of the Wild, which is set to release on May 12th, 2023. Polygon has reached out to Nintendo to see if itll eventually become eligible, but did not hear back in time for publication.\nYou can get a free seven-day trial for Switch Online here, and you can easily subscribe to the service directly from the Switchs eShop (it costs $3.99 per month, $7.99 for three months, or $19.99 per year). However, you can purchase (or gift) a one-year subscription with a digital code via Best Buy for $19.99. With a family subscription that costs $34.99 per year, up to eight Switch accounts can reap the perks of Switch Online.\nFor players who want all the perks, access to Goldeneye 007 and other N64 and Sega Genesis games, and complimentary DLC for some Switch games like Mario Kart 8 Deluxe, youll need Nintendos Switch Online plus the Expansion Pack tier, which costs $49.99 per year for one account, or $79.99 per year for a family subscription.\nRelated",
      "snippet": "<b>Polygon</b> has reached out to Nintendo to see if itll eventually become eligible, but did not hear back in time for publication. You can get a free ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:35:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/UIe-RFLJgaOm8x2bfPMATzCkitk=/0x59:1918x1063/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24270938/GameCapture_2022_12_06_13_52_18.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/deals/2023/2/2/23582037/nintendo-switch-online-game-digital-vouchers-discount"
      }
    },
    {
      "id": "3198213293053504605",
      "title": "Trigun Stampede transformed the Trigun anime to be faithful to it",
      "url": "https://www.polygon.com/23578531/trigun-stampede-anime-review-analysis-controversy",
      "description": "The new anime adaptation of Yasuhiro Nightows space Western manga is a worthy successor to the beloved 1998 series, but fans are split over the new series changes. Heres how Trigun Stampede fits in the history of the franchise, and why this new anime is worth your time.",
      "body": "Flipboard\nEmail\nIf you had told me before last year a new Trigun anime was coming out in 2023, I wouldnt have believed you. Thats the impression I sensed from most longtime Trigun fans I talked to in the wake of the announcement that Orange, the anime studio behind such lauded 3D CG animation like 2017s Land of the Lustrous and 2019s Beastars, would be creating a new anime based on Yasuhiro Nightows space Western action manga: a complicated mix of unvarnished enthusiasm, incredulous curiosity, and guarded expectation. And its got the fan base split.\nWhen Trigun Stampede was first revealed at Anime Expo 2022, reactions were... mixed, to say the least. While the prospect of the first new Trigun anime in over 13 years was greeted with near-unanimous goodwill, the responses to the production of the anime itself have been starkly divided. Many American fans of the original 1998 Trigun anime have criticized Trigun Stampede since its debut in January, with particular disapproval for the redesign of characters like series protagonist Vash the Stampede, the apparent absence of particular fan-favorite characters, the orchestral-heavy score as opposed to the 1998 series rock-oriented soundtrack, and the quality of the series CG animation. There was also initial confusion among the fan base as to how exactly Trigun Stampede fits into the chronology and canon of either Nightows original manga or the 1998 anime adaptation, if at all.\nTo answer that latter question: Trigun Stampede is a reboot, retelling its own take on stories, character beats, and events seen in the original manga and the 1998 anime. It is also set during an earlier period in the history of the Trigun universe than any previous iteration of the series to date. With all that said: I am here to make the good-faith case for why Trigun Stampede deserves your time, unpack the complicated history of the series, and explain how Oranges new anime is true to the spirit of the franchise while iterating on the core ideas and themes of its universe in ways the creators of the 1998 anime never had the opportunity to. Trigun Stampede does this through the same much approach the original Trigun anime did: by taking the source material and transforming it into a story that is distinctly its own.\n[Ed. note: Spoilers for the Trigun manga, the 1998 Trigun anime, and Trigun Stampede ahead.]\nThe history of Trigun\nImage: Orange/Crunchyroll\nFirst, some absolutely necessary background. In February 1995, Yasuhiro Nightow published the first one-shot (i.e., stand-alone issue) of Trigun, titled Trigun Pilot, in the Japanese manga publication Monthly Shnen Captain. A post-apocalyptic sci-fi Western, the comic centered on Vash the Stampede, a mysterious gunslinger traversing a barren planet whose ebullient personality and pacifist philosophy were contrasted with his otherwise infamous reputation as a localized disaster. The reception was positive, and Trigun began serialization in Monthly Shnen Captain that following April, with a total of 20 issues published before the magazine was shuttered in January 1997. Shortly after, Nightow was approached by Japanese publisher Shnen Gahsha, who was interested in working with him on a new manga series. However, Nightow couldnt  or wouldnt  let go of Trigun.\nWhen [Shnen Gahshas Young King Ours] invited me to do some work for them, they were hoping for a new piece, but I was troubled by leaving Trigun unfinished, Nightow said in a reader-submitted Q&A interview in September 2000. I told them I wouldnt feel like I had done my work unless I finished it, plus I was attached to it, and I asked them if theyd let me finish it. Around this same time, an anime adaptation of Trigun, produced by studio Madhouse and directed by Satoshi Nishimura, had just entered production, with Nightow attached as a creative consultant. Thanks in part to the production of Madhouses adaptation, the Trigun manga (retitled as Trigun Maximum) resumed publication on Oct. 30, 1997  less than half a year before the 1998 Trigun anime premiered on Japanese television.\nNot only was the 1998 anime adaptation of Trigun produced at a time when the original manga remained unfinished, but the very existence of that anime itself afforded Nightow the opportunity to finish the story of the manga as he had originally intended. The former fact is widely known and acknowledged among the Trigun fan base; the latter, however, is less so.\nTriguns American influence and the relationship between anime and adaptation\nFive years after the anime concluded in Japan, the English dub of Trigun premiered on Cartoon Networks Adult Swim programming block in 2003 and aired in reruns on the block up until 2009. As was the case with similar American-media-influenced anime like Cowboy Bebop, Outlaw Star, and The Big O, Trigun left a deep lasting impression on a generation of American anime fans who came of age around the turn of the century. Audiences responded not only to Vashs buffoonish demeanor, striking character design, and supernaturally proficient marksmanship, but also to his arc as a man haunted by the pain of his complicated past and the burden of his responsibility in safeguarding the survival of the human race.\nImage: Yasuhiro Nightow/Dark Horse Comics\nThe 1998 Trigun anime wasnt just popular, it was a bona fide phenomenon among American anime fans, particularly cosplayers who fastidiously recreated Vashs distinctive double-breasted coat, announcing themselves as (\ndeep breath\n) Valentinez Alkalinella Xifax Sicidabohertz Gombigobilla Blue Stradivari Talentrent Pierre Andri Charton-Haymoss Ivanovici Baldeus George Doitzel Kaiser III and shouting Love and peace! in their best impression of Johnny Yong Bosch at anime conventions. Nightow said it himself, in a 2009 interview during the promotional lead-up to the 2010 stand-alone film Trigun: Badlands Rumble, Im very blessed to have American fans. The Trigun movie thats coming out is [possible] because of requests from American fans. Without these fans, I wouldnt have this opportunity.\nNightows original manga and studio Madhouses adaptation exist in a symbiotic, interdependent relationship. The former gave birth to the latter, and the latter played a major role in the formers revival and continued existence. Because Madhouses adaptation was produced while Nightows manga was still incomplete, director Satoshi Nishimura, screenwriter Ysuke Kuroda, and the rest of the animes production staff had to work off what existed of the manga at the time and go in their own direction, resulting in a 26-episode series that is approximately 60% filler, containing characters, events, and revelations that diverge from the now accepted canon of the source material.\nThis is as common in anime of that time (for example, 2003s Fullmetal Alchemist and 2001s Hellsing) as it is today. Animators and producers often have to make necessary cuts and amendments in order to compress a serialized ongoing story into the space o",
      "snippet": "The new anime adaptation of Yasuhiro Nightows space Western manga is a worthy successor to the beloved 1998 series, but fans are split over the new series changes.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T15:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/0S3t4ZdsfODI1mZvoMsl3LWgi-w=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401313/23458631.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578531/trigun-stampede-anime-review-analysis-controversy"
      }
    },
    {
      "id": "1019101615044037375",
      "title": "Polygon 1-Day Volume Hits $958.16 Million (MATIC)",
      "url": "https://www.themarketsdaily.com/2023/02/02/polygon-1-day-volume-hits-958-16-million-matic.html",
      "description": "Read Polygon 1-Day Volume Hits $958.16 Million (MATIC) at Markets Daily",
      "body": "Polygons\ngenesis date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here. Polygons official website is polygon.technology. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. Polygons official message board is blog.polygon.technology.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nBuying and Selling Polygon\nIt is usually not currently possible to buy alternative cryptocurrencies such as Polygon directly using U.S. dollars. Investors seeking to trade Polygon should first buy Ethereum or Bitcoin using an exchange that deals in U.S. dollars such as Gemini, Coinbase or Changelly. Investors can then use their newly-acquired Ethereum or Bitcoin to buy Polygon using one of the exchanges listed above.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> 1-Day Volume Hits $958.16 Million (MATIC) at Markets Daily. <b><b>Polygon</b>s</b> genesis date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T14:36:49",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/02/02/polygon-1-day-volume-hits-958-16-million-matic.html"
      }
    },
    {
      "id": "6992343936574837393",
      "title": "Xbox lead dev talks about the future of video game accessibility",
      "url": "https://www.polygon.com/gaming/23581909/video-game-disability-accessibility-xbox-god-of-war",
      "description": "Games like God of War Ragnark and others were recognized at the 2023 Game Accessibility Conference Awards. We interviewed Xbox lead dev Tara Voelker about the state of games accessibility.",
      "body": "Flipboard\nEmail\nOver the past few years, interest in the field of video game accessibility has grown. Developers of all sizes have incorporated accessibility features into their games, whether in indie darlings like Tunic or major AAA releases like God of War Ragnork. As for hardware, Xbox released its Adaptive Controller in 2018, and PlayStation more recently announced Project Leonardo, which will be the companys effort to bring more accessible controllers to the PlayStation 5. The conversation about who gets included in video games, and how people play video games, has never been more relevant.\nBehind these splashy releases is the work of accessibility advocates who consult and advise on these games, paving the way for games to be more disability-friendly and available to a wider audience. Sometimes companies also hire particular organizations to serve as a consultant during hardware development, and or to speak up about issues as they arise. And now an awards show is  acknowledging this work when it happens, celebrating accessibility in video games.\nEnter the Game Accessibility Conference Awards.\nThe awards were started by the Game Accessibility Conference, a conference expressly dedicated to video game developers interested in broadening their knowledge on accessibility in games. The awards  which recognize the work of those who raise the bar for accessibility  cover 18 categories and celebrate work in different fields like academic research, publishers leading work in accessibility, and representation.\nThis year, God of War Ragnark took home awards in the AAA Excellence and Best Deaf/HoH accessibility categories. The nominations are shortlisted by a panel with the final picks chosen by a combination of a public and jury vote. To learn more about the awards, and and what the future of games accessibility looks like, Polygon interviewed Tara Voelker, co-director of the The Game Accessibility Conference Awards and senior Xbox Game Studios accessibility lead. The interview has been lightly edited for length and clarity.\nPolygon: How do you judge what makes a game accessible? (I imagine its hard and complicated.)\nTara: Judging what makes a game accessible is both simple and complicated. At its heart, a game is accessible when disabled gamers can play it. However, different gamers have different needs and different barriers that stop them from being able to play. A title may be incredibly accessible to deaf/hard of hearing gamers but completely inaccessible to those who are blind. Thats the complicated part.\nTo properly evaluate if something is accessible for a group of gamers, you have to understand their needs and verify those needs are met. For example, for a game to be accessible to those with colorblindness, you ensure that no key information is shown by color alone and is supported by shapes, pattern or text. Honestly, its still very rare for a game to truly be accessible for everyone simultaneously.\nImage: Santa Monica Studio/Sony Interactive Entertainment\nWhat makes an accessible game accessible?\nAn accessible game is one that has thought about the unintentional barriers that can prevent gamers with disabilities from playing, and avoids them completely or gives the option to remove them. As a game developer, you know what experience you want to give players, and the goal is to ensure people can get that experience.\nFor example, the challenge of a racing game is getting your car around the track as fast as possible. The challenge isnt supposed to be struggling to hit gas on the right trigger button on a controller because you have limited dexterity in your hands. This extra challenge can be removed by allowing the player to remap the gas to the A button. No more trigger button struggles and you can get on racing.\nI understand thats a nebulous idea, and how it manifests can be different per title.\nHow have you seen the field of games accessibility change throughout the years?\nThe field of accessibility in games has grown massively over time. When I first started in gaming, there were no full-time accessibility jobs in gaming. At all. And now there are multiple at both the studio and publisher level. When accessibility first started picking up speed, developers were rewarded and praised for things like colorblind filters, but now they are expected, and youll get a lot of complaints when you dont have them.\nAccessibility in games is on an exponential growth path, and the surge of accessible titles weve seen in the last few years has been truly amazing. The most exciting thing is the idea of accessibility is shifting to earlier in the game development process. For many years, accessibility was retrofitted. A game would be built and then devs would see how many accessibility holes they could patch. Some of these holes were un-patchable for reasons decided way earlier in development. Now were avoiding creating these holes altogether.\nImage: Devolver Digital\nWhy is it important to celebrate the work happening in this field?\nAlthough accessibility is growing, its still a largely advocate-driven space. In many situations, it can still take tons of emotional labor to ensure that accessibility is a concern during development. It is real work. We want all of those who work for accessibility to know they are appreciated and have a moment to see the impact they had for players celebrated. Not only will it lift their spirits and recharge them for the next fight, itll be easier to win next time when they can point and say, Well, look at this award and recognition\nIs there anything else youd like to share with us today?\nGaming has so many benefits and is truly part of pop culture. Disabled gamers deserve to be a part of the gaming space, and our games only get better when we consider their needs in development. Accessibility features arent just used by those who identify as disabled, they are used by gamers everywhere.\nThe easiest way to ensure that a game is accessible is to just get feedback from gamers with disabilities. There are plenty out there who want to play your games and will tell you why they cant. Talk to them!\nLoading comments...",
      "snippet": "... and and what the future of games accessibility looks like, <b>Polygon</b> interviewed Tara Voelker, co-director of the The Game Accessibility Conference ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T14:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/RpxqlOyfntLuMFvKhvCnqfXUgnI=/0x104:2867x1605/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24402424/Screen_Shot_2023_02_01_at_3.29.32_PM.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/gaming/23581909/video-game-disability-accessibility-xbox-god-of-war"
      }
    },
    {
      "id": "8175854587514041455",
      "title": "Next PS5 update will have Discord voice chat VRR support for 1440p and more",
      "url": "https://www.polygon.com/23582646/ps5-beta-system-update-discord-voice-chat-1440p-vrr",
      "description": "Sony has begun beta testing for the next PlayStation 5 system software update. Other features include wireless DualSense firmware updates, improved PS4 to PS5 save data transfer. The final update is expected \"in the coming months.\"",
      "body": "Email\nGraphic: James Bareham/Polygon\nSony has begun rolling out the next PS5 system software beta, and is testing a wide range of features to be added in the next system software update in the coming months.\nThe headline feature is the addition of integrated Discord voice chat, which among other things allows for voice chat between PS5 and other gaming platforms. To use it, PS5 owners will need to link their PlayStation Network and Discord accounts and use a Discord app on another device to initiate the chat.\nSony is also expanding variable refresh rate (VRR) support to include 1440p displays. VRR allows the monitor to adjust its refresh rate to the frame rate output by the console on the fly, making for a much smoother, judder-free image. This will be a useful update for people who already own 1440p VRR monitors  a popular configuration for PC gaming.\nThere are also a ton of enhancements to the user interface, social features, and general functionality in the beta. A few that jump out from Sonys rundown include: wireless firmware updates for DualSense controllers; an improved screen reader; more data transfer options, including much easier save data migration from PS4 to PS5, and data transfer from one PS5 console to another; per-game presets for multiplayer sessions; and manual uploads for game captures to the PlayStation App, for those time-critical moments when you just dont trust the auto-upload feature (hello, game reviewers and guide writers).\nIn the U.S. and U.K. only, Sony is also testing game capture using voice command: just say Hey PlayStation, capture that! to save a video clip of your recent gameplay.\nIts a relatively packed system update, then. Invited beta participants will receive an email telling them how to get involved. As usual, Sony cautions that not all features may make it into the final update for all PS5 owners, and that some features may see significant changes. But generally, these beta tests are a pretty good indication of what the final update will consist of in a month or twos time.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Sony has begun beta testing for the next PlayStation 5 system software update.\nOther features include wireless DualSense firmware updates, improved PS4 to PS5 save data transfer.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T13:14:36",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/I4QGednPQZdoFojtmuX_Ip34xHE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16330915/jbareham_190607_0906_ps5_0001_nw.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23582646/ps5-beta-system-update-discord-voice-chat-1440p-vrr"
      }
    },
    {
      "id": "2906269407958130654",
      "title": "The best Blu-ray and 4K UHD releases of February 2023",
      "url": "https://www.polygon.com/deals/2023/2/2/23573155/bluray-4k-uhd-disc-review-february-2023",
      "description": "Whats new on Blu-ray and 4K UHD this month? Everything from stoner comedies like Dazed and Confused to overlooked horror like Event Horizon.",
      "body": "Flipboard\nEmail\nNow is the perfect time to start or grow your Blu-ray collection. With HBO Max reminding the world that TV shows and movies can be removed from streaming services at a moments notice, weve begun to invest a bit more of our own entertainment budgets into good ol-fashioned discs. Preservation isnt the only benefit. The image and sound are better, and most discs still include special features unavailable on streaming services, like behind-the-scenes documentaries and commentaries.\nTo help you find your next favorite disc, we start each month with a list of our most anticipated releases. We havent had the opportunity to try these discs just yet, but if you want the formal thumbs up, no worries  in the coming months we will begin our rolling list of the best Blu-rays and 4K UHD discs of the year. But each of these releases has potential and comes from a label weve enjoyed in the past.\nThis month, weve got space horror, a stoner classic, and debatably the greatest art-house trilogy  enjoyable even if youve never visited an art house.\nOur most anticipated disc of February 2023\nSidekicks (4K UHD + Blu-ray)\n now available\nVinegar Syndrome has become one of the most reliable labels for horror, action, and exploitation cinema. It appears to have leveraged that cachet over the past couple of years to make special editions for studio films that have been forgotten or underappreciated. Last fall, it released a killer edition of Road House, replete with a 4K HDR presentation and a surprising number of new interviews with talent from both behind and in front of the camera.\nThat same sub-label, Vinegar Syndrome Ultra, returns with a release of Sidekicks. A bullied teenager daydreams of being Chuck Norris sidekick in various 90s action flick scenarios. To bring that joy to his life, he does the most period-appropriate thing possible: learns karate and enters a tournament that will settle the score with the local school baddies. Like the Road House release, Vinegar Syndromes spin on Sidekicks includes a 4K disc with HDR and hours of interviews with cast and crew, plus a new commentary track from director Aaron Norris, Chuck Norris brother.\nThe big Blu-ray and 4K releases for February 2023\nImage: Paramount Pictures\nEvent Horizon (4K UHD + Blu-ray + Digital Code)\n now available\nPaul W.S. Anderson doesnt get enough credit. The director has dedicated the majority of his career to video game adaptations, from 1995s Mortal Kombat to 2020s Monster Hunter  with an entire Resident Evil series in between. Anderson prioritized pulpy fun over the prestige that would become de rigueur, peaking just this month with HBOs The Last of Us. And yet, with so much Serious Entertainment, Ive come to appreciate Andersons enthusiastic approach to filmmaking. If you only watch one of his films, make it [the unforgettable/terrifying/some other descriptive word that gets across the WTF nature of this movie] Event Horizon, starring immensely talented Laurence Fishburne and Sam Neill, both of whom love a good opportunity to chew scenery.\nThe story is a mishmash of genre delights: sci-fi, body horror, and Lovecraftian nightmares. The new release includes a 4K disc, a Blu-ray disc, and a digital code, and supports Dolby Vision and HDR10.\nImage: Criterion\nThree Colors (4K UHD. Blu-ray)\n Feb. 7, 2023\nAs Criterion begins to ramp up its library of 4K discs, one of its best box sets gets the UHD treatment. Krzysztof Kielowskis Three Colors sounds like peak intimidating foreign cinema  a French/Polish trilogy, each entry named after the colors of the nations flag  but these films are nothing like the American cliche of the Parisian drama. Blue, White, and Red are approachable and intimate dramas starring international talent like Juliette Binoche and Julie Delpy. The three films land in different spots on the comedy-to-drama spectrum, but all tie together in a loose but affecting way that would inspire Hollywood filmmakers of the early 2000s obsessed with cosmic kismet.\nThe set includes all three films in 4K UHD with Dolby Vision HDR, along with a Blu-ray full of special features. Ever wanted a lesson in cinema from one of the greatest directors of all time? The set has three! Plus, you get the usual Criterion treats, like a collection of short films, mini documentaries, and essays from established film critics.\nImage: Universal Pictures\nThe Fabelmans (4K UHD, Blu-ray, DVD)\n Feb. 14, 2023\nFirst, the bad news: Steven Spielberg made his best film in decades and practically nobody saw it. Outrage! Hysteria!\nNow the good news: The Fabelmans might be Spielbergs most home-theater-friendly film. An intimate autobiographical spin on his own complicated family, along with his discovery of filmmaking, the drama should feel comfortable in the coziness of your living room.\nThe box includes a 4K disc with HDR, a Blu-ray disc, and a digital code.\nImage: Criterion\nDazed and Confused (4K UHD, Blu-ray)\n Feb. 21, 2023\nOur other anticipated Criterion release this month is the UHD upgrade for Richard Linklaters teen classic, Dazed and Confused. Finally, you can see Matthew McConaughey say All right, all right, all right in the highest possible fidelity. After spending six years in Austin, this has become an annual movie for me. But you dont have to be familiar with Top Notch and moonlight towers to connect with teens finding their own fun in an otherwise boring town.\nThe set includes a 4K disc with Dolby Vision HDR and a standard Blu-ray disc.\nPhoto: Ian Watson/HBO Max\nThe Last of Us\nwill likely be remembered as HBO Maxs breakout postapocalypse TV series, but thats no reason to skip Station Eleven, its life-affirming counterpoint. Based on the novel by Emily St. John Mandel, the limited series opens with an unsettlingly familiar pandemic, then tracks the lives of a band of traveling Shakespeare performers fighting for survival (and purpose) in a nearly empty world. Director Hiro Murai (Atlanta, some of the best music videos of the decade) produces some of the coolest visuals youll see on film or TV, but the darkness  literally, this show is heavy on shadows and night sequences  didnt benefit from crummy streaming. A 4K disc is the perfect way to revisit, or finally watch, one of our recent favorite series.\nImage: Criterion Collection\nThe Texas Chain Saw Massacre (4K UHD + Blu-ray)\n Feb. 28, 2023\nTobe Hooper broke into the film industry with 1974s The Texas Chain Saw Massacre, unquestionably his best film and one of the best horror movies full stop. Like so many great horror flicks, it does what is says on the tin. Its in Texas. Theres a chainsaw massacre. Simple and terrifying. Hoopers films would become exponentially silly and madcap, peaking 12 years later with The Texas Chainsaw Massacre 2, which filters the original premise through the lens of Looney Tunes. I love it, but to call its blend of comedy and violence an acquired taste would be an understatement.\nThis new release includes a 4K disc containing a whopping four comm",
      "snippet": "Whats new on Blu-ray and 4K UHD this month? Everything from stoner comedies like Dazed and Confused to overlooked horror like Event Horizon.\nFlipboard Email Now is the perfect time to start or grow your Blu-ray collection.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-02T13:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/K19HImb-rqSAzaC3ijzMnsOJyQY=/0x31:1600x869/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24397335/wamf1zuP9K7ZRYuMzZBRTPT8QADhSB_original.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/deals/2023/2/2/23573155/bluray-4k-uhd-disc-review-february-2023"
      }
    },
    {
      "id": "5678286703472024181",
      "title": "Crypto Price Today Live: Bitcoin marches towards $24k; Polygon, BNB rise up to 12%",
      "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-price-today-bitcoin-marches-towards-24k-polygon-bnb-rise-up-to-12/articleshow/97547666.cms",
      "description": "According to the 1-hour time frame analysis, the BTC/USDT spot market appears to be in a bullish state, with a price of $23,900 and support levels at $23,900 and $23,300. The resistance level is at $25,200 and the Relative Strength Index (RSI) is at 70, signaling an overbought market. The moving average is also above the 200-day moving average, further indicating a positive outlook,  Rajagopal Menon, Vice President at WazirX, said.",
      "body": "The cryptocurrency market was trading in the green on Thursday after Federal Reserve chair Jerome Powell acknowledged that inflation has started to ease, in remarks he made following a quarter-point rate hike by the US central bank.Bitcoin (BTC) rose 3.11% to $23,788, while Ethereum (ETH) was above the $1,600 level. BTC volume in the last 24 hours stood at approximately $30.58 billion, rising 37.16% in the last 24 hours. Bitcoin traded above $23,900 after reaching a low of $22,874 the previous day. A potential upward trend towards $24,000 and then $25,000 is possible if the market stays favourable. Meanwhile, Ethereum broke above $1,600, with support at that level and resistance at $1,700,  Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading higher. Polygon rose 12.35%. Solana, Avalanche, Cardano and BNB were also trading with gains.The global cryptocurrency market cap was trading lower around $1.09 trillion, rising 3.86% in the last 24 hours.The total volume in DeFi is currently $5.67 billion, 8.88% of the total crypto market 24-hour volume. The volume of all stablecoins is now $57.14 billion, which is 89.5% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, jumped around $458.6 billion, with a dominance of about 42.14%, a decrease of 0.33% over the day, according to CoinMarketCap. According to the 1-hour time frame analysis, the BTC/USDT spot market appears to be in a bullish state, with a price of $23,900 and support levels at $23,900 and $23,300. The resistance level is at $25,200 and the Relative Strength Index (RSI) is at 70, signaling an overbought market. The moving average is also above the 200-day moving average, further indicating a positive outlook,  Rajagopal Menon, Vice President at WazirX, said.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 12.29 hours, IST on February 02, 2023)Bitcoin $ 23,788 3.11%Ethereum $1,667 5.79%Tether $1 0.01%BNB $329.72 7.21%XRP $0.4122 2.99%Dogecoin $0.09326 1.38%Cardano $0.402 5.21%Polygon $1.23 12.35%Polkadot $6.51 5.33%Tron $0.06341 2.43%Litecoin $100.45 4.32%Shiba Inu $0.00001204 3.41%Solana $24.87 5.70%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
      "snippet": "According to the 1-hour time frame analysis, the BTC/USDT spot market appears to be in a bullish state, with a price of $23,900 and support levels at $23,900 and $23,300.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T08:09:00",
      "provider": {
        "name": "indiatimes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://img.etimg.com/thumb/msid-97547676,width-650,height-366,imgsize-182758,overlay-etmarkets/photo.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "indiatimes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-price-today-bitcoin-marches-towards-24k-polygon-bnb-rise-up-to-12/articleshow/97547666.cms"
      }
    },
    {
      "id": "3745917828214527204",
      "title": "Cryptocurrency prices today: Check rates of Bitcoin, Ethereum, Polygon, Tether",
      "url": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-02-02-2023-rates-of-bitcoin-ethereum-polygon/story",
      "description": "Bitcoin has climbed 3.10% in the past 24 hours, trading at $23,870.50",
      "body": "Bitcoin has climbed 3.1% in the past 24 hours, trading at $23,870.50. It is 3.04% higher than last week.    The second most popular token, Ethereum, has gained 5.62% from yesterday and is trading at $1,673.50. From the previous week, it is up 3.58%.    They have market capitalizations of $460.39 billion and $204.83 billion, respectively. BNB is trading at $329.83, which is 6.13% up from yesterday and 7.31% more than last week.    Today, XRP's price is $0.44, up 2.42% in the last 24 hours. It is 0.19% higher than last week.    Cardano and Dogecoin are trading at $0.44 (up 4.80%) and $0.099 (up 1.55%), respectively. Solana, Polka Dot, Shiba Inu, and Polygon are currently trading at $25.555 (up 6.04%), $6.6499 (up 5.86%), $0.000011 (up 1.76%), and $1.24 (up 11.88%), respectively.    Looking at the weekly chart, Solana is 4.52% up, while Polka Dot has moved up by 4.25%.    In the last seven days, Shiba Inu has gained 1.76% of its value, whereas Polygon is 23.50% up. Looking at the 24-hourly movement, the top five gainers are Loopring, Optimism, Synthetix, ImmutableX, and Convex Finance. They are trading at $0.44 (up 23.31%), $2.74 (up 21.18%), $2.71 (up 16.57%), $0.88 (up 14.44%), and $6.73 (up 14.19%), respectively. A stablecoin is an extremely low volatile cryptocurrency. Its value is tied to a physical asset like fiat currency or gold.    Talking about some of the popular tokens, Tether, USD Coin, and Binance USD are trading at $1 (up 0.01%), $1 (up 0.01%), and $1 (up 0.03%), respectively. Terra Classic is listed at $0.00011 (up 1.11%). The biggest losers of the day are UNUS SED LEO and Trust Wallet Token. They are trading at $3.37 (down 6.78%) and $1.70 (down 1.09%), respectively. Looking at the traffic, liquidity, trading volumes, and confidence in the legitimacy of trading volumes, the top three cryptocurrency spot exchanges are Binance, Coinbase Exchange, and Kraken.    Binance and Coinbase Exchange recorded a 24-hour volume of $22.6 billion (up 49.26%) and $2.12 billion (up 31.09%), respectively. Kraken saw a volume of $0.83 billion, which is 65.69% up from yesterday. DeFi, which is short for decentralized finance, is related to global, peer-to-peer financial services on public blockchains.    Some of the popular DeFi tokens are Avalanche, Dai, Uniswap, Wrapped Bitcoin, and Chainlink. They are trading at $22.21 (up 12.93%), $1 (up 0.05%), $7.03 (up 6.11%), $23,878.53 (up 3.31%), and $7.33 (up 5.49%), respectively. Non-fungible Tokens or NFTs are cryptocurrencies that cannot be exchanged for one another like other tokens due to their lack of fungibility.    ApeCoin, Decentraland, Flow, Axie Infinity, and The Sandbox are among the prominent NFT tokens. They are currently trading at $6.24 (up 6.10%), $0.88 (up 7.53%), $1.15 (up 7.24%), $11.49 (up 5.11%), and $0.77 (up 5.61%), respectively. The current global crypto market cap is $1.05 trillion. The total crypto market volume over the last 24 hours is $47.23 billion. They have remained flat over the last day.    The global crypto market cap was $798.56 billion last month, while three months ago, the total capitalization stood at $1.02 trillion.",
      "snippet": "Solana, Polka Dot, Shiba Inu, and <b>Polygon</b> are currently trading at $25.555 (up 6.04%), $6.6499 (up 5.86%), $0.000011 (up 1.76%), and $1.24 (up ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T06:09:50",
      "provider": {
        "name": "newsbytesapp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cdn.newsbytesapp.com/images/l6620230202111527.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsbytesapp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-02-02-2023-rates-of-bitcoin-ethereum-polygon/story"
      }
    },
    {
      "id": "886259891822234340",
      "title": "Bitcoin, ETH Rally With Profits, Majority Cryptocurrencies Tail Along",
      "url": "https://www.gadgets360.com/cryptocurrency/news/bitcoin-price-usd-23884-ether-other-cryptocurrencies-profits-today-3745884",
      "description": "The crypto market valuation rose by 3.78 percent in the last 24 hours. Bitcoin and Ether along with most cryptocurrencies opened with gains on Thursday, February 2. Cardano, Solana, and Polygon emerged among gaining altcoins on the price charts. On the other hand, Chainlink and Leo witnessed price reductions.",
      "body": "Most cryptocurrencies have begun to spring towards gains as the year of 2023 made way into its second month. On Thursday, February 2, Bitcoin opened with a gain of three percent to trade at the price point of $23,884 (roughly Rs. 19.5 lakh). On international exchanges, BTC reeled in gains of around 3.50 percent to trade at a similar value mark. In the last 24 hours, Bitcoin has grown by $755 (roughly Rs. 61,782). With the price of BTC spiking, majority altcoins are reeling-in benefits.\r\n\r\nEther opened with gains larger than Bitcoin. The second most valued cryptocurrency rose in price by 5.42 percent on Thursday. As per the crypto price tracker by Gadgets 360, ETH is trading at the price point of $1,670 (roughly Rs. 1.36 lakh). The cryptocurrency recorded a growth of $87 (roughly Rs. 7,120) since its last day's pricing.\r\n\r\nBinance Coin, Cardano, Polygon, Solana, Polkadot, Litecoin, and Avalanche  opened with gains.Crypto Ecosystem Saw Most Heists in 2022 Worth $3.8 Billion: Chainalysis\r\n\r\nShiba Inu and Dogecoin, both the meme coins recorded small but significant profits.\r\n\r\nMeanwhile, stablecoins such as USD Coin and Binance USD emerged among the handful of altcoins that opened with losses today.\r\n\r\nChainlink, Leo, and Near Protocol also recorded price reductions.Crypto Exploit Losses Fell by 93 Percent in January, Security Firm Says\r\n\r\nOverall, the crypto market valuation rose by 3.78 percent in the last 24 hours. As per CoinMarketCap, the value of the global crypto sector currently stands at $1.09 trillion (roughly Rs. 89,37,432 crore).\r\n\r\nThe year of 2023 has started on a positive note for cryptocurrencies, most of which are recovering from last year's downfall. Despite its element of volatility, the crypto sector has somehow kept itself safeguarded against a ban in the world' most populated nation, India.\r\n\r\nIndia got its union budget for the year of 2023-2024 on February 1, as part of which, finance minister Nirmala Sitharaman did not talk about restricting the crypto sector in the nation.\r\n\r\nIn fact, Sitharaman did not particularly address the crypto topic at all, which left players in the industry who were expecting tax reliefs, a tad disappointed.\r\n\r\nWhile many crypto industry leaders had big expectations for the union budget 23-24 and requested some key reforms such as lowering the TDS rate from 1 percent to 0.01 percent and providing clarity on taxation, I honestly did not have lofty hopes. It is best to wait until the Indian government fully comprehends what cryptocurrency is and the value it can bring to the Indian economy. Overall, this budget is very considerate knowing that the government is still trying to understand the crypto and is not saying anything about the crypto, Kumar Gaurav, Founder and CEO of Cashaa told Gadgets 360. Launched in 2017, Cashaa is neo-bank that works with crypto businesses.\r\n\r\n\r\nThe Infinix Zero Ultra has a decent set of specifications on paper, but does the phone justify its high asking price? We discuss this and more on Orbital, the Gadgets 360 podcast. Orbital is available on Spotify, Gaana, JioSaavn, Google Podcasts, Apple Podcasts, Amazon Music and wherever you get your podcasts.\r\n\r\n\r\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.Affiliate links may be automatically generated - see our ethics statement for details.",
      "snippet": "Cardano, Solana, and <b>Polygon</b> emerged among gaining altcoins on the price charts. On the other hand, Chainlink and Leo witnessed price reductions.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T05:34:25",
      "provider": {
        "name": "gadgets360",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.gadgets360cdn.com/large/crypto_money_laundering_unsplash_large_1656502490595.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "gadgets360",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.gadgets360.com/cryptocurrency/news/bitcoin-price-usd-23884-ether-other-cryptocurrencies-profits-today-3745884"
      }
    },
    {
      "id": "696883081395540259",
      "title": "AllianceBlock token plunges 51% after $5m exploit of Bonq DAO",
      "url": "https://www.fxstreet.com/cryptocurrencies/news/allianceblock-token-plunges-51-after-5m-exploit-of-bonq-dao-202302020028",
      "description": "New ALBT tokens will be minted and airdropped to the affected wallet addresses. Hackers have siphoned off roughly $5 million worth of allianceBlock (A",
      "body": "New ALBT tokens will be minted and airdropped to the affected wallet addresses. Hackers have siphoned off roughly $5 million worth of allianceBlock (ALBT) tokens on Bonq, a decentralized borrowing protocol, according to a Wednesday announcement from AllianceBlock. AllianceBlock has paused all activity on its bridge following the attack, which occurred Wednesday afternoon. During the exploit a Polygon wallet accessed 112 million ALBT tokens, bridging them from the Polygon blockchain to the Ethereum blockchain. The hacker also got 500,000 USDC from dumping bonq euro (BEUR) tokens. The protocol's team, along with that of Bonq, will mint new ALBT tokens and airdrop tokens to the affected wallet addresses. \"The AllianceBlock and Bonq Teams, including all connected partners, are now in the process of removing the liquidity, and are halting all exchange trading,\" the announcement reads. AllianceBlock says none of its smart contracts were breached or compromised during the attack, but that hasn't assuaged investors' fears. The ALBT token's price plunged roughly 51% following the exploit, according to CoinMarketCap. During the oracle hack, the attacker also minted 100 million BEUR tokens, decreasing their price to almost zero. That subsequently triggered the liquidation of the affected ALBT troves, according to a representative from Bonq.",
      "snippet": "During the exploit a <b>Polygon</b> wallet accessed 112 million ALBT tokens, bridging them from the <b>Polygon</b> blockchain to the Ethereum blockchain. The ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-02T00:28:22",
      "provider": {
        "name": "fxstreet",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://editorial.fxstreet.com/images/Psychology/stressed-business-man-gm474198918-64493675_Large.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fxstreet",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.fxstreet.com/cryptocurrencies/news/allianceblock-token-plunges-51-after-5m-exploit-of-bonq-dao-202302020028"
      }
    },
    {
      "id": "7297857046389374112",
      "title": "NASCAR drivers video game inspired wall ride stunt officially banned",
      "url": "https://www.polygon.com/23582064/nascar-wall-ride-video-game-gamecube-ross-chastain-martinsville-banned-rule",
      "description": "NASCAR on Jan. 31 said that \"wall rides\" like the one Ross Chastain pulled off at the end of an Oct. 30 race in Martinsville, Va. will be considered violations of safety rules and subject to time and lap penalties going forward. Chastain used the technique to slingshot past six drivers and stay alive in the 2022 NASCAR Cup Series playoffs.",
      "body": "Email\nPhoto: Stacy Revere/Getty Images\nRemember that awesome-as-hell, straight-out-of-the-basement, Nintendo GameCube move a NASCAR racer whipped out at the end of a wild race in Virginia at the end of October? Yeah, well, the fun-killing schoolmarms who control stock-car rules have said, Nope, no more of that.\nRecap: Ross Chastain, at the wheel for the Trackhouse Racing No. 1 Chevy Camaro, was in 10th place at Martinsville, the shortest track in NASCAR, and needed a top-four finish or he was out of the playoffs.\nChastain deployed a move he (and many others of his generation) used only in video games 20 years ago  the wall ride, where he motored into the corner at top speed and used the wall to brake and corner his vehicle. It worked: Chastain surged from 10th to 4th in the final corner of a half-mile track to stay alive in NASCARs playoff format, and finished second overall the next weekend at Phoenix. Its truly the stuff of legend.\nRoss Chastain rides the wall around the final corners to overtake five cars and reach the Nascar playoffs\nOctober 31, 2022\nAnd legend is where it will remain, apparently. Per NASCAR reporter Zack Albert, Chastains wall-ride maneuver is now considered a violation of rule 10.5.2.6.A, which encompasses any violations deemed to compromise the safety of an Event or pose a risk to anyone participating in or attending it.\nBasically if theres an act that we feel that compromises the safety of our competitors, officials, spectators, were going to take that seriously, said Elton Swayer, NASCARs chief competition executive. And we will penalize for that act going forward.\nSo NASCARs administration has laid down the law: There will be no more wall-riding. Any attempt to do so is going to incur a lap or time penalty that thwarts whatever intent the driver had going into the concrete.\nChastain, in October, acknowledged it was a high-risk gamble. But I was willing to do it, he told NBC. He told a trackside reporter that the move was inspired by NASCAR 2005 on GameCube, which he and his brother Chad played obsessively.\nGiven that the sport literally traces its heritage to bootleggers running whiskey in the 1950s, Chastains buccaneering spirit must be applauded. But yeah, if drivers are busting out a wall ride at the end of every race, the novelty would wear off  and someone would be likely to get hurt.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "31 said that \"wall rides\" like the one Ross Chastain pulled off at the end of an Oct.\n30 race in Martinsville, Va.\nwill be considered violations of safety rules and subject to time and lap penalties going forward.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T23:23:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/KRJ5cnM4S_eXOPLZ_99MM6vQoGo=/0x547:1270x1212/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24402599/1437778973.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23582064/nascar-wall-ride-video-game-gamecube-ross-chastain-martinsville-banned-rule"
      }
    },
    {
      "id": "3691053043336363818",
      "title": "EA reportedly cancels secret Titanfall game",
      "url": "https://www.polygon.com/23581952/ea-cancels-titanfall-sequel-again-monsters",
      "description": "Bloomberg reports that a new Titanfall/Apex Legends game was secretly in development at Respawn, and has been canceled, along with Apex Legends Mobile.",
      "body": "Email\nImage: Respawn Entertainment/Electronic Arts\nIn 2016, Electronic Arts published what may well be the last great big-budget shooter, Respawn Entertainments Titanfall 2. The game, to quote a particularly NSFW Achewood, was James Bond in a towel: full of astoundingly intricate level design, fast and balletic movement, and incredibly satisfying gunplay. It was revelatory, a whole new kind of fun emerging from something a lot of players already enjoyed, like if Call of Duty: Modern Warfare 2 suddenly got a tango mod, or an NFL team put out a Christmas album. Then EA spent the next seven years doing everything it could to not make a sequel.\nThe latest affront comes via a Bloomberg report saying that EA has canceled a secret single-player game in the Titanfall/Apex Legends universe that was in development at Respawn. This would be the second time (that we know of) that a Titanfall sequel was canceled  the free-to-play battle royale game Apex Legends began its life as a Titanfall 2 follow-up.\nThere are likely boring business reasons for the cancellation. Titanfall 2 was a massive critical success, but EA didnt consider it a financial hit  and unfortunately, just about any single-player game is going to struggle in comparison to a free-to-play game like Apex Legends, which has made more than $2 billion. None of this makes sense in what well call Regular People Math: EA also continues to print money with the microtransaction-driven FIFA Ultimate Team mode (so much so that the company now omits that games revenue from its annual reports). And yet the publisher has just finished shutting down a few projects  including, yes, a Titanfall mobile game, Apex Legends Mobile.\nNo more Titanfall sequels is pretty low on the list of reasons that unchecked growth in big-budget video game profits is bad. But its not not on the list.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Bloomberg reports that a new Titanfall/Apex Legends game was secretly in development at Respawn, and has been canceled, along with Apex Legends Mobile.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T23:03:48",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/LjWkZb5yauilMgWgnG2J_XSXo0k=/7x0:1793x935/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7520519/titanfall_2_dlc.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23581952/ea-cancels-titanfall-sequel-again-monsters"
      }
    },
    {
      "id": "3806204308262716535",
      "title": "FFXIV Valentiones Day 2023 event guide",
      "url": "https://www.polygon.com/ffxiv-guides-ff14-final-fantasy-14-online/2023/2/1/23581794/valentiones-day-2023-quest-location-outfit-emote-emissary-eat-chocolate",
      "description": "Our guide details where to start FFXIVs 2023 Valentiones Day event and get the free outfit and emote.",
      "body": "Email\nImage: Square Enix via Polygon\nValentines is in full swing in Final Fantasy 14, with its yearly Valentiones Day event taking place from Feb. 1 until Feb. 15 at 9:59 a.m. EST. As usual, these limited-time rewards are adorable, so you should definitely nab the outfit, emote, and furnishing before the event wraps up.\nAs per usual with these limited-time events, you need to be at least level 15 and have completed the main scenario quest Its Probably Pirates.\nYou can start the quest by talking to Lisette de Valentione at Mhn Khettos Amphitheater in Old Gridania. Weve marked the location below:\nGraphic: Julia Lee/Polygon | Source images: Square Enix\nOnce you complete the quest, which shouldnt take more than a few minutes, youll get a coffer that rewards you with the hat, top, bottom, and shoes for the Valentione Emissary set.\nTo answer a few questions:\nThe set is dyeable.\nViera cannot wear the hats. :(\nBoth outfits are gender-locked and we do not know if theyll ever get the gender restriction removed. Outfits have been getting gender restrictions removed over patches, and the Valentione set from 2020 recently had its restriction removed, so its not impossible.\nYou can get both the male and female set, but you only get one for free. The other set will cost a few thousand gil.\nThe set does go into your armoire.\nTo get the Eat Chocolate emote (Ballroom Etiquette - Valentiones Dangers), Valentiones Heart Desk furnishing, and the other genders set of clothes, you just need to buy it from the House Valentione Maid NPC we marked below.\nGraphic: Julia Lee/Polygon | Source images: Square Enix\nIf you love fashion, we recommend grabbing both sets of clothes in the event that you fantasia to the opposite gender or if the clothes one day does become un-gender-locked. The clothes, emote, and furnishing items will all become unavailable after the event ends, and youll only be able to purchase them for real money through the online shop in 2024, so you might as well grab them while theyre free now.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Email Image: Square Enix via <b>Polygon</b> Valentines is in full swing in Final Fantasy 14, with its yearly Valentiones Day event taking place from Feb. 15 ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T21:06:54",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/2CbF03RgKMXC3c3cH-hniKw50yw=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24402133/ffxiv_dx11_2023_02_01_14_44_16.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/ffxiv-guides-ff14-final-fantasy-14-online/2023/2/1/23581794/valentiones-day-2023-quest-location-outfit-emote-emissary-eat-chocolate"
      }
    },
    {
      "id": "1624882410655599678",
      "title": "Pokmon Go Rocket Giovanni counters team for February 2023",
      "url": "https://www.polygon.com/pokemon-go-guide/23581491/giovanni-counters-team-february-2023-team-go-rocket-registeel",
      "description": "After taking down a bulk of Team Go Rocket, youll need to face off against Giovanni. Our Pokmon Go guide lists his counters and party for February 2023.",
      "body": "Email\nGraphic: Julia Lee/Polygon | Source images: Game Freak/The Pokmon Company, Nintendo\nGiovanni is back in Pokmon Go, as part of the Shadowy Skirmishes Special Research in February 2023. As per usual, hes tough to battle, but we list out his party and counters to help take him down if youre having trouble.\nHow to find Giovanni in Pokmon Go\nTeam Go Rocket boss Giovanni is typically only available to battle while completing Team Go Rocket Special Research. We get a new set of this type of research every few months, typically with a new Shadow legendary Pokmon as a reward at the very end. After beating all three Team Go Rocket leaders, youll get a Super Rocket Radar, allowing you to hunt down Giovanni.\nJust like the leaders, Giovanni will appear in Team Go Rocket balloons or at taken over PokStops if you have the Super Rocket Radar. Once you find him and use the radar, you can battle him as many times as it takes to beat him (as long as youre within distance of the PokStop), which is great, because he is typically a pretty tough battle.\nPokmon Go Giovanni team\nThis time around, Giovanni will have the following:\nPersian (normal)\nRegisteel (steel)\nPokmon Go Giovanni counters\nBecause there are less potential party options for Giovanni than there are for the Rocket Leaders, hes actually easier to plan against, though his Pokmon are much stronger. You will need to bring the strongest Pokmon you have and your A game in order to take him down.\nIf he uses Nidoking, consider ground-types such as:\nGarchomp with Mud Shot and Earth Power\nMamoswine with Mud Slap and Bulldoze\nGroudon with Mud Shot and Earthquake\nRhyperior with Mud Slap and Earthquake\nIf he uses Cloyster, consider fighting-types such as:\nTerrakion with Double Kick and Sacred Sword\nMachamp with Counter and Dynamic Punch\nLucario with Counter and Aura Sphere\nConkeldurr with Counter and Dynamic Punch\nIf he uses Garchomp, consider ice-types, but note that Registeel is resistant to ice-type moves, so you will need to take another counter for it specifically (such as fighting- or ground-types). Powerful ice-type Pokmon include:\nGalarian Darmanitan with Ice Fang and Avalanche\nMamoswine with Powder Snow and Avalanche\nGlaceon with Frost Breath and Avalanche\nWeavile with Ice Shard and Avalanche\nHow to beat Giovanni in Pokmon Go\nI personally use a beefed up Machamp first to both get rid of his Persian quickly while also quickly building up Charge Moves to get through Giovannis two shields. After that, Ill try to find a counter for both his second Pokmon and the Registeel, if thats possible.\nAfter defeating Giovanni, you will get to catch Shadow Registeel from him. Its a guaranteed catch, so dont forget to use a Pinap Berry to score some extra candy.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "After taking down a bulk of Team Go Rocket, youll need to face off against Giovanni.\nOur Pokmon Go guide lists his counters and party for February 2023.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T20:15:41",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Mzlm0BCXbTBRoRl-TnAOPkQa01I=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401914/jlee_230201_1002_giovanni_registeel.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/pokemon-go-guide/23581491/giovanni-counters-team-february-2023-team-go-rocket-registeel"
      }
    },
    {
      "id": "449055911901068729",
      "title": "The new Batman movie has a Robin unlike any other in live action cinema",
      "url": "https://www.polygon.com/23581377/batman-grant-morrison-james-gunn-brave-and-bold",
      "description": "Warner Bros. new Batman franchise will begin with Brave and the Bold, says James Gunn, based on Grant Morrisons comics featuring Damian Wayne/Robin",
      "body": "Flipboard\nEmail\nOn Jan. 31, James Gunn, freshly named as DC Studios co-CEO, announced his slate of projects for the new version of the DC Universe. After a decade of tumultuous overhaul, he presented a slate thats intended to provide a coherent universe across movies, TV, cartoons, and video games. And among re-imaginings of Superman, Swamp Thing, and Green Lantern came the newest movie incarnation of Batman: Brave and the Bold.\nFor comic book and cartoon fans, the name recalls a famed title in the annals of DC. In a Brave and the Bold story, familiar DC characters team up, most famously with Batman. A lot of the fun comes from seeing the various outlandish characters of the DC universe bounce off the Dark Knights tight-lipped countenance. What little we know about the new Batman film indicates that it will also be a team-up movie, only he wont be hanging out with heroes like Plastic Man or Metamorpho. (At least not yet.) Instead, according to Gunns announcement, it will feature Batman dealing with his own biological child, Damian Wayne. For those who dont know, Damian is the secret love child of Bruce Wayne and Ras al Ghuls daughter Talia, and he eventually takes on the mantle of Robin.\nAnyone expecting Brave and the Bold to feature a new, peppy partner turning Batman into a brighter, less conflicted character may be very much surprised.\nHollywood hasnt ever seen this Robin\nPhoto: Warner Bros. Home Entertainment\nAt least at far as Batman movies have been concerned, Robins role has been to inject some levity into a usually grim storyline. That isnt exactly faulty thinking  Robins role when he was first introduced in the comics was to gather and maintain younger readership. That dynamic carried over to films like Batman Forever, Batman & Robin, and most recently, The Lego Batman Movie, which forced Batman to come out of his cave and crack a Dad joke or two. Brooding is a bachelors game.\nThe films (and their marketing) have become obsessed with this kind of sliding scale of dark and light Batman adventures. When Robin isnt around, Batman is allowed carte blanche to be an angsty hero who spends a lot of time contemplating his own existence. As soon as the Boy Wonder shows up, Batman has to shift his focus from internal to external, and from brooding to training and teaching  in effect, he gets a pep talk in the form of his adopted circus orphan.\nIn the comics, which have gone through several of their own brooding Batman to Dad Batman cycles, the stories are more varied, thanks to characters like former Robin Jason Todd (\na former Robin who fans murdered via phone poll\n) and the development of Nightwing (a former Robin who retired from the sidekick role to go be a solo hero.) Movies, though, have not gotten around to any of that.\nWith Damian Wayne, though, they could. Damian was invented by Grant Morrison and Andy Kubert after Morrison received acclaim for All-Star Superman. Their new take on the Man of Steel took advantage of the fact that while Supes wasnt a particularly complex character, he could contain complexities. He was both gentle and titanically strong, driven by simple ideals, but extremely intelligent. Morrison brought the same expansive notion of comic book humanity to the Batman and Son storyline, the start of their and Kuberts seven-year run in Batmans world.\nGood-cop Batman vs. bad-cop Robin\nImage: Grant Morrison, Andy Kubert/DC Comics\nOn the surface, Damians role in Bruces life (and the life of every hero hes paired with at the start) seems like the opposite of whatever buoyancy a Robin is supposed to provide. The kid represents both the ghosts of Batmans past coming back to haunt him, and his actual surprise son, who isnt really sure whether he wants to impress his father, or murder him and take his place. Damian initially tries to slaughter then-Robin Tim Drake. When Bruce Wayne dies (he wasnt actually dead, but dont worry about all that) and Dick Grayson takes on the Batman persona, Damian finds him to be a total square. The youngest Robin is angry, resentful, churlish and completely lacking a moral code. In short, hes pretty awful.\nBut thanks to Morrisons execution, Damian reveals multitudes, stretching far beyond the cinemas idea of Robin as a mere Batman palate-cleanser. As time has gone on in the comics, the idea of a Robin hasnt so much provided Batman with a little buddy as its given him a new challenge. Is Batman fit to take on a ward, and to be both a father and a crime-fighting partner? Is he fit to have a partner at all? Can Batmans purpose as a symbol in an eternal war on crime coincide with steering a deranged adolescent toward being a good person?\nEvery Batman writer probably has a different answer to these questions, but in Morrisons hands, with a Robin whos literally Bruce Waynes child, we get what may be the most optimistic ones. Damian provides the ultimate teaching lesson for these older heroes, and they pass with flying colors.\nPutting the dynamic in Dynamic Duo\nImage: Grant Morrison, Andy Kubert/DC Comics\nMorrisons comics range from lighthearted to intensely violent, another range that would be cool to see explored in a Batman film, which tend to tone down anything thats disturbing as soon as Robin shows up. But if Gunn and Co. can bring in a movie version of Damian who retains the characters power, it might flip viewer expectations for Robin going forward. Robin doesnt have to be Batmans Prozac  the characters stories can still contain all the internal goings-on that hes famous for. In fact, its better if they do. For a character whos always been known in the DC pantheon as the realistic or grounded one, it makes much more sense that the addition of a son to care for wouldnt solve his or anyone elses problems, but would instead force some meaty contemplation of their new roles, and how they fit into his old mold.\nOptimism doesnt always come in the form of a clear happy ending. Sometimes it simply comes from people doing good work that needs doing. Most parents will tell you that  raising a child is work (even if your child isnt a four-foot-tall homicide machine) but its good work that someone has to do. And on a less important scale, this is the work Batman needs on his next film for a wide audience. Damian probably wont be what audiences expect, but in a cinematic world with multiple Batmans, multiple Jokers, and a fairly stereotyped view of what a Batman family is supposed to look like, the thing we dont expect is the thing that needs to be done.\nDC\nLogan director may reimagine Swamp Thing for James Gunns DCU\nNews\nReleasing Batgirl would have hurt DC universe, says new DC Studios head\nMovies",
      "snippet": "new Batman franchise will begin with Brave and the Bold, says James Gunn, based on Grant Morrisons comics featuring Damian Wayne/Robin.\nFlipboard Email On Jan.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-01T20:15:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/3NaycIfQ476BIpeNMGgnSAgM1ak=/0x63:1823x1017/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15873321/b_r.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23581377/batman-grant-morrison-james-gunn-brave-and-bold"
      }
    },
    {
      "id": "597984873409291138",
      "title": "How Sea of Thieves pirates teamed up with the Parkinsons Foundation",
      "url": "https://www.polygon.com/23580232/sea-of-thieves-parkinsons-foundation-charity-streaming",
      "description": "Sea of Thieves event organizers collaborated with the Parkinsons Foundation to raise tens of thousands of dollars for a great cause. Heres how the partnership came to be.",
      "body": "Email\nImage: Rare/Xbox Game Studios\nThe Sea of Thieves community is full of unexpected delights, from tense sloop races to impromptu trivia nights on deck. While pirates are usually known for their avarice and greed, a group of notable players realized they could combine their existing events with a higher purpose. Thanks to a partnership between a crew of Sea of Thieves fans and the Parkinsons Foundation, the nonprofit has made big strides in the streaming space  and its proving to be full of opportunity for the charity and its cause.\nDread Pirate Doug and his production team are known in the Sea of Thieves community for organizing and orchestrating events like the Race of Legends, an Amazing Race-style competition where players take their ships around the map and complete strange, difficult, and esoteric challenges. The Race of Legends and its associated circuit has never been a day job for Doug and his crew, but it has proven to be a successful venture with regular and creative challenges for pirates to pursue. A life event inspired Doug to use his platform to try and do some good.\nLast year, my dad was diagnosed with Parkinsons, and it hit me and my family pretty hard, says Doug. Thats when we started raising money for the Parkinsons Foundation. We did several events called Clash for a Cause, where we did a day of Sea of Thieves events back-to-back. People were extremely generous, and we raised over $30,000 in all of those different events.\nAfter the success of these events, the Parkinsons Foundation, which funds research and care for those living with Parkinsons disease, realized streaming was a fruitful new fundraising opportunity.\nWe do new and nontraditional fundraising, including fitness or endurance-related fundraising, or what we call DIY  do-it-yourself fundraising, where people come up with their own events and ideas and we help them get it off the ground, says Zachary Orner, national manager of fundraising events at the Parkinsons Foundation. Doug started a conversation with the nonprofit, which expressed interest in collaboration, but Orner says the Parkinsons Foundation quickly realized that the streaming world was both full of potential and incredibly complex. However, they were prepared thanks to a streamer on staff.\nI started streaming about three or four years ago. At first, I just streamed, but I started to get really into charity streaming  I liked putting events together, bringing the community together, says Michelle Scott, streaming coordinator for the Parkinsons Foundation. Her history includes Call of Duty, Apex Legends, and of course Sea of Thieves. The Parkinsons Foundation allowed her to use her passion for a day job, and her connections to gamers like Doug proved to be a valuable asset. I started talking to [Doug] and then reached out to a couple of other people, and we started on the ground finding those content creators who have a love of raising money for charity.\nDoug connected with the Parkinsons Foundation, and the initiative has gone further than a single charity stream. Now, the Foundation maintains a stream team called the Parkinsons Champions and raises funds for events on Twitch. The organizations first event in December attracted over 4,000 viewers and raised over $16,000 for the cause.\nOrner predicts other charities will turn to streaming as a fundraising source. Weve already seen similar stories, like the animal rescue shelters who used Stray to raise money for real-world stray cats. The Parkinsons Foundation is one of the first charities to grow substantial roots in streaming, and it has helped create an additional space without the limitations of brick-and-mortar institutions or charity races to support people with Parkinsons and their loved ones.\n90,000 people, or more, are diagnosed with Parkinsons every year, says Orner. So theres just going to be more gamers and streamers out there who are going to become part of this community, and if we can have a space for them, were really excited about that.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Sea of Thieves event organizers collaborated with the Parkinsons Foundation to raise tens of thousands of dollars for a great cause.\nHeres how the partnership came to be.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T20:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/sQMtIWlefX-TbU4qOPkK4ICaYyE=/36x0:1965x1010/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399795/c767a615_c45e_4a95_89a6_4ae923ea38fd.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23580232/sea-of-thieves-parkinsons-foundation-charity-streaming"
      }
    },
    {
      "id": "3275544971086435741",
      "title": "Hitmans Freelancer mode makes it one of the best roguelikes ever",
      "url": "https://www.polygon.com/reviews/23581384/hitman-3-freelancer-mode-roguelike-world-of-assassination",
      "description": "Hitman World of Assassinations new free DLC adds a roguelike mode to the trilogy, complete with new objectives, a customizable safehouse, and a slew of \"accidents\" waiting to happen on PlayStation, PC, and Xbox.",
      "body": "Flipboard\nEmail\nThe modern Hitman trilogy  or rather, Hitman World of Assassination, as its now known  has always flirted with the roguelike genre. As the blank slate Agent 47, you drop into clockwork missions in far-flung locales, exploiting targets routines and generally wreaking havoc as creatively as you can. On one run, you poison a target, follow them to the bathroom, and drown them in the toilet mid-puke. On the next, having unlocked a new infiltration point and corresponding disguise, you swap out a golf ball for its explosive twin, watching with glee from the garden as your target then plows a nine iron into his unexpected demise.\nGraphic: James Bareham\nWhat to Watch\n.\nFor more than 22 years, developer IO Interactive has honed its talent for extracting joy from repetition. With its newly released mode, one that fully earns the roguelike moniker, it has almost achieved perfection.\nAs free DLC goes, Freelancer mode is less additional content and more sweeping reimagining. Whereas the base trilogy encourages replaying the same mission over and over  the better to execute the most ingenious and hilarious kills  Freelancer prohibits repeats. You plan a mission with what limited intel you have, improvise in the field, and move on to the next location.\nThis new gameplay loop revolves around taking down four syndicates across increasingly longer series of missions. The first syndicate requires completing two missions before luring out the syndicate leader. At that point, you drop into the last location, identify the leader by patiently watching for tells, and eliminate them. To complete a run, or campaign, you need to kill all four syndicate leaders without dying. In total, youre looking at 18 locations. (If it sounds complicated, dont worry: IO made a pre-brief tutorial video, which you can watch here.)\nImage: IO Interactive\nOf course, this being a roguelike, youre probably going to die  a lot. When you perish, you start a new campaign from the beginning, shuffling the targets, locations, and items, along with a multitude of modifiers and random events. You even lose any lock picks, sedatives, or explosives you had collected in your previous run. The only constant? Your safehouse.\nRelated\nhub worlds\n only continues to grow, IO has crafted a fortress of solitude to rival the best of them. Agent 47s bunker-beneath-a-house is sleek, utilitarian, and, for the worlds foremost assassin, surprisingly cozy. Im reminded of the house in Ex Machina. By rising through the Mastery Ranks of Freelancer mode, you can unlock new rooms, earn more decorations, and fill in the gaps on those weapon walls that every spy worth their salt seems to have. The safehouse, unlike your tools, missions, or targets, does not reset between runs, and improving it is nearly as satisfying as fleshing out Zagreus house in Hades. But while that corner of the underworld is replete with friends and family members, in Hitmans Freelancer mode, Agent 47 is more alone than usual.\nA sense of isolation is paramount in Freelancer, not only in tone, but in function. Whereas Agent 47 had the backing of the International Contract Agency in the vast majority of the trilogys missions, the reticent assassin has since gone well freelance. Hence the need to build the safehouse and arsenal from scratch  but also the need to sift through intel on your own. Series mainstay Diana Burnwood is still here (and still voiced by the phenomenal Jane Perry, of course) to offer a guiding hand, praise successful missions, and bemoan your fuck-ups. But as far as choosing which four syndicates to pursue on any given run  thats on you.\nImage: IO Interactive\nHerein lies the brilliant fulcrum of Freelancer mode. The eight randomized syndicates (represented as tidy dossiers) each have randomized optional objectives that cater to certain play styles. Complete these optional objectives, and youll earn a currency called merces, which you can spend at disguised suppliers scattered throughout each mission.\nHitmans Freelancer mode is something rare: an intoxicating blend of challenge and approachability\nThese optional objectives are just as much a boon as they are a way for IO to push you out of your comfort zone. During my third campaign, I opted to hunt a human trafficker, whose optional objectives mostly revolved around pure stealth. This being my preferred play style in the base trilogy, I had few problems eliminating the low-rung syndicate members with my bare hands, hiding them in freezers, and vanishing without a trace. By the time I arrived at the Isle of Sgil to erase the leader, I had built up a helpful assortment of lock picks, wrenches, and nonlethal poisons, and completed the job without much ado.\nI had also, by happenstance, added a few guns to my weapon wall, and decided to shake things up with my second syndicate: a group of arms dealers. The optional objectives for these missions required going loud, as they say  killing three guards with a shotgun, eliminating a target with a sniper rifle, and so forth. While these didnt conform to my usual methods, this syndicate would bring me to some of my favorite locations (Whittleton Creek, New York, Berlin, and the Maldives).\nImage: IO Interactive\nHow did it go? Not great, Bob! Because I went guns blazing at the first two locations, I spooked the higher-ups in subsequent locations. These missions gained the On Alert status, making it far more difficult to sneak through them unnoticed, regardless of my disguise. I spawned in the parking garage in New York, botched a strangle attempt, and fell to the ground in a storm of lead.\nTheres an array of other modifiers and randomized events that can pop up in each campaign, but frankly, I dont want to spoil them here. Half of the fun of Freelancer mode is breezing through one or even two syndicates, only to open your third dossier and realize how much your greed for merces has screwed you over. But you drop into the next location anyway, because improvising is half the fun  and half the comedy  of this excellent series.\nHitmans Freelancer mode is something rare: an intoxicating blend of challenge and approachability. It plays on the hubris of longtime players, but also guides newcomers with thematic objectives and a more explicit overall structure. It may not allow for the micro-repetition that makes the base trilogy tick. But it does maintain a rapid momentum from the beginning of each run to its bitter, comical end. After so many hours spent with this trilogy, combing each of its locations for something, anything I missed, I did not think it possible for IO to surprise me anymore  but here we are.\nHitman World of Assassination\ns Freelancer mode\nwas released on Jan. 26 on PlayStation 4, PlayStation 5, Windows PC, Xbox One, and Xbox Series X. The DLC was reviewed on Xbox. Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. You can find",
      "snippet": "Hitman World of Assassinations new free DLC adds a roguelike mode to the trilogy, complete with new objectives, a customizable safehouse, and a slew of \"accidents\" waiting to happen on PlayStation, PC, and Xbox.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T19:16:35",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/KDialbTr9903VlRdnkY6eGGAWGY=/0x0:2560x1340/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401856/hitman_hed.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/reviews/23581384/hitman-3-freelancer-mode-roguelike-world-of-assassination"
      }
    },
    {
      "id": "5346561866234161271",
      "title": "Is The Legend of Zeldas Triforce the hottest gaming tattoo? Probably",
      "url": "https://www.polygon.com/zelda/23580122/legend-of-zelda-triforce-tattoo",
      "description": "It seems like everyones got a Zelda tattoo  particularly of the iconic Triforce, which stands for courage, wisdom, and power. Heres why everyone wants one of the most popular gaming tattoos.",
      "body": "Email\nThis story is part of a group of stories called\nIn 2023, Polygon is embarking on a Zeldathon. Join us on our journey through The Legend of Zelda series, from the original 1986 game to the release of The Legend of Zelda: Tears of the Kingdom, and beyond.\nTheres more to the Triforce than just a few triangles. Its a symbol for power, courage, and wisdom  the ultimate source of strength and influence. Its been in every Zelda game since The Legend of Zelda was released in Japan in 1986  though in the first game, Link was only in search of two, the Triforce of Wisdom and the Triforce of Power. But it was Zelda 2: The Adventure of Link where Nintendo first introduced the motif into the game, symbolically bringing together the individual triangles into the iconic Triforce.\nIn 2023, Polygon is embarking on a Zeldathon. Join us on our journey through The Legend of Zelda series, from the original 1986 game to the release of The Legend of Zelda: Tears of the Kingdom and beyond.\nIts so simple but easily recognizable. You can identify a Triforce holder by the glowing seal of light on their hand, a visual shorthand for all that Link stands for. It was practically made to be a tattoo  an actual tattoo, scratched into skin with needles and ink.\nAnd so its no surprise that Triforce tattoos are one of the most popular gaming tattoos. One tattoo artist estimated hed done more than 60 in a single year. Its hard to overstate the ubiquity of the Triforce tattoo; youve surely seen them don arms and legs locally, and there are pages and pages of Triforce tattoos on Google and in Reddit threads. Thousands of people have tagged images on Instagram with #triforcetattoo. There are jokes, too: \n, reads one facetious jab at the iconography.\nThe Triforce on Links hand in The Legend of Zelda: Skyward Sword\nImage: Nintendo\nThe four tattoo artists I spoke to agreed its an immensely popular option  one tattoo artist even has seven Triforce tattoos speckling their body. Beyond the popularity of the games, tattoo artist Kim Hikaru said Triforce tattoos are more accessible; a simple one can cost less, take less time to do, and can be easily hidden.\nA good icon to tattoo is simple in design, tattoo artist Jess Soares told Polygon. Its something that can be seen from far away and makes you go, Hey! Is that a Zelda tattoo? The Triforce definitely does that.\nPhoto: Sabrina Camacho\nSabrina Camacho\n, an artist who tattoos at Snowbird Studio in Austin, Texas, agreed: The Triforce is such recognizable and subtle iconography, they said. I think people get Triforce tattoos because theyre all-encompassing. Everyone has their first Zelda game, the Zelda game they spent the most time replaying as a kid, and their favorite Zelda game of all time. And the Triforce is the icon that connects them all  throughout all of the lore, art styles, and characters, it stays.\nThis often gives the Triforce tattoo a deeply personal significance to those who have one. Nathalia de Matos, a 33-year-old medical lab technician in New Zealand, said the games have a close connection to her family; she played The Legend of Zelda with her parents and siblings when she was about 4, having just moved from Brazil to the United States. The earliest example I have is from a home video that my mother took of me and my siblings watching and cheering on my father whilst he played the first Legend of Zelda, she said. The games continued to play a role in her life as a source of escapism, she said. The tattoo was a way for me to give thanks for the comfort that the franchise provided throughout my childhood and into my late 20s. Its her only tattoo.\nHikaru, the tattoo artist, said he had a client who got the Triforce tattoo after he survived cancer; the courage triangle is glowing, the rest all gray.\nTheres a sense of community among people who have Triforce tattoos. Playing video games is sometimes talked about as a loner hobby, a person alone with the glow of a screen and a hard plastic controller. Theres truth to that, but video games also bring people together  in online communities sharing tips and tricks; in parks battling in Pokmon Go; huddled around a screen, stuffed on a couch and spilling out onto the floor; and yes, perhaps, in pointing at your Triforce tattoo while passing someone on the street in a Zelda shirt.\nPhoto: Nicole Carpenter/Polygon\nI didnt intend to get a Triforce tattoo. Id booked an appointment to get a portrait of Zelda, though  an American traditional style ladyhead. The tattoo artist, familiar with the games, asked if I wanted to slap it in an empty spot on my arm alongside the original tattoo. I shrugged and said sure. I am a walking poster child for the idea that tattoos, while permanent, dont have to have deeper significance or meaning. You can simply like a design, or a game, or a book, and get art of it inked into your body. I love the game and the design so I got it. Still, I see how powerful the symbol can be: So many people have come up to me, a total stranger, to talk about it. Sometimes its just, Hey, I like that game, too! but other times its a short, meaningful story.\nIt makes me happy that people found some solace and community with Legend of Zelda and the Triforce symbolism, Nicholas Jakic, a 30-year-old construction salesperson, told Polygon. I love when people point mine out and say that they like it and then show off theirs too. It is a very fun connection to have. I think most of the time its a very levelheaded way of connecting.\nLoading comments...",
      "snippet": "Email This story is part of a group of stories called In 2023, <b>Polygon</b> is embarking on a Zeldathon. Join us on our journey through The Legend of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T19:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/OP40CV49TAGGYo8LJLLLla-Y2mg=/0x883:1515x1676/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399594/Triforce_Tattoo__1_.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/zelda/23580122/legend-of-zelda-triforce-tattoo"
      }
    },
    {
      "id": "3590501241258930894",
      "title": "Logan director may take on Swamp Thing movie for James Gunns new DCU",
      "url": "https://www.polygon.com/23581571/swamp-thing-movie-dcu-director-james-mangold",
      "description": "James Mangold, who directed superhero movies like Logan  and The Wolverine and is directing the upcoming Indiana Jones and the Dial of Destiny, may be the first named director for James Gunns new DCU.",
      "body": "New DC Studios co-CEOs\nJames Gunn and Peter Safran unveiled their plans for the upcoming DC movie slate Tuesday, with new Batman and Superman projects among the many titles announced.\nOne of those titles is a feature movie adaptation of Swamp Thing, one of five movies announced. And the Swamp Thing movie may have found its director in James Mangold, who is reportedly in talks to take on the project.\nRelated\nHeres the official DC movie slate under James Gunn\nMangold is perhaps best known for the critically acclaimed superhero movie Logan, but he also directed the underrated The Wolverine (which greatly benefits from being the rare superhero movie with a local rather than global conflict, and also by having an\nawesome fight scene on a train\n). Hes a veteran director who has taken on many different kinds of projects to critical and commercial success, including the excellent Sylvester Stallone drama Cop Land, the renowned psychological drama Girl, Interrupted, the fun buddy comedy Knight and Day, and the Oscar-nominated Ford v Ferrari. Mangold is also directing the upcoming Indiana Jones and the Dial of Destiny.\nSwamp Thing originated in 1971s House of Secrets #92, and it has appeared in two movies, including 1982s Swamp Thing from Wes Craven. A short-lived television show on the short-lived streaming platform DC Universe, also titled Swamp Thing, was cancelled soon after premiering and lasted only 10 episodes. The character also showed up in the most recent season of Harley Quinn.\nSwamp Thing is often a tragic hero; my colleague Susana Polo described the character as essentially the personification of The Will of All Plants who accidentally absorbed the memories of a dead scientist. Swamp Thing is basically a swamp monster whose main goal is to protect its swampy home, and the environment more generally. Alan Moores run with the character in the late 1980s is particularly well-received, if youre interested in checking it out before the movie. Swamp Thing stories are generally more horror-oriented, which would be a first for Mangold, who has worked in essentially every other genre.\nNext Up In",
      "snippet": "James Mangold, who directed superhero movies like Logan and The Wolverine and is directing the upcoming Indiana Jones and the Dial of Destiny, may be the first named director for James Gunns new DCU.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:59:55",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/NrDdW2NYPaeLONT8E5GNLPsZsEI=/0x0:3984x2086/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401909/1422640277.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23581571/swamp-thing-movie-dcu-director-james-mangold"
      }
    },
    {
      "id": "5020953806857308469",
      "title": "Why Netflix and Wit Studios new short is so controversial",
      "url": "https://www.polygon.com/23581376/netflix-wit-studio-short-film-ai-controversy",
      "description": "\"The Boy & The Dog\" was created using AI-generated backgrounds. Netflix cited a labor shortage as the reason behind the experiment. Many have pointed out that animators in Japan are very underpaid.",
      "body": "Flipboard\nEmail\nNetflix and Wit Studio, the animation production company behind Spy x Family and Attack on Titan, have released a new short film. Titled The Dog & The Boy, the short follows a boy who discovers a robotic dog before theyre separated by a great tragedy. Its emotional and cute, but the most noteworthy thing about this short isnt the storyline  its the fact that the backgrounds were generated by artificial intelligence.\nThe Netflix Japan tweet about the short explains that this method is an experimental effort to help the anime industry, which has a labor shortage. A blog post on the Netflix Japan site goes into more detail about the process.\nAI to create art\nhas become a very controversial topic in the past few months. With tools like DALL-E, Midjourney, and Free AI Art Generator rising in popularity over the past year, many artists have spoken out about how these programs utilize their art without consent and how their specific art styles can be replicated with just a string of words typed into one of these programs. The #SupportHumanArtists movement started to call attention to the ethical issues that come with AI usage.\nOn Twitter, many users have called out Netflix and WIT Studio for this short film and for the possibility of using AI tools to replace background artists. The animation industry in Japan, in particular, already faces a lot of issues, chief among them the fact that many animators are underpaid.\nNetflix Japan has moved to AI quoting a \"Labor Shortage\", when they just laid off hundreds of animators and cut hundreds of animation projects. #SupportHumanArtists is so important right now",
      "snippet": "\"The Boy & The Dog\" was created using AI-generated backgrounds.\nNetflix cited a labor shortage as the reason behind the experiment.\nMany have pointed out that animators in Japan are very underpaid.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:43:16",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/SMLXsWFKK59_N2lChCkh3JodWas=/0x35:1591x868/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401732/Screen_Shot_2023_02_01_at_12.56.35_PM.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23581376/netflix-wit-studio-short-film-ai-controversy"
      }
    },
    {
      "id": "6175509636131755883",
      "title": "Pokmon Go Team Go Rocket leaders and boss guide",
      "url": "https://www.polygon.com/pokemon-go-guide/23579975/team-rocket-leader-counters-sierra-arlo-cliff-party-weaknesses",
      "description": "In Pokmon Go, youll need to take down the Team Go Rocket leaders Cliff, Siera, and Arlo to complete Special Research. We list their counters for February 2023.",
      "body": "has its own version of the notorious Team Rocket, called Team Go Rocket. In this Pokmon Go guide, well break down how to find the Rocket leaders and take them down.\nBelow, we list out their parties and strategies that are effective for February 2023, as part of the Team Go Rocket Takeover event that activated as part of the Cracking Voltage event.\nHow to find Sierra, Cliff, and Arlo in Pokmon Go\nTeam Go Rocket members can be found in hot air balloons flying above you or from glitchy, black PokStops. Each time you defeat one, youll get a Mysterious Component. After you get 6 Mysterious Components, theyll combine into a Rocket Radar, which allows you to find a random leader. The three leaders are Sierra, Arlo, and Cliff.\nSome Timed Research and Team Go Rocket Special Research tasks require you to beat all three leaders. Completing the Team Go Rocket Special Research will reward you with a Super Rocket Radar, allowing you to find the boss, Giovanni. Beating Giovanni will net you a Legendary Shadow Pokmon.\nTeam Go Rocket leader Sierra counters\nImage: Niantic\nSierra can have the following:\nBeldum (steel/psychic)\nAlakazam (psychic)\nShiftry (grass/dark)\nDepending on what she has in her party, we recommend using ghost-, dark-, or fighting-type Pokmon. Sierras part is the most potentially diverse out of the three, which makes her harder to match up against with specific Pokmon types. If you figure out what shes using, you may need a different type of Pokmon for each of hers.\nRelated\nWe recommend using the following, but make sure to pay attention to what Sierras using, as these arent effective against all of her available options:\nMachamp with Counter and Dynamic Punch\nHydreigon with Bite and Brutal Swing\nDarkrai with Snarl and Dark Pulse\nChandelure with Hex and Shadow Ball\nGengar with Lick and Shadow Ball\nTeam Go Rocket leader Arlo counters\nImage: Niantic\nArlo can have the following:\nNidoran (poison)\nTyranitar (rock/dark)\nCamerupt (fire/ground)\nCliffs team is largely weak to either fire-, grass-, or water-type moves. You can use lots of the counters we recommended against the other two leaders against him, but again, youll need to check his party to make sure your counters are lined up, as he can have a pretty diverse party.\nWe recommend using any of the following:\nKyogre with Waterfall and Surf\nSwampert with Water Gun and Hydro Cannon\nReshiram with Fire Fang and Fusion Flare\nCharizard with Fire Spin and Blast Burn\nVenusaur with Razor Leaf and Frenzy Plant\nTorterra with Razor Leaf and Frenzy Plant\nTeam Go Rocket leader tips\nIf youre struggling against the leaders, heres a few tips to keep in mind:\nThey will use their shields on the first two Charge Attacks you use. Using a Pokmon that can charge and use Charge Attacks quickly will help you get rid of their shields, allowing you to freely damage them.\nYou should be prepared for the first Pokmon you use to get knocked out. If you use a Pokmon that gets through shields easily, thats fine, but your other Pokmon will need to have decent type advantages to defeat any remaining Pokmon.\nRemember, you can attempt the battle many times using one Rocket Radar, so you can queue up your strongest Pokmon just to see what the leader is carrying. If you defeat them on the first try, great! If not, you can swap your party around for some type-effective counters.\nThe team leaders have high CP Pokmon, so you should definitely be using the highest CP Pokmon you have if youre struggling.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "In Pokmon Go, youll need to take down the Team Go Rocket leaders Cliff, Siera, and Arlo to complete Special Research.\nWe list their counters for February 2023.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:30:55",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/cqZHo1xyNSLbYwUfoA2UP2787ks=/0x152:1800x1094/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19253208/teamrocketadmins.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/pokemon-go-guide/23579975/team-rocket-leader-counters-sierra-arlo-cliff-party-weaknesses"
      }
    },
    {
      "id": "516374739913656998",
      "title": "Knock at the Cabin review: M. Night Shyamalan returns to form",
      "url": "https://www.polygon.com/reviews/23581395/knock-at-the-cabin-review-m-night-shyamalan-dave-bautista",
      "description": "The latest film from M. Night Shyamalan, Knock at the Cabin follows a family trapped by a man (Dave Bautista) who says one of them has to die or the world will end. In theaters Feb. 3.",
      "body": "Flipboard\nEmail\nLike Taylor Swift, Shakespeare had a lot to say about reputation. In Othello, when the noble Cassio mourns the tarnishing of his reputation, which he identifies as the immortal part of myself, the duplicitous Iago talks him out of being so precious, and says a good reputation is an idle and most false imposition, oft got without merit and lost without deserving. Theres a kernel of truth in both Cassios lament and Iagos dig: Reputations are hard-won and easily lost, and they involve a frustrating number of other people, none of whom need to be well informed as they help burnish it or burn it down. Writer-director M. Night Shyamalan has been dogged by his reputation since his breakout hit The Sixth Sense. His rep casts a shadow over every movie hes made since. But his latest, Knock at the Cabin, might be the first one in decades that his reputation actually improves.\nThat doesnt seem to be the case at first. In keeping with recent Shyamalan movies like Old,  Knock at the Cabin is a straightforward affair, a story that doesnt deviate from what the trailers show. Eric (Jonathan Groff) and Andrew (Ben Aldridge) are a happy couple on a woodsy getaway in a remote cabin with their young daughter, Wen (Kristen Cui). Their pleasant vacation is cut short when a man named Leonard (Dave Bautista) arrives with three associates in tow. With complete conviction, he says the world is ending, and the only way to stop it is for one of the family members to kill another.\nPhoto: Phobymo/Universal Pictures\nAdapting Paul G. Tremblays 2018 novel The Cabin at the End of the World, Shyamalan and his credited co-writers craft the source material into a taut psychological thriller that slowly pivots from home-invasion paranoia to existential horror. Leonard and his companions claim that theyre normal people who do not want to hurt the family at the heart of the film, and their actions seem to bear that out. Theyre apologetic, remorseful, even caring. They truly believe that the apocalypse is imminent, and that the only way to avert it is for Andrew, Eric, and Wen to designate one member of their family as a sacrifice. The invaders are willing to trap the family in their cabin for as long as it takes them to make that sacrifice.\nWith the action largely confined to one location, and the bulk of the story dedicated to a small cast wrestling with a tense, unbelievable situation, Knock at the Cabin feels like a play. Its success rests squarely on what the performers bring to the material. No one bears that weight more than Bautista, who has to sell the conviction of Leonards beliefs both to his victims and to the audience while giving credence to all the things Leonard becomes in their collective imaginations: a menace, a lunatic, a bigot, a sadistic murderer, or, most frightening of all, a sincere man receiving visions from a supernatural source.\nHis powerful conviction is the real horror of Knock at the Cabin. Leonard believes in absolutes in a world that offers none, and his soft speech and apparent sorrow over his actions makes him frightening in a way that makes Bautistas hulking, threatening physicality entirely secondary. The scary thing about Leonard isnt that he might hurt someone. Its that he might be right.\nPhoto: Phobymo/Universal Pictures\nShyamalan is playing in familiar territory here, revisiting the crisis-of-faith theme that fueled his initial wave of success with films like The Sixth Sense and Signs. In other words, its diving headfirst into ideas his more recent work has carefully avoided. Shyamalans midcareer nadir was characterized by his storytelling tics devolving into something like self-parody in films like The Village and Lady in the Water, a grim preface to the twin big-budget failures of The Last Airbender and After Earth. In the time since, hes rebuilt his reputation on the back of pulpy psychological thrillers like The Visit, Split, and Old.\nCombining his favorite ideas and his recent trends makes Knock at the Cabin uneven once it shifts from its horror intro into heavier subject matter. Shyamalan has always been a restrained director with a knack for making the space in a scene disappear, so that even the wide-open spaces of a field in The Happening or a beach in Old all feel slightly claustrophobic. In Knock at the Cabin, the abundant woods around the titular cabin slowly suffocate the protagonists, isolating them and keeping them from knowing whether the apocalypse Leonard says is in progress is even real. The trees that seem soothing in the early going of the film soon shiver with anxiety, and Shyamalans fondness for uncomfortable close-ups highlights the ways faith and doubt can transform a person from one moment to the next.\nIts all extremely effective, mesmerizing stuff, undercut by Shyamalans habits as a blunt, obvious writer. Characters say things plainly that would be better left unsaid. Answers are given where questions would sit better. And some of the details are just plain nonsensical. In his rewriting of a script from Steve Desmond and Michael Sherman, the Shyamalan of yore  the guy known for big twist endings and overly serious, turgid takes on pulp thrillers  collides with the modern Shyamalan and his odd, off-key restraint. The result is fascinating for those willing to consider it, but also a frustrating reminder of the baggage its director brings to all of his work.\nPhoto: Phobymo/Universal Pictures\nFew genre filmmakers were as openly spiritual as Shyamalan in his heyday, and the tension between his messy earnestness as a writer and his more calibrated, stylish approach to visual storytelling is part of what makes him such a polarizing artist. His contemporary films are easier to love because they lean hard on the latter, but the most endearing thing about him might be the fact that he cant stop thinking about how scary it is to believe in something, how horrible and beautiful a thing like faith can be even to those who embrace it. M. Night Shyamalan, as presented through his body of work, feels compelled to believe in some higher power, but is unable to quiet his rational mind. Knock at the Cabin, in some ways, is about this tension, and about coming to peace with the answer he reaches.\nAs uneven as Knock at the Cabin is, its the work of a more complete Shyamalan than even the director who made Old two years ago. Its a film from a creator whos interested in probing the ideas of his earlier work with the style and workmanlike rigor of his comeback era. In turning his gaze toward the apocalypse, a messy, complicated filmmaker finally turns to the most neglected aspect of his reputation: that of a believer. By the time the credits roll, theres an argument to be made that M. Night Shyamalan seems to know where he stands, and it doesnt really matter to him what anyone makes of it.\nKnock at the Cabin\nopens in theaters on Feb. 3.\nWhat to Watch\n8 movies like Dead Space to watch as a break from vivisecting Necromorphs\nMovies\nInfinity Pool fills the screen with ",
      "snippet": "The latest film from M.\nNight Shyamalan, Knock at the Cabin follows a family trapped by a man (Dave Bautista) who says one of them has to die or the world will end.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T18:05:46",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/flF-5jJpGyakP-9sF3AOtoOXwcw=/0x0:3840x2010/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401886/5765_D010_00050R.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/reviews/23581395/knock-at-the-cabin-review-m-night-shyamalan-dave-bautista"
      }
    },
    {
      "id": "915184156572266794",
      "title": "PlayStation Plus Collection shuts down on PS5 in May",
      "url": "https://www.polygon.com/playstation/23581400/playstation-plus-collection-ending-date-games-list",
      "description": "Sonys PlayStation Plus Collection for PlayStation 5 is coming to an end on May 9. The 20 games available to PS5 owners who subscribe to PS Plus will be redeemable for the next 3 months.",
      "body": "Email\nImage: Sony Interactive Entertainment\nPlayStation 5 owners have just a few months to redeem the titles included in the PlayStation Plus Collection, a list of 20 games from the PlayStation 4 era that were included with a PlayStation Plus subscription if you owned a PS5. Games in the PlayStation Plus Collection can be redeemed through May 9, and players who do redeem them will have access to the collection for as long as you remain a PlayStation Plus member, Sony says.\nSony Interactive Entertainment announced the removal of the PlayStation Plus Collection on Wednesday, but did not specify why the perk was going away. The PS4 games included in the PlayStation Plus Collection are as follows:\nBatman: Arkham Knight\nCall of Duty: Black Ops 3\nCrash Bandicoot: N-Sane Trilogy\nFinal Fantasy 15 Royal Edition\nGod of War (2018)\nThe Last of Us Remastered\nUncharted 4: A Thiefs End\nUntil Dawn\nThe PlayStation Plus Collection was introduced for the PlayStation 5s launch in November 2020, and helped bolster a relatively soft launch lineup of games exclusive to Sonys current-gen console. The perk is available to all PlayStation Plus subscribers from the Essential level and higher, but now that the PS5 library has grown  and that Sony says it has solved supply constraints around its current console  the company may no longer feel the need to use a bunch of older PS4 games as an incentive to buy a PS5.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Sonys PlayStation Plus Collection for PlayStation 5 is coming to an end on May 9.\nThe 20 games available to PS5 owners who subscribe to PS Plus will be redeemable for the next 3 months.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T17:56:47",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/nkfRi_LnAMpdqr8G5YbdwZTJO4k=/0x40:2048x1112/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401682/Fn5USB_WQAUjPKO.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/playstation/23581400/playstation-plus-collection-ending-date-games-list"
      }
    },
    {
      "id": "4121996918489331968",
      "title": "World first Final Fantasy 14 raid team embroiled in cheating scandal",
      "url": "https://www.polygon.com/23581166/final-fantasy-14-omega-ultimate-controversy-third-party-plug-in",
      "description": "A record-setting raid team in Final Fantasy 14 sparked controversy after a video revealed members of the team used third-party mods. In response, the games director Naoki Yoshida (Yoshi-P) said hes \"extremely disappointed\" and Square Enix has stripped the team of its achievement.",
      "body": "Email\nImage: Square Enix\nThe world of Final Fantasy 14 has become embroiled in what might be its biggest controversy yet.\nOn Jan. 30, a team of players were the first to complete a high-difficulty raid called The Omega Protocol  an achievement thats called a world first in raiding communities. Just hours later, footage uploaded to YouTube showed one team member using a third-party mod to help clear the raid. This reveal, which documented the use of an illicit tool in worldwide challenge, has touched nearly all ends of the Final Fantasy 14 community, from regular players to top developers at Square Enix.\nDirector and producer Naoki Yoshida responded candidly to the matter by saying the use of third-party tools was extremely disappointing. Developers and moderators took swift punitive action by stripping all members of the team of their achievements and titles.\nIt is extremely disappointing for me personally to see this commotion surrounding third-party tools once again in the wake of what happened with Dragonsongs Reprise (Ultimate), Yoshida wrote. As the individual who is entrusted with full supervision over FFXIV, it is my responsibility to enact countermeasures and police the use of these tools, as well as educate people to not use these types of third-party tools  this is especially unfortunate when I, as a gamer, am cheering on everyone who is learning this content by trial and error and putting in the effort to clear.\nDragonsongs Reprise (Ultimate)\nwas a similar incident in which developers grappled with the use of third-party tools on the part of players clearing content.\nAdditionally, Yoshida reiterated that he has never supported the use of third-party tools, and that such tools are strictly forbidden in Final Fantasy 14s terms of service. He said later in the post that the ultimate raids are the most difficult content in the game, and the team releases content only after ensuring it can be cleared without the use of third-party tools. However, if the presumption is that this content will be tackled and cleared with the use of third-party tools, then any reason to develop high-difficulty battle content seems to be lost, he said.\nDevelopers added The Omega Protocol on Jan. 24 as part of the 6.31 patch. As is tradition, the World Race for Charity stream initiated a worldwide race to clear the raid. On Jan. 30, about a week after the boss launched, members of a Japanese team called Unnamed_ shared screenshots documenting that they had been the first to clear the challenge. However, video evidence uploaded just hours later showed that at least one of the players used third-party tools to adjust the camera angle of the field so that it was more zoomed out.\nUse of third-party mods in Final Fantasy 14 isnt novel. Almost every elite player will use third-party tools of some kind that will help with tasks like tracking damage or buffs. However, its not often that players get caught  Final Fantasy 14 doesnt have anti-cheat software  and whats more, this particular case is a rather extreme use of third-party tools. This particular tool was not simply keeping a log to help a player, but altering the way they would see and experience the game. The news sparked conversations about what can and should be considered to be cheating. Additionally, it also inspired a lot of memes poking fun at the exploit.\nAs for whats in store for Final Fantasy 14 players, it seems developers and moderators are hell-bent on enforcing punishments to those who use third-party plug-ins. In a correspondence shared by a member of Unnamed_, which was translated by PCGamer, even members of the team who didnt use plugins would still get their titles and achievements revoked. The player was told by a FF14 GM, Although you did not commit any cheating directly yourself, you still took advantage of that cheating, and therefore profited from it.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "A record-setting raid team in Final Fantasy 14 sparked controversy after a video revealed members of the team used third-party mods.\nIn response, the games director Naoki Yoshida (Yoshi-P) said hes \"extremely disappointed\" and Square Enix has stripped the team of its achievement.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T17:37:31",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/q9fwRZO49tKuJa6zElgGiiNODRs=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401254/RyElCxlR6s7mFt4f_Yn_tMSwBI.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23581166/final-fantasy-14-omega-ultimate-controversy-third-party-plug-in"
      }
    },
    {
      "id": "2055038936705164331",
      "title": "Disney Plus February 2023 new releases",
      "url": "https://www.polygon.com/entertainment/2023/2/1/23578040/disney-plus-new-movies-tv-watch-february-2023",
      "description": "Black Panther: Wakanda Forever, Star Wars: The Bad Batch, The Owl House and more.  Heres every movie and show coming to Disney Plus in Feb. 2023.",
      "body": "Disney Plus\nlaunched in 2019 with most of Disneys back catalog, but the platform still hasnt reached maximum capacity just yet. In addition to original content, like the currently airing National Treasure series, a host of older movies and shows trickle onto Disney Plus each month.\nThis month both National Treasure: The Edge of History and Star Wars: The Bad Batch have season finales. Black Panther: Wakanda Forever hits Disney Plus at the beginning of the month, with a few Ant-Man-related specials coming later to prep for the new movie. Also, a new Up short about Carl going on a date, the newest episode of The Owl House, and a new season of The Proud Family: Louder and Prouder arrive on the platform throughout the month.\nAvailable Feb. 1\nMiraculous Tales of Ladybug & Cat Noir (S1, S2, S3)\nPuppy Dog Pals (S5, 3 episodes)\nO Coro: Sucesso, Aqui Vou Eu (S1)\nThe Chorus: Success, Here I Go Season 1 Premiere All Episodes Streaming\nFrom Disney: Ten young artists reach the final round of auditions to join the Theater Company. They will face their dreams, passions, fears, and uncertainties of the past, which may define their future.\nThe Proud Family: Louder and Prouder Season 2 Premiere All Episodes Streaming\nImage: Disney\nFrom Disney: The Proud Family: Louder and Prouder picks up the story of its central character, Penny Proud, and her iconic family: parents Oscar and Trudy, twin siblings BeBe and CeCe, and grandmother Suga Mama (and Puff!). By Pennys side is her loyal crew: Dijonay Jones, LaCienega Boulevardez, Zoey Howzer, Maya Leibowitz-Jenkins and Michael Collins.\nBuilding off the standout success of the series debut, season two of The Proud Family: Louder and Prouder continues to tell entertaining and laugh out-loud stories, while highlighting culturally specific experiences of the Black community and addressing universal topics. Various storylines this season include self-worth, interracial dating and Juneteenth.\nNational Treasure: Edge of History Episode 9 A Meeting with Salazar\nFrom Disney:After getting captured by Billie, all hope of saving the treasure seems lost for Jess. Tasha, Oren, Ethan, and Liam try to track Jess down using Tashas tech skills. Meanwhile, Liam finds a hidden cypher left behind by his grandpa, which holds the truth about Billie and the mysterious Salazar.\nStar Wars: The Bad Batch Episode 206 Tribe\nFrom Disney: When the new season opens, months have passed since the events on Kamino, and the Bad Batch continue their journey navigating the Empire after the fall of the Republic. They will cross paths with friends and foes, both new and familiar, as they take on a variety of thrilling mercenary missions that will take them to unexpected and dangerous new places.\nAvailable Feb. 3\nDance Moms (S1, S2, S7)\nDance Moms: Miami (S1)\nForged in Fire: Knife or Death (S1, S2)\nForged in Fire (S4)\nHamster & Gretel (S1, 5 episodes)\nHistorys Greatest Mysteries (S1, S2)\nIce Road Truckers (S11)\nMan vs. Child Chef Showdown (S2)\nMe & Mickey (Shorts) (S1, 7 episodes)\nThe Owl House (S3, 1 episode)\nImage: Disney\nThe Proof Is Out There (S1, S2)\nRescue Cam (S1)\nStorage Wars: Barrys Best Buys (S1)\nStorage Wars: Miami (S1)\nStorage Wars: New York (S1, S2)\nStorage Wars (S14)\nMarvel Studios Assembled: The Making of Black Panther: Wakanda Forever Premiere\nFrom Disney: Follow the production of Black Panther: Wakanda Forever in this episode of Assembled, as the cast and crew take on the incredible challenge of and remembering TChalla, with a chapter befitting the late king. Through intimate behind-the-scenes footage and interviews, watch Shuri take on the mantel of Wakandas hero and face a new foe from the oceans depths in Namor.\nNational Treasure: Edge of History Finale Episode 10 Treasure Protectors\nFrom Disney: Jess and her allies try to outwit Billie using Jesss knowledge of puzzles and history to escape and protect the treasure.\nStar Wars: The Bad Batch\nEpisode 207 The Clone Conspiracy\nEpisode 208 Truth and Consequences\nAvailable Feb. 10\nPeople Presents: Once Upon a Main Street\nThe Real MVP: The Wanda Durant Story\nThe Santa Con\nToni Braxton: Unbreak My Heart\nTurkey Hollow\nVictoria Gotti: My Fathers Daughter\nDug Days: Carls Date Premiere\nFrom Disney: In Pixar Animation Studios special short, Carls Date, Carl Fredricksen reluctantly agrees to go on a date with a lady friendbut admittedly has no idea how dating works these days. Ever the helpful friend, Dug steps in to calm Carls pre-date jitters and offer some tried-and-true tips for making friendsif youre a dog.\nMarvel Studios Legends\nAnt-Man\nFrom Disney: LEGENDS traces those moments big and small that transformed Scott Lang into the tiniest of Earths mightiest heroes. Scott faces off against powerful adversaries, meets the love of his life, and becomes the dad he was destined to be. Oh, and its the Ant-Man who winds up providing the key to defeating Thanos and saving the universe. Hes kind of a huge deal.\nHank & Janet\nFrom Disney: Hank Pym and Janet Van Dyne were the original Ant-Man and Wasp, but after an epic show of bravery, Janet was lost forever or so Hank thought. LEGENDS chronicles Hanks journey, as he goes from dedicated scientist, to overprotective father. Eventually, with the help of burglar-turned-hero Scott Lang, Hank and his daughter rescued Janet from the Quantum Realm, and the remarkable family was reunited.\nWasp\nFrom Disney: All her life, Hope was shielded from the action by her overprotective father, inventor Hank Pym. But when the Pym Particles fell into the wrong hands, Hope reluctantly trained a thief named Scott Lang to become the Ant-Man. In time, Hope donned a suit and wings herself, and was transformed into The Wasp. LEGENDS follows Hopes journey, one that leads to her fighting alongside the Avengers.\nAvailable Feb. 15\nCesar Millan: Better Human Better Dog (S3)\nDian Fossey: Secrets in the Mist (S1)\nMars (S1)\nMarvels Moon Girl and Devil Dinosaur (S1, 6 episodes)\nSuperKitties (S1, 7 episodes)\nMila in the Multiverse Season 1 Premiere All Episodes Streaming\nFrom Disney: Mila is 16 years old and living the adventure of her life traveling through the multiverse in search of her mother, Elis. As she travels, she will come face to face with The Operators, a mysterious and dangerous group that wants to exterminate all universes. She will have to face them in order to save the vast multiverse.\nStar Wars: The Bad Batch\nImage: Lucasfilm\nInside Airport Lost & Found\nMaking the Wish: Disneys Newest Cruise Ship\nAvailable Feb. 22\nTo Catch a Smuggler (S4)\nUltimate Airport Dubai (S1, S2, S3)\nThe Low Tone Club Premiere All Episodes Streaming\nFrom Disney: The Low Tone Club follows the story of Amaranto Molina, an unconventional music teacher who starts teaching at a music school that only encourages students who do well by commercial success standards. Every year Principal Eduardo Kramer, chooses five students, nicknamed The High Tones, to be part of the schools prestigious Teen Band. Molina, on the other hand, is put in ",
      "snippet": "Black Panther: Wakanda Forever, Star Wars: The Bad Batch, The Owl House and more.\nHeres every movie and show coming to Disney Plus in Feb.\nDisney Plus launched in 2019 with most of Disneys back catalog, but the platform still hasnt reached maximum capacity just yet.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T17:00:04",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/YhNklg8p5sS2WJC7o-jPND75wow=/405x0:3595x1670/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24077268/PRO3280_TRL_comp_ILM_v0005.1042_R.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/entertainment/2023/2/1/23578040/disney-plus-new-movies-tv-watch-february-2023"
      }
    },
    {
      "id": "3624862995997014614",
      "title": "Hamilton Lane, $830 Billion Investing Heavyweight, Comes to Polygon (MATIC): Details",
      "url": "https://u.today/hamilton-lane-830-billion-investing-heavyweight-comes-to-polygon-matic-details",
      "description": "Legendary asset management firm Hamilton Lane unveils its Polygon-based instrument for individual investors",
      "body": "January 31, 2023\nAs the partnership kicks off,Hamilton Lane openspart of itsEquity Opportunities Fund V to awide group ofindividual investors viaSecuritize's feeder fund. The tokenized fund lowers the \"entry barrier\"from investors by afactor of 250 times, from $5 million to $20,000.\nHamilton Lane and Securitize are going to launch two more funds with tokenized access in coming months.Colin Butler, global head of institutional capital at Polygon Labs, stresses the importance of this release for the entire segment of individual investors:\nAds\nAds\nThe tokenization of private funds is a massive leap forward for investors and fund managers  a broader pool of investors enticed by greater opportunity and disintermediation  but also for the greater understanding that practical applications of blockchain will make a marked difference in democratizing financial opportunity. Polygon makes these asset classes accessible, secure, and scalable, and frankly, the Polygon network is being built to become the home of global financial markets.\nEquity Opportunity Fund V was launched byHamilton Lane in June2022 and has already registered double-digit cumulative returns despite a severe marketrecession.\nTokenization unlocks new opportunities for investors\nBesides collaborating with Hamilton Lane,Securitize also launched its $25 million fine art fund. This fund is tokenized on Polygon Network (MATIC) as well.\nAs such, tokenization pushes the barriers of accessibility for all groups of investors. With tools likeSecuritize, they can get exposed to previously unseen classes of investing tools.",
      "snippet": "... in coming months.Colin Butler, global head of institutional capital at <b>Polygon</b> Labs, stresses the importance of this release for the entire segment ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T16:46:00",
      "provider": {
        "name": "u",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://u.today/sites/default/files/styles/twitter/public/2023-02/30501.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "u",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://u.today/hamilton-lane-830-billion-investing-heavyweight-comes-to-polygon-matic-details"
      }
    },
    {
      "id": "8547886605832414856",
      "title": "Amazon has some good microSD card deals for Switch and Steam Deck today",
      "url": "https://www.polygon.com/2023/2/1/23581172/samsung-sandisk-microsd-card-steam-deck-nintendo-switch-deal-1tb-512gb",
      "description": "Its a little more affordable than usual to greatly boost the internal storage in your Nintendo Switch or Steam Deck. Amazon has good prices on 512GB and 1TB microSD cards.",
      "body": "Email\nPhoto: Chris Plante/Polygon\nFew accessories get price cuts as often as microSD cards, and Amazon has some appealing deals today. These microSD cards will work for both the Nintendo Switch and the Steam Deck  two machines that arent exactly known for robust internal storage space.\nYou can grab this Samsung 512 GB microSD card for $49.99, or double the capacity to SanDisks 1 TB card by doubling the price to $99.99 (this ones a lightning deal that may not last long). Its worth grabbing one if you need more room for games and screen captures in your Nintendo Switch, as its internal 32 GB of storage probably wont last you very long. Unless you own dozens of games, the 512 GB card will likely suffice.\nSure, Steam Deck enthusiasts could do risky M.2 SSD surgery for faster transfer speeds; however, for most people buying a high-capacity microSD card for the Deck is the right way to go. Its cheaper and easier, and you wont risk breaking anything inside of that precious Deck. If you ask me, Id go for the 1 TB card on your Deck, since a lot of PC games have humongous install sizes these days.\nPrices on microSD cards tend to plummet temporarily during big sale events, like Black Friday and Cyber Monday. Ive seen slightly better prices than the ones available today through Amazon, but these deals arent a bad way to kick off February.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Its a little more affordable than usual to greatly boost the internal storage in your Nintendo Switch or Steam Deck.\nAmazon has good prices on 512GB and 1TB microSD cards.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T16:45:03",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/lS4hZG1qbwHuvB4sQS3xUnB28z4=/0x340:3000x1911/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23268317/cplante_220223_ecl1072_0023.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/2023/2/1/23581172/samsung-sandisk-microsd-card-steam-deck-nintendo-switch-deal-1tb-512gb"
      }
    },
    {
      "id": "7502454674214149280",
      "title": "PlayStation Plus February 2023 free games announced for PS4 PS5",
      "url": "https://www.polygon.com/23577654/playstation-plus-february-2023-games-essentials-ps4-ps5",
      "description": "PS Plus Essential games for February 2023 include Mafia: Definitive Edition and OlliOlli World. Heres the full PS Plus February 2023 lineup and when PS4 and PS5 games go live.",
      "body": "Email\nImage: Hangar 13/2K Games\nMafia: Definitive Edition and OlliOlli World highlight the new games available to PlayStation Plus Essential subscribers for February, Sony Interactive Entertainment announced on Wednesday.\nSubscribers will also get Evil Dead: The Game, the asymmetrical co-op shooter whose title should make the gameplay somewhat obvious (\n, for the record). And Destiny 2s 2020 expansion, Beyond Light, will also be available to Essential members.\nThe games will be available beginning Feb. 7.\nMafia: Definitive Edition\nis the 2020 remake (for PlayStation 4) of the much-loved 2002 open-world crime game, back when that was largely a new genre in AAA video gaming. The game takes players to a mobbed-up, fictional 1930s city called Lost Heaven, and explores the rise of an accidental mafia soldier and the fall of a major crime family.\nOlliOlli World, the third game in Roll7s skateboarding series, was a Polygon Recommends selection when it launched in February 2022. Its quite a departure from the first two games, trading a cartoony, 2.5D perspective (which allows for better physics and tricks) for the earlier pixel-art and side-scrolling motion. The PS5 and PS4 versions of OlliOlli World are available.\nEvil Dead: The Game is a 4-on-1 shooter that offers both PvE and PvP play. Players can take on the AI with other players online, or play with bot teammates. Theyre up against The Demon (likewise AI or another player) who is out to kill them all, or destroy the Necronomicon if they manage to find it. PS5 and PS4 versions are both available.\nRelated\nDestiny 2: Beyond Light\nlaunched in November 2020 and was the third major content update for a loot-shooter that is now free-to-play. For more on that expansion, and the others that have launched in the series (and advice on where to begin if youre totally new to the series) we have a guide that puts it all in perspective.\nPlayStation Plus subscribers can still pick up Januarys Essential-level games  Star Wars Jedi: Fallen Order, Fallout 76, and Axiom Verge 2  through Feb. 6.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "... World, the third game in Roll7s skateboarding series, was a <b>Polygon</b> Recommends selection when it launched in February 2022. Its quite a departure ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T16:34:49",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/SDCPOHRCS9M3wB600xls29M26f8=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24395785/mafia_de.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23577654/playstation-plus-february-2023-games-essentials-ps4-ps5"
      }
    }
  ]
}
