{
  "_type": "news",
  "didUMean": "",
  "totalCount": 204,
  "relatedSearch": [],
  "value": [
    {
      "id": "2545145890195768358",
      "title": "New Tomb Raider game announced for Android iOS launch in February",
      "url": "https://www.polygon.com/23580235/tomb-raider-reloaded-release-date-roguelike-android-ios",
      "description": "Lara Crofts next adventure is the roguelike Tomb Raider Reloaded, coming to Android and iOS on Feb. 14. It will be available free as part of a Netflix subscription too.",
      "body": "Lara Crofts next big adventure\nfrom Crystal Dynamics and Amazon Games is still a few years away, but her next small adventure drops later this month. Tomb Raider Reloaded, Laras first foray into the roguelike genre, will be released Feb. 14  Ms. Crofts birthday, according to the Survivor trilogy timeline  on Android and iOS devices. It will be available through Netflix at launch as part of the streaming services game offerings.\nTomb Raider Reloaded looks starkly different from the action-adventure-platforming games that starred the classic Lara Croft seen in the mobile roguelike game. Its a top-down, room-clearing exercise in raiding tombs, featuring the expected obstacles: traps, animated rock monsters, yeti, bow-wielding guards, and Tyrannosaurus rex. The roguelike draws on familiar Tomb Raider locations for its levels, including Vilcabamba, the Lost Valley, and St. Francis Folly.\nDevelopers Emerald City Games and CDE Entertainment (part of Crystal Dynamics/Eidos) say that players can expect ever-changing rooms and gameplay modifiers like XP boosts, craftable weapons, runes (which boost Laras stats), and cosmetic upgrades (like Laras famous bomber jacket) to keep things fresh in the run-based game. Returning to voice Lara Croft in Tomb Raider Reloaded is Keeley Hawes, the veteran actor who has brought Lara to life in Tomb Raider: Anniversary, Lara Croft and the Guardian of Light, and other games.\nTomb Raider Reloaded appears to be a nudge in a larger push to bring Lara Croft back to screens everywhere. Netflix has a Tomb Raider anime in the works, and Amazon is making a live-action series with the help of writer Phoebe Waller-Bridge, known for her roles in Fleabag and the upcoming Indiana Jones and the Dial of Destiny. Then, of course, theres the next Tomb Raider video game, an Unreal Engine 5-powered follow-up to Crystal Dynamics Survivor trilogy, which capped off with 2018s Shadow of the Tomb Raider.\nWhile we wait for all that, mobile gamers can try their hand at Tomb Raider Reloaded, which is available for pre-registration through the games official website and Google Play Store now.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Lara Crofts next adventure is the roguelike Tomb Raider Reloaded, coming to Android and iOS on Feb.\nIt will be available free as part of a Netflix subscription too.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T16:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/nw1do-k-TMIzrBU5E4I4FAyJh_c=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24401194/tomb_raider_reloaded.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23580235/tomb-raider-reloaded-release-date-roguelike-android-ios"
      }
    },
    {
      "id": "4203178967605112339",
      "title": "The best anime you need to catch up on in 2023",
      "url": "https://www.polygon.com/23560479/2023-best-anime-to-catch-up-on-demon-slayer-jujutsu-kaisen",
      "description": "2023 is going to be a big year for anime, with exciting new premieres and highly anticipated follow-ups to beloved series and franchises. Heres what you need to watch and when, including Demon Slayer: Kimetsu no Yaiba, Jujutsu Kaisen, and more.",
      "body": "Email\nImage: Ufotable/Aniplex\nWere only one month into 2023 and already anime fans have a bevy of exciting new premieres to look forward to all year round. From Demon Slayer: Kimetsu no Yaiba and Jujutsu Kaisen to Attack on Titan and so many other exciting anime, the return of beloved anime series is just around the corner, with yet more still on the horizon. It can be hard to keep track of just what exactly one should catch up on in order to be prepared for this years biggest premieres to come, let alone keeping up with the release of new episodes of anime currently airing right now. Thats why were here to do it for you!\nBelow is a short list of all the biggest anime series set to return this year, when theyre scheduled to be released, and where you can catch up on the previous episodes. Theres likely more major announcements of returning anime series to come in the weeks and months ahead, but for now  heres our rundown on all the anime you have to watch and when you should watch them by. Happy marathoning!\nAttack on Titan\ncontroversial\n) epic dark fantasy anime based on Hajime Isayamas acclaimed manga, will return this March for the first half of the final part of its fourth and final season (I know, its complicated  dont think too much about it). If you somehow havent seen this massively popular anime about a group of humans fighting an apocalyptic war of survival against a horde of man-eating giants and other humans (again, its complicated), you technically have enough hours left in the days between now and when this new season premieres to catch up and see what all the hubbub is about.\nAttack on Titan is available to stream on Netflix, Crunchyroll, and Hulu. The series will return with the premiere of the first half of its final season in March.\nDemon Slayer: Kimetsu no Yaiba\nNumber of episodes: 44\nImage: Ufotable/Aniplex\nDemon Slayer: Kimetsu no Yaiba, the shonen martial arts fantasy anime based on Koyoharu Gotouges popular manga, is returning for a third season later this year. Set after the events of last season, which adapted the Mugen Train arc and Entertainment District arc of the manga, this upcoming season is set to cover the events of the Swordsmith Village arc, which will follow series protagonist Tanjiro and his sister, Nezuko, journeying to a legendary village of swordsmiths in order to repair his Nichirin sword following his climactic battle against the demon Gyutaro and his sister, Daki. While there, Tanjiro will fight alongside Muichiro Tokito and Mitsuri Kanroji, the Mist and Love Hashira captains of Demon Slayer Corps respectively, as they take on Doma, the second most powerful lieutenant of series antagonist Muzan Kibutsujis personal demon army.\nDemon Slayer: Kimetsu no Yaiba is available to stream on Netflix, Crunchyroll, and Hulu and will return for a third season in April.\nFire Force\nNumber of episodes: 48\nImage: David Production/Crunchyroll\nFire Force, the shonen dark fantasy adventure anime based on Soul Eater creator Atsushi Ohkubos manga of the same name, is coming back for a third season later this year. For those not familiar, the series takes place in a post-apocalyptic Japan where spontaneous combustion is the norm, transforming ordinary humans into murderous supernatural creatures called Infernals. In order to combat this threat, special fire brigades made up of similarly gifted individuals are tasked with fighting back against Infernals and securing the safety of society. Fire Force follows Shinra Kusakabe, a third-generation pyrokinetic orphan who joins Special Fire Force Company 8 in hopes of finding and killing the Infernal responsible for murdering his mother and younger brother.\nFire Force is available to stream on Netflix, Crunchyroll, and Hulu and will return for a third season later this year.\nJujutsu Kaisen\nNumber of episodes: 24\nImage: MAPPA/Crunchyroll\nJujutsu Kaisen, the wildly popular shonen anime based on Gege Akutamis dark fantasy manga, will return with a second season set to premiere this July. The season will jump back and forth between the past and present day, following the story of\nSatoru Gojo\ns time as a student at the Tokyo Prefectural Jujutsu High School while also picking up after the events of last seasons exciting conclusion. Jujutsu Kaisen follows the story of Yuji Itadori, an athletically gifted high school student who becomes the unwitting host to a powerful cursed spirit named Ryoumen Sukuna who wishes to take over Yujis body and conquer the mortal world. With no other choice, Yuji chooses to become a Jujutsu sorcerer in other to protect others while searching for a way to expel and banish this evil spirit. And if youre already caught up on Jujutsu Kaisen, here are nine more anime like it for you to check out next.\nJujutsu Kaisen is available to stream on Crunchyroll and Hulu and will return for a second season later this year.\nKaguya-sama: Love Is War\nNumber of episodes: 37\nImage: A-1 Pictures/Aniplex\nThe romantic comedy anime Kaguya-Sama: Love Is War concluded its third (and presumably final) season last summer. Wait  if Kaguya-Sama: Love Is War just wrapped up, why do I need to prioritize watching this year? Thats a great rhetorical question, hypothetical reader! The answer is: Because theres a feature-length anime film, Kaguya-sama: Love Is War - The First Kiss That Never Ends, coming to American theaters for Valentines Day! If youre not familiar with one of the best, if not arguably the best, anime rom-coms in recent memory, heres how my colleague Petrana Radulovic summed up the shows\npremise and appeal\n:\nAfter learning that everyone on campus thinks theyd make a cute couple, class president Miyuki Shirogane and vice president Kaguya Shinomiya independently decide to get the other to confess their love. Each of them thinks that they will most definitely not fall for the other  and that ends up spectacularly backfiring, as they both end up with massive crushes on one another. But of course, they cant lose their self-imposed game, so it turns into the sort of battle where every win is also a bit of a loss.\nKaguya-sama: Love Is War is available to stream on Crunchyroll. Kaguya-sama: Love Is War - The First Kiss That Never Ends is coming to U.S. theaters on Feb. 14.\nMobile Suit Gundam: The Witch From Mercury\nNumber of episodes: 12\nImage: Sunrise/Crunchyroll\nFollowing the bloody and climactic conclusion of its first season, Mobile Suit Gundam: The Witch From Mercury is set to return this year, with the second half of the series scheduled to premiere sometime during the spring anime season (April through June). If youre not yet familiar with the series and would like to know more before diving in, heres the elevator pitch: Mobile Suit Gundam: The Witch From Mercury is the first stand-alone Gundam series since 2015s Mobile Suit Gundam: Iron-Blooded Orphans and follows a young mech pilot named Suletta Mercury whose nascent friendship (and possibly more) with a young classmate is complicated by her unknowing r",
      "snippet": "2023 is going to be a big year for anime, with exciting new premieres and highly anticipated follow-ups to beloved series and franchises.\nHeres what you need to watch and when, including Demon Slayer: Kimetsu no Yaiba, Jujutsu Kaisen, and more.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-01T15:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/47MhTnfDJx5M4FnA6BW3Y86EIBk=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24388105/18454701.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23560479/2023-best-anime-to-catch-up-on-demon-slayer-jujutsu-kaisen"
      }
    },
    {
      "id": "815248638295747672",
      "title": "Gamefound fell short of its goals but still ate at Kickstarters lead",
      "url": "https://www.polygon.com/tabletop-games/23579623/top-10-board-games-on-gamefound-2022-crowdfunding",
      "description": "Crowdfunding upstart Gamefound failed to meet its ambitious tabletop goals in 2022, but that didnt stop it from eating into Kickstarters massive lead in the space. The Poland-based company still managed a 45% uptick in crowdfunding revenue from backers last year.",
      "body": "Flipboard\nEmail\nMarcin wierkot, founder of the upstart crowdfunding platform Gamefound, set an ambitious goal for his company in 2022. He and his team hoped to bring in $67.5 million  25% of competitor Kickstarters revenue from tabletop projects in 2021. In the end, he fell well short of that goal. The Poland-based Gamefound increased its revenue more than 45% last year, earning just $28.3 million for new projects.\nSet against Kickstarters own $33 million decline in the tabletop category over the same period, its clear that, despite not reaching its financial goal, his team is quickly gaining on the Brooklyn-based crowdfunding giant. But growing pains are suddenly the least of its problems.\nGamefound exited beta in early 2022, going from a peak of four campaigns each month to more than 30 almost overnight. That exponential growth in the live platform led to some disruption for new customers. Several companies, speaking with Polygon on background, complained throughout last year that the service and attention their campaigns received was not what they expected. In response, the company grew even faster  in part by taking on significant investment from 139-year-old board game publisher Ravensburger (\nDisney Lorcana\n). But the maneuver still wasnt fast enough to satisfy all of the creators that flooded his platform  especially after Kickstarters very public meltdown over a proposed transition to blockchain technology.\nI dont want to make any excuses, wierkot told Polygon in an interview. What I want to make is just [a] better platform. [...] What I would say to those creators [is that] I want to hear [the] negative things. If you experienced that, let me know. Then we can fix it.\nCustomer service issues aside, Gamefound was also blindsided mid-year by news that San Francisco-based Backerkit was also getting into the tabletop crowdfunding business. Several of the spaces biggest creators  including Gloomhaven and Frosthaven publisher Cephalofair Games  fled to that platform instead of his.\nIf those campaigns would be at Gamefound we would definitely be closer to the number, he said. Which, you know, its fine... ish.\nPolygon reached out to Backerkit, asking if it would share its own data for 2022. The organization declined, citing the fact that it is still in its beta phase of development. Regardless of Backerkits success, wierkot thinks he may have underestimated consumers loyalty to Kickstarter, which has raised some $2 billion for tabletop games to date.\nKickstarter still has a super-strong brand, wierkot said. Theres the old saying, you know: The devil you know is better than the devil you dont know.\nThe devil was in the details for creators in 2022, unfortunately, with many being forced to raise additional money well after their initial campaigns were funded to cover the increased cost of global logistics. wierkot said that Gamefound is doing what it can to buoy backer trust on his platform, including with its new Stable Pledge program.\nGoing forward, wierkot has adjusted his goals for 2023  $50 million in backers crowdfunding dollars by the end of the year. But macroeconomic headwinds are increasing. Thats clear, he said, based on the subpar performance of some high-profile campaigns in 2022. In addition to\ns and Hasbros own enormous crowdfunding failures, even surefire licenses like Elden Ring, The Last of Us, and Slay the Spire underperformed, in his opinion. So too did the campaigns of his own publishing company, Awaken Realms.\nMost-funded campaigns on Gamefound in 2022\nCreator\n$506,106\nData: Gamefound\nThis year we had [the] Tainted Grail: Kings of Ruin campaign. The first campaign did $6 million on Kickstarter back in 2019. And now we had the follow-up campaign, which usually do better. [...] But this one did $4.5 million.\nSo what can wierkot do to reach Gamefounds aggressive goal of nearly 50% growth in 2023? Outside of a focus on day-to-day creator and backer service issues  and in building back trust with customers burned by shipping increases in 2022  not a whole lot.\nThe economy, realistically, we have nothing to do [about it], wierkot said. We cannot guarantee whatever will happen [with] inflation. [We have absolutely] no influence [there].\nNews\nAlice Is Missing expansion takes the RPGs silent storytelling in challenging directions\nNews\nPaizo commits to legal battle against Wizards over the future of Pathfinder and D&D\nNews",
      "snippet": "Several companies, speaking with <b>Polygon</b> on background, complained throughout last year that the service and attention their campaigns received was ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T14:30:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/49BFcMN4bOqiTb5lqeMMhWzqDDU=/0x65:1280x735/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23377064/CoBDeluxe_coins_render_WIP_01.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/tabletop-games/23579623/top-10-board-games-on-gamefound-2022-crowdfunding"
      }
    },
    {
      "id": "1443551291603416556",
      "title": "New on Netflix February 2023: Every movie and TV show arriving",
      "url": "https://www.polygon.com/entertainment/2023/2/1/23578014/new-netflix-movies-tv-shows-watch-february-2023",
      "description": "You, The Outer Banks, Love is Blind: After the Altar, the Lord of the Rings trilogy and everything else coming to Netflix next month.",
      "body": "Email\nImage: New Line Cinema\nEven with Netflixs recommendation algorithm serving you new movies, new TV shows, and original programming tailored to your viewing habits, the streaming services fire hose of content makes whats coming and going difficult to parse.\nThe Lord of the Rings trilogy is back on Netflix this month, along with La La Land and It (2017). As for new releases, look forward to Lyle Lyle Crocodile. The newest seasons of You and The Outer Banks will also hit Netflix, along with wild documentary Gunthers Millions.\nAvailable Feb. 1\nThe Great British Baking Show: The Professionals: Season 6 (Netflix Series)\nFrom Netflix: Teams of the UKs best professional pastry chefs aim to impress with their finest confections in this sibling series to The Great British Baking Show.\nGunthers Millions (Netflix Documentary)\nFrom Netflix: A dog with a trust fund isnt the strangest part of this story. Gunthers eccentric handler also lived a luxe life  with a cult-like entourage.\nBad Boys\nCall Me by Your Name\nDaddys Little Girls\nThe Lord of the Rings: The Fellowship of the Ring\nThe Lord of the Rings: The Return of the King\nThe Lord of the Rings: The Two Towers\nImage: New Line Cinema\nNew Amsterdam: Seasons 3 & 4\nThe Pursuit of Happyness\nSpy Kids: All the Time in the World\nStepmom\nTyler Perrys I Can Do Bad All by Myself\nUnderworld\nAvailable Feb. 2\nFreeridge (Netflix Series)\nFrom Netflix: Four teen friends work to reverse a curse after a peculiar old box seems to bring misfortune  and more  into their lives.\nAvailable Feb. 3\nClass (Netflix Series)\nFrom Netflix: Three students from a poor neighborhood join an exclusive high school for Delhi elite where dark secrets and rumors ultimately lead to murder.\nInfiesto (Netflix Film)\nFrom Netflix: As the coronavirus upends their lives, two detectives doggedly pursue those responsible for an abduction they realize is part of a sinister pattern.\nStromboli  (Netflix Film)\nFrom Netflix: Haunted by memories of her broken marriage and a fight with her daughter, a woman joins an intense self-help retreat when her vacation goes awry.\nThomas & Friends: All Engines Go: Season 2\nTrue Spirit  (Netflix Film)\nFrom Netflix: When Jessica Watson sets out to be the youngest person to sail solo, non-stop and unassisted around the world, she must overcome her greatest fear as she navigates the worlds most challenging stretches of ocean. Based on a true story.\nViking Wolf (Netflix Film)\nFrom Netflix: After witnessing a grotesque murder at a party in her new town, a teenager starts having strange visions and bizarre desires.\nAvailable Feb. 4\nAvailable Feb. 8\nBill Russell: Legend (Netflix Documentary)\nFrom Netflix: Featuring an interview with Bill Russell prior to his passing in 2022, Bill Russell: Legend is the definitive telling of the remarkable life and legacy of an NBA superstar and civil rights icon.\nThe Exchange (Netflix Series)\nFrom Netflix: Inspired by real events, two women set out to pioneer the cutthroat stock market of 1980s Kuwait  and disrupt its corrupt boys club along the way.\nMTV Floribama Shore: Season 1\nAvailable Feb. 9\nDear David  (Netflix Film)\nFrom Netflix: A straight-A high schoolers life is turned upside down when her risqu fantasy blog about her crush is leaked to everyone at school.\nMy Dad the Bounty Hunter (Netflix Family)\nFrom Netflix: An intergalactic bounty hunter takes dad duty to new extremes when his two kids accidentally hitch a ride with him to outer space and crash his mission.\nYou: Season 4: Part 1 (Netflix Series)\nImage: John P. Fleenor/Netflix\nFrom Netflix: Starting anew in London, Joe vows to bury the past and be his best self. But on the rocky road to redemption, a new obsession starts to take hold.\nAvailable Feb. 10\n10 Days of a Good Man  (Netflix Film)\nFrom Netflix: A lawyer turned private investigator takes on a missing person case, propelling him on an unexpected and life-altering quest.\nLove is Blind: After the Altar Season 3 (Netflix Series)\nFrom Netflix: Check in with this seasons former fiancs, one year since their big decisions to get married or walk away single.\nLove to Hate You (Netflix Series)\nFrom Netflix: For an attorney who despises losing to men and an A-list actor who distrusts women, love means nothing  until theyre forced to date each other.\nYour Place or Mine (Netflix Film)\nFrom Netflix: When best friends and total opposites Debbie and Peter swap homes for a week, they get a peek into each others lives that could open the door to love.\nAvailable Feb. 13\nSquared Love All Over Again (Netflix Film)\nFrom Netflix: A celebrity journalist and a down-to-earth teacher find their relationship in rocky waters when a job gets in the way of their new life together.\nVINLAND SAGA: Season 2 (new episodes)\nAvailable Feb. 14\nAll the Places (Netflix Film)\nFrom Netflix: Two siblings who havent seen each other in 15 years mend their relationship while fulfilling a childhood dream: a motorcycle road trip through Mexico.\nA Sunday Affair (Netflix Film)\nFrom Netflix: Lifelong best friends Uche and Toyin fall for the same complicated man, which tests their loyalty to each other as they face a heartbreaking revelation.\nIn Love All Over Again (Netflix Series)\nFrom Netflix: Ever since they met, Irene and Julio have been falling in love, splitting up, and then trying again. Will they ever find their happy ending?\nJim Jefferies: High n Dry    NETFLIX COMEDY\nFrom Netflix: Jim Jefferies is back for his fifth Netflix comedy special, High n Dry and no topic is off limits. The comedian muses on stoned koalas, his dads vasectomy confusion, choosing between his hair and his sex drive and more.\nPasin de Gavilanes: Seasons 1-2\nPerfect Match (Netflix Series)\nFrom Netflix: Couples who prove their compatibility gain the power to make or break other matches in this strategic and seductive dating competition.\nRe/Member (Netflix Film)\nFrom Netflix: Six high schoolers stuck in a murderous time loop must find the scattered remains of an unknown victim to break the curse and finally see another day.\nAvailable Feb. 15\n#NoFilter (Netflix Series)\nFrom Netflix: Bored with her studies, Marcely drops out of college to chase a new goal in life: becoming an influencer. But life online is harder than it looks\nAfrican Queens: Njinga (Netflix Documentary)\nFrom Netflix: From Executive Producer Jada Pinkett Smith comes a new documentary series exploring the lives of prominent and iconic African Queens. The first season will cover the life of Njinga, the complex, captivating, and fearless 17th century warrior queen of Ndongo and Matamba, in modern day Angola. The nations first female ruler, Njinga earned a reputation for her blend of political and diplomatic skill with military prowess and became an icon of resistance.\nCoComelon: Season 7\nEva Lasting (Netflix Series)\nFrom Netflix: A mysterious teen girl arrives at an all-boys school in 1970s Colombia, breaking stereotypes, rules... and a few hearts.\nFull Swing (Netflix Documentary)\nFrom Netflix: This immersive documentary seri",
      "snippet": "You, The Outer Banks, Love is Blind: After the Altar, the Lord of the Rings trilogy and everything else coming to Netflix next month.\nEmail Image: New Line Cinema Even with Netflixs recommendation algorithm serving you new movies, new TV shows, and original programming tailored to your viewing habits, the streaming services fire hose of content makes whats coming and going difficult to parse.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-01T13:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/9nAPCiPg7lJBXJOWe2Jte3LiEc8=/389x0:3435x1595/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22323904/ian_mckellan_gandalf_4k_lotr.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/entertainment/2023/2/1/23578014/new-netflix-movies-tv-shows-watch-february-2023"
      }
    },
    {
      "id": "2099758968027824960",
      "title": "Pokmon Go Shadowy Skirmishes quest steps rewards",
      "url": "https://www.polygon.com/pokemon-go-guide/23580945/pokemon-go-shadowy-skirmishes-rewards-research",
      "description": "Shadowy Skirmishes is the latest in a long line of Giovanni research quests in Pokmon Go, and sees the debut of Shadow Registeel.",
      "body": "",
      "snippet": "Shadowy Skirmishes is the latest in a long line of Giovanni research quests in Pokmon Go, and sees the debut of Shadow Registeel.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T11:48:10",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/wDQ-jsJw1NVuaKtyBfY3LAQWkb4=/396x0:1920x798/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24400983/pokemon_go_shadowy_skirmishes.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/pokemon-go-guide/23580945/pokemon-go-shadowy-skirmishes-rewards-research"
      }
    },
    {
      "id": "8687799011859773707",
      "title": "Cryptocurrency market goes up as Big Eyes Coin reaches USD20 Million Solana Polygon record gains",
      "url": "https://euroweeklynews.com/2023/02/01/cryptocurrency-market-goes-up-as-big-eyes-coin-reaches-usd20-million-solana-polygon-record-gains/",
      "description": ">>BUY BIG EYES COIN NOW!<< The cryptocurrency market has had a terrific few days, with significant increases being witnessed among major",
      "body": ">>BUY BIG EYES COIN NOW!<<\nThe cryptocurrency market has had a terrific few days, with significant increases being witnessed among major cryptocurrencies. Many experts have also tied this growth to the favourable CPI report issued on January 12, by the Bureau of Labor Statistics (BLS), which showed total inflation for all urban consumers dropping by 0.1%.\nOn Monday, the market surged further as market capitalisation of all cryptocurrencies was trading higher at $1.08 trillion, up approximately by 2% over the previous day. However, the overall trade volume increased by close to 24%, reaching $49.64 billion.\nAs the industry big boys  Bitcoin, Binance, BNB continue to consolidate their positions as market leaders, it is expedient to take note of promising newbies who are making giant strides, offering an equally good, if not better alternative platform for crypto investment.\nSolana: Relentless in spite Supply Zone Block\nBarring the US dollar pegged stablecoins, all top crypto tokens were trading higher on Monday. This is not excluding Solana (SOL), which surged 6 per cent, during the early trade. Solana quickly surged up from $20 to $25 on Friday, 20th January. Afterward, a critical short-term supply zone hindered its upward price action severely. Afterwards, SOL traded at $24.10, despite still having to deal with the above-mentioned supply zone. It now flirts around USD 24.14 and has managed to stabilise there for a number of days.\nPolygon: Leveraging partnerships for market growth\nPolygon has also taken advantage of the current surge in the cryptocurrency market to further increase its worth. However, it has not remained consistent through to Monday, losing close to USD5 within 24 hours.\nPrior to Monday, Polygon had enjoyed significant successes due to collaborations with well-known companies like Starbucks and Adidas. Polygon had seen a lot of adoption, which had raised the networks appeal among cryptocurrency users.\nBig Eyes Coin fast becoming investors favourite with 200% Launch Bonus\nBig Eyes Coin (BIG)\nwas also one of the cryptocurrencies to have made significant gains over the weekend, reaching USD 20.15 million in presale, and edging closer to official release for retail trading. The meme coin has waxed stronger every day and has been tipped by experts to become a crypto giant in the near future.\nSince its creation in late 2022, the Big Eyes went from making USD 1 million in a week, to crossing 40% of its USD 50 million mark for official launch. Big Eyes giant strides, however, are not unconnected to the 200% launch offer which investors have been taking advantage of. As a result of this offer, investors now get 3 times as much when they purchase Big Eyes tokens.\nThe Big Eyes is the new big thing in the cryptocurrency market, as it offers a great opportunity for investors to triple their investment immediately when they purchase, with a 200% launch bonus that can be accessed by using the promo code: LAUNCHBIGEYES200.\nFind out more about Big Eyes Coin (BIG):\nPresale:",
      "snippet": "Prior to Monday, <b>Polygon</b> had enjoyed significant successes due to collaborations with well-known companies like Starbucks and Adidas. <b>Polygon</b> had ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T10:15:20",
      "provider": {
        "name": "euroweeklynews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.euroweeklynews.com/wp-content/uploads/2023/01/Crypto-pic-1-3.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "euroweeklynews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://euroweeklynews.com/2023/02/01/cryptocurrency-market-goes-up-as-big-eyes-coin-reaches-usd20-million-solana-polygon-record-gains/"
      }
    },
    {
      "id": "8801826033063189621",
      "title": "Today's cryptocurrency prices: Rates of Bitcoin, Ethereum, Polygon, Shiba Inu",
      "url": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-01-02-2023-rates-of-bitcoin-ethereum-polygon/story",
      "description": "Bitcoin has surged by 1.29% in the past 24 hours to trade at $23,163.01",
      "body": "Bitcoin has surged by 1.29% in the past 24 hours to trade at $23,163.01. It is 2.23% up compared to last week.   The second most popular token, Ethereum, has risen by 0.81% from yesterday to now trade at $1,584.79. It is up by 2.31% compared to last week.   Bitcoin and Ethereum have market capitalizations of $446.42 billion and $193.87 billion, respectively.  BNB is trading at $310.93, which is 0.78% less than yesterday and 2.90% higher than the previous week.   XRP is currently trading at $0.44 after moving up 3.76% in the last 24 hours. It is 0.04% down from last week.   Cardano and Dogecoin are trading at $0.33 (up 4.33%) and $0.099 (up 0.80%), respectively.  Solana, Polka Dot, Shiba Inu, and Polygon are currently trading at $24.1 (down 0.45%), $6.2815 (down 2.66%), $0.000011 (down 0.50%), and $1.11 (up 1.14%), respectively.   Based on the weekly chart, Solana is down 1.84%, while Polka Dot has fallen 5.56%.   In the last seven days, Shiba Inu has gained 2.05% of its value, whereas Polygon is 15.29% up.  DYdX, Render Token, Threshold, Arweave, and Fantom are the top five gainers on a 24-hour basis. They are trading at $3.13 (up 28.13%), $1.52 (up 26.21%), $0.055 (up 22.98%), $11.38 (up 11.17%), and $0.55 (up 11.13%), respectively. A stablecoin is a cryptocurrency with extremely low volatility. Its value is linked to a physical asset such as fiat currency or gold.   Some of the popular tokens, Tether, USD Coin, and Binance USD, are trading at $1 (up 0.01%), $0.99 (down 0.01%), and $1 (flat), respectively. Terra Classic is listed at $0.00011 (up 3.33%).  The biggest losers of the day are Hedera, Dash, TRON, Tezos, and Mina. They are trading at $0.066 (down 1.68%), $61.17 (down 1.18%), $0.066 (down 1.03%), $1.06 (down 0.93%), and $0.88 (down 0.92%), respectively. Based on traffic, liquidity, trading volumes, and confidence in the legitimacy of trading volumes, Binance, FTX, and Coinbase Exchange are the top three cryptocurrency spot exchanges.   Binance and Coinbase Exchange recorded a 24-hour volume of $16.83 billion (down 22.96%) and $1.61 billion (down 29.52%), respectively. Kraken saw a volume of $0.52 billion, which is 26.34% down from yesterday.  DeFi, short for decentralized finance, refers to all global, peer-to-peer financial services on public blockchains.   Some of the prominent DeFi tokens are Avalanche, Dai, Uniswap, Wrapped Bitcoin, and Chainlink.   They are trading at $19.67 (down 0.19%), $0.99 (up 0.01%), $6.62 (up 1.16%), $23,105.90 (up 1.22%), and $6.95 (down 0.52%), respectively.  Non-fungible tokens (NFTs) are cryptocurrencies that lack the attribute of fungibility, which means they cannot be exchanged for one another like other tokens.   Some of the popular NFT tokens are ApeCoin, Decentraland, Flow, Axie Infinity, and The Sandbox. They are currently trading at $5.88 (down 0.01%), $0.77 (up 1.46%), $1.08 (up 7.60%), $10.92 (up 2.37%), and $0.77 (up 0.95%), respectively.  The current global crypto market cap is $1.04 trillion. The total crypto market volume over the last 24 hours is $57.1 billion. They have remained flat over the last day.   Last month, the global crypto market cap was $795.53 billion, compared to $1.02 trillion three months ago.",
      "snippet": "Solana, Polka Dot, Shiba Inu, and <b>Polygon</b> are currently trading at $24.1 (down 0.45%), $6.2815 (down 2.66%), $0.000011 (down 0.50%), and $1.11 (up ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-01T06:06:18",
      "provider": {
        "name": "newsbytesapp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cdn.newsbytesapp.com/images/l53320230201110059.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsbytesapp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-01-02-2023-rates-of-bitcoin-ethereum-polygon/story"
      }
    },
    {
      "id": "5884354410796054739",
      "title": "Polygon (MATIC) One Day Volume Hits $413.68 Million",
      "url": "https://www.wkrb13.com/2023/01/31/polygon-matic-one-day-volume-hits-413-68-million.html",
      "description": "Read Polygon (MATIC) One Day Volume Hits $413.68 Million at WKRB News",
      "body": "Polygons\ngenesis date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. The official website for Polygon is polygon.technology. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. The official message board for Polygon is blog.polygon.technology. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nPolygon Coin Trading\nIt is usually not currently possible to purchase alternative cryptocurrencies such as Polygon directly using US dollars. Investors seeking to acquire Polygon should first purchase Ethereum or Bitcoin using an exchange that deals in US dollars such as Gemini, Coinbase or Changelly. Investors can then use their newly-acquired Ethereum or Bitcoin to purchase Polygon using one of the aforementioned exchanges.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> (MATIC) One Day Volume Hits $413.68 Million at WKRB News. <b><b>Polygon</b>s</b> genesis date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T23:42:47",
      "provider": {
        "name": "wkrb13",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "wkrb13",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.wkrb13.com/2023/01/31/polygon-matic-one-day-volume-hits-413-68-million.html"
      }
    },
    {
      "id": "122352770456823737",
      "title": "Here are 4 new Exotics coming to Destiny 2: Lightfall",
      "url": "https://www.polygon.com/23580316/destiny-2-lightfall-exotic-final-warning-deterministic-chaos-winterbite-quicksilver-storm",
      "description": "Destiny 2: Lightfalls latest trailer shows off new weapons and armor, including four exotics like Winterbite, Swarmers, Cyrtarachnes Faade, and Abeyant Leap. The expansion is set for release on Feb. 28.",
      "body": "Destiny 2s latest expansion, Lightfall\n, is just under a month away, and that means its time for Bungie to show off some of the loot that players can look forward to. In the games latest trailer, players get their first look at some of the new weapons and armor in the expansion, as well as a few Exotics and their effects.\nThe trailer is mainly focused on The Strand and Exotics related to this new and mysterious power. There are both armor and weapons attached to Strand powers as well as something called tangles, which let players use Strand to weave objects and creatures, or for other purposes tied to weapons.\nAlong with these new Strand Exotics, the trailer also features the Quicksilver Storm catalyst upgrade, which allows the Exotic Auto Rifles grenade kills to created Strand tangles than can be thrown at enemies. Quicksilver is available for all layers that preorder Lightfall, which is set for release on Feb. 28.\nHeres a list of all the new weapons and armor that were shown off in Lightfalls latest trailer:\nFinal Warning  This Strand Sidearm shoots tracking rounds that seek out nearby enemies.\nDeterministic Chaos  A Void Machine Gun that rhythmically weakens enemies as it fires.\nWinterbite  A Stasis Exotic Glaive that freezes enemies on impact with frost orbs, leaving them vulnerable to follow-up attack.\nCyrtarachnes Faade  This Exotic helmet gives extra protection as Hunters gain armor and flinch resistance when they grapple.\nAbeyant Leap  When Titans use their Barricade with this Exotic leg armor, it spawns seeking projectiles that suspend enemies and gives armor to its wielder.\nSwarmers  This new Exotic leg armor allows Warlocks to create a Threadling to infest and attack enemies after destroying a tangle.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Destiny 2: Lightfalls latest trailer shows off new weapons and armor, including four exotics like Winterbite, Swarmers, Cyrtarachnes Faade, and Abeyant Leap.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T22:37:52",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/ilKUIeJ7bFcQSuTjoPHDljfVnZo=/0x26:1920x1031/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24400007/Destiny_2_Lightfall_exotics.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23580316/destiny-2-lightfall-exotic-final-warning-deterministic-chaos-winterbite-quicksilver-storm"
      }
    },
    {
      "id": "1150126887369023390",
      "title": "Rumbleverse shutdown: end date revealed for pro wrestling battle royale",
      "url": "https://www.polygon.com/23577658/rumbleverse-shutdown-battle-royale-epic-games",
      "description": "Epic Games and Iron Galaxy confirmed that Rumbleverse will end in February, barely six months after the game originally launched for PC, PlayStation, and Xbox.",
      "body": "Email\nImage: Iron Galaxy/Epic Games\nRumbleverse, the free-to-play, pro-wrestling-inspired battle royale brawler, is shutting down in February, Epic Games and developer Iron Galaxy Studios announced Tuesday. The game will go offline Feb. 28, about six months after the game officially launched.\nThe remaining weeks will be a chance to celebrate the competitive spirit youve brought to this game, Iron Galaxy said. There will be more livestreams to play some games with the developers and let them pull the curtain back to share some behind-the-scenes moments from the creative process that built this city.\nBut the reality is the whole thing closes down at the end of February. Any player who spent money on the game  including the purchase of a Battle Pass or the in-game currency, Brawlla Bills  is eligible for a refund, on any platform. We will share a FAQ page with additional refund information soon, Iron Galaxy said.\nIt is our sincerest hope that this news does not mark the end of Rumbleverse, Iron Galaxy added, in a more personal open letter directed at the games community of players. You may not yet have seen the Rumble in its final form. If we can welcome people back onto the deck of the battle barge again, we hope youll be there, laced up and ready to take your rightful place in the cannon.\nRumbleverse is a melee-based variant on the battle royale genre. Players launched into Grapital City, a large map with several points of interest, and stuffed their pockets with buffs, power-ups, and other items. Opponents were suplexed from the tops of skyscrapers and/or tossed in the water to be eliminated.\nAlthough Rumbleverse was developed to be as watchable as it was playable, the game failed to gain much traction on Twitch, which may have sealed its fate  along with some other battle royale titles. Also on Tuesday, Electronic Arts announced it was shuttering Apex Legends Mobile, which launched in May 2022, and ending development on Battlefield Mobile, a project announced in April 2021.\nRumbleverse was first announced at The Game Awards 2021, though a proposed early access launch for January 2022 was postponed so Iron Galaxy could tighten and polish the game. It formally launched on Aug. 11 on PlayStation 4, PlayStation 5, Windows PC, Xbox One, and Xbox Series X.\nA Nintendo Switch version was rated (overseas) earlier this month, but that now seems unlikely to be released.\nIron Galaxy, founded in 2008, is best known for its games Divekick (2013) and Extinction (2018), and for its work on Killer Instincts second and third seasons for Xbox Game Studios.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Epic Games and Iron Galaxy confirmed that Rumbleverse will end in February, barely six months after the game originally launched for PC, PlayStation, and Xbox.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T21:56:22",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/DOTyM0Cr7d1EZ5kSfLoc-ubnt7c=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23955124/rumbleverse_aims_to_reinvent_battle_royale_with_a_wrestling_flair_1920x1080_bd39632b5034.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23577658/rumbleverse-shutdown-battle-royale-epic-games"
      }
    },
    {
      "id": "8854190915572498360",
      "title": "Apex Legends Mobile shutting down in May EA and Respawn announce",
      "url": "https://www.polygon.com/23580272/apex-legends-mobile-shutting-down-battlefield-android-ios",
      "description": "Apex Legends Mobile is shutting down and being pulled from Android and iOS stores. EA is also killing its Battlefield mobile game that was announced ahead of Battlefield 2042s launch.",
      "body": "Email\nImage: Respawn Entertainment/EA Games\nPublisher Electronic Arts is throwing in the towel on Apex Legends Mobile, the mobile spinoff of its popular battle royale shooter set in the Titanfall universe, and on Battlefield Mobile, which was in development. Apex Legends Mobile will shut down and become unplayable on May 1, and developer Respawn Entertainment says its removing in-game purchases and pulling the game from digital stores today.\nWe have made the painful decision to sunset Apex Legends Mobile, Respawn said on its Twitter account. This decision does not come with ease. Factors beyond our control have prevented us from maintaining the high-quality experience and content that our players deserve.\nIn an update from Electronic Arts, the developers explained the decision in more detail, saying, Following a strong start, the content pipeline for Apex Legends Mobile has begun to fall short of that bar for quality, quantity, and cadence. It is for this reason, after months of working with our development partner, that we have made the mutual decision to sunset our mobile game. Although disappointing, we are proud of the game we launched, are grateful for the support of the Apex Legends community, and are confident that this is the right decision for players.\nDespite Apex Legends Mobiles shutdown  after less than a year  Respawn says it remain[s] excited about mobile as a platform and look forward to new opportunities to serve players there in the future. Respawn previously attempted to bring the Titanfall franchise to mobile with two canceled projects: Titanfall: Frontline, a competitive collectible card game, and Titanfall: Assault, a real-time strategy game.\nEA also commented on the decision to end development of its mobile version of Battlefield, saying, As the industry has evolved and our strategy to create a deeply connected Battlefield ecosystem has taken shape, we decided to pivot from the current direction to best deliver on our vision for the franchise and to meet the expectations of our players.\nBattlefield developer DICE announced its Battlefield mobile project in 2021, ahead of the troubled launch of Battlefield 2042 in October that year. At the time, DICE general manager Oskar Gabrielson (who has since left EA) said that the mobile spin on Battlefield would be completely new. EA and DICE enlisted studio Industrial Toys, the mobile game developer founded by Bungie co-founder Alex Seropian, to co-develop Battlefield mobile.\nBut in December 2021, Electronic Arts revealed it was shaking up the Battlefield franchise in a major way. Vince Zampella, co-founder of Apex Legends developer Respawn Entertainment, was tasked with overseeing the Battlefield franchise. Gabrielsons departure from DICE and EA was announced concurrently. EA and DICE later said they were \n, and would continue to support Battlefield 2042 and pursue new projects in the franchise.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Apex Legends Mobile is shutting down and being pulled from Android and iOS stores.\nEA is also killing its Battlefield mobile game that was announced ahead of Battlefield 2042s launch.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T21:56:20",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/4BHsFhiouMvgktTjwkkFThBT708=/0x0:1456x762/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22454829/apex_mobile_beta_registration_screenshot_2.jpg.adapt.1456w.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23580272/apex-legends-mobile-shutting-down-battlefield-android-ios"
      }
    },
    {
      "id": "4294633057357332953",
      "title": "Addressable raises $7.5M to enable Web3 companies to acquire users at scale",
      "url": "https://news.yahoo.com/addressable-raises-7-5m-enable-213754446.html",
      "description": "Tel Aviv, Israel, 31st January, 2023, Chainwire",
      "body": "Tel Aviv, Israel --News Direct-- Chainwire\nTel Aviv, Israel, 31st January, 2023, Chainwire\nAddressable, an innovative end-to-end solution for Web3 marketing, announced today that it secured $7.5 million in a seed funding round, led by Viola Ventures and Fabric Ventures, with participation from Mensch Capital Partners and North Island Ventures. The funding will be used to accelerate adoption and expansion of Addressables best-in-class solution, including support for additional blockchains and social media integrations.\nMarketing is all about knowing your audience, but since crypto wallets are anonymized by design, Web3 marketers rarely know their audiences age, country or purchasing history, says Dr. Asaf Nadler, co-founder and chief scientist at Addressable. In the face of anonymity, our solution allows Web3 marketers to associate anonymous blockchain audiences with social media activity, ultimately addressing the most significant barrier to Web3 growth today.\nAddressables SaaS solution provides Web3 marketing teams with a powerful platform to launch campaigns and more effectively target new audiences by matching blockchain activity with social profiles. This precise targeting reduces cost-of-acquisition dramatically compared to the broad targeting of existing web2 tools. Leading Web3 companies like Polygon, Bancor, Immutable, and Kryptomon are already using Addressables technology to acquire new users in an era when traditional Web2 marketing campaigns are no longer effective.\nIn the Web3 era, the key barrier to growth is the inability of marketers to deliver their messages to their targeted audiences, simply because they dont know much about them, says Leon Stern, director of growth at Polygon  an Addressable customer. Most users arent attentive on Discord  theyre on social media, and you need to effectively get their attention there. This is where the value of Addressable lies.\nAddressable was founded by Tomer Sharoni, Tomer Shlomo and Dr. Asaf Nadler, data analytics veterans with more than 20 publications on blockchain, machine learning and big data.\nStory continues\nWe are witnessing an increasing number of Web3 companies investing in meaningful and sustainable user growth through social media, where almost all users spend their time, says Tomer Sharoni, Addressables CEO. Our unique ability to pinpoint Web3 audiences on social media is the missing piece for mass adoption of Web3. In todays blockchain ecosystem, were the only Web3 marketing SaaS platform addressing user acquisition at scale.\nEffective user acquisition became the major concern for Web3 businesses over the turbulent past year, said Richard Muirhead, Chairman and Managing Partner at Fabric Ventures. Addressables Web3 marketing platform combines a compelling go-to-market opportunity for any web3 business with a user-centric approach for which this sector craves. We are excited to take part in Addressables journey and to welcome them into the Fabric family.\nAddressable is solving a huge problem for web2 and Web3 companies that want to understand their Web3 audiences, says Omry Ben David, General Partner at Viola Ventures. Its platform enables marketers to connect the dots between on-chain blockchain data with off-chain social media accounts and use precision targeting for a crisper value proposition and thus superior ROI and conversion. Coupled with an A-class founding team, we believe Addressable is best positioned to lead the marketing stack category in web3.\nAbout Addressable\nAddressable is an innovative end-to-end Web3 marketing solution. The companys best-in-class SaaS platform provides Web3 marketing teams with a powerful platform to effectively target new audiences by matching blockchain activity with social profiles. Addressable is a trusted partner of leading Web3 companies including Polygon, Bancor, Immutable, and Kryptomon. Founded by data analytics veterans Tomer Sharoni, Tomer Shlomo and Dr. Asaf Nadler, Addressable has raised $7.5 million in a seed funding round led by Viola Ventures and Fabric Ventures.\nContact",
      "snippet": "Leading Web3 companies like <b>Polygon</b>, Bancor, Immutable, and Kryptomon are already using Addressables technology to acquire new users in an era when ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T21:37:54",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media.zenfs.com/en/news_direct/fbba8fcc04d272edcaf46d4aec40bfeb",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://news.yahoo.com/addressable-raises-7-5m-enable-213754446.html"
      }
    },
    {
      "id": "4179119927222240263",
      "title": "Star Wars Jedi: Survivor release date delayed to April Respawn says",
      "url": "https://www.polygon.com/23580234/star-wars-jedi-survivor-release-date-delayed",
      "description": "Star Wars Jedi: Fallen Order sequel Star Wars Jedi: Survivor has been delayed, Respawn Entertainment and Electronic Arts have announced. Jedi: Survivor now arrives on PS5, PC, and Xbox Series X on April 28, a six-week delay.",
      "body": "Email\nImage: Respawn Entertainment/Electronic Arts\nRespawn Entertainments follow-up to Star Wars Jedi: Fallen Order will arrive a little later than expected. The sequel, Star Wars Jedi: Survivor, will now launch on April 28, Respawn and publisher Electronic Arts announced Tuesday.\nThe continuing adventures of padawan Cal Kestis and droid pal BD-1 were originally expected to arrive on PlayStation 5, Windows PC, and Xbox Series X on March 17. The new late-April release date for Star Wars Jedi: Survivor represents a six-week delay.\nFor the last three years, the Jedi team here at Respawn has poured its collective heart and soul into Star Wars Jedi: Survivor, and we are proud to say the next chapter in the tale of Cal Kestis is content complete, reads a statement credited to game director Stig Asmussen and the Star Wars Jedi Team. We are now focused entirely on the final stage: bug fixes to enhance performance, stability, polish, and most importantly, the player experience.\nThe developer added, In order for the team to hit the Respawn quality bar, provide the team the time they need, and achieve the level of polish our fans deserve, we have added six crucial weeks to our release schedule.\nKestis next journey in the Star Wars galaxy is set five years after the events of Fallen Order, with our hero still being pursued by the Empire as one of the last remaining Jedi. Jedi: Survivor will expand on the series dynamic combat in new and innovative ways, giving Kestis new Force abilities and new lightsaber stances designed to keep the action fresh.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Star Wars Jedi: Fallen Order sequel Star Wars Jedi: Survivor has been delayed, Respawn Entertainment and Electronic Arts have announced.\nJedi: Survivor now arrives on PS5, PC, and Xbox Series X on April 28, a six-week delay.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T21:23:15",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/a3hGubhlJ8xjY8-cRYXi98ZgdBk=/0x0:3840x2010/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24276019/Star_Wars_Jedi_Survivor.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23580234/star-wars-jedi-survivor-release-date-delayed"
      }
    },
    {
      "id": "6324131122005441596",
      "title": "Marvel Snap Friendly Battle FAQ how to play against friends",
      "url": "https://www.polygon.com/guides/23568522/marvel-snap-friendly-battle-update",
      "description": "Marvel Snap features a battle mode. Called Friendly Battle, it lets you play against your friends. Heres everything you need to know about how it works.",
      "body": "Email\nImage: Second Dinner/Marvel\nYou can now send snarky Ms. Marvel stickers to your pals playing Marvel Snap, thanks to a recently added matchmaking mode. Rolled out in a Jan. 31 patch, Friendly Battle lets you go up against a friend in a multi-round gauntlet of Snap matches.\nUnless your friends are total jerks, Friendly Battle is relatively low stakes, allowing you a risk-free playground in which you can test out decks before bringing them to the main multiplayer mode. But its still a blast, and is poised to radically upend Marvel Snaps ever-evolving meta. Heres everything you need to know.\nHow do I start a match of Marvel Snaps battle mode?\nTo the right of Marvel Snaps main page, where the season pass tab used to be, youll see an icon shaped like a joystick. (You can still access the season pass menu in the upper-left corner of the main page.) Click on that, then select the giant Friendly Battle button  currently the only option on that tab.\nFrom there, you can either create or join a match of Friendly Battle. If you create a match, youll be given a five-digit numeric code. Send that to any friend you want to play against; they can punch it in and join your game.\nHow long are matches of Marvel Snap Friendly Battle?\nGames of Marvel Snaps battle mode lasts a bit longer than standard games, since each one plays out over multiple matches. Instead of cubes, players have health. After every match, the amount of cubes youd win is actually the amount of health your opponent will lose, and vice versa  but you cant deal more damage than the amount of health you have left. When one player drops to 0 health, its game over. You also cant switch decks between rounds.\nThis results in a fascinating wrinkle to Marvel Snaps underlying game of bluffs. Though locations are randomized with every match, both players use the same decks throughout. Success is contingent on memorizing which cards your opponent plays (and clocking, for instance, that your opponent has a Rogue in her deck, meaning your Wong card isnt just practically useless but is in fact an enormous risk factor).\nAll told, an entire game of Friendly Battle can last anywhere from 20 to 30 minutes.\nCan you earn progress from Friendly Battle?\nNope. Matches of Friendly Battle dont reward you with boosters (used to\nincrease your seasonal rank\n). All you can get is the sweetest prize of all: bragging rights.\nSince Marvel Snaps Friendly Battle doesnt influence your progress over the course of a season, its a good place to test out decks whose efficacy youre not yet sure of.\nDoes Friendly Battle feature chat?\nNot at the moment, unfortunately. Youll still have to rely on Marvel Snaps rudimentary but pointedly nontoxic communication system  sending Bitmojis of five popular characters  to convey feelings of dammit! and screw you! Or you could just pop into a Discord server.\nWhy doesnt my app show Friendly Battle?\nProbably because you havent updated your app! On iPhone, for instance, you may need to head to the App Store and manually update Marvel Snap. For Friendly Battle to display, your app should be on versions 11.18.1+0. (You can find this info at the very bottom of Marvel Snaps settings menu.)\nWhat are the best decks for Marvel Snap Friendly Battle?\nHey, this mode came out, like, three hours ago. Well let you know!\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Marvel Snap features a battle mode.\nCalled Friendly Battle, it lets you play against your friends.\nHeres everything you need to know about how it works.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T20:52:19",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/fgUhWUhQspJz-zkxRrMkdmjhaoo=/0x213:2000x1260/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399711/marvel_snap_battle_mode.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23568522/marvel-snap-friendly-battle-update"
      }
    },
    {
      "id": "477671127009054072",
      "title": "Marvel Snap battle mode FAQ how to play Friendly Battle",
      "url": "https://www.polygon.com/guides/23568522/marvel-snap-friendly-battle-mode-update",
      "description": "Marvel Snap features a battle mode. Called Friendly Battle, it lets you play against your friends. Heres everything you need to know about how it works.",
      "body": "Email\nImage: Second Dinner/Marvel\nYou can now send snarky Ms. Marvel stickers to your pals playing Marvel Snap, thanks to a recently added matchmaking mode. Rolled out in a Jan. 31 patch, Friendly Battle lets you go up against a friend in a multi-round gauntlet of Snap matches.\nUnless your friends are total jerks, Friendly Battle is relatively low stakes, allowing you a risk-free playground in which you can test out decks before bringing them to the main multiplayer mode. But its still a blast, and is poised to radically upend Marvel Snaps ever-evolving meta. Heres everything you need to know.\nHow do I start a match of Marvel Snaps battle mode?\nTo the right of Marvel Snaps main page, where the season pass tab used to be, youll see an icon shaped like a joystick. (You can still access the season pass menu in the upper-left corner of the main page.) Click on that, then select the giant Friendly Battle button  currently the only option on that tab.\nFrom there, you can either create or join a match of Friendly Battle. If you create a match, youll be given a five-digit numeric code. Send that to any friend you want to play against; they can punch it in and join your game.\nHow long are matches of Marvel Snap battle mode?\nGames of Marvel Snaps battle mode lasts a bit longer than standard games, since each one plays out over multiple matches. Instead of cubes, players have health. After every match, the amount of cubes youd win is actually the amount of health your opponent will lose, and vice versa  but you cant deal more damage than the amount of health you have left. When one player drops to 0 health, its game over. You also cant switch decks between rounds.\nThis results in a fascinating wrinkle to Marvel Snaps underlying game of bluffs. Though locations are randomized with every match, both players use the same decks throughout. Success is contingent on memorizing which cards your opponent plays (and clocking, for instance, that your opponent has a Rogue in her deck, meaning your Wong card isnt just practically useless but is in fact an enormous risk factor).\nAll told, an entire game of Friendly Battle can last anywhere from 20 to 30 minutes.\nCan you earn Marvel Snap progress from battle mode?\nNope. Matches of Friendly Battle dont reward you with boosters (used to\nincrease your seasonal rank\n). All you can get is the sweetest prize of all: bragging rights.\nSince Marvel Snaps Friendly Battle doesnt influence your progress over the course of a season, its a good place to test out decks whose efficacy youre not yet sure of.\nDoes Marvel Snap battle mode feature chat?\nNot at the moment, unfortunately. Youll still have to rely on Marvel Snaps rudimentary but pointedly nontoxic communication system  sending Bitmojis of five popular characters  to convey feelings of dammit! and screw you! Or you could just pop into a Discord server.\nWhy doesnt Marvel Snap show Friendly Battle?\nProbably because you havent updated your app! On iPhone, for instance, you may need to head to the App Store and manually update Marvel Snap. For Friendly Battle to display, your app should be on versions 11.18.1+0. (You can find this info at the very bottom of Marvel Snaps settings menu.)\nWhat are the best decks for Marvel Snap battle mode?\nHey, this mode came out, like, three hours ago. Well let you know!\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Marvel Snap features a battle mode.\nCalled Friendly Battle, it lets you play against your friends.\nHeres everything you need to know about how it works.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T20:52:19",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/fgUhWUhQspJz-zkxRrMkdmjhaoo=/0x213:2000x1260/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399711/marvel_snap_battle_mode.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23568522/marvel-snap-friendly-battle-mode-update"
      }
    },
    {
      "id": "368173464319720264",
      "title": "Last of Us strawberries are a symbol heres what they mean",
      "url": "https://www.polygon.com/23578593/last-of-us-strawberries-symbol-matrix-lord-of-the-rings",
      "description": "The Last of Us episode 3, about gay couple Bill (Nick Offerman) and Frank (Murray Bartlett), connects to The Matrix and Lord of the Rings in a fascinating way that many people who know the games wouldnt even pick up on.",
      "body": "Email\nImage: HBO Max\nNaughty Dog built The Last of Us on a bedrock of science fiction tropes, one showrunners Neil Druckmann and Craig Mazin easily reconstructed for their HBO adaptation. Many of the references are obvious: Joel and Ellie are successors to the familiar Lone Wolf and Cub protector/straggler dynamic, while the zombie of it all speaks for itself. But The Last of Us episode 3, Long, Long Time, marks a new blip on a trope timeline that feels far less obvious: the power of a sweet, sweet strawberry in the worst of times.\nIn \nLong, Long Time\n, doomsday prepper and Cordyceps survivor Bill (Nick Offerman) finds his world rocked when Frank (Murray Bartlett) shows up at his doorstep. What starts as a meal evolves into a loving, long-lasting relationship filled with the romantic highs, heated fights, and the sweet gestures of a normal-times marriage. While the episodes been lauded for deepening the games portrayal of Bill and Franks unspoken-in-the-games relationship and tearjerker ending, its the little moments that really let it spark. The one that stuck out to me: To crack the hard shell of his loved one, Frank trades a gun to Tess (Anna Torv) for a few strawberry seeds and surprises Bill with a well-tended garden. Bill sinks his teeth into one of those post-apocalyptic strawberries and, damn, its juicy. Bills face says it all: Thats the stuff. Strawberries.\nThe scene is easy to read: The strawberry, in all its glory  aromatically sweet, tart on the tongue, maybe even a bit leafy  is the fruit of a former world. From the decay of a fungal overgrowth erupts new life, the strawberry. And not only is the ground fertile enough to allow for rebirth, in this case, the missing ingredient was love. The bite of a strawberry in The Last of Us is a taste of hope. (And one easily destroyed by fungal infection.)\nDruckmann and Mazin arent alone in finding solace in the strawberry. In 2021, writers Lana Wachowski, David Mitchell, Aleksandar Hemon found humanity in the form of strawberries in The Matrix Resurrections. In that long-awaited sequel, Neo reunites with his old pal Niobe in the blossoming underground society of IO. Since Neo was last unplugged from the Matrix, humankind has brought life back under the scorched skies by extracting the code for familiar bits of everyday life and reassembling the digital bits into genetic code. While nothing is real in the Matrix, this reverse-engineering process allows IO scientists to re-create a true luxury: the strawberry.\nImage: Warner Bros. Pictures\nTwenty years before The Last of Us or The Matrix Resurrections, Peter Jackson, Fran Walsh, Philippa Boyens remixed J.R.R. Tolkiens own reflection on the joys of Middle-earth to make the strawberry even more important to two hobbits on an impossible mission, in a moment that at least feels apocalyptic. In The Return of the King, at one of the lowest moments on the journey to destroy the One Ring, Sam asks Frodo to revive his spirit through sense memory.\nDo you remember the Shire, Mr. Frodo? he asks. Itll be spring soon. And the orchards will be in blossom. And the birds will be nesting in the hazel thicket. And theyll be sowing the summer barley in the lower fields... and eating the first of the strawberries with cream. Do you remember the taste of strawberries?\nImage: Warner Bros. Pictures\nFrodo admits that he cant. He cant feel much of anything. To which Sam basically replies, Screw that, lets go. Theres no greater motivator on the hills of hell than the strawberry. (Funnily enough, in Tolkiens manuscript for The Return of the King, Sam pokes Frodo to remember the taste of rabbit, and only in the chapter The Grey Havens does the author reflect on the Shires delectable strawberries and cream  Jackson and his co-writers lifted the delicacy for use in their version of the scene.)\nThe strawberry-as-symbol craze has already iterated beyond the fruit itself. In HBOs Last of Us-like 2021 post-apocalyptic drama Station Eleven (based on the 2014 novel of the same name by Emily St. John Mandel), Jeevan (Himesh Patel) phones his ER doctor sister Siya (Tiya Sircar) as a viral pandemic begins to explode across Chicago. Her warning is immediate: Its too late to run  shelter immediately and barricade the door. But amid the anxiety spiral, Siya also finds time to reminisce with her brother about their childhood years. This might be the last time they ever speak, so why not recount the time Jeevan barfed strawberry Yoo-hoo on Jenny Kemkin?\nLater in the episode, Jeevan scrambles for groceries in a last-ditch effort for survival, but lingers when hes caught in a memory vortex. Strawberry... Yoo-hoo...\nImage: HBO Max\nThere is no shortage of the strawberry as a symbol of purity throughout time, from the lets-eat-strawberries-instead-of-people messaging of Soylent Green to multiple Shakespeare plays to the Bible, at least based on some interpretation. Ingmar Bergmans 1957 drama Wild Strawberries, in which an ailing doctor reflects on his winding life as he prepares for death, feels especially apt to the collective understanding of the strawberry as a fruit of Good Times; in Swedish, the title Smultronstllet is literally the wild strawberry patch but figuratively an idiomatic phrase for a place or moment in time associated with a feeling of great happiness.\nBut in a streak of post-apocalyptic fiction, the more classic representation of the strawberry as a pure organic entity feels more like what Bergman was chasing: a symbol of what was, tasted again, but only as a fleeting morsel. The Last of Us, tropiness of it all, leans right in and takes a bite of the feeling.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Last of Us episode 3, about gay couple Bill (Nick Offerman) and Frank (Murray Bartlett), connects to The Matrix and Lord of the Rings in a fascinating way that many people who know the games wouldnt even pick up on.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-31T20:37:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/bMpR3Pnaq2W9a9UJJlrf5uS7Gsk=/0x49:2846x1539/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24397131/strawberries.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578593/last-of-us-strawberries-symbol-matrix-lord-of-the-rings"
      }
    },
    {
      "id": "1418700236179320422",
      "title": "The Sims next-gen Project Rene features and customization revealed",
      "url": "https://www.polygon.com/23580081/the-sims-project-rene-development-update-multiplayer-playtest",
      "description": "The Sims next game, Project Rene, is still early in development but Electronic Arts shared an update on the game, its multiplayer functions, and the current playtests.",
      "body": "The Sims\n4 is still in active development, with a baby-focused expansion currently planned to launch in March. The next installation of The Sims for next-generation platforms is currently codenamed Project Rene, and its still relatively early in development. We havent seen any actual Sims from Project Rene so far, but Electronic Arts did share more details on the game during Tuesdays Behind The Sims Summit.\nA small part of the experience is currently in the hands of play-testers, and the developer stressed that the full game is still years out. Multiplayer will be a major part of the next Sims, alongside the traditional single-player experience that fans have enjoyed over the past Sims games.\nWe think we can be both, Grant Rodiek, game director for Project Rene, said during the stream.\nProject Rene will not be a MMO; the multiplayer features EA showed focus on enhanced customization. Play-testers are testing the games build-and-buy mode, which allows users to customize every part of a piece of furniture, from the color of the cushions to the exact wood used in the frame. Rodiek explained the team is pursuing a structure that allows friends to drop in or out to help build a bedroom or customize a gallery.\nYou can have that deep dive, at home, on your PC, play for four hours, change every single thing about a piece of furniture you can imagine  typing in RGB values and changing every single part. Thats the PC experience, the true, rich experience youre used to, Rodiek said.\nThen on the go, you can grab your phone, and maybe its a different experience. Maybe youre grabbing archetypes, pre-selecting templates, or grabbing the stuff youve already created, Rodiek added. What this means is you can now play The Sims wherever you are, with no barriers and no restrictions.\nWhile much of Project Rene is still kept under wraps, Rodiek did confirm that players will be able to create and customize Sims on the go, too. Its very difficult. Its not easy, its something we have to figure out, he said. Project Rene is still a long ways from launch, but its early development looks impressive and ambitious.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Sims next game, Project Rene, is still early in development but Electronic Arts shared an update on the game, its multiplayer functions, and the current playtests.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T20:28:49",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/BuJnYhXkNzZw5KfzAGevNBZEg-A=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19373190/Screenshot__258_.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23580081/the-sims-project-rene-development-update-multiplayer-playtest"
      }
    },
    {
      "id": "2380559044815095879",
      "title": "The Sims 4s new free patch adds hearing aids binders and more",
      "url": "https://www.polygon.com/23579998/the-sims-4-patch-medical-wearables-shapewear-binders-trans-affirming",
      "description": "The Sims 4 base game now has the option to add medical wearable gear like hearing aids or glucose monitors to Sims, as well as gender affirming customization like binders and top surgery scars.",
      "body": "The Sims 4\nis a bustling life simulator game with tons of inclusive options, and developer Maxis has added even more Create A Sim options for more authentic representation. A new patch was released on Tuesday that includes a handy light switch, better building on consoles, and bug fixes. Most notably, the patch includes wearable medical gear like hearing aids and glucose monitors, and trans affirming customization options like binders and top surgery scars.\nHow to equip medical wearables in The Sims 4\nIn Create A Sim, select your Sims face, then select Accessories. The new Medical Wearables category includes a new hearing aid that can be put on any Sim who is a toddler or older. The hearing aid comes in fifteen colors, and can be placed in the left ear, right ear, or both ears. For glucose monitors, select the Sims body category in Create A Sim. Players can add glucose monitors to the left or right arm, or the left or right side of the lower abdomen.\nUnder the same Body category, all players can find a Body Scars category with an option for Teen and older male Sims (masculine or feminine frame) to add a Top Surgery Scar to their Sims.\nHow to equip binders and top surgery scars in The Sims 4\nBinders, shape wear, and top surgery scars are ways that players can create trans Sims. These assets are available in the Create A Sim section of the game. Binders can be found in the Tops category, under Tanks, and can be equipped by Sims who are teenagers or older. Theres new shapewear available in the underwear section as well.\nThe Body category in Create a Sim has a section called Body Scars. Teen or older male Sims (with either a masculine or feminine frame) can add a top surgery scar to their Sim. These scars come from a breast tissue removal surgery, a common gender affirming procedure for trans and non-binary people.\nPrevious updates to The Sims 4 have allowed for better trans representation. In 2016, Sims were unlocked from the gender binary, and instead can be customized on a spectrum between masculine or feminine options. In May 2022, Maxis added customizable pronouns to Sims, including custom options for neopronouns.\nBuild mode updates and bug fixes\nThe new patch also updated Build Mode UI on consoles. Now the Catalog is opened by default and STAYS open as you grab items and interact with the lot. You no longer need to reopen the Catalog and re-navigate to the menu you were in every. single. time. Players will also be able to toggle on Guidance System, which will offer players assistance with Build Mode at any time.\nThere are also bug fixes for the base game along with a handful of expansions, including City Living, Get Famous, and High School Years. This includes delightful changes like toddlers no longer bathing with slippers on, and Child Sims who get at least a B average at school getting recognized be progressing in Parenting Predicaments scenario objectives. You can read the full list of bug fixes in the patch notes.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Sims 4 base game now has the option to add medical wearable gear like hearing aids or glucose monitors to Sims, as well as gender affirming customization like binders and top surgery scars.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T19:46:57",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/PPjahUqDTUDXDmbx9vI-p5MHCRU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399392/ts4_sexual_orientation_top_image.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579998/the-sims-4-patch-medical-wearables-shapewear-binders-trans-affirming"
      }
    },
    {
      "id": "8128813123988205146",
      "title": "GoldenEye Surface 2 walkthrough from communications link to the bunker",
      "url": "https://www.polygon.com/23578768/goldeneye-007-surface-2-mission-walkthrough-severnaya-surveillance-communications-link-mission-5",
      "description": "Traverse the snowy terrain of Surface 2 in GoldenEye 007 to interrupt the communications link. Leave no trace behind as you gain entry to the enemys bunker.",
      "body": "Email\nImage: Rare Ltd. via Polygon\nYou return to Surface in GoldenEye 007 to search for any evidence of Janus presence. It can be a little difficult to traverse the snowy terrain, but you must break the communications link to the bunker, and gain entry to the bunker.\nDepending on the difficulty setting youre playing on, you may have to disrupt all of the surveillance equipment and disable the Spetsnaz support aircraft. For visual learners, check through the galleries to find marked up screenshots that show you exactly where to go. Read on to learn how to complete every objective and in our GoldenEye 007 Surface 2 walkthrough.\nIf youre looking for assistance on previous levels, take a look at our GoldenEye 007 walkthroughs for Dam, Facility, and Bunker 1.\nTips before starting Surface 2 in GoldenEye 007\nEnemies will swarm you from everywhere as you progress through the level. Keep an eye out for enemy silhouettes in the distance, and take them out from a distance.\nUse the silenced pistol to destroy the surveillance cameras. Non-silenced weapons will lure more enemies out of their buildings to come towards you.\nJust keep running from objective to objective  dont stop.\nSurface 2 objectives\nDepending on the difficulty, you can have up to four primary objectives to complete on Surface 2. The four objectives are as follows:\nObj. A: Disrupt all surveillance equipment (00 Agent difficulty)\nObj. B: Break communications link to bunker (Agent difficulty and above)\nObj. C: Disable Spetznaz support aircraft (Secret Agent difficulty and above)\nObj. D: Gain entry to bunker (Agent difficulty and above)\nCollecting the comms room key\nGrid View\nImage: Rare Ltd. via Polygon\nEliminate any enemies along the way of the path.\nImage: Rare Ltd. via Polygon\nTake the second right, and continue down that path.\nImage: Rare Ltd. via Polygon\nHead down the path, and take the second left turn towards the wooden building.\nImage: Rare Ltd. via Polygon\nSurveillance camera one location on the front of the wooden building. Head inside after destroying it.\nImage: Rare Ltd. via Polygon\nCollect the comms room key after defeating the enemy inside.\nImage: Rare Ltd. via Polygon\nTurn right as you exit the building.\nImage: Rare Ltd. via Polygon\nTurn right again to see the giant telescope on top of the communications building.\nImage: Rare Ltd. via Polygon\nFollow the center path, and defeat any enemies that come your way.\nTake the third right, and continue until a path opens on your left.\nTake the second left on this path to find a wooden building, and quickly shoot the surveillance camera on the front of the building. You can also go around the building from the left side to buy yourself some more time before the alarm goes off.\nEnter the building, and eliminate the soldier inside. The enemy will drop a comms room key, so make sure to pick up the key before leaving.\nFollow the pathing outside of the building, and take the immediate right turn.\nTurn right up the snow embankment to see the silhouette of a building with a giant telescope dish on top.\nHead towards the building, and take out any nearby enemies outside the entrance.\nBreak the communications link to the bunker\nDestroy the the equipment on top of the table inside the room.\nImage: Rare Ltd. via Polygon\nEnter the building and go up the stairs.\nTurn left at the top of the stairs, and destroy the camera at the end of the path.\nContinue left up the stairs, and open the door straight ahead of you.\nShoot all three of the equipment on top of the table to break the communications link to the bunker  completing Objective B.\nDisrupt the remaining surveillance equipment\nGrid View\nTurn left out of the communications building.\nImage: Rare Ltd. via Polygon\nContinue down the path towards a fenced area with two buildings inside.\nImage: Rare Ltd. via Polygon\nGo to the back side of the building to find the third surveillance camera.\nImage: Rare Ltd. via Polygon\nLocation of the third surveillance camera.\nImage: Rare Ltd. via Polygon\nExit the fenced area and turn left. Follow the path to another pair of buildings.\nImage: Rare Ltd. via Polygon\nFind the fourth surveillance camera on the building on the right.\nImage: Rare Ltd. via Polygon\nFourth and final surveillance camera.\nImage: Rare Ltd. via Polygon\nExit the building, and turn left towards the back of the building.\nHead straight until you reach a fenced area with two wooden buildings inside.\nMove to the back side of the building on the left, and shoot the camera on the wall to destroy it.\nLeave the fenced area, and follow the path on the left to another pair of buildings.\nShoot camera on the wall of the building on the right to complete Objective A. If youre looking for the location of every surveillance camera, check out the surveillance locations section below.\nDisabling the Spetznaz support aircraft\nGrid View\nRetrace your steps to the communications building by turning left around the cliffside.\nImage: Rare Ltd. via Polygon\nPass the communications building.\nImage: Rare Ltd. via Polygon\nFollow the path from the entrance of the communications building, and turn left at the bottom of the slope.\nImage: Rare Ltd. via Polygon\nThrow the remote mine onto the helicopter to disable the Spetznaz support aircraft.\nGraphic: Johnny Yu/Polygon | Source images: Rare Ltd.\nTurn around and head left through the snow towards the communications building.\nContinue past the communications building, and follow the path from the entrance.\nGo right and walk down the path until you reach an intersection.\nTake the left path until you reach the Spetznaz support aircraft.\nOpen the start menu and switch to the weapons inventory. Scroll down and select the remote mine.\nAim at the helicopter, and press the fire button to throw the remote mine onto the aircraft. This step completes Objective C.\nGain entry to the bunker\nImage: Rare Ltd. via Polygon\nTurn around to find the bunker behind you.\nOpen the door and head inside to complete Objective D and Surface 2.\nAll surveillance equipment locations\nImage: Rare Ltd. via Polygon\nGo up the stairs and follow the pathing to the second camera.\nGraphic: Johnny Yu/Polygon | Source images: Rare Ltd.\nEnter the fenced area and go beside the building on the left. Find the camera on the wall, and shoot it to disable it.\nGraphic: Johnny Yu/Polygon | Source images: Rare Ltd.\nHead towards the building on the right to find a camera hoisted onto the front of the building. Destroy it to complete Objective A.\nGraphic: Johnny Yu/Polygon | Source Images: Rare Ltd.\nAlthough the surveillance equipment locations are mentioned in the above sections, here are the exact locations of the cameras in case you missed any:\nBefore entering the building with the comms room key, find the camera on the front face of the building.\nInside the communications building, go up the stairs and follow the path until you hit a corner. The camera will be on the wall directly ahead of you.\nInside of the fenced area with a pair of buildings, youll find the third camera on the side of the buildin",
      "snippet": "via <b>Polygon</b> You return to Surface in GoldenEye 007 to search for any evidence of Janus presence. It can be a little difficult to traverse the snowy ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T19:40:58",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/_u2Vw0YdXZhxDzU6YfLocvos2i0=/0x0:1600x838/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24397581/Surface2lede.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578768/goldeneye-007-surface-2-mission-walkthrough-severnaya-surveillance-communications-link-mission-5"
      }
    },
    {
      "id": "3570665824165247312",
      "title": "Batgirl would have hurt DC universe says new DCU Studios head",
      "url": "https://www.polygon.com/23579868/batgirl-canceled-release-dcu-movies-hbo",
      "description": "Warner Bros. late-stage cancelation of Batgirl still has fans asking questions, but new DC Studios co-chair Peter Safran offered some new answers during the announcement of the new DCU.",
      "body": "DC has announced its latest slate of movies and shows\n, but there are still plenty of questions swirling around Warner Bros. recent cancelation of Batgirl, a movie that was apparently mostly finished. During DCs announcement event on Monday, co-chairperson of DC Studios Peter Safran took some time to address these questions and shed a little more light on what went into shelving Batgirl and why he thought it was the right move.\nAccording to Safran, despite its late-stage cancelation, releasing Batgirl would have done nothing but harm to the larger DCU.\nOn the Batgirl front, its not about late in the process of the film getting canceled, Safran explained during the event, as reported by Variety. I saw the movie, and there are a lot of incredibly talented people in front of and behind the camera on that film. But that film was not releasable, and it happens sometimes. That film was not releasable. I actually think that [president and CEO of Warner Bros. Discovery David] Zaslav and the team made a very bold and courageous decision to cancel it because it would have hurt DC. It would have hurt those people involved.\nPart of the issue with the movie, as Safran explained, was that it was originally conceived as a direct-to-HBO-Max movie, which left it feeling a little too small for the shifting theatrically focused release plans that Warner Bros. Discovery had for its slate of superhero films.\nIt would not have been able to compete in the theatrical marketplace, Safran said. It was built for the small screen. So, again, I think it was not an easy decision, but they made the right decision by shelving it.\nSafran noted that part of the reason it would hurt the larger project is that Batgirl is sure to feature into the plans that he and co-chair James Gunn have for the larger Batman franchise, particularly with DCs upcoming The Brave and the Bold movie, which will introduce the Batfamily to the new DCU.\nSafran and Gunns new DCU\nwill kick off with a lineup of 10 interconnected projects that will make up the first chapter of the new universe. The first of the films on the way as part of the new DCU will be Superman: Legacy, written by Gunn, which will recast the Krytoponian hero and introduce the new DC world to viewers.\nNext Up In",
      "snippet": "late-stage cancelation of Batgirl still has fans asking questions, but new DC Studios co-chair Peter Safran offered some new answers during the announcement of the new DCU.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T18:51:59",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/WVORAvPk4BnytaPpi81avxD9ZQE=/598x0:1717x586/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22932033/batgirl_movie_concept_art.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579868/batgirl-canceled-release-dcu-movies-hbo"
      }
    },
    {
      "id": "3172372328496509148",
      "title": "Overwatch 2s season 3 battle pass brings back Overwatch Credits",
      "url": "https://www.polygon.com/23579894/overwatch-2-season-3-updates-ramattra-balance-credits-hero-gallery-skins",
      "description": "Overwatch 2 season 3 will include Ramattra balance changes and the reintroduction of Overwatch Credits and seasonal legendary skins.",
      "body": "Overwatch 2\nis on the verge of its third season of content, and Blizzard has released a statement that shares lessons learned over the first two seasons and how that will affect the game moving forward. This includes balance changes to new tank hero Ramattra, and the re-introduction of Overwatch Credits to allow players to pick up more skins without paying real money.\nRamattra is the games latest tank, a revolutionary omnic\nwho can turn into a terrifying Nemesis Form. Ramattras initial release was met with a lot of positive feedback in terms of fun factor, writes Blizzard. But it was clear you felt Ramattra wasnt viable in enough situations.\nSince Ramattras release, Blizzard has upped his power in Nemesis form with more armor and speed, along with a lower cooldown on his omnic forms Void Barrier. He currently stands as one of the stronger tanks on the roster, and Blizzard intends to nerf his ultimate ability Annihilation to compensate.\nIn Season 3, well be changing the timer on Annihilation so that it will tick down slower if enemies are in it (previously paused the timer entirely) and adding a cap of 20 seconds. That should eliminate many of the extreme uses and enable more counterplay while keeping Annihilation a strong and impactful ability.\nBlizzard is bringing back the original Overwatchs credits in Overwatch 2, which were previously called Legacy Credits that couldnt be earned via gameplay. Players can earn 1,500 credits for free through season 3s battle pass, with an additional 500 credits on the premium track. All epic and legendary-tier skins released prior to Overwatch 2 will be available in the games store, including ones from seasonal event modes, for 1,500 credits. If a player completes the battle pass, theyll be able to pick up a legendary skin once per season for free. Blizzard says its looking into additional ways to spend credits: These changes arent the end of our journey to make Overwatch 2 a more rewarding game to play - theyre just the beginning.\nThe blog also shares Blizzards takeaway from the Battle for Olympus and other seasonal game modes. While the developer is generally happy about the reception to Battle for Olympus, it is taking fan feedback around earning hero titles, completing challenges, and counting environmental kills into account for future updates. Blizzard also intends to release improvements to ranked matchmaking and revamping the on fire system.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Overwatch 2 season 3 will include Ramattra balance changes and the reintroduction of Overwatch Credits and seasonal legendary skins.\nOverwatch 2 is on the verge of its third season of content, and Blizzard has released a statement that shares lessons learned over the first two seasons and how that will affect the game moving forward.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T18:45:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Hq9OoGVfpJoVYWjNK9J0EoMJPCI=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24265234/OVR_Season2PK_ShambaliGameplay.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579894/overwatch-2-season-3-updates-ramattra-balance-credits-hero-gallery-skins"
      }
    },
    {
      "id": "4809507207800556667",
      "title": "Can Blitzle be shiny in Pokmon Go?",
      "url": "https://www.polygon.com/pokemon-go-guide/23579919/can-blitzle-be-shiny-spotlight-hour-january",
      "description": "Pokemon Gos latest Spotlight Hour, for January 31, 2023, features Blitzle. Can it be shiny?",
      "body": "Email\nImage: Julia Lee/Polygon | Source images: Niantic\nFor Jan. 31, 2023, Blitzle will be in the spotlight in Pokmon Go, and youll get double candy for transferring Pokmon. And yes, Blitzle can be shiny in Pokmon Go!\nGraphic: Julia Lee/Polygon | Image sources: Niantic\nWhile neither Blitzle nor Zebstrika, its evolution, are particularly meta Pokmon, you can use the candy transfer bonus to rake in extra candy for any rare Pokmon you may have. If youre still trying to gather Scatterbug Candy to evolve a Vivillon, this is a great time to transfer any extra Scatterbug you may have sitting around.\nPokmon is about catching em all, and in Pokmon Go, that means catching every variant, including rare shiny versions of Pokmon. Every Tuesday in Pokmon Go, players will see a specific Pokmon spawning more frequently during Spotlight Hour, which runs from 6 p.m. to 6:59 p.m. local time. Spotlight Hour is your chance to load up on candy, a chance for high CP Pokmon, and, if youre lucky, a shiny Pokmon.\nAre shiny rates boosted during Spotlight Hour?\nShiny rates do not appear to be boosted during Spotlight Hours, based on data gathered by Pokmon community The Silph Road. However, the sheer number of Pokmon that spawn during the hourlong weekly event will give you an improved chance of clicking on a random shiny. The more Pokmon you click on, the more opportunity you have to catch a shiny Pokmon.\nWhat can I do to attract more shiny Pokmon?\nNot much, unfortunately. It appears to be random chance. Shiny Pokmon catch rates are set by developer Niantic, and they are typically only boosted during special events like Community Days or Safari Zones, or in Legendary Raids. There are no consumable items that boost shiny Pokmon rates.\nWhere can I find a list of available shiny Pokmon?\nLeekDuck keeps a list of currently available shiny Pokmon. Its a helpful visual guide that illustrates what all of the existing shiny Pokmon look like.\nFor more tips, check out Polygons Pokmon Go guides.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Pokemon Gos latest Spotlight Hour, for January 31, 2023, features Blitzle.\nCan it be shiny?.\nEmail Image: Julia Lee/<b>Polygon</b>.\nSource images: Niantic For Jan.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T18:33:15",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/oMhuEWJ5oFcHN2XdNaT7tI1dpaU=/0x43:984x558/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399212/jlee_230131_1002_is_it_shiny_blitzle.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/pokemon-go-guide/23579919/can-blitzle-be-shiny-spotlight-hour-january"
      }
    },
    {
      "id": "1010218279731856725",
      "title": "Who are the Authority in DC Comics and Warner Bros. new movie?",
      "url": "https://www.polygon.com/23579767/authority-dc-james-gunn-superman-movie-dcu-slate",
      "description": "Superman is a household name, less so Apollo, the Superman of the Authority, the DC superheroes set to star in a Warner Bros. movie, according to James Gunn.",
      "body": "Warner Bros. new DC Studios roster\n: a Green Lantern buddy show set on earth, an Amazonian clash of politics and swords show set on Themyscira, a new Superman movie to set the new tone, and a Swamp Thing flick for the booming genre of horror cinema.\nAnd then, theres a movie about the Authority  a high concept superhero team from a little-known indie superhero setting created as a boundary-pushing reflection and celebration of the Justice League and the Avengers, whose two most famous members are basically \nWhat if Batman and Superman were gay married\n? They adopted a kid, and everything.\nWhat is the Authority? How did the team come to be? And how did they go from a reflection of the DC Universe to being in the DC Universe itself? We have the answers.\nWhat is DC Studios Authority film based on?\nImage: Mark Bagley/DC Comics\nThe Authority began its editorial life in the pages of the Wildstorm line, the independent superhero setting of then-upstart comic publisher Image Comics, founded in 1992 by current DC Comics chief creative officer, Jim Lee. Wildstorm was a kind of hard-edged, 90s kid version of the Marvel Comics titles that Lee and his artist cohorts had quit in order to form their own publisher, and the Authority grew out of its founding superhero team, Stormwatch.\nImages Stormwatch title was a reimagining of the teams of proactive, weapon-toting, secretive, extra-governmental task forces that were all the rage in superhero comics at the time. But while the teams brand of Schwarzenegger-esque one-liners and take-no-prisoners attitude was all the rage in 1993, it was looking increasingly dated by the end of the decade  and sales were starting to show it. Enter writer Warren Ellis, who was given the reins of the series in 1997 and a mandate to burn down and rebuild it how he saw fit.\nEllis  who work is now overshadowed by persistent allegations of predatory interpersonal behavior  replaced Stormwatch with a completely new roster. Now spearheaded by the foulmouthed, Union Jack-T-shirt-wearing Jenny Sparks, and the Trench Coat Guy par excellence Jack Hawksmoor, Elliss new team didnt just take a proactive approach to crises. The whole point was that they were determined to shape world events, even if that meant overriding or even overthrowing national governments. All of which led to the creation of a brand-new team out of the ashes of the old one: The Authority.\nWhat characters are on the Authority?\nImage: Warren Ellis, Bryan Hitch/DC Comics\nThe new title, launched in 1999 with the team of Ellis and artist Brian Hitch, struck like a widescreen lightning bolt on the comics scene, thanks in significant part to Hitch giving the book an expansive visual language inspired by cinematic blockbusters. Ellis imagined his team as an ersatz version of DCs Justice League, but one that engaged with  and exerted their will on  a world far more like our own. Alongside Sparks (alive since the year 1900, electricity powers, eventually revealed to be a human embodiment of the 20th century) and Hawksmoor (genetically engineered via alien abduction to take on the ineffable power of any city he walks into), were the Doctor (a magic-wielding mystic who was something like if Doctor Strange had no limits), the Engineer (a scientist who replaced her blood with 10 pints of nanomachines that can build essentially anything), Swift (Hawkgirl, but interesting), and the tag team of Midnighter and Apollo, clear analogues for Superman and Batman (with a little bit of Wolverine) who were  shock upon shocks for 1999!  a devoted gay couple.\nWith a then-revolutionary approach to large-scale, decompressed storytelling, and a wry, cynical attitude toward superhero cliches, The Authority rapidly became a trendsetting buzz book for the new millennium. That reputation that became even more pronounced after the Ellis/Hitch team was followed by the loud, brash, and very deliberately controversial approach of writer Mark Millar and artist Frank Quitely. Under their pens, the new team set the tone, style, and storytelling approach that (for better or worse) superhero series would follow for the next decade and change: From the cool-kid energy of Marvels Ultimate Universe (for which Millar wrote an updated Avengers), to the attitude of writer Grant Morrisons concurrent run on DCs JLA.\nWhat separates The Authority from other attempts to make \nmore realistic superheroes\n was that while it was more violent, sarcastic, and gritty than the classic superhero team book, at its best, it retained a fighting optimism about superheroes as a whole. If the world sucked, then the Authority would grit their teeth and find a way to make it better, whether by punching a despots brain out through the back of his head, or using their bigger-on-the-inside headquarters to home refugees afterward.\nHow did the Authority become part of DC?\nImage: Mikel Jann/DC Comics\nIronically, just as The Authority was beginning its run, Wildstorm itself underwent a corporate shift, moving from Image Comics to new ownership under none other than DC itself. At first, the new owners continued to run the Wildstorm universe as a strictly independent venture, meaning that the Authority and their pals only crossed over with the JLA and Batman in occasional, special-event crossovers. But the launch of DCs New 52 in 2011 inaugurated a new approach of gradually but steadily blending the two continuities.\nAnd so, in 2021, the Authority came full circle, as Grant Morrison and Mikel Jann gave us Superman and the Authority, a miniseries that imagined a near-future in which Superman himself has assumed leadership of the globe-watching superteam, and shaped them into an organization for the defense of humanity. And while that series seemed to be imagining an Elseworlds reality to come, Morrison (and their editors) were clear that it reflected the new status quo of the DC Universe, telling Comic Book Resources, What I did was kind of retrofit it all in so it absolutely ties in, its kind of important [] its very much tying in with what happens next with Superman and with Supermans son Jon Kent.\nSo, two decades later, the Authority have become more than just a wiseass version of the Super Friends: Theyre a sincere, if intimidating, encapsulation of what superheroes mean to the DC Universe in the new millennium. Heres hoping the world is ready for them.\nNext Up In",
      "snippet": "Superman is a household name, less so Apollo, the Superman of the Authority, the DC superheroes set to star in a Warner Bros.\nmovie, according to James Gunn.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-31T18:20:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/8CjfzIb_V99omxcTg5q_ynd4Oyg=/0x31:1041x576/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13706370/Authority_0001__1_.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579767/authority-dc-james-gunn-superman-movie-dcu-slate"
      }
    },
    {
      "id": "577820945906184659",
      "title": "Cryptocurrencies Price Prediction: Solana, Polygon & Binance American Wrap 31 January",
      "url": "https://www.fxstreet.com/cryptocurrencies/news/cryptocurrencies-price-prediction-solana-polygon-binance-american-wrap-31-january-202301311818",
      "description": "Solana Price Prediction: $30 SOL Incoming Solana price maintains its bullish stance. key levels have been defined to gauge the centralized smart contr",
      "body": "Binance Coin Price Forecast: BNB underpinned as rally steams on ahead of Fed\nBinance Coin (BNB) is set to jump higher as the US Federal Reserve comes out first with its assessment of the US economy and the best interest rate path approach in the future. Expectations are that the Fed will commit to a small 25-basis-point hike once or twice and go home for the year.\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice.\nCryptos feed",
      "snippet": "Solana Price Prediction: $30 SOL Incoming Solana price maintains its bullish stance.\nkey levels have been defined to gauge the centralized smart contr.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T18:18:03",
      "provider": {
        "name": "fxstreet",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://editorial.fxstreet.com/images/Markets/Currencies/Cryptocurrencies/cryptos_chart_Large.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fxstreet",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.fxstreet.com/cryptocurrencies/news/cryptocurrencies-price-prediction-solana-polygon-binance-american-wrap-31-january-202301311818"
      }
    },
    {
      "id": "2977144896349824594",
      "title": "James Gunn explains his new DCU across movies TV and animation",
      "url": "https://www.polygon.com/23579802/james-gunn-dc-slate-movies-tv-animation-gaming-explained",
      "description": "The DC cinematic universe is changing, and it will be confusing. But James Gunn is here to explain how the old DCU (Shazam, The Flash, Aquaman) connect to the new DCUs Superman, Supergirl, The Authority, Booster Gold, and more.",
      "body": "Flipboard\nEmail\nWriter-director James Gunn, who serves as DC Studios co-chairman and CEO with Peter Safran, outlined the duos plan for a new chapter of the DC Universe on Tuesday  a plan that will span eight to 10 years across 10 initial projects, and will attempt to unify DCs comic properties across film, television, gaming, and animation. The new DCU slate includes a cinematic reboot of the Superman franchise and a brand-new Batman movie thats not a sequel to 2022s The Batman.\nBut Gunn and Safrans new plan doesnt nullify the worlds of the four still-to-be-released DC Studios movies (Shazam! Fury of the Gods, The Flash, Blue Beetle, and Aquaman and the Lost Kingdom) nor will it apparently alter plans for sequels to Matt Reeves The Batman and Todd Phillips Joker. Gunn explains how the ambitious plans are all going to work in the video above, and provides more color on newly revealed projects starring Supergirl, Green Lantern(s), and Booster Gold.\nIn his announcement video, Gunn says the goal at Warner Bros. Discovery is to make sure the DCU is connected in film, television, gaming, and animation and that characters are consistent, played by the same actors, and it works in one story. Anything that doesnt work within that DCU continuity, including The Batman  Part II and Joker: Folie  Deux, will have its own brand: DC Elseworlds. (That label is familiar to many DC fans, as its where creators tell alternate universe What if...? stories outside of the comics continuity.)\nGunn also explains that the remaining DC movie slate, which draws on characters borne of the Zack Snyder-led era at DC, will lead directly into Gunn and Safrans new projects. Shazam has always been off kind of in his own part of the DCU so he connects very well, Gunn says. That moves directly into The Flash, a fantastic movie that [] resets the entire DC universe, and then [...] into Blue Beetle, about a kid whos a marvelous part of the DCU, and then into Aquaman 2.\nThe first of Gunns new DCU projects is Creature Commandos, a team of monstrous misfits who will operate under Amanda Waller (played by Viola Davis in The Suicide Squad and Peacemaker). Well see Davis return as Waller here, as Gunn explains, Were gonna have characters move into animation, out of animation, usually having the same actor play their voice as who plays them in live-action. That will be a major change for the DCU, in which multiple actors portray heroes like Batman, The Flash, and Superman across media formats.\nGunn goes on to explain some of his other projects, including Lanterns, likened to True Detective but with Green Lanterns who are space cops overseeing precinct Earth; The Authority a passion project for Gunn that will welcome the superhero team to the DCU for the first time; and Booster Gold, a Very Gunn character in that hes a loser from the future who becomes a superhero in the present day so that people will love him  basically the superhero story of imposter syndrome, Gunn says.\nOther projects, including new movies Superman: Legacy, The Brave and the Bold, and Supergirl: Woman of Tomorrow, get a bit more color as well, because Gunn namechecks the comic book writers and series that those films will draw from, including Grant Morrisons and Tom Kings runs on Brave and the Bold and Supergirl. (Interestingly, Gunns video breakdown shows artwork from Grant Morrison and Frank Quitelys All-Star Superman when discussing the Superman film he plans to deliver in 2025.)\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The DC cinematic universe is changing, and it will be confusing.\nBut James Gunn is here to explain how the old DCU (Shazam, The Flash, Aquaman) connect to the new DCUs Superman, Supergirl, The Authority, Booster Gold, and more.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T18:15:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/C4b92te_I4uSk_NaQLqVel4cVz4=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399033/james_gunn.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579802/james-gunn-dc-slate-movies-tv-animation-gaming-explained"
      }
    },
    {
      "id": "4481279551274751019",
      "title": "Ubisoft announces The Crew Motorfest a racing sequel set in Hawaii",
      "url": "https://www.polygon.com/23579847/the-crew-3-motorfest-release-date-announcement-ubisoft-location-map",
      "description": "The Crew Motorfest, the third game in Ubisofts open-world racing series The Crew, will launch in 2023 and take PlayStation, PC, and Xbox drivers to the Hawaiian islands.",
      "body": "Flipboard\nEmail\nThe Crew Motorfest will be the third installment in Ubisofts open-world racing series, the publisher announced on Tuesday. The latest chapter, developed by Ubisoft Ivory Tower, sends drivers to the Hawaiian islands.\nThe game will launch in 2023 but otherwise does not yet have a release date. Its tabbed for PlayStation 4, PlayStation 5, Windows PC, Xbox One, and Xbox Series X. The Crew Motorfest will also be accessible on launch day with an Amazon Luna or Ubisoft Plus subscription.\nThe Crew Motorfest will visit Hawaii under the auspices of a car festival, somewhat in the vein of Forza Horizon or the old MotorStorm series. Racing environments will include urban locations, off-road rallies, and seaside drives, Ubisoft said.\nA closed test will begin on Feb. 1 on PC, Ubisoft Ivory Tower said. Interested players may register for the opportunity to join The Crew Motorfests Insider Program testing out the game before its launch. Subsequent phases will target different groups of players, Ivory Tower developers said.\nThe Crew Motorfest follows 2018s The Crew 2, which itself was the sequel to 2014s The Crew, which was the first title published by Lyon, France-based Ubisoft Ivory Tower.\nGrid View",
      "snippet": "The Crew Motorfest, the third game in Ubisofts open-world racing series The Crew, will launch in 2023 and take PlayStation, PC, and Xbox drivers to the Hawaiian islands.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T18:11:03",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/p6UU7sx2CucR5aSublCZl7sTojM=/505x0:5884x2816/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399105/TCM_Announce_Screenshots_05_5884x3310_31012023_6PMCET.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579847/the-crew-3-motorfest-release-date-announcement-ubisoft-location-map"
      }
    },
    {
      "id": "2275373043378646949",
      "title": "The Sims 4s infant update launches in March",
      "url": "https://www.polygon.com/23579807/the-sims-4-infant-baby-update-release-date-announcement-march",
      "description": "Maxis announced that its infants update is coming to The Sims 4 on March 14. Babies do much more than just lay there: crawling, spitting up, breastfeeding, and more.",
      "body": "The Sims 4\ns most anticipated updates will arrive in-game on March 14, developer Maxis announced during its Behind The Sims Summit livestream on Tuesday. Of course, its the babies update. The developer debuted a brief trailer and a quick behind-the-scenes look at the infant update, showing off everything that infants  and the player!  can do once its live.\nAnd its huge. Of The Sims 4s seven different life stages, babies are currently terribly limited, basically props linked to a bassinet. Babies just lay there, but the players still got to take care of them. The infant update on March 14 will make taking care of babies much more interesting, because theyve finally got some agency. It starts with the Create-A-Sim screen for babies, which is where youll be able to change how a baby looks and what its wearing.\nBeyond that, babies can crawl, spit up, take baths, have tantrums, bite, and be breastfed  and thats not even it. Its truly an all-encompassing life stage, with a ton of new technology: sitting or standing while holding a baby, giving your baby to another person, and a bunch of ways for babies to move, crawling all over all sorts of things. Socially, babies can interact with all other life stages in different ways, including animals.\nIt means a lot of cute new items, too, like nursery items and toys.\nIts unclear whether this new life stage will go between newborns and toddlers, or simply be the first life stage available, but weve reached out to Electronic Arts for clarification. Toddlers, for their part, were added to The Sims 4 in 2017, which added a lot of depth to the family experience in the game. Toddlers have their own personalities and traits, and the ability to learn new skills that stay with them through their lifespan.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Maxis announced that its infants update is coming to The Sims 4 on March 14.\nBabies do much more than just lay there: crawling, spitting up, breastfeeding, and more.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T18:01:34",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/ifshyqHPNIHSEYl2FD2iZ0NiD9M=/0x162:2256x1343/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399026/Screenshot__183_.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579807/the-sims-4-infant-baby-update-release-date-announcement-march"
      }
    },
    {
      "id": "7594760854959188734",
      "title": "Superman: Legacy release date cast and everything we know so far",
      "url": "https://www.polygon.com/23579720/superman-legacy-cast-release-date-director-james-gunn",
      "description": "Superman: Legacy is the first movie in the new DCU and will be written by James Gunn, though it doesnt have a director yet. The movie will also not star previous Superman Henry Cavill, but has not announced who will replace him.",
      "body": "Email\nImage: The CW\nA new Superman movie is finally on the way as part of James Gunn and Peter Safrans new take on the DC Universe. On Tuesday, the pair, who are now coheads of Warner Bros. DC Studios, announced a list of 10 projects (\nincluding two Batman movies\n) that will kick off the new DCU starting with Superman: Legacy in 2025.\nWhile the announcement didnt include too many details about Superman: Legacy just yet, heres everything we do know about the Man of Steels latest foray into film.\nHenry Cavill wont play Superman\nThe previous Superman, who started his tenure in 2013s Man of Steel, has hung up his cape for good and wont be returning as Superman for Gunns new film. While\n2, we still dont know who will take up the mantle next. Gunn has teased that itll be a younger take on Clark Kent, although old enough to already be working at the Daily Planet.\nWhats Superman: Legacy about?\nBeyond the youth-skewing approach to the film, all we know from the initial announcement of the DCU and Chapter 1: Gods and Monsters is that Superman will be balancing his Kryptonian heritage with his human upbringing. Might we finally get Brainiac on the big screen?\nJames Gunn is writing the movie\nGunn will handle the scripting for Superman: Legacy, which should put him in the position to set up his new DCU in whatever way he can. His role as writer clearly makes this a different project than the one J.J. Abrams was developing with Ta-Nehisi Coates movie either, which is reportedly still in the works as a DC Elseworlds film.\nWe dont know whos directing it yet\nNo official director has been attached to Superman: Legacy just yet. Gunn said during the larger DCU announcement that he may end up being the one to direct it, which could make sense as its the official kick off of the new universe, but he may also have too many irons in the fire elsewhere to do more than write this new version of Superman.\nWhen will Superman: Legacy be released?\nSuperman: Legacy is set to arrive in theaters on July 11, 2025. This seems to be the first of the new slate of DCU projects to get a release date and will even be released ahead of The Batman Part 2, which is set to come out in Oct. 3, 2025.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Superman: Legacy is the first movie in the new DCU and will be written by James Gunn, though it doesnt have a director yet.\nThe movie will also not star previous Superman Henry Cavill, but has not announced who will replace him.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T17:33:22",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/VktV8Tlr4DaQBvULxgO0Patb2Ig=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24399008/Superman_Supergirl.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579720/superman-legacy-cast-release-date-director-james-gunn"
      }
    },
    {
      "id": "7251732558471841075",
      "title": "DC reveals Batman Part 2 release and more Batman movies in Phase 1",
      "url": "https://www.polygon.com/23579541/batman-2-movies-brave-bold-joker-james-gunn-dcu-releases",
      "description": "Warner Bros. and James Gunns new slate of DCU films features a new Batman and Robin movie, Brave and the Bold  but what does that mean for The Batman 2 and Joker 2? Heres the release schedule plan.",
      "body": "Warner Bros. new slate of movies\nand TV based on DC Comics is expansive, from a deep space adventure with Supergirl to deep swamp horror with Swamp Thing. Theres even a new Batman movie, starring a new Batman and Robin!\nBut that may leave fans of 2022 blockbuster The Batman wondering where that leaves the films sequel and previously announced spinoff TV shows, and fans of Joker wondering about its sequel. The answer is its theyre still there  just elsewhere. Or, to be specific: Elseworld.\nWhat is Brave and the Bold, WBs new Batman movie?\nImage: Grant Morrison, Andy Kubert/DC Comics\nAccording to Warner Bros. announcement  heralded by director and co-chairperson of DC Films, James Gunn  Brave and the Bold will be the first official DCU Batman movie of the studios new direction for DC Comics adaptations.\nThe flick will be an unusual father-son story based on Grant Morrisons run on the comics Batman and Batman & Robin with Frank Quitely and other artists. Their time on Batman books was marked by wild new supervillains like the cannibalistic Flamingo and the plastic surgery-obsessed Professor Pyg  and Batmans discovery that his off again on again flame, Talia al Ghul, had been hiding the existence of their son, Damian, from him.\nIn the comics, Talia raised Damian as a spoiled assassin, only dumping him in Batmans lap on his eleventh birthday, causing no end of conflict as Damian came to terms with his fathers no killing rule. Its certainly one of the angles the film could explore, not to mention the action possibilities you get when Batmans baby momma is the daughter of Ras al Ghul and leader of the ninja-assassin consortium known as the League of Shadows.\nAs yet, Brave and the Bold does not have a release date, or any creatives attached, but we can expect it to hit theaters no sooner than July 2025, when Gunns Superman: Legacy kicks off the direction of the new DC Films interconnected universe.\nIs The Batman 2 still happening? Joker 2?\nPhoto: Jonathan Olley/Warner Bros.\nJoker: Folie  Deux, the reportedly musical sequel to 2019s Joker, starring Joaquin Phoenix and Lady Gaga, started production in 2022, and remains slated to premiere on Oct. 4, 2024.\nMatt Reeves Batman film franchise is still moving ahead as well. Unless we hear otherwise, its safe to assume that its spinoff TV series, The Penguin, is also still happening, as well as the two untitled The Batman TV spinoffs in development, about Arkham Asylum and the Gotham City Police department. All three shows were reportedly still in development in late October 2022, shortly after Warner Bros. announced James Gunns involvement in redirecting the DC Films subdivision.\nRobert Pattinson is confirmed to return in The Batman  Part II, with Matt Reeves in the directors chair again. There is no firm information on who else from the cast would return (although the actors of key characters, like Zo Kravitz, Jeffrey Wright, and Andy Serkis are almost certainly on contract for sequels), and only speculation on who the villain would be, as Pattinson and Reeves have been perfectly happy to chat to reporters about their favorite Batman villains.\nSo there will be two Batman franchises??\nImage: Frank Quitely, Alex Sinclair/DC Comics\nIt sounds like... yeah. Brave and the Bold will represent the core direction for Batman in the film DC Universe, while The Batman and its sequels and spinoffs will be classified as a DC Elseworlds story, a tried and true designation from the pages of DC Comics itself.\nBack in the late 1980s, when DC Comics did its own franchise-wide reboot that flattened all the parallel settings of the DCU into a single setting, any story that featured DC Comics characters but was impossible to square with that timeline was labeled an Elseworlds story. For example, the very first Elseworlds story, Gotham by Gaslight, was a reimagining of Batman as a Victorian-era hero on the hunt for Jack the Ripper.\nThe new DC Films slate is borrowing Elseworlds in much the same situation  a rebirth of priorities that still leaves space imagine the different ways a superheros story can be told. The DC Elseworlds slate will include The Batman Part II, Joker: Folie  Deux, the current animated series Teen Titans Go!, and Ta-Nehisi Coates long-gestating Superman movie. And thats a healthy swathe of alternate universe drama for all kinds of fans.\nNext Up In",
      "snippet": "and James Gunns new slate of DCU films features a new Batman and Robin movie, Brave and the Bold but what does that mean for The Batman 2 and Joker 2? Heres the release schedule plan.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T17:10:01",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/zFI2vtZqIGU-U4XgohtviOmaLRI=/397x0:3434x1590/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24398739/image_2021_12_27_134301.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579541/batman-2-movies-brave-bold-joker-james-gunn-dcu-releases"
      }
    },
    {
      "id": "25250287375464476",
      "title": "Every new DC movie and show announced from James Gunns DC Studios",
      "url": "https://www.polygon.com/23578415/new-dc-movies-james-gunn-release-date-superman-batman-schedule-calendar-upcoming",
      "description": "Batman, Superman, Wonder Woman, and the Snyderverse get a reboot as James Gunn reveals Phase 1 of the DCU, 10 DC movies and shows that he and Peter Safran will produce for DC Studios. Heres the lineup and release calendar.",
      "body": "Email\nIllustration: Lucia Pham for Polygon\nDC Studios has revealed its full slate of movie and TV projects coming soon under the leadership of James Gunn and Peter Safran. The list includes five feature films and five television series for HBO Max, headlined by two Batman movies and a Man of Steel reboot, Superman: Legacy, in 2025.\nThe lineup includes some of the comics publishers most recognizable and famous heroes and franchises, as well as some offbeat choices  which shouldnt surprise anyone familiar with Gunns rsum, which includes the 2022 HBO Max show Peacemaker and Marvels Guardians of the Galaxy trilogy.\nHeres a look at all the new movies and shows coming to the DC Universe:\nNew DCU movies\nSuperman: Legacy\nThis is the only project with a release date: July 11, 2025. Written by Gunn, Superman: Legacy will follow Kal-El as he reconciles his extraterrestrial origins with his human family and upbringing. It sounds like a reboot of 2013s Man of Steel (directed by Zack Snyder) with one important proviso: Henry Cavill is not coming back as Superman. So expect a lot of anticipation and hype as Gunn gets close to finding his lead.\nRelated\nEverything we know about Superman: Legacy so far\nThe Authority\nThis superhero ensemble dates to a 1999 comic book series published under DCs WildStorm imprint. The Authority is a group of seven heroes with very high-concept super powers (one, Jack Hawksmoor, is psychically bonded to cities, drawing his strength from them). It will be the first appearance of WildStorm canon in the DC Universe.\nThe Brave and the Bold\nImage: Grant Morrison, Frank Quitely, Philip Tan/DC Comics\nThe Brave and the Bold is a silver-age DC Comics title that, for about 15 years (1967 to 1983) starred Batman and Robin in crossover stories with other DC characters. It was also the title of a three-season Batman animated series airing on Cartoon Network from 2008 to 2011. DC Studios news release says the DCU will introduce its Batman and Robin in this unusual father-son story inspired by Grant Morrisons comic series. That series was inspired by the animated show.\nRelated\nHow the whole Batman Elseworlds thing works\nSupergirl: Woman of Tomorrow\nDC Studios says this picture, based on Tom Kings award-winning comics stories, presents a Supergirl viewers are not used to seeing. Truthfully, theyre not used to seeing Supergirl on a big screen at all. Her only theatrical appearance so far is 1984s Supergirl, starring Helen Slater as Kara Zor-El, and Faye Dunaway as her nemesis.\nSwamp Thing\nBelieve it or not, Swamp Thing (whose first appearance was in 1971s House of Secrets #92) appeared in two movies back in the 1980s, the first one (1982s Swamp Thing) directed by horror master Wes Craven. DC Studios lineup announcement says only that this movie will investigate the dark origins of Swamp Thing.\nNew DCU TV shows\nCreature Commandos\nGunn is the writer for this series, already pegged at seven episodes. In it, Amanda Waller (the director of the Suicide Squad) forms another super-team out of monstrous prisoners.\nWaller\nIf Creature Commandos wasnt enough, this series dedicated to Amanda Waller stars Viola Davis in the lead role. DC Studios says the show will feature Team Peacemaker, and is written by Watchmens Christal Henry and Supernaturals Jeremy Carver.\nBooster Gold\nImage: DC Comics\nDC Comics longtime comic-relief character is a time traveler who uses basic technology and consumer appliances from the future to make himself a superhero in present day.\nLanterns\nThe Green Lantern Corps have been the galaxys foremost law enforcement agency since 1959, making Hal Jordan (the Silver Age Green Lantern) and John Stewart (first appearance, 1971) perfect for a buddy-cop team-up. DC Studios said it will be an enormous TV event series focused on the two unraveling a dark mystery.\nParadise Lost\nIts set in Themyscira, so you know this show will touch Wonder Womans history and character arc. Its not clear if she will star in it, though. This drama focuses on the genesis and political intrigue of an island of all women, DC Studios said, which sounds very Game-of-Thrones-y.\nGunn and Safran took over as heads of the DC Universe in October, when they were both announced as coequal chiefs of DC Studios. The two will lead all movie, television, and video game products for the company, with Gunn likely to take on the writing and directing of other projects as well. 2023 will also see the release of a number of pre-DCU films, including Shazam: Fury of the Gods, The Flash, and Aquaman and the Lost Kingdom.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Email Illustration: Lucia Pham for <b>Polygon</b> DC Studios has revealed its full slate of movie and TV projects coming soon under the leadership of James ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T17:07:06",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/zjmnAzp8dfQkG6WcC8uhEVZje-8=/0x22:997x544/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23085475/Batman_Superman_Worlds_Finest_Cv1_JAY_FABOK_OPEN_ORDER_VARIANT.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578415/new-dc-movies-james-gunn-release-date-superman-batman-schedule-calendar-upcoming"
      }
    },
    {
      "id": "8622593951554297239",
      "title": "Targets 20-inch Pokmon Squishmallows out now are absolutely huge",
      "url": "https://www.polygon.com/23579586/pokemon-squishmallow-pikachu-gengar-20-inch-jazwares",
      "description": "The Pokmon Company and toymaker Jazwares have released their 20-inch Pokmon Squishmallows (Pikachu and Gengar) at Target. They went fast, but some stores appear to have inventory.",
      "body": "Email\nPhoto: Polygon\nTarget started selling The Pokmon Company and toymaker Jazwares 20-inch Pokmon Squishmallows on Jan. 29 to little fanfare. The retailer quietly put a release date on its website, listing most stores as having two to four of each  Pikachu\nand Gengar\n in stock. It was an easy drop to miss  except for those whove been watching the site intently, like me.\nThats why I arrived at Target around 15 minutes before it opened, expecting there may be a small group of people looking to buy one of the new Squishmallows. (There are a lot of Squishmallow fans, but also a lot of resellers whove benefited from early drops.) No one else was there looking for Squishmallows, and a Target employee grabbed one of each for me from the back. It was easy, and the culmination of a month of seeking out Targets and Walmarts for the odd store out that may have put out the plush toys early, like I saw online.\nPhoto: Polygon\nThe guy came back with two massive boxes and another worker in tow. Surely, I thought, there were more than two Squishmallow in each box, but I was wrong. The 20-inch Pokmon Squishmallows are absolutely massive. Im sure that if I curled up small enough, I could fit inside the skin of one of them. My dog can lay comfortably on top of one like its a bed. I have a 10-inch Squishmallow, so I figured a 20-inch would just be double the size. Its not  its roughly four times as big as the 10-inch one.\nPOV: you're in a meeting with me today\nJanuary 30, 2023\nOf course, there are no complaints here. Theyre perfect, and have joined me in every meeting Ive had since I got them. If you want your own, theres good news and bad news: Theyre definitely out at Target, but theyre very hard to find. Most stores near me sold out within a day, according to the Target website. But others on social media and Reddit have seen restocks and rogue Pokmon Squishmallows  youll want to check online. You cant order online for delivery, but they are available to pay for online and pick up in-store. Target is the only store selling the 20-inch Squishmallows right now, and its not clear if theyll be sold elsewhere. Targets selling them at $44.99.\nTen-inch versions of the Pikachu and Gengar Squishmallows are expected to go on sale at Walmart in early February, too  as early as Wednesday. (Some folks online reported buying them in early January, due to stores putting them out early. Walmart then recalled them to ensure they couldnt be sold before the release date.) Other sizes will be available, too. The only ones expected to be limited are the ones from The Pokmon Center, which sold out instantly in November. The 10-inch Pokmon Squishmallows cost around $15.\nGameStop will also sell 10-inch and 14-inch Pokmon Squishmallows. The listing suggests theyll be out in May. Hot Topic and others are expected to have them later, too.\nA post shared by Squish Alert (@squishalert.app)\nThese are Jazwares and The Pokmon Companys first two Pokmon Squishmallows, as the companys confirmed its going to make more. Its unconfirmed which Pokmon will get Squishified, but Squishmallow restocking app SquishAlert suggested that Snorlax and Togepi are two of the next ones, posting photos of the purported plushes. The Pokmon Company declined to comment.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Email Photo: <b>Polygon</b> Target started selling The Pokmon Company and toymaker Jazwares 20-inch Pokmon Squishmallows on Jan. 29 to little fanfare.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T16:57:12",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/tC8PjeLrbDVVN3_xjnPfSBhPsqA=/0x0:4032x2111/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24398777/IMG_8594.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579586/pokemon-squishmallow-pikachu-gengar-20-inch-jazwares"
      }
    },
    {
      "id": "4129949532342191567",
      "title": "Dead Space remake: Where to find the Tissue Sample side mission item",
      "url": "https://www.polygon.com/guides/23579507/dead-space-remake-tissue-sample-premeditated-malpractice-side-mission-walkthrough-dna-scanner-hunter",
      "description": "In the Dead Space remake, youll need to find a tissue sample for a side mission. Our guide will walk you through finding the tissue sample and the DNA Scanner.",
      "body": "Email\nImage: Motive Studio/Electronic Arts via Polygon\nThe Dead Space remake adds new side missions to Isaacs time on the USG Ishimura. These are small(ish) trips through the ship to round out the narrative and world-building. One side mission, Premeditated Malpractice, might be a little confusing: Found during Chapter 5, Lethal Devotion, you can stumble on the steps out of order.\nPremeditated Malpractice guide will walk you through finding the Tissue Sample and the DNA Scanner to complete this side mission.\nTissue Sample Needed\nWhat makes this side mission confusing is that you can find the DNA Scanner in the Main Lab of Medical (on your way to collect the liquid nitrogen while fleeing the Hunter necromorph) before you find the sample it needs. The DNA Scanner will just say Tissue Sample Needed.\nTo find the Tissue Sample, you just have to play a little further.\nCollect the Tissue Sample from the Hunter\nIn Cryogenics, youll finally fight and defeat Dr. Mercers Hunter by Stasis-ing it in the central cryo chamber and activating the controls in the adjoining Cryogenics Control Room. Once its dead  and after a quick call with Daniels  youll be free to loot the room(s).\nCollect the Tissue Sample after defeating the Hunter in Cryogenics.\nImage: Motive Studio/Electronic Arts via Polygon\nIn the cryo chamber, all thats left of the Hunter is a Tissue Sample. Pick that up to start the Premeditated Malpractice side mission. Open the RIG menu and tab over to Missions. On the right, select the Scan Tissue Sample objective under Premeditated Malpractice and choose Track Objective.\nScan the Tissue Sample at the DNA Scanner\nNow, your locator will lead you back to the Main Lab area of Medical and to the DNA Scanner. Youll have to handle a few necromorphs on the way there.\nScanning the Tissue Sample there will unlock the next steps in the side mission that take you to the Bridge and finally to Hydroponics  where youll pick up the Prototype Stasis Module upgrade that adds damage to your Stasis ability.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Email Image: Motive Studio/Electronic Arts via <b>Polygon</b> The Dead Space remake adds new side missions to Isaacs time on the USG Ishimura. These are ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T16:38:38",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/XkljAxf9ZEHH2vIxWSo0Yd-anMg=/0x57:2880x1565/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24398791/Dead_Space_Tissue_Sample_cover.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23579507/dead-space-remake-tissue-sample-premeditated-malpractice-side-mission-walkthrough-dna-scanner-hunter"
      }
    },
    {
      "id": "2445543978277967166",
      "title": "Tom Hanks getting de-aged with deepfake AI for new Robert Zemeckis movie",
      "url": "https://www.polygon.com/23579566/tom-hanks-ai-movie-de-aged-robert-zemeckis",
      "description": "The upcoming movie Here, starring Tom Hanks and Robin Wright, and directed by Zemeckis, will be using the technology behind the viral deepfake Tom Cruise.",
      "body": "an insult to life itself\n.\nThe upcoming movie Here, from Robert Zemeckis and starring Tom Hanks and Robin Wright, will probably increase that discourse tenfold. The movie will be using the AI-driven tool Metaphysic Live, best known for its deep fakes of Tom Cruise (and also featured on Americas Got Talent).\nHere, adapted from Richard McGuires graphic novel, follows the two protagonists over a long period of time and is set in a single location. Both Hanks and Wright will be de-aged in the movie, playing the younger versions of their characters.\nZemeckis said in a statement to The Hollywood Reporter the technology will allow Here to do things that were previously impossible, by having Hanks and Wright play their characters throughout the films time periods.\nOf course, while what Zemeckis says is technically true by one definition, many, many movies have managed to portray characters across multiple time periods before Here. Makeup and costuming, or casting different actors to play younger (or older) versions of the characters, are old methods that have worked time and time again. Well just have to wait and see how Here compares (and also how it compares to other, more recent de-aging tech, like that seen in The Irishman and the upcoming\nIndiana Jones and the Dial of Destiny\n).\nWright was previously in the excellent (and underseen) 2013 movie The Congress, about an actor who gives her digital likeness to a movie studio for them to use in perpetuity. A challenging work that anticipates many of our current conversations around AI (and a movie that also looks great), The Congress has never been more relevant (and you can watch it on Hulu, Peacock, or for free with ads on Tubi).\nHere, which co-stars Paul Bettany and Kelly Reilly along with Hanks and Wright, is expected for release in 2024.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The upcoming movie Here, starring Tom Hanks and Robin Wright, and directed by Zemeckis, will be using the technology behind the viral deepfake Tom Cruise.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T16:33:40",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/HeNuekETWtQnHx06QFx6RJxaVGs=/0x128:2500x1437/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24398871/TELEMMGLPICT000281290699_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwSX5rhseiWKOo9p9OQ_ymek.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579566/tom-hanks-ai-movie-de-aged-robert-zemeckis"
      }
    },
    {
      "id": "1538625972487531301",
      "title": "The One Piece manga is great but it has never been so exhausting",
      "url": "https://www.polygon.com/23579573/one-piece-manga-eiichiro-oda-burnout",
      "description": "Eiichiro Odas One Piece manga has been keeping up a relentless pace for five years now, and fans can be forgiven for wanting to take a break from the adventures of Luffy and co.",
      "body": "Email\nImage: Eiichiro Oda/Viz Media\nIts a very fun and very complicated time to be a fan of Eiichiro Odas One Piece manga. And I dont just mean the recent events of the Egghead Arc, where the Straw Hats finally met the infamous Dr. Vegapunk, an encounter that has coincided with roughly a million different reveals and plot twists. The last time One Piece had a story arc that seemed to give its readers a chance to breathe was around five years ago, and even then, the plot was consumed with a heated and lengthy battle between Luffy and Katakuri and Big Moms delirious pursuit of the Straw Hat Crew.\nOda has made it clear that One Piece is entering a final stage of sorts (though what that entails, and how long he has left, are endlessly debatable) and even chapters that seemed like they might provide a bit of respite have introduced new threats and/or details for fans to mull over. So recently, Ive seen quite a few readers respond to One Piece chapters with a sense of exasperated confusion, like when youre lost in a department store as a kid and you cant comprehend any sort of direction. Fans still love the book  theyre just finding that love to be somewhat exhausting.\nAnd thats understandable. A fix for this thats often quoted among One Piece fans is to wait for the arc to finish and then binge it. Oda has a way of threading plotlines that feels really satisfying in the end, but leaves you wondering Where is this going? while youre in the thick of things. Binging also allows you to shrug off bits that honestly go nowhere or dont really work out  something thats fairly annoying on a week-to-week schedule, but much more forgivable as part of the bigger picture. This proclivity has only become exacerbated in recent years as the stakes get bigger and bigger and the narrative gets full to bursting with whatever climactic scenario Oda is trying to concoct.\nYou might just be tired of One Piece right now\nTheres also another suggestion: You might just be kind of tired of One Piece right now. In an era of indefinite storytelling, thats a real possibility. Now, One Piece isnt like a Pokmon or a Marvel Cinematic Universe  something where you can clearly compare and contrast the quality of, or your interest level in, each new installment. It is one long story created, for the most part, by one artist. But make no mistake, One Piece is expansive enough as a story and as a franchise that if you find yourself ending every chapter with a frustrated shrug emoji, you might be bored of this Luffy stuff for a while.\nEveryone engages with something this big on their own level. Some just read the manga, but others read it, watch the anime adaptation, buy the clothes and merch, debate every chapter with fans, and analyze it in their free time. In that scenario, burnout is inevitable. Of course, tastes vary, and theres a good chance that youre watching Dr. Vegapunks Wonderful World of Shit You Didnt Know Yet That You Might Not Like, and wont dig it no matter how much space you put between you and the Straw Hat Crew. Thats cool.\nGetting sick of something, though, especially something that has been going so hard for half a decade (in a story thats lasted 25 years, as of last July) is cool, too. Its hard to admit in a time so dominated by IPs slipping into every facet of our lives, when the ONE MOVIE/TV SERIES/MANGA/ANIME\nTHAT THE WHOLE WORLD IS TALKING ABOUT\n comes out twice a week. Being bored means missing out on the thing and the conversation around it, and being dismissive of it means opening yourself up to a wave of people who will heartily disagree with you.\nBut one can still very much like One Piece and be very tired of One Piece right now. If thats the case, go away for a few months. Take a vacation from the Grand Line and see what else is out there in the world of manga. Kaiju No. 8 is pretty great!\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Eiichiro Odas One Piece manga has been keeping up a relentless pace for five years now, and fans can be forgiven for wanting to take a break from the adventures of Luffy and co.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-31T16:19:43",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/FvRuy-5mNCJUi96yi3QNoWWQHpo=/196x163:2177x1200/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24398806/IMG_0019.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23579573/one-piece-manga-eiichiro-oda-burnout"
      }
    },
    {
      "id": "7475872778461715274",
      "title": "January is now the only good movie month after M3GAN and Plane",
      "url": "https://www.polygon.com/23564509/january-movies-2023-best-month",
      "description": "M3GAN, Skinamarink, and Plane highlight a month free of expectation, and free from the hype of a franchise movie cycle that now dominates the other 11 months of the year, starting in February with the MCUs next big movie, Ant-Man and the Wasp: Quantumania.",
      "body": "Email\nImage: Universal Pictures\nOnce upon a time, January was the absolute pits when it came to movies. It was a month best known for dreck like Mortdecai, Meet the Spartans, and Movie 43. These films were more masochism than cinema, stuff that would challenge the most dedicated Bad Movie Night aficionados. Yet in the year of our M3GAN 2023? It may be the only good movie month left.\nThat shift is likely due to a confluence of changes. Big franchise blockbusters are stretching further outside their traditional summer window: Ant-Man and the Wasp: Quantumania will premiere on Feb. 17, the earliest a Marvel Studios release has arrived in theaters apart from Black Panther. Blockbusters already stretch until December, a month also staked out by Star Wars and Avatar movies, and sometimes, a Spider-Man (or\nmen\n). This means January is now the only month left thats reliably free from franchise fare. Thats because its a month uniquely resistant to branding: a 31-day stretch mostly defined by not belonging to the previous year.\nIn the old days, studios often used the first month of the year as a dumping ground, a place to offload projects that had little chance of success, due to poor quality or questionable marketability. Since awards season is in full swing in January as well, prestige pictures also took up a lot of oxygen in January, extending their theatrical runs or returning to theaters as word-of-mouth built around Oscar nominations. Streaming services changed this calculus: Now every streamer needs buckets of content. Studios have to decide whats worth pawning off to a service, and whats worth a January theatrical release. Thats a tricky question, and no one seems to have a set answer yet.\nThats left January as a month worth looking forward to, a way to kick off the year with a bunch of movies where you can see all sorts of unusual shit: the avant-garde, abrasive horror of Skinamarink. The brawny flight-crew action of Plane, a film that barely has a title. The petty little murder doll M3GAN, who will almost certainly graduate into a summer blockbuster in 2024. If youre lucky, you can even catch a long-awaited international cult release like Shin Ultraman.\nJanuarys existence outside of the hype cycle and perpetual franchise demands also means that streaming movies or on-demand releases can also breathe and be enjoyed on more generous and equitable terms than they can during the rest of the year. Under-the-radar films can soar in January if viewers take advantage of the lull and find them. Last years Indian action-comedy An Action Hero, the fantastic 2022 directorial debut of Anirudh Iyer, came stateside via Netflix on Jan. 27, and the pulpy Christian Bale period mystery The Pale Blue Eye was one of the first big Netflix releases of 2023.\nJanuary and its window of diverse, unique cinema wont last forever. An MCU movie is a little over two weeks away, and soon, the blockbuster machine will start up again. Franchises will stir back to life. They will be ranked, and the rankings will be argued about. Debates about what they mean to us and whether or not we want to see where they go next will be renewed. It will again become difficult to talk about movies as singular works, instead of as points gained or lost on a corporate scorecard. For 11 more months, the din will continue, disconcertingly similar to the noise that raged the year before. Then it will be January again. Praise M3GAN.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "M3GAN, Skinamarink, and Plane highlight a month free of expectation, and free from the hype of a franchise movie cycle that now dominates the other 11 months of the year, starting in February with the MCUs next big movie, Ant-Man and the Wasp: Quantumania.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T16:02:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/LGxA5N_RQDEVgKPIkCP4sSUf038=/0x0:1131x592/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24273353/megan_trailer.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23564509/january-movies-2023-best-month"
      }
    },
    {
      "id": "5841156607484217101",
      "title": "Fortnites next Dragon Ball Super event introduces Gohan and Piccolo",
      "url": "https://www.polygon.com/fortnite/23579538/fortnite-x-dragon-ball-super-2023-event-trailer-gameplay-details",
      "description": "In Fortnites second crossover event with Dragon Ball Super, Son Gohan and Piccolo arrive as skins, and the Kamehameha and Nimbus Cloud items return, as does the Dragon Ball Adventure Island map, and much more.",
      "body": "Email\nImage: Epic Games/Toei Animation\nEpic Games has officially unveiled the second Dragon Ball Super crossover event that begins in Fortnite today, Jan. 31. The event introduces Son Gohan and Piccolo as selectable player skins, as well as reintroducing the Kamehameha attack item, Nimbus Cloud mobility item, and the Dragon Ball Adventure Island map.\nIn a detailed blog post published on the official Fortnite website, the development team lays out the new additions to the games Battle Royale and Zero Build game modes, such as the aforementioned Kamehameha and Nimbus Cloud items, which will remain in Battle Royale and Zero Build until the launch of the v23.40a patch. Son Gohan and Piccolo, the two Dragon Ball Super characters featured in this years update, each have their own unique alternate outfits, emotes, and accessories included in their respective bundles.\nGet ready to power up with the return of Fortnite x Dragon Ball!\nSon Gohan and Piccolo make their way to the Island. Theres also the return of the Dragon Ball Adventure Island, Kamehameha attack item and Nimbus Cloud (Kitoun) mobility item.\nJanuary 31, 2023\nAside from Battle Royale and Zero Build, players will be able to explore the Dragon Ball Adventure Island map, created by Vysena Studios, which features several iconic locations from the anime including Gokus House, Kamis Palace, the Room of Spirit & Time (also known as the Hyperbolic Time Chamber), and Beerus Planet. In addition, players will be able to compete in Tenkaichi Budokai, the maps open PvP battle arena named for the animes annual in-universe martial arts tournament.\nThe event doesnt appear to be associated with any upcoming Dragon Ball Super-related announcement, but Son Gohan and Piccolos character designs resemble those seen in Dragon Ball Super: Super Hero, which premiered in Japan last June before its limited theatrical run in America in August of last year. This years crossover follows in the wake of last years Dragon Ball Super event, which introduced Goku, Vegeta, Beerus, and more as playable in-game characters.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "In Fortnites second crossover event with Dragon Ball Super, Son Gohan and Piccolo arrive as skins, and the Kamehameha and Nimbus Cloud items return, as does the Dragon Ball Adventure Island map, and much more.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T15:22:17",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/-odYvg4aQfz6_TXWHt610_C2_zY=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24398591/fortnite_gohan_and_piccolo_loading_screen_1920x1080_8590ef4f0b37.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/fortnite/23579538/fortnite-x-dragon-ball-super-2023-event-trailer-gameplay-details"
      }
    },
    {
      "id": "7610080679172709782",
      "title": "Polygon Price Forecast: What crypto traders are looking for from Jerome Powell on Wednesday",
      "url": "https://www.fxstreet.com/cryptocurrencies/news/polygon-price-forecast-what-crypto-traders-are-looking-for-from-jerome-powell-on-wednesday-202301311514",
      "description": "Polygon (MATIC) price has received a firm rejection on the top side at $1.18, which triggered a massive wave of profit-taking as traders wanted to cas",
      "body": "Polygon price ties up with gains after the doubtful start on Tuesday. MATIC recovers after a sharp decline of 7% on Monday. Traders are looking for clues from Jerome Powell on Wednesday. Polygon (MATIC) price has received a firm rejection on the top side at $1.18, which triggered a massive wave of profit-taking as traders wanted to cash in on profits, not taking the risk of staying in the trade. With several central banks coming out this week, including the most important Federal Reserve interest rate decision on Wednesday at 19 GMT, violent swings look granted. Trying to create order in the chaos, only one message will be important for cryptocurrencies: the message from Fed chair Jerome Powell. Polygon price sees traders on full alert for Powells words Polygon price received a short but harsh rejection on Monday, which can be labelled profit-taking as a bunch of traders decided not to sit on the risk. Meanwhile, a new bunch of traders is eager to get in and try to play a pre-position trade in the idea that markets are selling the rumour and a dovish central bank will offer a buy-the-fact moment, with MATIC rallying higher. Markets will be hanging on Jerome Powells lips. MATIC is set to jump higher in case Powell confirms the Fed hikes 25 basis points and possibly another 25 basis points after that and be done with it. Everything more dovish than that will be even more bullish for cryptocurrencies. A breakout trade looks to result in a break above $1.18 and open a new area for Polygon price to rally in the coming weeks, with $1.57 as the next profit target by the end of February. MATIC/USD daily chart As mentioned above, with already a few scenarios, a more hawkish scenario could be Jerome Powell delivering a 25 basis point hike with a very harsh hawkish comment or even a 50 basis point hike. That would mean markets have been blindsided and completely ignored the warning signs of the Federal Reserve being still hawkish, which would trigger a repricing of a risk premium. In that case, expect MATIC to tank towards $0.96 with even overshooting towards $0.90 towards the 55-day and the 200-day Simple Moving Averages.",
      "snippet": "<b>Polygon</b> (MATIC) price has received a firm rejection on the top side at $1.18, which triggered a massive wave of profit-taking as traders wanted to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T15:14:03",
      "provider": {
        "name": "fxstreet",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://editorial.fxstreet.com/images/Markets/Currencies/Cryptocurrencies/Polygon/polygon-200x200-637526942732422088_Large.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "fxstreet",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.fxstreet.com/cryptocurrencies/news/polygon-price-forecast-what-crypto-traders-are-looking-for-from-jerome-powell-on-wednesday-202301311514"
      }
    },
    {
      "id": "552393853287355514",
      "title": "Alice Is Missing expansion deepens the silence of the tabletop RPG",
      "url": "https://www.polygon.com/23577920/alice-is-missing-expansion-silent-falls-spenser-starke-interview",
      "description": "Alice Is Missing, the multi-award-winning texting RPG, is getting an expansion. Silent Falls will double the original games card count and add new characters as it explores small-town power dynamics.",
      "body": "Flipboard\nEmail\nWhen screenwriter and tabletop game designer Spenser Starke suddenly lost his mother in 2016, he immediately shouldered his fathers emotional burden, as well as that of his grandmother and maternal aunt. Hunkering down like that, he told Polygon in an interview, left no emotional oxygen for his own grief.\nThat came later, when Starke designed Alice Is Missing, a collaborative storytelling RPG set in an imaginary Pacific Northwest town where a group of friends search for their missing friend. The mystery, told through cards and set to a bespoke playlist of moody indie tunes, twists the familiar by limiting the players to nonverbal, indirect communication: no speaking, no noises, no body gestures, only text on a cellphone.\nNow, Starke is gearing up to crowdfund Alice Is Missing: Silent Falls, an additional collection of cards  clues, locations, suspects, and more  that nearly doubles the original count and complicates the search for Alice. Players can add as many or as few of these cards to the core deck as they please. Nothing is mandatory, and every addition has been designed to fit seamlessly into the little box that became a surprise hit when it launched in 2020.\nMany of these new ideas have been kicking around since the beginning and were shaved off the original production of Alice Is Missing to create what Starke referred to as an MVP, or most viable product, for Kickstarter.\nIve been tweaking the cards in the expansion literally since the game launched as a way to give people the opportunity to tell new stories with the game and to provide an added level of narrative challenge, Starke said. It was a game I never thought people would play because its just weird and emotional and Type-2 fun. But it comes from a very real place.\nImage: Hunters Entertainment\nImage: Hunters Entertainment\nAlice Is Missing follows the disappearance of Alice Briarwood, a Northern California high schooler with a group of friends  created and embodied by the players  hellbent on discovering what happened. Over the course of a single, roughly three-hour session, players discuss via one-on-one text conversation what they think happened as more clues are revealed and likely culprits emerge. Guided by card prompts and an ever-ticking timer, the group will discover how someones absence can tear through a community, revealing uncomfortable truths along the way.\n[The game] was originally born out of this desire to make a game that captured the emotional landscape I was traversing during that time, which is why youre not going to solve it on your own, Starke said The game has to play out. Youre not going to Sherlock Holmes this thing. Thats purposeful.\nImage: Hunters Entertainment\nImage: Hunters Entertainment\nStarke said hes always been drawn to emotional, indie video games such as Life Is Strange, Oxenfree, and Firewatch, and Alice Is Missing consciously draws on the cozy but also fucked-up vibes to construct its atmosphere of the familiar made strange, a cracked mirror through which you might view your own past. Not so much a rug pull as a mechanism for vulnerability, Alice Is Missings tendency to evoke surprisingly strong reactions while sitting dead quiet in a dim room has earned it quite a reputation within the tabletop community.\nThe Silent Falls expansion is designed for groups to tackle after a couple of sessions playing the core game. He doesnt agree that this return should be called his directors cut or definitive edition. He doesnt generally enjoy touching his creative works again after theyve been released into the world and the hands of an audience. But this project feels different, Starke said. The timing felt right.\nImage: Hunters Entertainment\nPlayers will find three new suspects that might be tied to Alices disappearance, and each throws a wrench into how veteran players understand Silent Falls social fabric. The first is Officer Prescott, the towns sheriff, whose implication means players can likely not turn to the police for assistance. Another, Alices estranged father, John Harwood, raises the specter of domestic trouble and rotten family dynamics. The last is a new student who quickly befriended Alice and inserted herself into the group, harshing the vibes and forcing everyone to reflect on their own ties to the now-missing girl.\nStarke is obviously interested in interrogating power structures via the small-town simulacra of Silent Falls. What does it mean when the people you ostensibly trust might be using their authority to hide a heinous crime? How do traditional family roles curdle a relationship over long years of resentment? What do we assume about the people close to us, and what are they afraid to reveal, lest we judge them?\nRevisiting Silent Falls should hopefully feel like reigniting a fire in players, Starke said. Even after all the playtesting, feedback, and iteration, he admits feeling more nervous than he ever did while designing the original experience. Its an electric energy he craves from the creative process.\nThe stuff that scares me is the stuff that Im most excited about. If Im not, then I havent done my job. I havent pushed myself, Starke said. Its going to be really exciting for me to watch people use the prompts that Ive given them to tell me stories. I love having that opportunity again.\nAlice Is Missing: Silent Falls launches on Kickstarter beginning Feb. 14 and will be hosted by publisher Hunters Entertainment, the company responsible for Kids on Bikes, Altered Carbon The Role Playing Game, and Outbreak: Undead.\nAlice Is Missing\nPrices taken at time of publishing.\n$22\nRenegade Game Studio (physical box)\n$20",
      "snippet": "Hunkering down like that, he told <b>Polygon</b> in an interview, left no emotional oxygen for his own grief. That came later, when Starke designed Alice Is ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T15:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/XiLQNA3eyx9U5lD6Qkzw43r0-bQ=/0x117:3000x1688/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24396043/AIM_Landscape_copy.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23577920/alice-is-missing-expansion-silent-falls-spenser-starke-interview"
      }
    },
    {
      "id": "4733465312784917160",
      "title": "Polygon Up 50% This January",
      "url": "https://www.livetradingnews.com/polygon-up-50-this-january-219966.html",
      "description": "Polygon Up 50% This January 2023",
      "body": "WhatsApp\nIt seems 2023 is looking up for Crypto, with Polygons MATIC up 50% this January, Bitcoin up 44%, and Etheruem up 38%. Investors should be regaining their faith once again in Crypto. This reinforces the topic of social media and the markets, many influencers talk about the downfall of Crypto because a token takes a dip, but that is the cycle of anything with price volatility, the ups are downs are a part of trading and investing, especially in the Crypto market.\nPolygon MATIC holds 10th place for market capitalization in Crypto, with its valuation at $10.6 billion.\nA $MATIC early holder sold 4,553,023 $MATIC for 5,200,081 $DAI at an average price of $1.14 today.\nThe $MATIC holder received 4M $MATIC from #Binance when the price is $0.02.",
      "snippet": "<b>Polygon</b> Up 50% This January 2023. WhatsApp It seems 2023 is looking up for Crypto, with <b><b>Polygon</b>s</b> MATIC up 50% this January, Bitcoin up 44%, and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T06:50:35",
      "provider": {
        "name": "livetradingnews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.livetradingnews.com/wp-content/uploads/2023/01/621770db61376f0023883225-Blog_What-Is-Polygon-MATIC.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "livetradingnews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.livetradingnews.com/polygon-up-50-this-january-219966.html"
      }
    },
    {
      "id": "4960239214249037165",
      "title": "Today's cryptocurrency prices: Check Bitcoin, Ethereum, Shiba Inu, Solana rates",
      "url": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-31-1-2023-rates-of-bitcoin-ethereum-solana/story",
      "description": "Bitcoin has slipped 3.47% in the past 24 hours to trade at $22,871.88",
      "body": "Bitcoin has slipped 3.47% in the past 24 hours to trade at $22,871.88. It is 0.80% lower than the week before.    Ethereum, the second most popular token, is down 3.82% from yesterday and is currently trading at $1,572.24. It is down 3.94% compared to last week.    Their market capitalization stands at $440.94 billion and $192.40 billion, respectively. BNB is trading at $313.34, which is 0.44% lower than yesterday and 2.54% down since last week.    XRP is currently trading at $0.33 after falling down 5.38% in the last 24 hours. It is 6.94% down from last week.    Cardano and Dogecoin are trading at $0.33 (down 5.42%) and $0.099 (up 2.87%), respectively. Solana, Polka Dot, Shiba Inu, and Polygon are currently trading at $24.210 (down 3.97%), $6.4530 (down 4.73%), $0.000011 (down 2.18%), and $1.09 (down 5.48%), respectively.    Based on the weekly chart, Solana is down 3.08%, while Polka Dot has fallen 0.22%.    Shiba Inu is down 2.10% in the last seven days, whereas Polygon has gained 8.55%. Looking at the 24-hourly movement, the top five gainers are Mina, Dash, dYdX, Dogecoin, and ImmutableX. They are trading at $0.88 (up 9.16%), $61.90 (up 7.63%), $2.44 (up 5.06%), $0.099 (up 3.15%), and $0.66 (up 1.13%), respectively. A stablecoin is a cryptocurrency with extremely low volatility. Its value is pegged to a real-world asset such as fiat currency or gold.    Some of the popular tokens, Tether, USD Coin, and Binance, are trading at $1 (down 0.01%), $1 (up 0.02%), and $1 (up 0.07%), respectively. Terra Classic is listed at $0.00011 (down 5.14%). The biggest losers of the day are BitDAO, Axie Infinity, Gala, The Sandbox, and Stacks. They are trading at $0.44 (down 15.72%), $10.67 (down 9.88%), $0.055 (down 8.66%), $0.77 (down 8.29%), and $0.22 (down 8.18%), respectively. In terms of traffic, liquidity, trading volumes, and trust in the legitimacy of trading volumes, Binance, Coinbase Exchange, and Kraken are the top three cryptocurrency spot exchanges.    Binance and Coinbase Exchange recorded a 24-hour volume of $20.85 billion (up 21.35%) and $2.28 billion (up 48.92%), respectively. Kraken saw a volume of $0.69 billion, which is 90.74% up from yesterday. DeFi or decentralized finance is an umbrella term for global, peer-to-peer financial services on public blockchains.    Some of the prominent DeFi tokens are Avalanche, Dai, Uniswap, Wrapped Bitcoin, and Chainlink. They are trading at $19.70 (down 4.49%), $0.99 (up 0.06%), $6.54 (down 4.63%), $22,822.61 (down 3.45%), and $6.98 (down 4.61%), respectively. Non-fungible tokens (NFTs) are cryptocurrencies that lack the attribute of fungibility, due to which they cannot be exchanged for one another.    Some of the popular NFT tokens are ApeCoin, Decentraland, The Sandbox, Axie Infinity, and Flow. They are currently trading at $5.88 (down 5.12%), $0.77 (down 8.01%), $0.77 (down 8.28%), $10.67 (down 9.86%), and $1 (down 7.90%), respectively. The current global crypto market cap is $1.08 trillion. The total crypto market volume over the last 24 hours is $52.22 billion. They have remained flat over the last day.    The global cryptocurrency market valuation was $796.25 billion last month, in comparison to $1.02 trillion three months ago.",
      "snippet": "Solana, Polka Dot, Shiba Inu, and <b>Polygon</b> are currently trading at $24.210 (down 3.97%), $6.4530 (down 4.73%), $0.000011 (down 2.18%), and $1.09 ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T05:53:26",
      "provider": {
        "name": "newsbytesapp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cdn.newsbytesapp.com/images/l96020230131110342.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsbytesapp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-31-1-2023-rates-of-bitcoin-ethereum-solana/story"
      }
    },
    {
      "id": "5786577526952422379",
      "title": "Crypto Price Today: Bitcoin slips below $23 000 Solana Polygon tank up to 6% Dogecoin rally 4%",
      "url": "https://forextv.com/bitcoin-news/crypto-price-today-bitcoin-slips-below-23000-solana-polygon-tank-up-to-6-dogecoin-rally-4/",
      "description": "All top crypto tokens were trading sharply lower on Tuesday but Dogecoin jumped more than 3 per cent, whereas Polygon, Cardano, Solana and Avalanche were among the top losers with up to 6% fall. Read Full Story",
      "body": "All top crypto tokens were trading sharply lower on Tuesday but Dogecoin jumped more than 3 per cent, whereas Polygon, Cardano, Solana and Avalanche were among the top losers with up to 6% fall.\r\nRead Full Story",
      "snippet": "... lower on Tuesday but Dogecoin jumped more than 3 per cent, whereas <b>Polygon</b>, Cardano, Solana and Avalanche were among the top losers with up to 6% ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T05:14:17",
      "provider": {
        "name": "forextv",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "forextv",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://forextv.com/bitcoin-news/crypto-price-today-bitcoin-slips-below-23000-solana-polygon-tank-up-to-6-dogecoin-rally-4/"
      }
    },
    {
      "id": "8218383834384315095",
      "title": "Polygon (MATIC) and Optimism (OP): Which Technology Is More Beneficial for Ethereum (ETH)?",
      "url": "https://u.today/polygon-matic-and-optimism-op-which-technology-is-more-beneficial-for-ethereum-eth",
      "description": "Find out why Polygon still has advantage in future of Ethereum scalability",
      "body": "But which one is best for Ethereum?\nIn recent years, Ethereum (ETH) has established itself as the leading blockchain in the cryptocurrency market due to its ability to facilitate the use of smart contracts. This feature allows for the creation of decentralized applications (dApps), tokens and other applications without the need for intermediaries.\nHowever, as the network has grown in popularity, it has also experienced issues with scalability and high transaction fees. In response to these challenges, several competitors such as Cardano (ADA), Solana (SOL) and Avalanche (AVAX) have emerged to address the scalability issues faced by Ethereum.\nDespite the emergence of rival blockchain platforms that boast advanced technology, Ethereum remains the most secure option due to its proven track record over time. In order to address its scalability and cost issues, solutions such as Layer 2 protocols have emerged as a means to enhance the Ethereum blockchain.\nTwo notable examples of Layer 2 solutions are Polygon (MATIC) and Optimism (OP). Both protocols aim to increase scalability on the Ethereum network, but they have distinct differences in their approach.\nAds\nPolygon\n, also known as Matic Network, is a Layer 2 scaling solution that aims to improve Ethereum's scalability by using a layered architecture. This architecture allows for the faster and more efficient execution of smart contracts and decentralized applications.\nOptimism is another Layer 2 scaling solution that aims to improve Ethereum's scalability by enabling faster and lower-cost transfers on the network by transaction aggregation. Additionally, Optimism's Layer 2 supports more advanced smart contract functionality.\nDespite both Polygon and Optimism aiming to improve Ethereum's scalability, they achieve this through different methods.\nPolygon uses ZK-Rollups, which makes use of zk-SNARKs, a zero-knowledge proof technology, to validate transactions without revealing the details of the transactions. This allows for a large number of transactions to be grouped into a single block, thereby increasing the processing capacity of the blockchain.\nOn the other hand, Optimism uses a mechanism called Optimistic Rollups, which uses a leader mechanism to ensure security. Transactions are processed outside of the main blockchain but are still considered secure as long as they are confirmed in an honest manner by the leader.\nBut which one is best for Ethereum?\nOne of the leading authorities on this topic is Ethereum co-creator Vitalik Buterin. According to Buterin, second-layer Zero Knowledge Rollups (ZK-Rollups) are likely to ultimately surpass Optimistic Rollups as the preferred scalability solution for the Ethereum network.\nWhile Buterin acknowledges that the Optimistic solution is currently more advanced, he believes that the underlying technology of ZK-Rollups will ultimately prove to be superior in the long run. Furthermore, Buterin notes that ZK-Rollups are faster at facilitating transactions on and off the main network, which could lead to increased adoption of this technology.",
      "snippet": "Find out why <b>Polygon</b> still has advantage in future of Ethereum scalability. But which one is best for Ethereum? In recent years, Ethereum (ETH) has ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-31T00:00:00",
      "provider": {
        "name": "u",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://u.today/sites/default/files/styles/twitter/public/2023-01/Polygon%20%28MATIC%29%20and%20Optimism%20%28OP%29-%20Which%20Technology%20Is%20More%20Beneficial%20for%20Ethereum%20%28ETH%29%3F.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "u",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://u.today/polygon-matic-and-optimism-op-which-technology-is-more-beneficial-for-ethereum-eth"
      }
    },
    {
      "id": "5727486890774237698",
      "title": "MLB The Show 23 release date cover star and pre-orders announced",
      "url": "https://www.polygon.com/23578469/mlb-the-show-23-release-date-jazz-chisholm-cover",
      "description": "MLB The Show 23 will launch March 28, 2023 for Nintendo Switch, PlayStation 4, PlayStation 5, Xbox One, and Xbox Series X. Pre-orders open Feb. 6. Jazz Chisholm of the Miami Marlins is this years cover star.",
      "body": "MLB The Show\nreturns in late March for the third straight year as a cross-platform baseball simulation, developed by Sony San Diego, which has delivered the series annually for 15 years. For this years cover star, Sony turned to the first Bahamas-born player to make a Major League Baseball All-Star roster.\nHeres everything we know about MLB The Show 23.\nWhen does MLB The Show 23 come out?\nMLB The Show 23s release date is March 28. Pre-orders will open on Feb. 6. Major League Baseball opening day is March 30.\nWhat platforms are MLB The Show 23 available on?\nMLB The Show 23s main editions will launch on PlayStation 5 and Xbox Series X, whose buyers will also get downloadable versions of the game for PS4 and Xbox One, respectively.\nThe PS4 and Xbox One versions, along with Nintendo Switch, do not have all the features of the two main editions. The MLB The Show franchise supports cross-platform multiplayer among all versions.\nMLB The Show 23 will again be available on launch day to Xbox Game Pass subscribers on Xbox One and Xbox Series X.\nAre there special editions of MLB The Show available?\nMondays livestream reveal did not mention special editions. The official MLB The Show website so far only lists the standard editions for the five platforms. The Nintendo Switch, PS4, and Xbox One versions will cost $59.99. The PlayStation 5 and Xbox Series X versions cost $69.99 and come with 5 card packs (used in the Diamond Dynasty mode) and 10,000 Stubs (an in-game currency used in Diamond Dynasty and Road to the Show).\nIn the past, MLB The Show has also offered digital deluxe editions that include additional premium in-game content and a four-day weekend early-access preview.\nWho is on the cover of MLB The Show 23?\nJazz Chisholm\n(full name: Jasrado Prince Hermis Arrington Chisholm, Jr.), the 24-year-old, Bahamas-born star for the Miami Marlins, features on the cover of MLB The Show 23 for all versions.\nChisholms first full season came in 2021; in a 2022 season cut in half by injury, Chisholm was selected to the National League All-Star team, though he did not play in that game. Originally a starting second baseman, the Marlins plan to move Chisholm to the outfield after acquiring Luis Arraez (also a middle infield All-Star in 2022) from the Minnesota Twins on Jan. 20.\nChisholm is also a member of Great Britains national baseball team, competing for them in the 2017 World Baseball Classic. He has confirmed that he will play for Great Britain in the 2023 World Baseball classic, which will be held March 8-21 in Taiwan, Tokyo, Miami, and Phoenix.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "MLB The Show 23 will launch March 28, 2023 for Nintendo Switch, PlayStation 4, PlayStation 5, Xbox One, and Xbox Series X.\nJazz Chisholm of the Miami Marlins is this years cover star.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T21:15:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/2e0Lv3eD_FmfDVzBTZOPeWIG2LQ=/0x0:5523x2892/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24396901/1404569770.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578469/mlb-the-show-23-release-date-jazz-chisholm-cover"
      }
    },
    {
      "id": "6839750949717834867",
      "title": "The Avengers X-Men and Thanos were all defeated by one Marvel enemy",
      "url": "https://www.polygon.com/2023/1/30/23574771/x-men-2011-sins-of-sinister-marvel-crossover",
      "description": "The X-Mens Mister Sinister begins his global takeover, defeating the X-Men, Avengers, Thanos, and Asgard in the first issue alone. That and other news from this weeks best new comics, from Shazam to Superman.",
      "body": "Flipboard\nEmail\nThe list of ways in which 2019s House of X/Powers of X succeeds as a comic book story is long. Jonathan Hickman and his collaborators delivered original world-building, deep-lore payoffs, the twistiest plot twists, electrifying action, and instantly iconic character moments. But if something about HoX/PoX is still underappreciated, its that Hickman wasnt just eating  he was meal-prepping for those whod come after.\nThis week, in X-Men comics, Kieron Gillen and Lucas Werneck delivered the first course of a long-awaited dinner with Sins of Sinister #1, the kickoff issue to the Sins of Sinister crossover. Evil glam geneticist Mister Sinister is here to chew scenery and fuck up the future, and he shows no sign of running out of either in an issue that shows him overthrowing Krakoa, Mars, all human governments, every human superhero team, and several extra-solar powerhouses like Thanos, Hell, and Asgard itself in a mere decade.\nWhat else is happening in the pages of our favorite comics? Well tell you. Welcome to Monday Funnies, Polygons weekly list of the books that our comics editor enjoyed this past week. Its part society pages of superhero lives, part reading recommendations, part look at this cool art. There may be some spoilers. There may not be enough context. But there will be great comics. (And if you missed the last edition, read this.)\nSins of Sinister #1\nImage: Kieron Gillen, Lucas Werneck/Marvel Comics\nThe joy of Mister Sinister is in expertly applied contrast, as Gillen proved when he delivered the definitive modern take on the character in his 2011 Uncanny X-Men run. Sinister is knowingly camp, a cape-wearing monologuer who lives for drama, flirting with the fourth wall but never quite crossing over it. Hes objectively funny, a villain who demands reader attention with captivating flair and fascinatingly intricate plans.\nHes also maybe the only mutant villain with delusions of godhood and the ambition to make it so left in the Krakoan era. Because, as Gillen codified a decade ago, like Magneto and Apocalypse and Orchis and Nimrod, Sinisters goals are genetic supremacy. The difference is that Sinister doesnt believe that humans should replace mutants or vice versa.\nHe thinks he should replace both of them. Hes an incomprehensibly selfish ego bent on universal genocide of every sentient thing except for his genetic code  and god, Gillen and Werneck make him fun to watch, from his grandiose plans (shrinking the Juggernaut and opening a wormhole to fire him through Thanos skull at point-blank range) to his stupid little rages (OH, FIDDLE &%&% BASTARD @#%&# STICKS! he bellows on one tear) to his Krakoan Island of Doctor Moreau hairless cat with Cyclops eyes.\nWhat Im trying to say is that the first two pages of this comic, an homage to the opening scene of House of X/Powers of X, but with only clones of Cyclops and Sinister in Professor Xs place, bastardizing the X-Mens warcry into grammatical mush as he looks directly into the camera, is sublime.\nLazarus Planet #1: We Once Were Gods\nImage: Josie Campbell, Caitlin Yarsky/DC Comics\nMy parents got me a couple rabbits when I was a kid, and none of the feet of my Barbies went unchewed. I dont want any of the rabbit owners out there to miss this targeted message for them.\nAction Comics #1051\nImage: Phillip Kennedy Johnson, Rafa Sandoval/DC Comics\nThis weeks Action Comics revealed that Lois Lane keeps her husbands skimpy, chain-forward costume from his time on Warworld in their bedroom closet and I just want to say, I love this for her.\nNews\nYou can finally battle your friends in Marvel Snap this week\nReviews\nDeadpool brings more queer chaos to Marvels Midnight Suns\nComics",
      "snippet": "The X-Mens Mister Sinister begins his global takeover, defeating the X-Men, Avengers, Thanos, and Asgard in the first issue alone.\nThat and other news from this weeks best new comics, from Shazam to Superman.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-30T21:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Qf6kOhvF6DAHYE1U9Rvrmp1S89c=/0x0:1331x697/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24395971/RCO005_1674686278.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/2023/1/30/23574771/x-men-2011-sins-of-sinister-marvel-crossover"
      }
    },
    {
      "id": "5020431662060055333",
      "title": "Marie Kondo has given up on a perfectly tidy home and thats OK",
      "url": "https://www.polygon.com/23578292/marie-kondo-given-up-tidying-sparks-joy",
      "description": "Marie Kondo rose to fame through her Netflix show, Tidying Up, which focused on tidying through keeping what \"sparks joy.\" Now, she has \"given up\" on keeping her home tidy at all times. Heres why.",
      "body": "Email\nPhoto: Denise Crew/Netflix\nMarie Kondo became a household name three years ago through preaching the tidying gospels of keeping only what sparks joy. Now, the best-selling author and television personality  who once taught us how to fold our socks  is taking a step back and embracing the mess.\nAt a press event preceding her newest book, Kondo opened up about the priorities in her life after giving birth to her third child. My home is messy, but the way I am spending my time is the right way for me at this time at this stage of my life, Kondo said, via an interpreter, as reported by The Washington Post.\nUp until now, I was a professional tidier, so I did my best to keep my home tidy at all times, Kondo added. I have kind of given up on that in a good way for me. Now I realize what is important to me is enjoying spending time with my children at home.\nRelated\nI Marie Kondod my entire internet presence, one account at a time\nMarie Kondo rose to fame through teaching others the art of tidying their homes. She led with the idea of identifying and keeping items that spark joy, rather than the daunting task of simply deciding what to get rid of. Her Netflix shows Tidying Up With Marie Kondo (2019) and Sparking Joy with Marie Kondo (2021) only raised her profile and the concepts she espoused.\nThese shows also sparked ridiculous controversy, at the time, as some viewers seemed to willfully misunderstand her advice, claiming they felt chastened about throwing things away. As she expanded her tidy empire to include organizational products people continued to shade her  even as other home network giants started their own inescapable product lines.\nKondos new book, Marie Kondos Kurashi at Home: How to Organize Your Space and Achieve Your Ideal Life, is less focused on decluttering the home, and more focused on decluttering the ways in which we live our lives through mindfully building routines. Judging by the books description, she has repurposed the idea of sparking joy out of physical space and into the rhythms of everyday life, which makes sense given her busy life as a parent.\nThis is part of what makes Kondo giving up, so delightful. Shes still doing what sparks joy for her; and honestly, raising three kids feels like the absolute opposite of anything you might consider giving up. We all deserve to reorient toward our joys, or to do less of anything that we have outgrown.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Marie Kondo rose to fame through her Netflix show, Tidying Up, which focused on tidying through keeping what \"sparks joy.\" Now, she has \"given up\" on keeping her home tidy at all times.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T20:44:09",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/mV9UBBW7nIvGkk6c48I1VmHhkD8=/0x98:3600x1983/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13692151/KONDO_WENDYRON_Unit_01016R.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578292/marie-kondo-given-up-tidying-sparks-joy"
      }
    },
    {
      "id": "5765830177595122859",
      "title": "Dead Space remake infinite ammo cheat gives you unlimited nodes",
      "url": "https://www.polygon.com/guides/2023/1/30/23577908/dead-space-remake-infinite-money-nodes-ammo-health-pulse-rifle-exploit",
      "description": "Our Dead Space infinite ammo cheat guide will explain how to use a Pulse Rifle exploit to get free ammo at a Bench  which you can sell to buy ammo, health, and upgrade nodes.",
      "body": "Email\nImage: Visceral Games/Electronic Arts via Polygon\nThe Dead Space remake really leans into scarcity and desperation. As weve said before, youre going to spend most of the game low on health, running out of ammo, and just hoping to make it to the next save point before it all goes wrong.\nSure, you can knock down the difficulty to get more damage per shot, or you could game the system with a cheat or a exploit. The Dead Space remake has only been out for a few days, but players have already figured out how to do exactly that. This exploit was explained by u/Mrthrowawaymcgee on Reddit.\nWhat follows is a Dead Space infinite ammo exploit guide that will walk you through everything you need to know about using the Pulse Rifle to get free ammo at a Bench  free ammo that you can sell to buy as much ammo and health, or as many upgrade nodes as you want.\nWhat you need before you can exploit the exploit\nFirst off, you cant use this exploit from the beginning of the game. Youll need to play a bit until you have:\nPulse Rifle. Youll find the Pulse Rifle when you reach the Flight Deck Tram Station in Hangar-Cargo-Tram Control during Chapter 1 New Arrivals.  Well explain why this exploit only works with the Pulse Rifle below.\nA minimum of four nodes and preferably seven nodes (and a max of 13) to put into the Pulse Rifle at a Bench. These can be ones you havent installed yet, or you can steal them from other gear. Youll start turning a super small profit with just four nodes, but it will speed up the process a lot with each additional node you have to work with.\nIf you have already upgraded the Pulse Rifle a bit, youll also need at least 5,000 credits to reset the Pulse Rifles upgrades.\nHow to reset upgrades in the Dead Space remake\nResetting all upgrades at a Bench.\nImage: Visceral Games/Electronic Arts via Polygon\nWhenever you find a Bench, you can upgrade your weapons or your suit by installing any nodes youve found into that gears upgrade tree. If, for whatever reason, you want to reset your progress through the upgrade tree, you can hit square/X to spend 5,000 credits and uninstall all the node upgrades for that weapon (you get the nodes back). Youll need to spend 5,000 credits on each weapon if youre looking to reset multiples to reclaim even more nodes.\nBest place to use the exploit\nThe free ammo exploit will be easiest (and most time-efficient) someplace where you have a Shop and a Bench in close proximity.\nA convenient location to perform this exploit.\nImage: Visceral Games/Electronic Arts via Polygon\nTheres a good spot early on in Chapter 1 New Arrivals. After you replace the tram car and install the data board, youll open up the Flight Deck Tram Station in Hangar-Cargo-Tram Control. Theres a Shop as you walk into the tram station and a Bench through the To Medical door at the far end.\nTheres also a good one right near the start of Chapter 7 Into the Void in the RIG Room.\nUpgrading a guns capacity refills the clip\nThe way this exploit works is that upgrading any weapons capacity with a node at a Bench refills the clip. Think of it like how leveling up a RPG character (in some games) refills their health. (This is also generally a good way to get a few extra bullets in a pinch.)\nThis only becomes an exploit if you can somehow sell that free ammo, which is why\nOnly the Pulse Rifle works\nReclaim the ammo from a Proximity Mine with R1.\nImage: Visceral Games/Electronic Arts via Polygon\nThe Pulse Rifles alternate fire  hitting R1 instead of R2 to shoot  plants a Proximity Mine that costs you 25 bullets. If the mine doesnt explode, however, you can pick it up by hitting R1 again to reclaim the ammo into your inventory. If you dont reload the Pulse Rifle, it stays in your inventory in an easily sellable package.\nSteps of the exploit\nNow that you understand why and how this exploit works, lets talk about the actual steps youll need to follow. To get started, go stand next to a Bench, and:\nPlant as many Proximity Mines as you have ammo for (without reloading) and convert them back to ammo with R1. Its fine to leave that ammo on the floor.\nHead to the Bench and Reset All nodes on your Pulse Rifle (if you have upgraded it at all). Upgrade the first node  it just so happens to be a capacity increase  to refill your clip.\nTurn that clip of free ammo into Proximity Mines and then back into collectible ammo (that you can also leave on the floor).\nGo to the Bench and upgrade to the next capacity slot, refilling your clip again.\nRepeat steps 3 and 4 until you run out of capacity upgrades (or nodes).\nIf you have the cash on hand, Reset All nodes again and repeat the process.\nWhen youre out of money to reset, pick up all your free ammo and take it back to a Shop. Sell it all.\nLather, rinse, and repeat to your hearts content.\nEach stack of 100 Pulse Rifle ammo is worth 2,500 credits.\nImage: Visceral Games/Electronic Arts via Polygon\nGoing from zero bullets, running through the Pulse Rifles five default capacity upgrades (requiring seven nodes), and then selling the free ammo will net you 8,750 credits. Subtract  the 5,000 credits you spent to reset the nodes, and youll walk away with 2,750 credits in profit.\nOnce you build up a bit of a bankroll, youll have enough to reset your nodes multiple times. That makes the process of returning to a Shop to sell your free bullets a lot more efficient since youll have a lot more bullets. Each time you can Reset All nodes, youll get an extra 2,750 per trip.\nHow to get more out of the exploit\nOnce you pick up a bit of cash, buy the Kinetic Autoloader Pulse Rifle Upgrade from the Shop for 10,000 credits. This unlocks two more capacity nodes  and theyre next to each other. These increase your capacity by a total of 20 shots.\nPulse Rifle Upgrade location in the Bridge.\nImage: Visceral Games/Electronic Arts via Polygon\nTheres also an easy-to-miss Pulse Rifle upgrade in Chapter 4 Obliteration Imminent. After youve defeated the Brute in the Main Atrium of the Bridge, head to the elevator closest to where the Brute busted through the door. Take it down to Floor 3. Youre looking for the Electrical Systems Storage room a little to the east (east on your map  we recognize theres no east in space).\nShoot the fuse to unlock the door.\nImage: Visceral Games/Electronic Arts via Polygon\nHead to the far side of the room where youll see a body smashed through a window. Pull out the body, and then use Kinesis to move the crates by the door. Shoot the fuse to the left of the door to unlock the room. Inside, there are a few lockers that require Security Level 3, a few credits, and the P.C.S.I. Custom Magazine Pulse Rifle Upgrade.\nThe Pulse Rifle upgrade tree with both Pulse Rifle upgrades.\nImage: Visceral Games/Electronic Arts via Polygon\nThat upgrade unlocks two more capacity nodes and unlocks the Special 2 (SP2) node that greatly increases ammunition capacity  which increases your capacity by 20 instead of just 10.\nA quick note on that, though: SP2 doesnt re",
      "snippet": "Email Image: Visceral Games/Electronic Arts via <b>Polygon</b> The Dead Space remake really leans into scarcity and desperation. As weve said before, youre ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T20:37:20",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/1YoyYp3bljDBaHqRNLISzYR30yg=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24396699/Dead_Space_exploit_cover.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/2023/1/30/23577908/dead-space-remake-infinite-money-nodes-ammo-health-pulse-rifle-exploit"
      }
    },
    {
      "id": "4694179066058650559",
      "title": "Marvel Snap finally gets PvP Battle Mode so you can fight your friends",
      "url": "https://www.polygon.com/23578288/marvel-snap-battle-mode-friends-multiplayer",
      "description": "Marvel Snaps new Battle Mode will go live Tuesday, Jan. 31, developer Second Dinner announced Monday. Finally, players can go against their friends.",
      "body": "Email\nPhoto: Polygon\nMarvel Snaps Battle Mode, which lets players go up against their friends, will go live Tuesday, developer Second Dinner announced Monday. Marvel Snap players have been eagerly anticipating a friends-only mode after it was announced in November. The feature was expected at the end of this month  yep, lines up.\nSecond Dinner announced the feature in a tweet on Monday: Its coming... Get ready for Battle Mode where you can challenge your friends and see whos really the best, it wrote. The mode was outlined in a blog post in December: Players that create a match will get a code to share with their friends  or streamers or random people, according to creator Ben Brode. On the opposite end, you join a match by entering that code.\nIn Battle Mode, theres a series of matches to be played, with the goal of knocking down the opponents health. Each player starts with 10 health, and whoever wins a match will knock off points: two points regularly, or four points when a player snaps. (Retreating will see players losing a single point.) Battle Mode keeps going until there are no points left.\nBrode also shared on Twitter Battle Mode will be available across regions, too.\nMarvel Snap was released globally in October, available for free on Android, iOs, and on Windows PC. The fast-paced card game runs only six rounds, using cards with characters from Marvels massive roster of heroes. Each player builds a deck of 12 cards, where cards are pulled from and into your hand. To win, youve got to get the highest points on two of three locations where cards drop  but its more complex than it seems. Theres a bunch of different strategies and ways to mastermind a creative deck, made accessible by its simple setup.\nNext Up In",
      "snippet": "Email Photo: <b>Polygon</b> Marvel Snaps Battle Mode, which lets players go up against their friends, will go live Tuesday, developer Second Dinner ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T19:45:18",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/yALLOaw6mpJVZGVhpnlndBITHCM=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24340653/leader_marvel_snap.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578288/marvel-snap-battle-mode-friends-multiplayer"
      }
    },
    {
      "id": "4676375487172745661",
      "title": "The Super Mario Bros. Movie gets a Smash Bros. fight in new trailer",
      "url": "https://www.polygon.com/23578167/mario-bros-movie-trailer-smash-bros-donkey-kong-seth-rogen",
      "description": "The Super Mario Bros. Movie already looks like a greatest hits of Mario spin offs and the latest trailer gives it a huge shout out of Smash Bros.",
      "body": "Chris Pratt\n) and Donkey Kong (Seth Rogen) facing off on whats essentially a 2D Final Destination-style stage.\nMario is almost immediately beaten by his oldest rival before he leaps into the air and nabs a powerup (not unlike Smash): a catsuit that doesnt seem to do much for him. This bit of comedy gives us our first listen on Seth Rogens DK voice as he laughs a Marios futile attempts to win and promptly throws him off the stage  in yet another Smash homage.\nAll these Smash Bros. references shouldnt come as much of a surprise considering how much the movie already seems to be leaning on some of Marios most popular spinoff games. Weve already gotten glimpses of Luigi (Charlie Day) fighting ghosts, like he might in Luigis Mansion, and of plenty of the characters racing across screen in Mario Kart-style go karts.\nWith all these references revealed already, there are sure to be dozens more to dig through when The Super Mario Bros. Movie arrives in theaters on April 7.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Super Mario Bros.\nMovie already looks like a greatest hits of Mario spin offs and the latest trailer gives it a huge shout out of Smash Bros.\nChris Pratt ) and Donkey Kong (Seth Rogen) facing off on whats essentially a 2D Final Destination-style stage.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T19:25:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/VuiZZSAZTUyaBu2Io-hdxjSp6l4=/346x0:3396x1597/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24396498/image_2023_01_30_140721822.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578167/mario-bros-movie-trailer-smash-bros-donkey-kong-seth-rogen"
      }
    },
    {
      "id": "5312135979685158830",
      "title": "Is Shrek not in Puss in Boots: The Last Wish because hes dead?",
      "url": "https://www.polygon.com/23578016/puss-in-boots-last-wish-shrek-ending-theory",
      "description": "One day we may get a Shrek 5, but heres a theory: Shrek the ogre might be dead in the spinoff sequel. And if its true, Puss in Boots 2 is much more poignant.",
      "body": "Puss in Boots: The Last Wish\nis not just a sequel to a Shrek spinoff  its also a gorgeously animated movie with some beautiful action sequences, vivid characters, and a touching story about mortality.\nBut yes, it is also a Shrek spinoff, which leads to the natural question: Is Shrek in this movie? The answer is surprisingly complicated for something so simple.\nOK, so, is Shrek in Puss in Boots: The Last Wish?\nImage: DreamWorks Animation\nUnlike the previous Puss in Boots movie, which served as a prequel to Puss as we meet him in Shrek 2, The Last Wish takes place after all of Puss Shrek-related escapades, when hes on the last of his nine lives.\nShrek himself does not make a canon appearance, but when Puss reminisces on his past adventures, both Shrek and Donkey pop up in a memory. It is a scene where the three of them jauntily walk across a fallen log bridge, which as far as we know was not actually shown on screen in a mainline Shrek movie. Was it a missing moment, or did this happen after Shrek Forever After?\nIn addition to Shrek and Donkey, a handful of other Shrek characters make brief appearances in The Last Wish: Pinocchio is seen in one of the big bad villains flashbacks, doing a merry little jig and squealing that he is a real boy. Gingy the Gingerbread Man was directly involved in Puss fourth death, where the two of them watched an oven right before it exploded.\nWhen does Puss in Boots: The Last Wish take place in relation to Shrek?\nImage: DreamWorks Animation\nHeres where things get a little more fun. We know that Puss mustve met Shrek and the gang sometime between his third and fourth lives  which means that he lived four more lives since then. Now granted, Puss has lived a carefree life leading to the events of The Last Wish, which means the gaps between lives couldve been just a couple of months. But they also couldve spanned quite some time (on the longer end, cats live about 18 years, but this is a fantasy world with talking cats, so we cant quite put a number on it).\nBut context in The Last Wish suggests its been some time since Puss has seen Shrek and the others. Hes basically in a different country and off doing his own thing. And its been long enough that Puss doesnt feel like he can comfortably hit up Shrek or Donkey when a doctor suggests he spend his last life chilling. A lot of the movie focuses on Puss getting over his own inflated ego and learning to rely on others, but it does undermine his previously established friendship with Shrek and the others. Surely they had the sort of bond that transcends a few awkward years.\nBut what if its been more than a few awkward years? What if its actually been such a long period of time that Shrek isnt alive anymore?\nWait, what? But doesnt Puss go to Far Far Away in the last scene?\nYes, the ending of The Last Wish finds Puss, Kitty, and Perrito stealing a ship and sailing to Far Far Away, but lets remember a few key things: One, Shrek renounced the Far Far Away throne to live in his swamp back in the third movie, leaving the crown to Fionas cousin Arthur. And two, a lot of other characters live in Far Far Away  notably characters who probably cant die of old age, like Pinocchio (made of wood), Gingy (made of cookie), and the Magic Mirror (made of mirror). Also, Fiona and Shrek and Donkey and Dragon all had kids, which means that Puss could very likely be visiting the second (or third!) generation.\nI dont believe you.\nthat some sort of Shrek reboot\nor sequel is coming up. And Universal and DreamWorks probably want to make as much Shrek money as possible, so it is vastly unlikely that Shrek is actually dead. Also, hes an ogre. Surely they live pretty dang long.\nBut the message of mortality and Puss fear of death hits all the harder when we consider that the heros outlived some of his closest friends and has seen the passage of time. It could even be that he took off and left them when he realized they were nearing the ends of their lives, unable to face that fact. Maybe he regrets this! Maybe he has compartmentalized! Maybe this is another reason he wants to work alone and be alone  getting close to others when you have a semi-immortal lifespan only builds up to heartache. No wonder this cat has commitment issues!\nWait, speaking of commitment issues  what about Puss wedding? Were Shrek and Donkey and the rest of them there?\nI certainly hope so. Maybe Puss running away from that wedding wasnt just running from a life with Kitty, but the fact he couldnt face his friends one last time. Let that sink in. :)\nPuss in Boots: The Last Wis\nh is available on demand now.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "One day we may get a Shrek 5, but heres a theory: Shrek the ogre might be dead in the spinoff sequel.\nAnd if its true, Puss in Boots 2 is much more poignant.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T19:17:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/rZqBCCwgWednVdOlFYkKjkFXia8=/0x92:967x598/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24396181/shrek_puss_in_boots_1551253811.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578016/puss-in-boots-last-wish-shrek-ending-theory"
      }
    },
    {
      "id": "2386996507441628625",
      "title": "Cryptocurrencies To Watch: Week of Jan. 30",
      "url": "https://www.mccourier.com/cryptocurrencies-to-watch-week-of-jan-30/",
      "description": "Hold an Eye on These Cash Is the crypto market lastly pulling out of its hunch? Bullish traders say sure as Bitcoin inches nearer to $24,000. Whereas the",
      "body": "Polygon (MATIC)\nHold an Eye on These Cash\nIs the crypto market lastly pulling out of its hunch? Bullish traders say sure as Bitcoin inches nearer to $24,000.\nWhereas the market reveals some indicators of a bull run, it is very important keep in mind that it is nonetheless unstable. A number of tokens stand out as noteworthy within the newest week amid the strengthening market.\nThis week, we study Threshold Community (T), Fantom (FTM), Avalanche (AVAX), Gala (GALA), and Polygon (MATIC). In deciding on these property, we have thought of components together with optimistic technical developments, important information occasions, and noticeable modifications in worth.\nKey Takeaways\nThreshold Community (T) was the weeks largest gainer, with an 80% worth surge that will have been the results of a Coinbase itemizing and a number of other venture updates.\nOne other main gainer this week was Fantom (FTM), which jumped 27% after the combination of The Vault on-chain fund and the launch of an NFT market on its community.\nAvalanches AVAX token rose 18% after the launch of a number of integrations on the community and presumably on account of the Amazon Internet Companies (AWS) partnership wave it nonetheless could also be using.\nGaming-focused venture Gala (GALA) posted a 16% enhance after potential partnerships with film stars and a gaming studio acquisition.\nPolygon (MATIC) superior greater than 20% amid elevated community exercise, which is cementing its place as a scalability platform.\nNominal vs. Real Interest Rate: What's the Difference?\nThreshold Community (T)\nThe Threshold Community (T) was probably the most notable gainer this week, with the token growing by 80%.\nThe rise got here after Coinbase stated it could record the T token and that buying and selling began Jan. 26.\nThe venture can also be anticipated to launch the minting function for tBTC quickly.\nThreshold Community is a decentralized finance, or DeFi, service that provides such options as staking and liquidity provision. It permits customers to deposit and redeem their Bitcoin in DeFi with out a third social gathering. T began final week at 0.023 cent and is now valued at round 0.044 cent.\nFantom (FTM)\nFantoms FTM coin elevated 27% after it introduced the Jan. 19 launch of the Ecosystem Vault on its community.\nThe vault is a fund that operates on-chain, taking 10% of the transaction charges for funding initiatives, concepts, and creations. The Fantom neighborhood controls how the funds are used.\nAdditionally final week, the Hector Community launched on Fantom its non-fungible token (NFT) market.\nThis Fantom-focused venture launched the Atlantica Market on Jan. 23 in whats one other main step ahead for the community. FTM was buying and selling round 38 cents initially of the final week and is now hovering at round 47 cents.\nAvalanche (AVAX)\nAvalanches AVAX elevated by 18% after it skilled adoption on a number of fronts.\nA number of new DeFi integrations for the token have taken place prior to now week, together with these by switch service SafeTransfer and Delta Prime DeFi.\nThe coin is now priced at round $20.91.\nNevertheless, it additionally might be that Avalanche continues to be using an early January partnership begin with Amazon Internet Companies.\nAWS now absolutely helps Avalanches infrastructure and decentralized purposes, or dApp, ecosystem.\nGala (GALA)\nThe Gala ventures GALA token elevated 16% after a number of main bulletins within the final week.\nFirst, there are stated to be collaborations with Hollywood actors Mark Wahlberg and Dwayne The Rock Johnson, though neither settlement has been confirmed.\nThe Gala group additionally stated it acquired gaming studio Ember Leisure, indicating that it has plans for the gaming market.\nGALA began final week at round 0.04 cent and is now valued at round 0.059 cent.\nPolygon (MATIC)\nPolygons MATIC token rose within the final week by greater than 20% to $1.11 due to a large enhance in community exercise.\nThe exercise progress is so important that Polygon overtook Ethereum when it comes to every day energetic customers.\nPolygon nows solely behind Binances BNB Chain when it comes to every day energetic customers.\nPolygon additionally has been gaining elevated DeFi exercise as the whole worth locked (TVL), or the general worth of crypto property deposited within the protocol, hit $872 million.\nThats a wholesome quantity throughout a interval when the crypto market is taken into account to be in a hunch.",
      "snippet": "<b>Polygon</b> (MATIC) Hold an Eye on These Cash Is the crypto market lastly pulling out of its hunch? Bullish traders say sure as Bitcoin inches nearer to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T19:08:21",
      "provider": {
        "name": "mccourier",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.mccourier.com/wp-content/uploads/2023/01/Cryptocurrencies-To-Watch-Week-of-Jan-30.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mccourier",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.mccourier.com/cryptocurrencies-to-watch-week-of-jan-30/"
      }
    }
  ]
}
