{
  "_type": "news",
  "didUMean": "",
  "totalCount": 204,
  "relatedSearch": [],
  "value": [
    {
      "id": "3139229987664684406",
      "title": "PS5 ad teases Uncharted 5 PlayStation fans believe",
      "url": "https://www.polygon.com/23578101/uncharted-5-ps5-ad-naughty-dog-cassie-nathan-drake",
      "description": "A new PlayStation 5 ad appears to show an unannounced Uncharted game, one that could star Nathan Drakes daughter Cassie from Uncharted 4: A Thiefs End.",
      "body": "Email\nImage: Naughty Dog/Sony Interactive Entertainment\nA new PlayStation 5 ad appears to include a mysterious tease for an unannounced game that some fans believe may be the next Uncharted  one that doesnt star Nathan Drake as its protagonist.\nThe new ad, titled \nLive from PS5\n, presents Sonys suite of exclusives, both from PlayStation Studios and third parties like Square Enix, as live-action clips on a news broadcast. Those clips highlight games like God of War Ragnark, Marvels Spider-Man 2, Horizon Forbidden West, Returnal, and Gran Turismo 7. Another live-action clip, which is seen only in short, seconds-long bursts, shows a young woman exploring a cave lit only by a torch, and encountering an ancient artifact and blowing the dust off it. The footage does not appear to match any released or announced game from Sony Interactive Entertainment.\nThats why some PlayStation fans believe its a tease for the next Uncharted game, and that it will star Nathan Drake and Elena Fishers daughter, Cassie.\nCassie appeared as a young teenager in the playable epilogue of Uncharted 4: A Thiefs End. While the ending of the game doesnt reveal too much about her character, its clear she has inherited her parents sense of adventure, and sometimes joins Nate and Elena on expeditions. But shes unaware of the extent of her fathers treasure-hunting escapades  that is, until she finds the key to Nates secret cabinet, and her parents are forced to come clean about their adventurous past. Given Cassies interests and talents  she has a love of history and archaeology, speaks Latin, and can scuba dive  she seems like a natural fit for the video gaming adventuring lifestyle.\nThe woman seen in the new PS5 ad looks similar to a grown-up Cassie. Shes decked out in jungle fatigues and wearing a backpack and climbing gear.\nNaughty Dog co-president Neil Druckmann (who co-directed Uncharted 4) recently told Buzzfeed that the studio behind the Uncharted games put its final brushstroke on that story, saying it was done and moving on. But that doesnt mean another studio couldnt pick up where Naughty Dog left off, especially with a new heroine. Other teams, including Bend Studio (\n) have had their hands on the franchise. After all, Sony Pictures CEO Tom Rothman has said last years Uncharted film adaptation is the start of a movie franchise, so Sonys not ready to let the Drake family go.\nImage: Sony Interactive Entertainment\nImage: Sony Interactive Entertainment\nImage: Sony Interactive Entertainment\nAs VGC notes, job listings at PlayStation have pointed to another studio co-developing an exciting new project with Naughty Dog in a beloved franchise. The original developer behind Uncharted and The Last of Us is currently busy making a multiplayer spinoff in the world of The Last of Us, which we should hear more about this year.\nThe most recent entry in the Uncharted game franchise was 2017s Uncharted: The Lost Legacy, a spinoff starring Chloe Frazer and Nadine Ross. In addition to exploring the franchise without Nathan Drake at the helm, Lost Legacy brought a new gameplay wrinkle to the Uncharted games: an open-world game map that players could explore in a non-linear fashion. Its new protagonists, and a fresh take on Uncharted gameplay, offered a glimpse into what the franchise could become in the future.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "A new PlayStation 5 ad appears to show an unannounced Uncharted game, one that could star Nathan Drakes daughter Cassie from Uncharted 4: A Thiefs End.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-30T19:08:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/ShRBZa2W5AW7-ye5NMFaoskdi0w=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24396314/uncharted_cassie.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23578101/uncharted-5-ps5-ad-naughty-dog-cassie-nathan-drake"
      }
    },
    {
      "id": "125737412056810963",
      "title": "Howls Moving Castle Loewe collaboration puts Calcifer on cute purses",
      "url": "https://www.polygon.com/23577876/howls-moving-castle-loewe-collaboration-how-to-buy",
      "description": "The Loewe x Howls Moving Castle collaboration puts characters (like Howl, Sophie, and Calcifer) from Studio Ghiblis beloved film on bags, shirts, scarves, wallets, and more. Heres how to access pre-sale.",
      "body": "Email\nPhoto: Juergen Teller/Loewe\nIts another beautiful day for Studio Ghibli fans. Fashion label Loewe is doing a Howls Moving Castle collaboration, featuring famous film moments and characters from Hayao Miyazakis beloved movie on bags, shirts, scarves, wallets, leather keychains, and more. This will be Loewes third and final Studio Ghibli collaboration, following its popular My Neighbor Totoro capsule series in 2021, and its Spirited Away series in 2022. Loewe x Howls Moving Castle drops on February 2, but you can also sign up for early access, which will launch on February 1.\nAs with past Studio Ghibli collaborations, this series is bursting with inventive items  covered in tassels, fur, and jewels, and sporting whimsical shapes  plastered with familiar characters. Howl, Sophie, Markl, Heen (the dog), Turnip Head, and the Witch of the Waste all make appearances. But Calcifer, the demon fire at the heart of Howls castle, really steals the show.",
      "snippet": "The Loewe x Howls Moving Castle collaboration puts characters (like Howl, Sophie, and Calcifer) from Studio Ghiblis beloved film on bags, shirts, scarves, wallets, and more.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T19:00:55",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/D7EiqawZBO-iud45AjMrYDQ_8Cs=/0x509:1400x1242/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24396178/image__1_.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23577876/howls-moving-castle-loewe-collaboration-how-to-buy"
      }
    },
    {
      "id": "6568511388746826547",
      "title": "Poker Face creators really just wanted to hear Natasha Lyonne call BS",
      "url": "https://www.polygon.com/23573399/poker-face-nora-lilla-zuckerman-interview",
      "description": "The showrunners of The Last Jedi and Knives Out director Rian Johnsons new show tell us why its so satisfying to hear lead actor Natasha Lyonne (Netflixs Russian Doll) call bullshit on the criminals she comes across.",
      "body": "Email\nPhoto: Evans Vestal Ward/Peacock\nAs far as catchphrases go, bullshit is a pretty good one. Maybe its not original, but damn if it isnt satisfying. Charlie Cale (\nNatasha Lyonne\n), the protagonist of Poker Face, Rian Johnsons throwback murder mystery show gets to say it several times an episode thanks to her unique gift: a preternatural ability to tell if people are lying to her. Its one of the things that makes the Peacock series so compelling to watch  theres a catharsis to calling bullshit, and every episode is built around the moment when Charlie does.\nAccording to sister showrunners Nora and Lilla Zuckerman, this is by design.\nShe thinks that truth matters, and she thinks that helping people matters, the pair told Polygon in a recent interview. A lot of us feel that way right now. I think shes tapping into something very primal in all of us.\nRelated\nReview: No lie, Poker Face just owns\nThat primal feeling extends to Poker Faces rotating cast of salt-of-the-earth types that Charlie encounters while on the road. As viewers learn in the Poker Face premiere, which premiered last Thursday, Charlie has run afoul of a casino tycoon and has to stay one step ahead of Cliff (Benjamin Bratt), the hired goon tasked with tracking her down who occasionally catches up with her from time to time. Because of Cliffs ever-present threat, Charlie lingers on the margins of society, hanging out with and helping folks that live off the beaten path. The Zuckermans have a joke about this, saying that the show doesnt take place at The Four Seasons, it takes place at Four Seasons Total Landscaping.\nCharlies world is one that, despite its rough exterior, is full of good people who are overlooked and in need of help, and often die as a result of that institutional neglect. An annoying but sweet metalhead, a BBQ pitmaster, a military veteran working behind a Subway counter  all victims killed because someone thought they wouldnt be missed. Perhaps, even, because the killers felt that way about themselves. Its not like the cops seem to care; why would some nosy blonde woman change things?\nNora and Lilla Zuckerman say that Charlies status as a civilian doesnt just invite this presumption, but makes for more interesting stories. While Poker Face is a throwback by design, one of the ways it feels fresh is in how Charlies crime solving is accidental, and not because she is law enforcement, or a private detective. There really is only so much Charlie can do. She cant guarantee justice, but who can? Again: shes working her way through the places the system has ignored.\nCharlie is really limited in what she can do, the Zuckermans say. She just has to sort of count on her own ability, her powers of observation, the way that she talks to people, the way that she gets them to sort of show their cards to her  to use a good metaphor for the show.\nIn other words, Charlie does the most radical thing someone can do in a cold and indifferent time, something thats both the best way she can help the good people around her and the worst way she can hurt those who wish to harm them: She notices them. Shes interested. She gives a damn. And she calls bullshit.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "... that truth matters, and she thinks that helping people matters, the pair told <b>Polygon</b> in a recent interview. A lot of us feel that way right now.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-30T18:35:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/oTWWQfPNt6tMC7417FLTZSqyg10=/0x0:5866x3071/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24388570/NUP_197588_01305R.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23573399/poker-face-nora-lilla-zuckerman-interview"
      }
    },
    {
      "id": "3228451005420630874",
      "title": "Xbox Games With Gold taps another two for February",
      "url": "https://www.polygon.com/23577900/xbox-free-games-with-gold-february-2023-xbox-one-xbox-series-x",
      "description": "Xbox Live Gold and Xbox Game Pass Ultimate subscribers get two games from Games with Gold in January 2023: For the King and Guts N Goals. Those games are playable on Xbox One and Xbox Series X.",
      "body": "Email\nImage: James Bareham/Polygon\nXbox continues to observe the 10th year of its free games catalogue by sliding further into obscurity with each months releases. The February 2023 pair on offer are For the King and Guts N Goals, both for Xbox One (compatible with Xbox Series X).\nFor the King, by IronOak Games, is available all month (Feb. 1 to Feb. 28). Developed in Unity, its a real-time strategy game that incorporates turn-based combat and procedural generation into its gameplay. Launching in 2018 on Nintendo Switch, Windows PC, and Xbox One, it has a strongly positive reputation on Steam. For the King is at least a timely selection, as its sequel is expected sometime this year.\nRelated\nXbox Games With Gold lived in Game Pass shadow in 2022\nGuts N Goals, available Feb. 16 to March 15, launched in October 2021. Developed entirely in GameMaker, its ostensibly a soccer game where players beat up their opponents in turn-based combat, while avoiding traps and other hazards familiar to strategy games.\nIn addition to these games, subscribers can still get two of\nJanuarys Games With Gold\n; Autonauts is still available until Feb. 15, and Iris Fall is available until Tuesday, Jan. 31.\nXbox Live Gold membership costs $9.99 a month and is mainly for online multiplayer access now. For Xbox One and Xbox Series X owners looking for a subscription plan, Xbox Game Pass Ultimate, at $14.99 per month, offers a better selection and includes Xbox Live Gold access.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Xbox Live Gold and Xbox Game Pass Ultimate subscribers get two games from Games with Gold in January 2023: For the King and Guts N Goals.\nThose games are playable on Xbox One and Xbox Series X.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T17:30:38",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/7z5keqdSl2iy4sgUqxpWqMpZoUI=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23592188/xbox_games_with_gold_stock.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23577900/xbox-free-games-with-gold-february-2023-xbox-one-xbox-series-x"
      }
    },
    {
      "id": "4040040723628275003",
      "title": "James Camerons Avatar and Hayao Miyazaki have the same war obsession",
      "url": "https://www.polygon.com/23574291/james-cameron-avatar-war-nature-hayao-miyazaki",
      "description": "Cameron makes movies about nature, as does the Studio Ghibli director behind Princess Mononoke. But when compared to Miyazaki, The Way of Waters conflicts make even more sense.",
      "body": "Flipboard\nEmail\nThrough a mix of cold and unnatural technological processes, James Camerons Avatar: The Way of Water manages to be a lovingly crafted showcase of natural splendor. Its a romantic fantasy of a world untouched by the depravities of modern, capitalistic, and militaristic civilization, one in which there exists the freedom to coexist with nature, and to find family and love.\nAt the same time, all the impressive visual-effects energy put toward portraying the natural wonders of Avatars setting, Pandora, is also equally committed to rendering vehicles and weapons of war in similar, painstakingly realistic detail. There are fictitious airships only an iteration away from what we have on Earth, hydrofoil whaling vessels that leap powerfully over the waves, crablike diving robots, and mechanized armor that can also serve you a stiff cup of joe. They are all glorious, terrible inventions. They are love letters to futuristic military technology.\nThis tension might seem utterly confounding if it were not for another filmmaking auteur with a strikingly similar style: Hayao Miyazaki, founder of the famous animation company Studio Ghibli. As is self-evident from his vast catalog of films and television, Miyazaki is a pacifist and a lover of the environment. He also holds an admitted attraction to drawing military machinery. His films often contain exhortations against violence and imperialism, and messages to protect nature against the transgressions of man. At the same time, they are often replete with lovingly drawn tanks, airplanes, and other high-tech military hardware.\nAvatar: The Way of Water\nImage: 20th Century Studios\nMiyazaki grew up in Japan during the end of the Second World War. His father ran an aircraft parts manufacturer and helped produce fighter planes for the Japanese military. In Studio Ghiblis 2013 film The Wind Rises, a fictionalized biography of Jiro Horikoshi, the famous inventor of Japans deadly WWII Zero fighter planes, Miyazaki reflects not just on world history, but on his own life as an artist, and the way his upbringing shaped his paradoxical interests. During one press conference captured in The Kingdom of Dreams and Madness, a documentary about Studio Ghibli, head producer Toshio Suzuki says that Miyazaki finds himself fascinated by military aircrafts. Hes a man whos lived with this contradiction. Hes torn by what he loves. Hes drawn to war planes, yet hes anti-war. How is someone like him even possible?\nSimilarly, Camerons directing philosophy is informed by his fathers engineering career. In an interview with The Talks, he says: My father was an engineer, very rational and logical, while my mother was an artist. Ive always felt that cinema is not a pure art form; it is a technical art form. It involves complex equipment, and theres a mastery of a technical side of it that you have to have in order to express your emotions and your feelings. I love the engineering and I love the storytelling. In my mind, those two things go hand in hand.\nAnd, indeed, Camerons movies often deftly deploy both sides of this equation. His two Terminator films are famous for their futuristic designs of enemy airships, tanks, and glistening exoskeletons while primarily being about love and parenthood. True Lies uses jump jets and Bond-film-styled action sequences to tell a story of absent fathers. Aliens birthed an entire aesthetic around the surly space marines making up its cast while mainly being a story concerned with a mothers love for her adoptive child. His attention to detail when it comes to mechanized mass destruction is rivaled only by his passion for making sentimental epics about love and companionship.\nThe lovers in his most recent work, The Way of Water, are, oddly enough, the son of protagonist Jake Sully, Loak, and the teen boys whalelike tulkun buddy, Payakan. Loak and Payakan are both misunderstood by their own tribes, and through their shared pain stemming from feelings of isolation, they become friends. Their relationship strengthens them both in two ways: It helps them find their place in their respective societies and ultimately helps them fight back against the humans who seek to destroy their tribes and their homes. The hurting tulkun represents not only humanitys divorce from nature but from each other. it symbolizes that potent destruction lies in nature, rather than in man. Cameron exposes our tendency to relate to nature as something we should fear or control, and through empathic and visual impact, he pivots us toward a relationship of appreciation and aid.\nCamerons committed romanticism toward nature manifests as grand adventures, not unlike the stories that have entranced Miyazaki. In the first Avatar, Jake Sully is only able to abandon his dead-end life as an injured military grunt and gain access to a life in Pandora with the guidance of the Navi princess Neytiri. As for Miyazaki, his characters often start out in towns, cities, and other bastions of human civilization, and are introduced to the wild secrets of nature through some magical interlocutor. The magical fish-girl Ponyos love for the young Sosuke requires the human world to find balance with the oceanic one or be swept away. In Princess Mononoke, the wild princess San allows Ashitaka, an exiled prince from a human village, to ride among her wolves, and help her save her forest from human encroachment. Its as if these stories must forever twist between the poles of rigid, patriarchal social order and the idealized freedom of untrammeled nature.\nThe Wind Rises\nImage: Studio Ghibli\nBoth men exhibit a kind of alienation with the modern world and its wasteful contrivances. Cameron drives a 2013 Kia Rio. Hes a vegan and a committed environmentalist. Miyazaki similarly leans away from philistinism and rejects others overreliance on technology. In the various documentaries on his life, he is portrayed as someone who lives the life of an artist aesthete, despite his outsized stature and influence in the industry. In spite of, or perhaps in response to, their roles directing huge teams of people and using advanced technology to produce their films, each directors personal ethos stands in stark opposition to contemporary modes of productivity, efficiency, and large-scale production.\nAt the core, there is a tension between the things they inherently cherish  the innocent, grounded adventures they shape their films and lives around  and their own natures. They both desire to make great art, art that requires teams and resources and is expected to sell; to move the numbers up and make their investors happy. Disneys production budget for The Way of Water and Camerons three planned follow-ups, if they are all completed, is expected to top $1 billion. As much as he and Miyazaki desire coexistence between humanity and nature, both directors films are driven by the same capitalist economy that exploits people and brings ruin to the natural world.\nIn The Kingdom of Dreams and Madness, Miyazaki ",
      "snippet": "Cameron makes movies about nature, as does the Studio Ghibli director behind Princess Mononoke.\nBut when compared to Miyazaki, The Way of Waters conflicts make even more sense.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T16:03:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/qF2trujUPROVzj5lthLoKJDDtrI=/0x0:1178x617/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24395708/cameron_miyazaki.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574291/james-cameron-avatar-war-nature-hayao-miyazaki"
      }
    },
    {
      "id": "7530177613769539455",
      "title": "Netflixs One Piece adaptation is setting sail in 2023 poster reveals",
      "url": "https://www.polygon.com/23577694/one-piece-netflix-release-date-monkey-d-luffy-teaser",
      "description": "Netflix unveiled the first teaser poster for their upcoming live-action adaptation of One Piece on Monday, offering a glimpse at Iaki Godoy in costume as protagonist Monkey D. Luffy. The series is scheduled to premiere in 2023.",
      "body": "Email\nImage: Netflix\nNetflix revealed a first look at its upcoming live-action adaptation of One Piece on Monday, offering a glimpse at Iaki Godoy as protagonist Monkey D. Luffy, clad in his iconic straw hat and red vest with a clenched fist held high against a brilliant sunset view of the ocean. Theres also a tiny seagull with a hat  a News Coo in One Piece  soaring in the sky.\nThe poster also reveals that the series is set to premiere sometime in 2023.\nAdventure is on the horizon! ONE PIECE sets sail in 2023. Click Remind Me to add it to your list.\nJanuary 30, 2023\nAnother behind-the-back look at the cast of the live-action One Piece is now on the Netflix website. It shows Luffy with both of his arms raised in the air, standing on the shore of a beach and staring out at his ship, the Going Merry, while flanked by members of his Straw Hat Pirates crew: Sanji (Taz Skylar), Nami (Emily Rudd), Usopp (Jacob Gibson), and Roronoa Zoro (Mackenyu Arata).\nImage: Netflix\nNetflix announced the cast for the adaptation of One Piece back in November 2021, and revealed a tour of the series sets last summer during the streamers annual Geeked Week event. Still no firm release date or trailer as of yet, but the arrival of the latest take on Eiichiro Odas beloved pirate adventure manga is well within sight.\nThe series is executive produced by Matt Owens (Agents of SHIELD) and Steven Maeda (Lost), and produced by Tomorrow Studios, the same studio behind 2021s Cowboy Bebop starring John Cho, Mustafa Shakir, Daniella Pineda.\nNext Up In",
      "snippet": "Netflix unveiled the first teaser poster for their upcoming live-action adaptation of One Piece on Monday, offering a glimpse at Iaki Godoy in costume as protagonist Monkey D.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T15:50:30",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/FMmC94bMIp6qu8NOpgeTzJdXjog=/0x79:1080x644/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24395719/FnuIBgRagAAkBY9.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23577694/one-piece-netflix-release-date-monkey-d-luffy-teaser"
      }
    },
    {
      "id": "1618612769846908831",
      "title": "Cryptocurrency Prices Today, January 30: Bitcoin, Ethereum, Polygon, Litecoin, EOS, XRP tumble up to 5 percent",
      "url": "https://www.timesnownews.com/business-economy/markets/cryptocurrency-prices-today-january-30-bitcoin-ethereum-polygon-litecoin-eos-xrp-tumble-up-to-5-percent-article-97453264",
      "description": "The global cryptocurrency market cap was trading well above $1 trillion, rising over 1.5 percent in the last 24 hours.",
      "body": "Almost all major cryptocurrencies fell on Monday. In the last 24 hours, Bitcoin (BTC) dropped 1.68 percent to $23,094.92, Ethereum (ETH) fell 1.93 percent to $1,579.37, and Polygon was lower by nearly 5 percent to $1.11. Other tokens like Litecoin, EOS and XRP also fell as much as 3 percent in the last 24 hours.In terms of volume, BTC volume stood at approximately $25.72 billion, gaining 46.95 percent in the last 24 hours.The global cryptocurrency market cap was trading well above $1 trillion, rising over 1.5 percent in the last 24 hours.Analysts are of the view that there are multiple aspects like favorable market conditions, increased institutional buying and the anticipation of extensive utilisation are helping the cypto market.Though, they said, there is reason to be concerned as well if the US Fed hikes interest rates, it could have a significant impact on the cryptocurrency market. If the Fed interest rate hike is more than expected by the market, the impact on the cryptocurrency market may be slightly negative.",
      "snippet": "... Bitcoin (BTC) dropped 1.68 percent to $23,094.92, Ethereum (ETH) fell 1.93 percent to $1,579.37, and <b>Polygon</b> was lower by nearly 5 percent to $1.11.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T14:54:41",
      "provider": {
        "name": "timesnownews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static.tnn.in/thumb/msid-97453264,imgsize-2587479,width-1280,height-720,resizemode-75/97453264.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "timesnownews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.timesnownews.com/business-economy/markets/cryptocurrency-prices-today-january-30-bitcoin-ethereum-polygon-litecoin-eos-xrp-tumble-up-to-5-percent-article-97453264"
      }
    },
    {
      "id": "111686581539974588",
      "title": "Millions of Polygon's MATIC Sold by Unknown Whale Hours Before Price Fall",
      "url": "https://u.today/millions-of-polygons-matic-sold-by-unknown-whale-hours-before-price-fall",
      "description": "Unknown MATIC whale dumps millions of Polygon tokens right before price goes red",
      "body": "That is what happened this time too, with MATIC's token price dropping by almost 6% in amoment after today's more than $10 million sale by the whale.\nAds\nAds\nWhale affairs with Polygon (MATIC)\nDespite periodic sales of tens of millions of Polygon tokens, this unknown investor still holds a large bag of MATIC. According to the data cited, on top of the 9.46 million MATICs stored in the hot wallet, the whale has another 73.3 million tokens locked up in staking, the equivalent of almost $100 million in total.\nNike .SWOOSH Web3 Studio Kicks Off with Polygon NFTs\nRecall that earlier, onSunday, another unidentified large native Polygon token holder also exchanged 4.5 million MATICs for DAI at a price of $1.14 per token. On the same day, MATIC reached its local peak of $1.2 and has now rolled back to $1.11.",
      "snippet": "Unknown MATIC whale dumps millions of <b>Polygon</b> tokens right before price goes red. That is what happened this time too, with MATIC's token price ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T14:05:00",
      "provider": {
        "name": "u",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://u.today/sites/default/files/styles/twitter/public/2023-01/30401.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "u",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://u.today/millions-of-polygons-matic-sold-by-unknown-whale-hours-before-price-fall"
      }
    },
    {
      "id": "9005259572345850658",
      "title": "Intella X Neowiz's Web3 gaming platform reveals its ecosystem partners",
      "url": "https://laragione.eu/adnkronos/comunicati/intella-x-neowizs-web3-gaming-platform-reveals-its-ecosystem-partners/",
      "description": "SEONGNAM, South Korea, Jan. 30, 2023 /PRNewswire/ Following the recent announcement of $12 million in private funding, Intella X, Neowizs Web3 gaming platform, has revealed its initial ecosystem partners. The platforms initial gaming ecosystem consists of 30+ top-tier global partners from various sectors that include games, investments, blockchain services, and security to accelerate and bolster []",
      "body": "Scarica e leggi gratis su app\nIntella X, Neowizs Web3 gaming platform reveals its ecosystem partners\nGennaio 30, 2023\nSEONGNAM, South Korea, Jan. 30, 2023 /PRNewswire/  Following the recent announcement of $12 million in private funding, Intella X, Neowizs Web3 gaming platform, has revealed its initial ecosystem partners.\nThe platforms initial gaming ecosystem consists of 30+ top-tier global partners from various sectors that include games, investments, blockchain services, and security to accelerate and bolster Web3 gaming through Intella X.\nThe partners of Intella X include Polygon, Animoca Brands, Magic Eden, Big Brain Holdings, Planetarium Labs, Global Coin Research (GCR), ConsenSys (Infura), Neowiz, Arumgames, Blue Potion Games, Hidea, Massive Gaming, Modori, Ozys, Web3Auth, CertiK, Haechi Labs, Theori, Block Crafters Capital, Kross Lab, Bora, Crit Ventures, JoyCity, Kaura, Kracker Labs, Mobirix, Neon Games, Pearl Abyss, Widus Partners, Wemix, Swapscanner, and XL Games.\nAn official from Intella X commented, Through the support of our top tier ecosystem partners, Intella X will be built as a global, Web3-centric gaming ecosystem hub that exercises the fundamental values and philosophy of Web3 and leading innovators in Web3 gaming.\nEach partner from their respective industries is committed to the acceleration of mass adoption of Web3 and the long-term growth of the Intella X gaming ecosystem by joining forces in providing the highest quality of gaming experience to Web3.\nIntella X will make its global debut on Polygon in the first quarter of 2023 with its proprietary mobile wallet, DEX, NFT marketplace, launchpad, and game lineups for 2023.\nFollow Intella X socials for news and announcements.\nHomepage  https://www.intellax.io",
      "snippet": "The partners of Intella X include <b>Polygon</b>, Animoca Brands, Magic Eden, Big Brain Holdings, Planetarium Labs, Global Coin Research (GCR), ConsenSys ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T07:48:00",
      "provider": {
        "name": "laragione",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "laragione",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://laragione.eu/adnkronos/comunicati/intella-x-neowizs-web3-gaming-platform-reveals-its-ecosystem-partners/"
      }
    },
    {
      "id": "6098689021327119232",
      "title": "Cryptocurrency prices: Today's rates of Bitcoin, Ethereum, Shiba Inu, Tether",
      "url": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-30-01-2023-rates-of-bitcoin-ethereum-tether/story",
      "description": "Bitcoin has climbed 2.2% over the last 24 hours, trading at $23,741.74",
      "body": "Bitcoin has climbed 2.2% over the last 24 hours, trading at $23,741.74. It is 4.4% higher than the previous week.    The second most popular token, Ethereum, has risen 2.4% from yesterday to trade at $1,638.07. It is up 0.4% from last week.    The market capitalization of Bitcoin and Ethereum stands at $457.56 billion and $197.64 billion, respectively. BNB is trading at $315.62, which is 2.3% higher than yesterday and 4.1% up since last week.    XRP is currently trading at $0.44 after moving up 0.8% in the last 24 hours. It is 3.3% up from last week.    Cardano and Dogecoin are trading at $0.33 (up 1.8%) and $0.088 (up 0.6%), respectively. Solana, Polka Dot, Shiba Inu, and Polygon are currently trading at $25.48 (up 5.6%), $6.57 (up 0.8%), $0.000011 (up 1.1%), and $1.16 (up 0.9%), respectively.    Looking at the weekly chart, Solana has gained 5.0%, while Polka Dot has gained 5.7%.    In the past week, Shiba Inu's value has increased by 0.4%, whereas Polygon is 16.5% up. Based on the 24-hourly movement, the top gainers are Mina, Decentraland, Osmosis, GMX, and The Sandbox. They are trading at $0.77 (up 16.85%), $0.77 (up 12.17%), $1.04 (up 7.40%), $60.17 (up 6.50%), and $0.77 (up 5.93%), respectively. A stablecoin is a cryptocurrency that has very low volatility. Its value is correlated to a real-world asset such as fiat currency or gold.    Among the popular tokens, Tether, USD Coin, and Binance USD are trading at $1 (flat), $1 (up 0.1%), and $1 (flat), respectively. Terra Classic is listed at $0.00011 (up 0.59%). The biggest losers of the day are UNUS SED LEO, Toncoin, Frax Share, Trust Wallet Token, and Aptos. They are trading at $3.63 (down 7.52%), $2.44 (down 3.22%), $10.85 (down 1.76%), $1.72 (down 1.42%), and $18.05 (down 1.13%), respectively. In terms of traffic, liquidity, trading volumes, and trust in the legitimacy of trading volumes, Binance, Coinbase Exchange, and Kraken are the top three cryptocurrency spot exchanges.    Binance and Coinbase Exchange saw 24-hour volumes of $18.32 billion (up 31.72%) and $1.54 billion (up 37.57%), respectively. Kraken recorded a volume of $0.35 billion, which is up 30.04% from yesterday. DeFi, which is short for decentralized finance, is related to global, peer-to-peer financial services on public blockchains.    Some of the popular DeFi tokens are Avalanche, Dai, Uniswap, Wrapped Bitcoin, and Chainlink. They are trading at $20.68 (up 1.01%), $0.99 (down 0.06%), $6.88 (up 1.18%), $23,657.24 (up 1.99%), and $7.35 (up 0.32%), respectively. Non-fungible tokens (NFTs) are cryptocurrencies that do not possess the property of fungibility, meaning they cannot be exchanged for one another like other tokens.    ApeCoin, Decentraland, Axie Infinity, The Sandbox, and Flow are some of the prominent NFT tokens. They are currently trading at $6.22 (up 3.23%), $0.77 (up 12.18%), $11.88 (up 3.53%), $0.77 (up 5.94%), and $1.09 (up 1.23%), respectively. The current global crypto market cap is $1.05 trillion. The total crypto market volume over the last 24 hours is $36.87 billion. They have remained flat over the last day.    The global cryptocurrency market valuation was $798.32 billion last month, in comparison to $1.02 trillion three months ago.",
      "snippet": "Solana, Polka Dot, Shiba Inu, and <b>Polygon</b> are currently trading at $25.48 (up 5.6%), $6.57 (up 0.8%), $0.000011 (up 1.1%), and $1.16 (up 0.9%), ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T05:51:31",
      "provider": {
        "name": "newsbytesapp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cdn.newsbytesapp.com/images/l23220230130111215.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsbytesapp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-30-01-2023-rates-of-bitcoin-ethereum-tether/story"
      }
    },
    {
      "id": "6285281437675250502",
      "title": "Weekly Technical Outlook: Key Resistance Levels for Amazon, Polygon (MATIC/USD) and GBP/USD",
      "url": "http://babypips.com/trading/weekly-charts-2023-01-30",
      "description": "Amazon, Polygon (MATIC/USD), and GBP/USD are hitting major resistance levels on their daily time frames! Will we see rejections in the next few days?",
      "body": "TradingView\nBreakout alert! In case you didnt notice, Amazon broke above a months-long trend line resistance a few weeks ago.\nBut before you price in the reversal of a long-term downtrend, you should also note that the stock is approaching the tricky 102.00  107.00 zone that may rain on the bulls parade.\nSee, the area lines up with a key support in June and then in October, which is also close to the 38.2% Fibonacci retracement level of September to Decembers downswing.\nIt also doesnt help that AMZN is testing the daily charts 100 SMA just as price is showing a bearish divergence with Stochastic.\nA rejection from the 100 SMA opens AMZN to a dip back to its broken trend line levels if not Decembers lows.\nBut if the stock extends its January upswing, then we could see a trip to the 114.00 zone near the 200 SMA or even the 120.00 previous inflection point!",
      "snippet": "Amazon, <b>Polygon</b> (MATIC/USD), and GBP/USD are hitting major resistance levels on their daily time frames! Will we see rejections in the next few ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T05:44:28",
      "provider": {
        "name": "babypips",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://bpcdn.co/images/2023/01/30001856/AMZN.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "babypips",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://babypips.com/trading/weekly-charts-2023-01-30"
      }
    },
    {
      "id": "4375934838497008268",
      "title": "Last of Us episode 3 review: Nick Offerman leads the San Junipero of zombies",
      "url": "https://www.polygon.com/23571500/last-of-us-drop-episode-3-review-nick-offerman-murray-bartlett",
      "description": "The Last of Us games most incidental gay romance becomes a standalone episode with Offerman and Murray Bartlett from The White Lotus. Heres why it is up there with Black Mirror.",
      "body": "Email\nPhoto: Liane Hentscher/HBO\nIf you enjoyed Black Mirrors San Junipero, youll want to give a thought to Long, Long Time, the third episode of The Last of Us on HBO Max, starring Parks and Recreations Nick Offerman in a guest role as Bill.\nNo, San Junipero doesnt have anything to do with zombies, and Long, Long Time doesnt have anything to do with uploading your personality to an endless 1980s club scene. They share a far more niche category: self-contained episodes that pivot from the overall thrust of their respective TV series to present a sci-fi-tinged queer love story.\nBack in 2016, everyone I knew was watching San Junipero, talking about how they hadnt watched San Junipero yet, or telling me I should watch San Junipero, the fourth episode of the third season of Black Mirror. Its not that I knew a lot of Black Mirror fans; its just that I know a lot of queer folks who enjoy genre TV. Eventually, I watched San Junipero. It was lovely! Ive never seen another episode of Black Mirror.\nSan Junipero is widely considered one of the best episodes of television to come out in 2016, and is still appreciated for being basically the only episode of Black Mirror where technology is a good thing thats nice, instead of a Twilight Zone horror. But for many, San Junipero is most fondly remembered because a romance-centered genre story is rare enough to see on TV, let alone one where a gay couple gets to ride off into the sunset together.\nDid you enjoy what San Junipero did for bisexual and lesbian sci-fi fans? Would you like to see The Last of Us do it for (white) gay men?\nWell, then, can I interest you a 60-ish-minute short film where Nick Offerman plays a closeted survivalist in a zombie apocalypse who learns the irreplaceable value of attachment from another mans tenderness, as you follow their relationship from its beginning through to a peaceful end in old age?\n[Ed. note: The rest of this piece contains broad spoilers for Long, Long Time.]\nAlso Joel and Ellie are there too, I guess, but whatever. They bookend the episode, appearing only at the beginning and end, leaving the rest for director Peter Hoar and writer Craig Mazin to spend expanding on Bill and Frank. And expand they do. Bills game appearance is minor, and Frank died before the player even finds out he existed. What players know is that their relationship ended badly. One can infer that they were lovers, but theres no direct confirmation of it. The Frank (played by The White Lotus Murray Bartlett) and Bill of The Last of Us TV show are a near-complete retread.\nOfferman frankly stuns in the role as a self-sufficient prepper who freezes like a deer when presented with the freely offered intimacy he had never dared to allow himself to need. Bill and Frank kiss, and fuck, and argue; they cook, and make art, and surprise each other with loving gifts; they find much struggle but greater joy in building out a pocket of paradise in the wasteland.\nIf the episode has a failure point, its that these guys are almost literal Log Cabin Republicans (although the log cabin is a modern colonial in the suburbs of Boston). Or, and Im putting on my best Surfer Dude accent here, Getting yours and then actively resisting creating a community to share with others even though you absolutely have the resources to do so? Not (queer) radical, dude. Not (queer) radical at all.\nBut thats a failure point of all of The Last of Us, game and show, in that regardless of race or creed, it molds its characters according to a lionization of the largely mythical idea of the private, isolationist homestead defended righteously against chaos.\nOffermans and Bartletts performances are what make the episode transcend The Last of Us limited ideas of ideal society, turning Long, Long Time into the best episode of the shows first season. Time  and further seasons, as they arrive  will tell if it turns out to be the best episode of the show, period.\nBut in the meantime, no pun intended, it can be enjoyed in isolation from the rest of The Last of Us. If you can watch the satisfying thing everybodys talking about without signing up for hours of notoriously dour television on either side of it, well, thats an easy sell. Stand-alone status propelled the spread of San Junipero across the face of queer discourse, and it may just walk Long, Long Time into the queer sci-fi hall of fame as well.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Last of Us games most incidental gay romance becomes a standalone episode with Offerman and Murray Bartlett from The White Lotus.\nHeres why it is up there with Black Mirror.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-30T03:20:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/W759tBoyT1yLUG8V9jsrFFaKTNs=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390566/nick_offerman_2.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23571500/last-of-us-drop-episode-3-review-nick-offerman-murray-bartlett"
      }
    },
    {
      "id": "8169327977463613850",
      "title": "HBOs The Last of Us expands Bill & Franks gay romance from the game",
      "url": "https://www.polygon.com/23574585/last-of-us-bill-frank-gay-game-show",
      "description": "The Last of Us third episode is among the best of the series, highlighting Bill and Franks relationship  which was easy to miss in the video game.",
      "body": "Email\nPhoto: Liane Hentscher/HBO\nThree episodes in, its clear that HBOs The Last of Us is a faithful adaptation of the original video game from 2013  so much so that lines and frames may have been pulled straight from the game. Thats not to say that there arent changes, though. Series co-creators Craig Mazin and Neil Druckmann are making strategic adjustments to certain elements of the game for the new medium and to catch up to modern sensibilities. The first of those changes was with Joels partner, Tess, and how her story ultimately came to an end in episode 2. Whether it was an improvement is debatable, but for a show dedicated to preserving the anatomy of the source material, it was notable.\nThe filmmakers made another major change in the third episode, and its one that is unequivocally for the better.\n[Ed. note: This story contains spoilers for the third episode of HBOs The Last of Us and the original The Last of Us video game.]\nBill and Frank have been mentioned offhand a few times over the past two episodes, referred to as collaborators in Joel and Tess smuggling ring. If you havent played The Last of Us, those names mean nothing to you, but for those who have, Bill, at least, is a beloved character. Bill is gay in the game, but its referenced so vaguely that plenty of players missed it.\nThe decision to keep it muted, hinted at in a single line of dialogue and a hidden letter, was both praised and criticized  it was easy to overlook, but it also avoided a lot of gay-character tropes, and allowed Bill to be a human and not a manifestation of sexuality, as Polygons Danielle Riendeau put it at the time. Naughty Dog won recognition from GLAAD for its portrayal of Bill in the organizations\nlist of the years most intriguing new LGBTQ characters.\nThe games storyline doesnt avoid tropes altogether, though: It was criticized for burying its gays. Bill doesnt die, but Frank does  hes found hanging in a house. While Bill is left behind in a less secure part of town, he doesnt explicitly die; hes just never heard from again.\nIn the Bills Town segment of The Last of Us, Joel and Ellie meet Bill in Lincoln, Massachusetts, a small town northwest of Boston. Bills clearly been prepping for a while, having strung up his part of town with a bevy of tripwires and traps that are meant to keep out humans, infected or not. (And the area around Lincoln has a ton of infected.) Joel and Ellie need help  in particular, a car. While Bill doesnt have a car, he has parts they can use to fix a car up. As you may expect, everything goes a little nuts. Theres a lot of moving about the town and fighting off infected; its very intense compared to episode 3 of the show.\nBills Town is an exciting section of the game with a bunch of action \nincluding a bloater\n!  but its also got a lot of smaller moments and quips between Bill, Joel, and Ellie; its clear that they all have complicated relationships, but still feel a tenderness for each other. Bills and Joels relationships mirror each other, which you can see as the chapter moves on, and we learn about Franks fate. After some close calls with infected, the group hides in a house. Franks house. Thats where they find his body, hanging. He got bit, they learned, and wanted to die before turning.\nTheres a note the player can pick up near the body, but its easy to miss. In the letter, Frank chastises Bill for being afraid to leave the security of his area, and outright tells Bill that he hates him. Bill could never have given Frank the life he wanted to live, Frank says.\nYou dont have to give the letter to Bill, but you can  and it clearly upsets him: So thats how you feel, Bill says. Well, fuck you too, Frank. Fuckin idiot. Bill and Franks relationship in the game, depending on how players inferred it, is a tragic one, but its almost objectively underserved.\nIts a harsh contrast to the Bill and Frank we see in the show, where a tender love grows in the apocalypse. Episode 3 is filled with small, sweet moments between the two, and while they squabble, their arguments definitely have a different tone. Its a romance that makes for one of the best episodes of The Last of Us, and stands out among prestige TV, too. Sure, Bill and Frank both die in the end, but its at the end of a challenging yet beautiful life.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Last of Us third episode is among the best of the series, highlighting Bill and Franks relationship which was easy to miss in the video game.\nEmail Photo: Liane Hentscher/HBO Three episodes in, its clear that HBOs The Last of Us is a faithful adaptation of the original video game from 2013 so much so that lines and frames may have been pulled straight from the game.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-30T03:05:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/OeYasptpfAwPrprH1ASs9-wbzc4=/0x0:980x513/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390470/nick_offerman_murray_bartlett_0.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574585/last-of-us-bill-frank-gay-game-show"
      }
    },
    {
      "id": "7669996755418620246",
      "title": "Star Trek: Picard season 3 new trailer is a Next Gen nostalgia blast",
      "url": "https://www.polygon.com/23574891/star-trek-picard-season-3-trailer-release-date-paramount-plus",
      "description": "Star Trek: Picard season 3 returns in February, and a new trailer for the series reunites Patrick Stewart, Jonathan Frakes, Brent Spiner, and the rest of the Next Generation Cast.",
      "body": "Flipboard\nEmail\nIts classic Star Trek baddies against classic Star Trek good guys in the latest trailer for final season of Picard, which brings the show to its inevitable Star Trek: The Next Generation reunion plot line.\nThe seasons story appears to kick off with a distress call from Picards old flame and former chief medical officer Beverly Crusher, but of course there are galaxy-wide stakes here as well.\nPicard mainstays Patrick Stewart, Jeri Ryan, and Michelle Hurd return in season 3 for their usual roles, while Brent Spiner will pick up his fourth discrete character in the shows history by reprising Lore, a warped prototype of Next Generations android officer, Data. Joining the main cast are pretty much all the TNG mainstays  LeVar Burton, Michael Dorn, Jonathan Frakes, Gates McFadden, and Marina Sirtis  as well as Pulp Fictions Amanda Plummer, as the seemingly new villain, Vadic. The trailer reveals that Todd Stashwick and Ed Speleers also join the cast.\nAlso, and this is wild, three decades after his two appearances on Star Trek, Daniel Davis is back to play Professor Moriarty. You know, the sentient hologram version of the fictional character",
      "snippet": "Star Trek: Picard season 3 returns in February, and a new trailer for the series reunites Patrick Stewart, Jonathan Frakes, Brent Spiner, and the rest of the Next Generation Cast.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T01:02:55",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/3iOomqRVoWlQSbOFBQXm0ZgM4-g=/0x360:6240x3627/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24391175/Picard_302_TP_0927_01612_RT.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574891/star-trek-picard-season-3-trailer-release-date-paramount-plus"
      }
    },
    {
      "id": "106491665729184224",
      "title": "Check out Parker Otolanis great concept for a revived AirPort router/home hub",
      "url": "https://www.mactech.com/2023/01/30/check-out-parker-otolanis-great-concept-for-a-revived-airport-router-home-hub/",
      "description": "Parker Otolani  who manages consumer product development for The Verge, Polygon, and the Vox Media Podcast Network  has designed a fantastic mock-up of a new AirPort router/home hub. He envisions an Airport powered by Wi-Fi6E, Siri, HomeKit, and private relay powered by Apple Silicon for US$199. Check it out. Ive said before that []",
      "body": "Rumor: 14-inch, 16-inch MacBook Pros coming in September\nJuly 2, 2021\nSmart Spacers are the Ultimate Table Divider for any table. Conference Tables, Portable / Folding Tables, Rectangle Tables, Round Conference Tables, Round Tables, Assisted Living, Banquet and Events, Clampless Versions, Conference Rooms, Executive and Meeting Tables, Offices, Restaurants, acrylic, rectangle, banquet, conference, club, dining, restaurant, hospitality, section, barrier, screen, zone, Tabletop, square, panel, plexiglass, social distancing, sneeze guard, table divider, divider panels, virus protection, plexiglass dividers, round table divider , Sneeze Guard divider, plexi partitions, plexiglass partitions, acrylic partitions, round table, safety overhang, social distancing, physical separate,\nCopyright 1984-2023 MacTech. All rights reserved. | Legal Stuff | Support: Email or 877-MACTECH, +1-805-494-9797",
      "snippet": "Parker Otolani who manages consumer product development for The Verge, <b>Polygon</b>, and the Vox Media Podcast Network has designed a fantastic mock-up of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-30T00:00:00",
      "provider": {
        "name": "mactech",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.mactech.com/wp-content/uploads/2022/11/cropped-atw-icon-web-e1674143258951.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "mactech",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.mactech.com/2023/01/30/check-out-parker-otolanis-great-concept-for-a-revived-airport-router-home-hub/"
      }
    },
    {
      "id": "5287425782032613691",
      "title": "HBOs The Last of Us: Every type of infected zombie",
      "url": "https://www.polygon.com/23570026/the-last-of-us-infected-zombies-all-types",
      "description": "There are a bunch of infected in HBOs The Last of Us, from clickers to bloaters and beyond. Heres each stage of the infection as seen in the game and TV show.",
      "body": "The Last of Us\n monsters are not your average zombies. Yes, theyre gross. Yes, they bite. But theyre not reanimated after dying. Instead, theyre living people who have been taken over by a fungus called Cordyceps  their whole thing is multiplying and spreading the infection as far and wide as possible.\nThe Cordyceps infection evolves over the course of an infected persons lifespan, which makes the Last of Us games infected that much scarier. Each of these different evolutions creates a unique threat. For instance, the first stage  when a person has first turned  is super fast and can detect uninfected people to chase. Clickers, a later stage, are blind, with mushroom-like growths splitting open their faces and obscuring their vision.\nRelated\nWe havent seen all of the infected types from the games represented yet in HBOs The Last of Us, but theyre probably coming.\nRunner\nImage: Naughty Dog/Sony Interactive Entertainment\nThe first stage of infection happens as the fungus spreads through the body. In HBOs The Last of Us, the shows creators slipped in an infographic to explain how long it takes for the infection to spread inside a person, depending on the bite location: On the head or neck, its quick, within minutes. If the bites on an extremity, like a leg or arm, itll take closer to 24 hours. The first signs of infection include coughing, slurred speech, muscle spasms, and mood changes. (Remember the old lady in episode 1? The muscle spasms were the first sign.)\nRunners are fast  inhumanly fast  and often travel in big groups. These look a lot like regular zombies, because they havent started sprouting mushrooms yet.\nStalker\nImage: Naughty Dog/Sony Interactive Entertainment\nStalkers are probably the most common type of infected. Theyre slightly more advanced than Runners and have visible changes  fungus grows out of their bodies, and sometimes their flesh is visibly decaying. Stalkers are not as fast as Runners, but theyre very deadly, always lurking, and ready to attack. In the games, Stalkers sometimes grow onto walls with mushroom tendrils holding them in place. When you walk by, theyll break free in a surprise attack.\nWeve seen these in HBOs The Last of Us, but completely grown into the wall and seemingly dead. In some cases, it seems like the fungus network may still be alive, but in others, its clearly dead and crumbling.\nClicker\nImage: Naughty Dog/Sony Interactive Entertainment\nProbably the creepiest sound in the show (and the games), Clickers are infected that have been around for a while, with mushrooms visibly protruding from the head, taking over the eyes. They cant see, so its necessary to move slowly and quietly near them. Any noise will alert a Clicker, and theyre very good at finding their prey using audio cues. Theyre easy to identify because of their signature clicking noise, a form of echolocation, and because of the massive fruiting mushroom sprouting from the head. We saw a couple of these on HBOs The Last of Us in Bostons historical museum in the second episode.\nBloater/Shambler\nImage: Naughty Dog/Sony Interactive Entertainment\nBloaters are the most advanced stage, and there are a few different variants within the group. We havent seen one of these on the show just yet, but HBO previously teased a Bloater in one of The Last of Us trailers. You can tell an infected is a Bloater because of the size  theyre big, grotesque, and, naturally, bloated with decaying mushroom bubbles. Bloaters and Shamblers are slower but really strong, and they can have a surge of energy to lunge toward an enemy. The layers of fungus act like armor, making them difficult to kill, too. They can also rip those growths off their bodies and throw them, sending damaging acid everywhere. If you get caught by a Bloater in the game, its an instant kill  and it rips your head in half through the jaw.\nShamblers are basically waterlogged Bloaters found more on the West Coast in the games. Theyre pretty similar, but they emit an acid gas that they spit at enemies.\nRat King\nImage: Naughty Dog/Sony Interactive Entertainment\nWeve only seen one Rat King infected in the Last of Us games, and its pretty gnarly: Its a shambling mass of multiple infected Clickers, Runners, and Stalkers all mashed together. It may be an anomaly, and who knows if well see one in the first season of The Last of Us. The battle against the Rat King in The Last of Us Part 2 takes place in two stages, and the monster breaks apart into different infected. Its got all the characteristics of the infected that comprise it, throwing mushroom bombs and emitting poison gas.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "There are a bunch of infected in HBOs The Last of Us, from clickers to bloaters and beyond.\nHeres each stage of the infection as seen in the game and TV show.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-29T19:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/NCsKDH9jA3MK-5GI68p55smPVN0=/0x57:2166x1191/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24387413/clicker.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23570026/the-last-of-us-infected-zombies-all-types"
      }
    },
    {
      "id": "6976011773668812694",
      "title": "Mahokenshi is a hex-based tactics deckbuilding game without decks",
      "url": "https://www.polygon.com/23574441/mahokenshi-deckbuilding-tactics-release-date-review-impressions",
      "description": "The supernatural samurai adventure from Game Source Studio, which combines card-game mechanics with a tactical strategy game, is out now on Steam",
      "body": "Email\nImage: Game Source Studio/Iceberg Interactive\nDevelopers seem to be willing to apply deckbuilding mechanics to every genre and setting these days. At first, this seemed a little faddish, but as designers relax into it, some interesting, thoughtful hybrids are emerging.\nOne such example is Mahokenshi (out now on Steam), a tactics game set in a world of Japanese-style folklore from French studio Game Source. Its not that Mahokenshi does anything revolutionary with its card game elements, but the care with which the developer has integrated deckbuilding into every element of the game  not just combat, but exploration and adventuring, too  is very pleasing.\nIts not worth spending too much time on the setting. You control magic-wielding samurai from four elemental schools as they battle cultists and goblins across some mystical islands. Theres some nice artwork, especially on the card illustrations, and the miniaturized maps of temples, forests, and little warring figures have a bonsai-like quality. But, coming as it does from a Western studio, it smacks a little of a kind of reverential but generalized Orientalism that is falling out of favor. Theres nothing offensive here  just a vague, borrowed mysticism that doesnt seem deeply connected to the game itself.\nAs a tactics game, Mahokenshi is relatively lightweight, but fun. Missions play out on hex-based maps where you direct your samurai to explore and battle. You spend the card-game staple of energy when moving or playing cards, and its fixed (to begin with, you have four energy per turn) rather than building over time, although there are ways to increase it later in the game. Tiles have different properties  standing in a forest boosts your defense, while mountains increase attack rating  and also contain chests of gold, new cards to add to your hand, and locations like villages, dojo, and castles, where you can boost your cards or your character in various ways. Because everything depends on energy, youre always balancing the rewards of exploration against defense and engagement, usually with one eye on a turn limit for the mission. Its solid risk-reward design. Some of the cleverest card designs entwine all the games systems at once, combining movement with attack or defense skills in concepts like Fly or Charge.\nImage: Game Source Studio/Iceberg Interactive\nAs a card game, Mahokenshi has a twist, in that its not really a deckbuilder in the long run. Every mission resets your deck to a few basic starter cards, and you need to build a new deck on the fly through exploration and buying cards from villages. This is quite refreshing, in a way  it means Mahokenshi is a game of improvisation and thinking on the fly, rather than theorycrafting your way to a perfect build. It makes the game quite immediate and approachable in the early stages, too.\nBut it also essentially doubles the influence of randomness on the outcome of your mission. Not only is the order you draw your cards each turn down to chance, but so, to a considerable degree, is the selection of cards youll have to draw from. As missions get tougher, this can be a problem. Some might find Mahokenshi too capricious as a result, but it certainly keeps the game both interesting and light on its feet.\nAs deckbuilding burrows deeper into every corner of video game design, its popping up in ever more varied places and getting bent into ever more interesting shapes. As amalgamations go, Mahokenshi is a refreshing one to build on.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The supernatural samurai adventure from Game Source Studio, which combines card-game mechanics with a tactical strategy game, is out now on Steam.\nEmail Image: Game Source Studio/Iceberg Interactive Developers seem to be willing to apply deckbuilding mechanics to every genre and setting these days.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-29T17:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/3C6CoQIf-gtaAm9lOpe47BSCLlA=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390249/Mahokenshi_Key_Art.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574441/mahokenshi-deckbuilding-tactics-release-date-review-impressions"
      }
    },
    {
      "id": "4046406291405625668",
      "title": "The 8 best movies like Dead Space",
      "url": "https://www.polygon.com/what-to-watch/23574260/movies-like-dead-space-sci-fi-horror-movies",
      "description": "The Dead Space remake has been released on PS5, PC, and Xbox Series X, and boy is it good. If youre looking for movies like Dead Space, watch one of these sci-fi horror gems on Amazon, HBO, and other streaming platforms.",
      "body": "Email\nThis story is part of a group of stories called\nYour time is precious, and your options are endless. The good news: We watch it all so you dont have to. Polygons What to Watch highlights the best, the funniest, the scariest, and the most exciting in movies, TV, and everything in between. Stop scrolling, start watching!\nDead Space, the sci-fi horror video game franchise starring the ever-suffering engineer Isaac Clarke, has risen from the dead with a new remake of the 2008 original for modern consoles courtesy of Montreal-based developer EA Motive  and its really good! Whether this is your first time descending into the Necromorph-laden bowels of the USG Ishimura, an avid Dead Space fan eager to spot what Motive have changed in this new version, or you just want to know who the heck this dude in a sci-fi diving suit doing the shoot dance in Fortnite is, the 2023 remake of Dead Space is solid on nearly all fronts.\nThe success of this new Dead Space game got us thinking about horror maestro (and \nGrandpa Horror\n) John Carpenters long-held desire to produce a live-action adaptation of the series. Then we got to thinking where such a film would fit among the best videogame film adaptations created so far, and then that got us thinking about what are the best sci-fi horror movies to watch for fans of Dead Space both new and old  yknow, besides the obvious ones like Event Horizon and the Alien series, cus youve likely already seen those!\nAn hour here and there of trawling IMDb later, and youve got this list: The most Dead Space-like movies to watch if youre looking for something else to chase the exhilarating horror and fun of playing through the new remake.\nDark Star\nImage: Jack H. Harris Enterprises/VCI Entertainment\nWhat it is: Before there was Alien, there was Dark Star, a kooky space comedy envisioned by eventual-Alien-writer Dan OBannon and then-unknown director John Carpenter as an offbeat alternative to 2001: A Space Odyssey. There are few comedies that would fit this list, but this is one of them.\nWhy its like Dead Space: Fans of Dead Space or Ridley Scotts sci-fi horror movie will see instant similarities in Dark Stars imagined future, where blue-collar spaceship workers futz about interstellar space. But Carpenters movie, first cobbled together as a student film then finalized as a feature for about $60,000, is a big goof, complete with slacker space cadets pranking each other aboard the Dark Star scout ship, a bowling ball alien sidekick, a talking bomb (the Hal 9000 replacement), and ahead-of-the-time special effects being put to use for comic mayhem. On the wavelength of Dr. Strangelove or National Lampoon more than any straight-faced sci-fi horror flick, Dark Stars far-out space peril remains cult-y and off-the-radar. But theres a reason Quentin Tarantino recently revered it as \na classic\n. Matt Patches\nWhere to watch: Dark Star is available to stream for free on Plex and with ads on Pluto TV, Tubi, and Roku.\nPandorum\nImage: Overture Films/Anchor Bay Entertainment\nWhat it is: Dennis Quaid and Ben Foster star in Christian Alvarts 2009 sci-fi horror drama as Lieutenant Payton and Corporal Bower, two interplanetary naval officers and crew members of the spaceship Elysium who awake from hypersleep after eight years aboard and discover that the rest of the ships crew have gone missing. If that werent enough, a group of cannibalistic monsters are now stalking them across the ship as they race to find answers.\nWhy its like Dead Space: In a recent interview with Rock Paper Shotgun, Glen Schofield  the director of 2022s The Callisto Protocol and the original 2008 Dead Space  directly cited Alvarts film among his favorite sci-fi horror movies and a prominent influence on his approach to horror in games. I love movies like Alien, The Thing and Pandorum. And then [Event Horizon] and Alien Versus Predator. Theres not a lot of them, but I liked them all.  Toussaint Egan\nWhere to watch it: Pandorum is available to stream on Starz and ford digital rental or purchase on Amazon, Apple TV, Google Play, and Vudu.\nSunshine\nImage: Fox Searchlight Pictures\nWhat it is: Director Danny Boyle (28 Days Later) and writer Alex Garland (Annihilation) released the sci-fi psychological thriller Sunshine in theaters just one year before Dead Space, and the film and game have some clear parallels. The movie follows an international crew of astronauts who embark on a mission to reignite Earths sun with a massive nuclear bomb  only to encounter the missing, derelict ship that attempted a similar feat seven years earlier. A deadly, mission-altering accident isnt the only terror the crew of the Icarus II has to face, and everything that can go wrong, does go wrong.\nWhy its like Dead Space: Sunshine has it all: a derelict ship; quasi-religious fundamentalists succumbing to space madness; flashes of grisly body horror; incredibly dramatic lighting; zero-G space walks; a lavish hydroponics lab; and a star-studded cast led by Cillian Murphy, Chris Evans, Michelle Yeoh, Rose Byrne, Benedict Wong, and Mark Strong. OK, that last bit has nothing to do with Dead Space, but what a lineup!  Michael McWhertor\nWhere to watch it: Sunshine is available for digital rental or purchase on Amazon, Apple TV, and Vudu.\nGhosts of Mars\nImage: Screen Gems/Sony Pictures Releasing\nWhat it is: All of John Carpenters movies have delightful B-movie flare. But arguably none have more than Ghosts of Mars, a pseudo-Western on Mars with an all-star cast (including Ice Cube, Pam Grier, and Jason Statham). When a freight train on a mission to pick up a prisoner (named Desolation Williams and played by Ice Cube) returns with only one survivor (Natasha Henstridge), she is interrogated about the series of events, unfolding through a series of interweaving flashbacks.\nWhy its like Dead Space: The Martian atmosphere is extremely spooky (and the red tones of the planets surface are gorgeous), especially in the back half of the movie, which I will leave intentionally vague so as not to spoil anything. John Carpenter is famously a fan of the Dead Space franchise and has said to anyone who will listen that he wants to make a movie adaptation. Ghosts of Mars makes it easy to see why hes so attracted to it. Pete Volk\nWhere to watch: Ghosts of Mars is available for digital rental or purchase on\nSolaris\nImage: The Criterion Channel\nWhat it is: Based on Stanisaw Lems 1961 novel of the same title, Andrei Tarkovskys 1972 psychological sci-fi horror drama centers on Kris Kelvin, a psychologist who is sent to a space station orbiting a mysterious exoplanet after the crew of the station have ceased communication with Earth. When he arrives, Kris is plagued with the same strange hallucinations and visions that are afflicting the rest of the station, forcing him to confront memories and revelations about himself and his loved one he had long since left buried.\nWhy its like Dead Space: In terms of the cerebral horror of it, and the fact that a lit",
      "snippet": "The Dead Space remake has been released on PS5, PC, and Xbox Series X, and boy is it good.\nIf youre looking for movies like Dead Space, watch one of these sci-fi horror gems on Amazon, HBO, and other streaming platforms.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-29T15:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/97FGMQSqykogEMo1Z4GKdxurekA=/0x44:1000x568/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22331651/sunshine.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/what-to-watch/23574260/movies-like-dead-space-sci-fi-horror-movies"
      }
    },
    {
      "id": "3355933922865310817",
      "title": "Mina, MATIC Come Into Spotlight as ZK Tokens Start Gaining Momentum",
      "url": "https://u.today/mina-matic-come-into-spotlight-as-zk-tokens-start-gaining-momentum",
      "description": "Mina Protocol's and Polygon's tokens show powerful price action as zero-knowledge proofs narrative gains traction",
      "body": "www.freepik.com\nDisclaimer: The opinion expressed here is not investment advice  it is provided for informational purposes only. It does not necessarily reflect the opinion of U.Today. Every investment and all trading involves risk, so you should always perform your own research prior to making decisions. We do not recommend investing money you cannot afford to lose.\nGoogle News\nPolygon's native token, MATIC, and the Mina Protocol token are up more than 18% as the week draws to a close. Their growth would seem to be in harmony with the general market environment, but it could be argued that a number of investors are buying these tokens based on a particular narrative.\nCan Polygon Skyrocket in 2023?\nThe talk is about the zero-knowledge proofs sector, which should make its full debut in the coming months with the release of long-awaited projects. As a technology, ZK has already built a reputation for the future of blockchain privacy and scalability.\nM power\nApart from the fact that MINA and MATIC start with the same letter, they are also the main beneficiaries of the impending ZK season. Expected innovations from Polygon and Mina Protocol are considered the most progressive in the field and are most anticipated.\nAds\nAds\nOn Polygon's side in particular, the crypto community will have to get zkEVM, which is a second-layer rollup with extremely low fees and increased privacy due directly to the principle of operation.\nCan Polygon Skyrocket in 2023?\nAs for Mina, the community expects the bridge between the protocol and Ethereum to be launched fairly soon. Success in this case could lead to more decentralized applications connecting to Mina, which, thanks to Mina's lightness and autonomy, will boost their efficiency, privacy and security.",
      "snippet": "Can <b>Polygon</b> Skyrocket in 2023? The talk is about the zero-knowledge proofs sector, which should make its full debut in the coming months with the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-29T14:21:00",
      "provider": {
        "name": "u",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://u.today/sites/default/files/styles/twitter/public/2023-01/30374.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "u",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://u.today/mina-matic-come-into-spotlight-as-zk-tokens-start-gaining-momentum"
      }
    },
    {
      "id": "4411030751513874511",
      "title": "Grave MistakeJoe Biden Reveals Game-Changing Crypto Roadmap After $2 Trillion Bitcoin, Ethereum, BNB, XRP, Cardano, Dogecoin, Polygon And Solana Price Crash",
      "url": "https://www.forbes.com/sites/billybambrough/2023/01/29/grave-mistake-joe-biden-reveals-game-changing-crypto-roadmap-after-2-trillion-bitcoin-ethereum-bnb-xrp-cardano-dogecoin-polygon-and-solana-price-crash/",
      "description": "The Biden administration has said Congress needs to \"step up its efforts\" in regulating the bitcoin and crypto market...",
      "body": "ethereum, BNB, XRP, solana, cardano, dogecoin and polygon price boom.\nGetty Images\n\"In the past year, traditional financial institutions limited exposure to cryptocurrencies has prevented turmoil in cryptocurrencies from infecting the broader financial system,\" four senior U.S. officials in the Biden administration wrote in a statement, urging Congress to \"step up\" efforts to regulate the cryptocurrency market after a number of crypto bills have been introduced.\n\"It would be a grave mistake to enact legislation that reverses course and deepens the ties between cryptocurrencies and the broader financial system.\"\nOver the last year, some of Wall Street's biggest giants have begun making inroads into the world of bitcoin and crypto.\nBlackrock, the world's largest asset manager, has partnered with bitcoin and crypto exchange Coinbase while Goldman Sachs, JPMorgan, Wells Fargo\nWFC\nhave been named on a list of FTX creditors after the exchange's shock collapse.\nFidelity, one of the worlds biggest financial institutions, has attracted criticism from regulators and lawmakers for its 401k plan that allows bitcoin allocations.\n\"Legislation should not greenlight mainstream institutions, like pension funds, to dive headlong into cryptocurrency markets,\" White House advisors Brian Deese, director of the National Economic Council, Arati Prabhakar, director of the White House office of science and technology policy, Cecilia Rouse, chair of the Council of Economic Advisors, and national security advisor Jake Sullivan wrote.\nCongress should consider expanding the powers of regulators, including the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC), bolster transparency and disclosure requirements for crypto companies, increase funding for law enforcement and pass so-called stablecoin legislation, they advised, following on from president Joe Biden's crypto executive order in March last year and the White House's \"comprehensive\" framework for crypto development in September.\nThe bitcoin price has seen wild swings over the last few years, rocketing a break-neck speed before\n... [+]\ncrashing back, with other major coins ethereum, BNB, XRP, solana, cardano, dogecoin, and polygon seeing similar volatility.\nForbes Digital Assets\nThe statement has been broadly welcomed by the crypto industry that's still reeling from the collapse of FTX and its fallout.\n\"This is the first media statement from the White House on the subject since the events in late 2022,\" Sheila Warren, the chief executive of lobby group Crypto Council for Innovation, said in an emailed statement.\n\"Its anchored in the public policy goals we would expect from the executive branch following such events: holding bad actors accountable, protecting investors, and ensuring financial stability. It also acknowledges that human behavior leading to recent failures is not new or unique to crypto.\"\nHowever, Warren cautioned against heavy-handed or rushed legislation.\n\"Its important to have careful, evidence-based conversations and get legislation right. We support the administrations call to Congress to establish appropriate guardrails and transparency for those participating in the digital assets space,\" she said.\nHowever, Binance chief executive Changpeng \"CZ\" Zhao has warned via Twitter last year's $2 trillion bitcoin and crypto price collapse will put off \"traditional financial players' [adoption] of [bitcoin, crypto and blockchain] technology,\" and \"will likely cause them to be further behind on the adoption curve, which may have existential implications for them.\"\nFollow me on",
      "snippet": "ethereum, BNB, XRP, solana, cardano, dogecoin and <b>polygon</b> price boom. Getty Images \"In the past year, traditional financial institutions limited ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-29T13:15:20",
      "provider": {
        "name": "forbes",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://imageio.forbes.com/specials-images/imageserve/63d64c12dc3425eddf5c8568/0x0.jpg?format=jpg&width=1200",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "forbes",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.forbes.com/sites/billybambrough/2023/01/29/grave-mistake-joe-biden-reveals-game-changing-crypto-roadmap-after-2-trillion-bitcoin-ethereum-bnb-xrp-cardano-dogecoin-polygon-and-solana-price-crash/"
      }
    },
    {
      "id": "4958265686747078540",
      "title": "Polygon (MATIC) Ancient Whale Drops His Holdings, Here's Why",
      "url": "https://u.today/polygon-matic-ancient-whale-drops-his-holdings-heres-why",
      "description": "MATIC facing some selling pressure from early whales as it reaches top of trading range",
      "body": "stock.adobe.com\nDisclaimer: The opinion expressed here is not investment advice  it is provided for informational purposes only. It does not necessarily reflect the opinion of U.Today. Every investment and all trading involves risk, so you should always perform your own research prior to making decisions. We do not recommend investing money you cannot afford to lose.\nGoogle News\nAn early MATIC whale makes an unexpected move by selling millions worth of tokens amid the massive rise of the asset on the market. In exchange for Polygon's token, the whale grabs some DAI. The first MATIC transaction on the whale's wallet occurred when the token was trading at $0.02.\nAson-chain data shared by Lookonchain suggests, the early holder sold 4.5 million tokens in exchange for 5.2 million DAI at the average price of $1.14. Considering the fact that the addresses received part of those funds at the average price of $0.02, the profit made reached triple digits.\nA $MATIC early holder sold 4,553,023 $MATIC for 5,200,081 $DAI at an average price of $1.14 today.\nThe $MATIC holder received 4M $MATIC from #Binance when the price is $0.02.\nJanuary 28, 2023\nThe most likely reason behind such an unexpected move is the price performance of the MATIC token, which has been rallying on the market in the past few days. Polygon's token has gained more than 52% to its value since reaching the local bottom on Jan. 1.\nIn the new year, the token has been showing way more solid performance compared to the end of 2022. Even besides the market-wide rally, MATIC began its movement upwardearlier than mastodons like Bitcoin or Ethereum.\nAds\nAds\nPrior to the massive recovery of the market, Polygon was actively working on the fundamental growth of the network by funding various blockchain-related events, attracting more developers to the ecosystem and developing it based on their long-term vision.\nFrom a price perspective, MATIC has been showing way more solid performance than some alternatives. The token has been moving in a rangebound since July, and the most recent price move put it at the top of the range, which could have been the reasoning behind the whale's decision to sell his holdings.",
      "snippet": "Ads Ads Prior to the massive recovery of the market, <b>Polygon</b> was actively working on the fundamental growth of the network by funding various ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-29T10:32:00",
      "provider": {
        "name": "u",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://u.today/sites/default/files/styles/twitter/public/2023-01/30368.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "u",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://u.today/polygon-matic-ancient-whale-drops-his-holdings-heres-why"
      }
    },
    {
      "id": "224898299069500716",
      "title": "Polygon (MATIC) Reaches 1-Day Volume of $627.12 Million",
      "url": "https://theenterpriseleader.com/2023/01/28/polygon-matic-reaches-1-day-volume-of-627-12-million.html",
      "description": "Read Polygon (MATIC) Reaches 1-Day Volume of $627.12 Million at Enterprise Leader",
      "body": "Polygons\nlaunch date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. The official message board for Polygon is blog.polygon.technology. The official website for Polygon is polygon.technology. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nPolygon Coin Trading\nIt is usually not presently possible to buy alternative cryptocurrencies such as Polygon directly using U.S. dollars. Investors seeking to acquire Polygon should first buy Ethereum or Bitcoin using an exchange that deals in U.S. dollars such as Gemini, Coinbase or GDAX. Investors can then use their newly-acquired Ethereum or Bitcoin to buy Polygon using one of the aforementioned exchanges.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> (MATIC) Reaches 1-Day Volume of $627.12 Million at Enterprise Leader. <b><b>Polygon</b>s</b> launch date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T22:18:41",
      "provider": {
        "name": "theenterpriseleader",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theenterpriseleader",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://theenterpriseleader.com/2023/01/28/polygon-matic-reaches-1-day-volume-of-627-12-million.html"
      }
    },
    {
      "id": "1593844958950371070",
      "title": "Forspokens story and dialogue have no chill",
      "url": "https://www.polygon.com/23573344/forspoken-jrpg-writing-frey-cringe-dialogue",
      "description": "Some fans have accused Forspoken of being cringey, but it doesnt go far enough, and could lean into the whimsy of JRPGs more.",
      "body": "Flipboard\nEmail\nFrom Freys very first steps in the medieval fantasy land of Athia, Forspokens influences emerge in full force.\nShe runs and ducks under broken walls in an abandoned castle with a giant dragon in pursuit. She gets an annoyingly chatty companion named Cuff, who is literally a talking gold bracelet. Then, after narrowly avoiding danger, we get a dramatic birds-eye view of the landscape, dominated by a massive stone landmark arching up into the sky.\nThe game seems to scream: This is a JRPG! This is an isekai! There might be some glorious anime bullshit in here! Even smaller details, like the stone landmark, reminded me of Xenoblade Chronicles Gaur Plain. However, despite its initial promise, much of Freys time in Athia unfolds without much whimsy or the requisite amount of levity. Luminous Productions and Square Enixs new game strikes a distinctively serious tone that makes it difficult to persevere throughout the long journey.\nImage: Luminous Productions/Square Enix\nLuminous Productions imbues Athia with a sort of pervasive sadness. This mainly stems from the bubonic plague vibe it has going. There isnt actually a plague, but there are dark and stormy clouds that envelop entire towns and kill all the living things within. Forspoken also relies on a photorealistic graphics style that, despite some of the vibrant magic in the combat, isnt all that colorful  even its flowers look a little sad and colorless.\nThen we layer on Freys story, which is also very sad! Shes an orphan abandoned by her parents at birth. She lives in poverty in New York City, and the day she finally saved enough money to move and make a better life, her home gets burned down by a gang. She finds new confidence in Athia, but still lives a solitary life. In her journey, she isnt joined by any band of companions, who fill the cutscenes with romantic monologues about the power of friendship.\nShe is an outsider to the world of Athia and (without spoiling anything) gets burned when she does open her heart up a bit.\nFreys magical parkour abilities allow her to bound across the world untethered. Yet, outside of its mechanics, Forspoken lacks the moments of levity that allow players to endure the long, sad, and sometimes difficult journeys of so many other serious games. There are no silly Cactuars popping up to make you laugh; no overly cocky friends standing by your side; no moments of whimsy that allow you to take a break and recover from it all. Perhaps the closest you get is a cute little side quest where you feed sheep, but even then, that ends up being slightly tedious because you dont actually get to see Frey feed the sheep since text on a black screen just says you fed them.\nImage: Luminous Productions/Square Enix via Polygon\nTheres a reason comic relief is so common in blockbuster movies and video games  it gives the audience a breather before the next exciting, yet stressful set piece. Forspoken is so decidedly serious in its overarching narrative that it becomes too much weight for the dialogue to bear  thus, the cringe emerges. The bad jokes and stiff self-narration are fixtures of several popular AAA games, but in Forspoken when they miss, they seem to fall even harder, because its not a world where silly things happen or people speak in strange, unbelievable ways. The self-referential dialogue feels less like comic relief, and more like self-deprecation.\nI personally think that Frey deserves to have fun. She clearly enjoys herself at points. The first time she uses her magical parkour abilities she says, Okay, this is awesome! I am catching some serious air! Her life and story dont need to be completely goofy, but all the sad medieval stuff could use some pushback. And it doesnt get any. For me, its exhausting enough to push me away.\nLoading comments...",
      "snippet": "Image: Luminous Productions/Square Enix via <b>Polygon</b> Theres a reason comic relief is so common in blockbuster movies and video games it gives the ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T18:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/59vohQmAvaFWmZ2MKGCY8y6Maro=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24388459/ss_81859572363b131dd490ff8a6fda03ffcde9a994.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23573344/forspoken-jrpg-writing-frey-cringe-dialogue"
      }
    },
    {
      "id": "4278487308376203626",
      "title": "Critical Role cast had to rewrite history with Legend of Vox Machina",
      "url": "https://www.polygon.com/23574551/the-legend-of-vox-machina-cast-changes-critical-role",
      "description": "Matt Mercer, Ashley Johnson, Marisha Ray, and Sam Riegal talk about the differences between Critical Role and The Legend of Vox Machina.",
      "body": "Email\nImage: Prime Video\nSince the web series kicked off in 2012, actual-play phenomena Critical Role has expanded the world of Exandria, with each subsequent campaign taking place later on in the worlds history. But with Prime Videos animated fantasy series, The Legend of Vox Machina, the voice actors return to where it all started, with their first group of misfit mercenaries from the very first campaign. This time, however, they had a chance to rewrite history and make some tweaks to the way it unfolded the first time around.\n[Wed] been playing as a group for two and a half years before we decided to take it to the stream, says Marisha Ray, voice of half-elf druid Keyleth. So there were a lot of character building and backstory moments that the audience never saw. So through flashbacks, and just really great cold opens, were able to see kind of a peek behind that curtain.\n[Ed. note: This post contains spoilers for the first three episodes of The Legend of Vox Machina season 2]\nThe scenes that I love are the moments that I didnt get to be there in the actual campaign, adds Ashley Johnson, who voices compassionate gnomish cleric Pike Trickfoot.\nImage: Prime Video\nDue to real-life scheduling conflicts, Johnson was absent for some pivotal moments. Thanks to the animated series, the actors were able to rewrite history a bit and bring Pike into the fold for those scenes. This seasons third episode, for instance, The Sunken Tomb follows the plot points of one of the web series episodes that Johnson couldnt attend; now when a trap triggers in the eerie underwater temple and kills half-elf ranger Vexahlia (Laura Bailey), Pike rushes to her side to try and revive her  a moment notably absent from the original run.\nThe animated series not only gives the actors a chance to dive into more of their characters backstories and explore dynamics that werent present at the table, but it also takes the show outside the storytellers POV, allowing viewers to see the villains conniving and plotting their own schemes. Dungeon Master Matt Mercer was particularly excited to see that aspect of the show come to life, since, as Dungeon Master, he played all the dragons of the Chroma Conclave. In the show, though, while he does reprise the role of ancient dragon Umbrasyl, the other dragons are voiced by Cree Summers, Lance Reddick, and Liam OBrien (who is also the player and voice behind half-elf rogue Vaxildan). Now we get to see the dragons behind-the-scenes machinations, which make the epic battles all the more exciting. Thats not the only tweak that comes with showdowns.\nWe get to make some elements of combat that sometimes the dice dont get to make as cool at the table be that much more cinematic and dynamic and exciting for this series, says Mercer.\nImage: Prime Video\nWhen it comes to the actual web series, the cast now plays a new set of characters dealing with a new set of threats (though their OGs do make the occasional cameo appearance). Still, there is a special place in their hearts for the characters who started it all, even if recording in a booth with a script is different from improvising at the table.\nIts like going home on vacation to visit your family, explains Mercer. Theres this facet of these characters that we love so much and lived with for many years, many years ago. And now we get to kind of slip back into those old comfortable outfits. We get to re-embrace where it all started for a lot of these friendships that have now become inseparable bonds and breathe new life to them, and pay homage and accurately represent what happened in a lot of ways and then surprise, even ourselves and others and hopefully the audience. This is kind of taking what was old and making it new again.\nWhile the first-ever session for Vox Machina was recorded in person, much of the recording for season one had to be done remotely due to the pandemic. When possible, the cast recorded in pairs or trios, able to feed off each others energy and try to replicate the experience of being at the table and making it all up the first time around. Going forward, recording together looks like its going to be more of a regular thing, but the actors say there will always be something really special about that first ever everyone-together recording session.\nIt was a very pinch ourselves type of a moment, says Sam Riegal, the voice of rakish gnome bard Scanlan. We were all together in a booth recording a show that we created and helped write and get to do the voices for and get to help produce. And we were being voice directed by Mary McGlynn, one of our oldest friends. It was a real Is this real? type of a moment, that first time in the booth. But every time we get together to perform, whether its at the table, or behind some microphones, or on a convention stage, its great. Its great to hang out with these guys. Even after being around them for years and years, we still manage to make each other laugh. Its a rare friendship that we have. And I hope we get to keep doing it forever.\nNew episodes of",
      "snippet": "Matt Mercer, Ashley Johnson, Marisha Ray, and Sam Riegal talk about the differences between Critical Role and The Legend of Vox Machina.\nEmail Image: Prime Video Since the web series kicked off in 2012, actual-play phenomena Critical Role has expanded the world of Exandria, with each subsequent campaign taking place later on in the worlds history.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T16:32:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/MTFdqpL5khFyb1GU6WHivzZoC_U=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390424/VXMA_S2_FG_205_00073906_Still096_3000__1_.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574551/the-legend-of-vox-machina-cast-changes-critical-role"
      }
    },
    {
      "id": "7761588773771887632",
      "title": "Dead Spaces remake improves its main cast but not the Ishimuras crew",
      "url": "https://www.polygon.com/23573120/dead-space-remake-isaac-clarke-voice-ishimura-writing",
      "description": "The Dead Space remake improves on the writing of protagonist Isaac Clarke, Kendra Daniels, and Zach Hammond, but the USG Ishimuras victims get little fleshing out.",
      "body": "Dead Space\nis a terrifying game about venturing through an abandoned industrial space ship, all to the tune of suffocating isolation. Isaac Clarke isnt entirely alone, however  his ship, the USG Kellion, arrived with a small crew of support staff. The Dead Space remake characterizes Isaac and his allies much more deeply than the original did  but the same cant be said for the other poor souls on the USG Ishimura.\nThe two most prominent characters accompanying Isaac are Zach Hammond and Kendra Daniels, a security officer and a computer specialist. Isaac is separated from his team almost immediately, and forced to communicate with them through space Skype calls.\nIn the original game, Daniels and Hammond are at each others throats before the Kellion even arrives at its destination. Daniels comes off as aggressive, questioning Hammonds every decision, without any context or clues as to why. Its an awkward set up, especially because Isaac is a silent protagonist, and unable to interject. From the players perspective, its like watching mom and dad fight.\nImage: Motive Studios/Electronic Arts\nThe remake addresses this discomfort in two elegant ways. First, Isaac is now a voiced protagonist, and he regularly chips in on the teams plans. Hes cool, confident, and competent, like the trained engineer hes supposed to be. He saves his teammates lives early on with a clever suggestion, and he can tell what the next quest objective is by glancing at some schematics or a damage report. Instead of following orders from the other two, he feels like a crucial part of the team.\nSecondly, Hammond and Daniels also feel like a rare safe reprieve from the horror. Isaac finds only a few scant souls left alive on the Ishimura, and most of them exist only to die and ramp up the tension. I grew to appreciate my calls with my Kellion shipmates. And when the plot escalates and everyones at each others throats, its all the more delicious after the friendly beginnings and slow burn to hostility.\nIts a shame that everyone else on the USG Ishimura is a cardboard cutout, existing only to go mad and/or die. The notes and audio logs that Isaac finds around the ship may mention things like a regular poker night or uncomfortable relations with a coworker, but its all just window dressing, a stark contrast from the warm fuzzies I get from a compliment from Hammond.\nA guy might write a diary about the ships weekly poker game: Went to poker night. Played bad because of all the ominous visions Ive been having! Meanwhile, Im over here feeling like a sucker because I was hoping for a detailed account of pre-outbreak poker.\nOne bit of graffiti was so absurd it made me laugh (seemingly unintentionally). Someone had scrawled on a bathroom wall: I cant die here. Not here. Not like this. It seems a second writer replied with: EAT ME to which the original author wrote: They ate my boy. The absurdity temporarily broke my immersion. Its like the Left 4 Dead graffiti argument, but much smaller and sillier.\nImage: Motive Studios / Electronic Arts via Polygon\nThere are very few hints as to who the people on the Ishimura actually were, you know, as people before the crisis, and the clues that do exist are a little ham-handed. One worker scrawled Fuck this ship, its a shitty capitalist organization, near a cheerful poster, which is a little on the nose. Its a missed opportunity, especially when compared to a game like Prey (2017), where the player can find little glue snowmen and corporate whiteboards abandoned mid-meeting.\nWhile the Ishimura is still a terrifying, rusted labyrinth to navigate, it does feel a little like everyone aboard was born to sign up for this gig and subsequently die. Its not so much a failure as a missed opportunity. The game is, however, much improved when it comes to the interactions between its main cast. A few pieces of graffiti are goofy, and Id love to learn more about the Ishimuras days before everything went to shit  but none of this is enough to spoil Isaacs terrifying journey through a very scary ship.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Image: Motive Studios / Electronic Arts via <b>Polygon</b> There are very few hints as to who the people on the Ishimura actually were, you know, as people ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-28T15:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/8o7p_LHva4rxLq3u2E9FcNNOhZw=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390008/ds_launch_hammond.jpg.adapt.1920w.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23573120/dead-space-remake-isaac-clarke-voice-ishimura-writing"
      }
    },
    {
      "id": "7645023360869291044",
      "title": "The best movies leaving Netflix Hulu and more in January to watch now",
      "url": "https://www.polygon.com/what-to-watch/2023/1/28/23567677/best-movies-netflix-amazon-hulu-hbo-leaving-january-2023",
      "description": "The best movies leaving streaming in January 2023, with great movies to watch on Netflix, HBO Max, Hulu, and Amazon Prime Video, like The Addams Family, Mamma Mia!, and In the Heat of the Night.",
      "body": "Email\nThis story is part of a group of stories called\nYour time is precious, and your options are endless. The good news: We watch it all so you dont have to. Polygons What to Watch highlights the best, the funniest, the scariest, and the most exciting in movies, TV, and everything in between. Stop scrolling, start watching!\nIts the end of the month, so you know what that means, Polygon readers: A new group of movies leaving their respective streaming services.\nAfter the flurry of typical arrivals and departures when the calendar turned to 2023, there is once again plenty of good movies leaving streaming services at the end of January. The entertainment team at Polygon has highlighted the best of the best on each streaming service, and will do so again next week to tell you the best of whats new in February.\nWithout further ado, heres the list. Weve got comedies on Netflix, dramas on Hulu, sci-fi actioners on HBO Max, and much more to fill your hearts delight and your weekend plans.\nLeaving Netflix\nDirector: Barry Sonnenfeld\nCast: Anjelica Huston, Raul Julia, Christopher Lloyd\nIf watching Wednesday sparked your interest, but you wanted some more family out of the spooky, kooky Addams family, why not visit one of the older incarnations? The 1990s movies have an electric cast, with Raul Julia and Anjelica Huston leading the family as Gomez and Morticia. Christina Riccis Wednesday is still perhaps the most iconic. (Sorry, Jenna Ortega!! Theres a reason she was also in the Netflix show!) Its funny and delights in the macabre without ever being too scary for young viewers. The movie follows the family reconnecting with long-lost Uncle Fester (played here by Christopher Lloyd)  but is it really Fester, or the adopted son of a con artist looking to scam the Addams family out of their fortune? The intrigue! Petrana Radulovic\nThe Addams Family leaves Netflix on Feb. 1.\nThe Paper Tigers\nImage: Well Go USA Entertainment\nGenre: Action/comedy\nDirector: Tran Quoc Bao\nCast: Alain Uy, Ron Yuan, Mykel Shannon Jenkins\nA heartfelt comedy about former martial arts prodigies who have grown into listless middle-aged men but are now thrown back together after the death of their former master, The Paper Tigers hits all the notes you want. Its funny, its sweet, the action scenes kick ass (choreographed by the YouTube sensations The Martial Club, who also appear in the movie and choreographed the fights in Everything Everywhere All at Once)  its the charming kind of low-budget action comedy we get far too few of these days. Make sure you check it out when you have the chance. Pete Volk\nThe Paper Tigers leaves Netflix on Feb. 1.\nLeaving Hulu\nDirectors: Stphane Aubier, Vincent Patar, Benjamin Renner\nCast: Lambert Wilson, Pauline Brunner (original); Forest Whitaker, Mackenzie Foy (dub)\nA cozy little hidden gem of a movie, Ernest & Celestine came out in the U.S. the same year as Frozen and thus was doomed to be lost in the Let It Go fanfare. Animated just like a storybook, Ernest & Celestine tells the story of a precocious orphan mouse who befriends a reluctant bear named Ernest. At first it seems like a simple tale of gruff man becomes a dad figure to a small child, but the movie dives into the interspecies conflicts with more nuance than Zootopia would a few years later. Ernest and Celestine both stand by one another when they are put on trial by their respective governments for potentially betraying their species (like I said  it gets deep!). The story is thought-provoking and the animation feels like a warm cup of tea. PR\nErnest & Celestine leaves Hulu on Jan. 28.\nMamma Mia!\nDirector: Phyllida Lloyd\nCast: Meryl Streep, Pierce Brosnan, Colin Firth, Amanda Seyfried\nMamma Mia! is the perfect antidote to dreary winter days  look at those warm, sunny beaches, the aquamarine ocean waters, the ABBA! Most of the cast was drunk on ouzo (a strong Greek liquor) during filming, and you can absolutely tell that theyre just having the time of their lives. Can Pierce Brosnan sing? Not really! But he and Meryl Streep are just so damn charming together that well forgive it. Everyone loves the dads, but Mamma Mia! at its core is a celebration of womanhood  with Sophie, Donna, Tanya, and Rosie leading the charge, and the three dads (and Sky) just sitting around and looking pretty. Sit back, relax, and let the isle of Kalokairi sweep you away to the sweet serenade of Dancing Queen. PR\nMamma Mia! leaves Hulu on Jan. 31.\nThe Age of Innocence\nDirector: Martin Scorsese\nCast: Daniel Day-Lewis, Michelle Pfeiffer, Winona Ryder\nGenteel, 19th-century drawing-room drama might not seem like Martin Scorseses usual bag, although what he finds in this adaptation of the Edith Wharton novel about a tortuous love triangle in New York high society  betrayal, repression and emotional violence as individuals strain to find their place in a tightly codified, strictly hierarchical social world  maybe isnt that different from Goodfellas after all. Its just that its all about frocks, swooning, and party invitations. Where it does differ from most of his filmography is in its interest in the relationship between men and women, rather than men and other men. The costumes, cinematography, and sets create a fantastically detailed, claustrophobically ornate stage for the films intense romantic drama, and even the great Daniel Day-Lewis is all but blown off the screen by a brilliant Michelle Pfeiffer in perhaps her greatest role. Oli Welsh\nAge of Innocence leaves Hulu on Jan. 31.\nGodzilla, Mothra and King Ghidorah: Giant Monsters All-Out Attack\nImage: Sony Pictures Home Entertainment\nGenre: Kaiju/horror\nDirector: Shusuke Kaneko\nCast: Chiharu Niiyama, Ryudo Uzaki, Masahiro Kobayashi\nFew movie franchises have a consistent level of quality like the Godzilla movies (most American entries excluded). The original 1954 Godzilla is a stone-cold masterpiece, and nearly all of the movies that followed in the early era strike a perfect balance of popcorn entertainment and trenchant social commentary.\n2001s Godzilla, Mothra and King Ghidorah: Giant Monsters All-Out Attack is a throwback to that early era of Godzilla movies, in tone and style. GMK uses miniatures to brilliant effect just like in the original movies, and eschews a CG Godzilla for the classic man in a suit approach. Theres one breathtaking moment where the camera zooms out from a man in a bathroom to Godzilla crushing the house hes in with his foot, moving from a full-size set to miniatures without breaking the shot. The movie does this multiple times, transitioning to miniatures with clever masking techniques for maximum impact and jaw-dropping scale, and the joy in the movies formal approach energizes it.\nLike many of the best Godzilla movies, it balances tones very well. Its able to be funny  in the first 90 seconds, it references both the original movie and Roland Emmerichs 1998 entry (humorously dismissing the latters potential status as canonical)  and very tense in the destruction ",
      "snippet": "... watching! Its the end of the month, so you know what that means, <b>Polygon</b> readers: A new group of movies leaving their respective streaming services.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-28T13:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/aIPtd0vU4tcgnrb2UFv2GP8ul2g=/0x3:1920x1008/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22344945/MV5BNWFiMzkwMzQtYjBhZi00NDNlLWFlODMtMjA1MzAzNzA1ZGI3XkEyXkFqcGdeQXVyMTE0NTczNDAz._V1_.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/what-to-watch/2023/1/28/23567677/best-movies-netflix-amazon-hulu-hbo-leaving-january-2023"
      }
    },
    {
      "id": "781959079221766967",
      "title": "Can Big Eyes Coin sustain amidst Crypto giants Polygon and Solana?",
      "url": "https://euroweeklynews.com/2023/01/28/can-big-eyes-coin-sustain-amidst-crypto-giants-polygon-and-solana/",
      "description": "With the new year came the positive news for all crypto fanatics as rays of hope shone over the lands of crypto once again. Bitcoin regained some of its",
      "body": ">>BUY BIG EYES COIN NOW!<<\nSolana ascends despite 2022 blows\nEstablished as a rival to Ethereum, the Solana blockchain is lightning fast and incomparable to any of its competitors, with transaction speeds of over 60,000 per second and gas fees as little as $0.00025. In comparison, Solana is 3,000 times better than Ethereum, and 1,000 times better than Bitcoin in terms of transaction speeds.\nSolana started off 2023 with single figures after receiving tremendous blows from the bear market as well as the FTX liquidity crisis in November 2022. However, with just one month into 2023, Solana has exhibited its bullish potential by increasing its value by more than a double from December 2023, up by nearly 160%. Remarkable, isnt it? Moreover, Solanas loyal community and an impressive ecosystem further paves its ascent.\nPolygon  Poly-Gone or Poly-Strong?\nPreviously known as Matic Network in 2017, Polygon is the Internet of Blockchains and a layer-2 scaling solution for the Ethereum blockchain network. It is a cryptocurrency (MATIC) that connects Ethereum-compatible and several other blockchain networks, all whilst incorporating the blockchain, Ethereum. Polygon provides faster transaction speeds and cheap gas costs, which benefit the Ethereum blockchain, alongside giving full security and constructive dynamics.\nIn 2022, Polygon hit its lowest at around $0.758 due to the volatile crypto market. Nevertheless, in the start of 2023, it has managed to bounce back stronger than ever, gaining by over 35%. Moreover, unlike Solana, the community of Polygon has held strong, as users in De-Fi mostly prefer Ethereum because of its popularity and high liquidity, aka Polygon.\nOutstanding Presale Launch of Big Eyes Coin\nHitting the presale milestone of $18 million just recently, Big Eyes Coin is a meme coin on the Ethereum network that incorporates the functions of De-Fi, offered by Ethereum itself, into its ecosystem. This cat-themed project is nearing its launch date and will be available for the public very soon.\nBig Eyes Coin was created with the aim of providing the community with useful resources and services, resulting in value and success for the users. Thanks to their NFTs  Sushi Crew  alongside well-conducted social-media strategies, this project tends to attract users and investors looking for success or growth amidst the volatile crypto space.\nNot only does Big Eyes Coin focus on helping its community, they focus toward saving the environment as well. From the total supply of Big Eyes Coin, 5% will be donated to charities all over the world to aid in the protection of the worlds sea bodies. Some of these charities are Seashepherd, Orca Network, and Fundlife International.\nThe presale of Big Eyes Coin, the cat-themed meme coin, is still on, and they are currently offering additional 200% on all purchases. Use LAUNCHBIGEYES200 as the promo code to avail this soon-ending offer.",
      "snippet": "<b>Polygon</b> provides faster transaction speeds and cheap gas costs, which benefit the Ethereum blockchain, alongside giving full security and ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T10:15:33",
      "provider": {
        "name": "euroweeklynews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.euroweeklynews.com/wp-content/uploads/2023/01/Can-Big-Eyes-Coin-Pic-1.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "euroweeklynews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://euroweeklynews.com/2023/01/28/can-big-eyes-coin-sustain-amidst-crypto-giants-polygon-and-solana/"
      }
    },
    {
      "id": "5118153407439956538",
      "title": "Today's cryptocurrency prices: Check Bitcoin, Ethereum, Dogecoin, Tether rates",
      "url": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-28-01-2023-rates-of-bitcoin-solana-bnb/story",
      "description": "Bitcoin has shed 0.1% over the last 24 hours and is now trading at $22,988.84",
      "body": "Bitcoin has shed 0.1% over the last 24 hours and is now trading at $22,988.84. It is 1.2% higher than the previous week.   Ethereum, the second most popular token, is up 0.5% from yesterday and now trades at $1,592.03. It is down 4.2% from last week.   Bitcoin and Ethereum have market capitalizations of $443.23 billion and $192.09 billion, respectively.  BNB is trading at $308.22, which is 0.8% up from yesterday and a 1.1% rise from last week.   XRP is currently trading at $0.44 after moving up 1.0% in the last 24 hours. It is 0.4% down from last week.   Cardano and Dogecoin are trading at $0.33 (up 2.1%) and $0.099 (up 4.9%), respectively.  Solana, Polka Dot, Shiba Inu, and Polygon are currently trading at $24.30 (up 1.5%), $6.51 (up 0.8%), $0.000011 (up 3.2%), and $1.13 (up 3.5%), respectively.   Based on the weekly chart, Solana has declined by 5.0% while Polka Dot has gained 4.0%.   Shiba Inu has lost 2.8% of its value in the last seven days whereas Polygon has gained 10.4%.  The top five gainers on the basis of the 24-hour movement are Gala, Trust Wallet Token, Avalanche, Frax Share, and Enjin Coin. They are trading at $0.055 (up 21.35%), $1.73 (up 13.35%), $20.46 (up 12.79%), $11.09 (up 9.89%), and $0.44 (up 9.66%), respectively. A stablecoin is an extremely low volatile cryptocurrency. Its value is tied to a physical asset like fiat currency or gold.   Talking about some of the popular tokens, Tether, USD Coin, and Binance USD are trading at $1 (flat), $1 (down 0.1%), and $1 (up 0.1%), respectively. Terra Classic is listed at $0.00011 (up 1.74%).  The biggest losers of the day are Threshold, Theta Network, eCash, UNUS SED LEO, and ApeCoin. They are trading at $0.044 (down 13.27%), $1.10 (down 6.48%), $0.000033 (down 5.05%), $3.59 (down 3.01%), and $6.19 (down 1.99%), respectively. Looking at the traffic, liquidity, trading volumes, and confidence in the legitimacy of trading volumes, the top three cryptocurrency spot exchanges are Binance, Coinbase Exchange, and Kraken.   In the last 24 hours, Binance and Coinbase Exchange recorded a volume of $17.16 billion (down 13.05%) and $1.63 billion (down 15.81%), respectively.   Meanwhile, Kraken saw a volume of $0.54 billion which is down 14.67% from yesterday.  DeFi, which is short for decentralized finance, is related to global, peer-to-peer financial services on public blockchains.   Some of the prominent DeFi tokens are Avalanche, Dai, Uniswap, Wrapped Bitcoin, and Chainlink.   They are trading at $20.46 (up 12.94%), $0.99 (down 0.05%), $6.79 (up 0.54%), $22,955.94 (up 0.03%), and $7.32 (up 1.05%), respectively.  Non-fungible tokens (NFTs) are cryptocurrencies that do not possess the property of fungibility, meaning they cannot be exchanged for one another like other tokens.   ApeCoin, Decentraland, Axie Infinity, Flow, and The Sandbox are some of the prominent NFT tokens.   They are currently trading at $6.18 (down 2.30%), $0.77 (up 5.60%), $11.85 (up 2.73%), $1.09 (down 0.65%), and $0.77 (up 3.28%), respectively.  The current global crypto market cap is $1.05 trillion and the total crypto market volume over the last 24 hours is $54.43 billion. Both have remained flat over the last day.   The global crypto market cap was $807.37 billion last month, while three months ago, the total capitalization stood at $983.56 billion.",
      "snippet": "Solana, Polka Dot, Shiba Inu, and <b>Polygon</b> are currently trading at $24.30 (up 1.5%), $6.51 (up 0.8%), $0.000011 (up 3.2%), and $1.13 (up 3.5%), ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-28T08:32:12",
      "provider": {
        "name": "newsbytesapp",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://i.cdn.newsbytesapp.com/images/l77420230128135925.jpeg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "newsbytesapp",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.newsbytesapp.com/news/business/cryptocurrency-prices-28-01-2023-rates-of-bitcoin-solana-bnb/story"
      }
    },
    {
      "id": "4270862114155115611",
      "title": "M3GAN Netflixs You People and every new movie you can watch at home",
      "url": "https://www.polygon.com/entertainment/2023/1/27/23567450/new-movies-watch-m3gan-netflix-you-people",
      "description": "The best new movies to watch at home this weekend, including the VOD debut of M3GAN, Netflixs new comedy You People, the Oscar-nominated psychological drama Tr on Peacock, and more.",
      "body": "Email\nImage: Universal Pictures\nM3GAN fans (M3FANs), rejoice: The supreme queen bee of sentient doll-based brutality finally arrives on VOD this weekend. If watching a creepy plasticine child perform infectious dance moves before proceeding to butcher a man with a makeshift machete doesnt quite sound like your kind of vibe, not to worry; theres a ton of new releases available to choose from on streaming and VOD.\nYou People  no no, not you people  the latest comedy-drama from Black-ish creator Kenya Barris starring Jonah Hill and Eddie Murphy comes to Netflix this week, along with a new documentary on the life and music of singer-songwriter Leonard Cohen. The new action rom-com Shotgun Wedding, starring Jennifer Lopez and Josh Duhamel, premieres on Prime Video; meanwhile, Todd Fields Oscar-nominated psychological drama Tr is finally available to stream on Peacock. Theres plenty more new releases to enjoy on VOD this weekend besides M3GAN, including a new dark comedy-drama starring Julianne Moore and Stranger Things Finn Wolfhard.\nHere are the new movies available for you to watch at home this weekend.\nNetflix\nDirector: Kenya Barris\nCast: Jonah Hill, Lauren London, Eddie Murphy\nJonah Hill and Eddie Murphy star in this new buddy comedy from Black-ish creator Kenya Barris that could best be described as a Meet the Fockers-type scenario crossed with a race-swapped version of Guess Whos Coming to Dinner. Look, theres a tone-deaf comment about police brutality! Oh, and theres an uncomfortable offhand joke about Louis Farrakhans incendiary remarks about Jewish people! One thing is certain: You People is edgy; it is saying things; and boy howdy, it is going there! Jurys out on whether thatll make for a funny comedy.\nFrom\nour review\n:\nTheres this weird notion that good comedy is offensive, when in fact its empathetic. In order to make someone laugh and do it consistently, its necessary to understand something about them first. This is why the impulse behind a film like You People can be a good one, as comedy can make a lot of hay out of the misunderstandings people have about one another as they bumble toward understanding. You People, however, is mostly interested in ignorance, and as such it gets old fast. Because the most offensive comedy isnt ignorant or bigoted, its simply boring.\nHallelujah: Leonard Cohen, A Journey, A Song\nWhere to watch: Available to stream on\nDirectors: Dan Geller, Dayna Goldfine\nCast: Leonard Cohen. Nancy Bacal, Steve Berkowitz\nThis documentary digs into the writing and cultural impact of singer-songwriter Leonard Cohens music, particularly his 1984 folk rock song Hallelujah. Directors Dan Geller and Dayna Goldfine combine archival footage of past interviews and performances by Cohen, who passed away in 2016 due to complications stemming from leukemia, and interviews with past collaborators, loved ones, and artists who have covered the song in the past to create a tribute to Cohens life and his art.\nAn Action Hero\nWhere to watch: Available to stream on Netflix\nImage: AA Films\nDirector: Todd Field\nCast: Cate Blanchett, Nomie Merlant, Nina Hoss\nCate Blanchett stars in Todd Fields first feature film since 2006s Little Children as the eponymous Lydia Tr, a famous composer and the first female conductor of the Berlin Philharmonic orchestra. A literal virtuoso, Tr is mere weeks away from realizing what might be her magnum opus. When her reputation and legacy are suddenly jeopardized by a series of scandals, shell have to weather the consequences of her own indiscretions and face a bracing new reality. One of the best movies of 2022, Tr was recently honored with a handful of Oscar nominations, including Best Picture.\nVOD\nDirector: Gerard Johnstone\nCast: Allison Williams, Jenna Davis, Violet McGraw\nThe latest horror film from Housebound director Gerard Johnstone and Malignant screenwriter Akela Cooper follows Gemma (Allison Williams), a roboticist for a Seattle toy company who creates an artificially intelligent doll to look after her orphaned niece, Cady (Violet McGraw). But when the doll, at first unbeknownst to either Gemma or Cady, begins to commit a series of violent murders ostensibly in service of its prime directive, Gemma will have to fight to protect her niece and the world from what she has created.\nFrom our\nreview\n:\nThe graveyard of awful horror comedies is among the saddest and most boring in all of film. Its filled with hundreds of bad-taste parodies, laughless messes, silly garbage, and probably a few unfortunate movies that werent deliberately designed to be laughed at. The worst movies in the subgenre feel like tightrope acts that try too hard to balance what the creators seem to think are two opposite extremes, hoping the audience laughs one moment and screams the next. But following in the footsteps of classics like the original Chucky movie Childs Play, director Gerard Johnstone and the team behind the new horror comedy M3GAN realize that laughing and screaming arent actually that different  and most importantly, that either one can be the key to a great time.\nLife Upside Down\nWhere to watch: Available to rent for $6.99 on Amazon, Apple, and Vudu\nImage: IFC Films\nDirector: Cecilia Miniucchi\nCast: Bob Odenkirk, Radha Mitchell, Danny Huston\nForced to quarantine in the beginning months of the COVID-19 pandemic, three couples look at their lives, friends, partners, and themselves differently as they reassess everything and everyone they once thought was important. I know that sounds dour, but its a comedy I swear! Look, it even has Bob Odenkirk in it! Hes a funny guy when hes not playing a disbarred criminal lawyer working on behalf of a methamphetamine empire, right?\nWhen You Finish Saving the World\nWhere to watch: Available to purchase for $19.99 on Amazon, Apple, and",
      "snippet": "The best new movies to watch at home this weekend, including the VOD debut of M3GAN, Netflixs new comedy You People, the Oscar-nominated psychological drama Tr on Peacock, and more.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T23:15:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/4wMcB0xcARa02NX8c5CuFvvmpp8=/0x0:1200x628/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24339077/Megan_3.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/entertainment/2023/1/27/23567450/new-movies-watch-m3gan-netflix-you-people"
      }
    },
    {
      "id": "1049186426178851689",
      "title": "Starfield release date is still first half of 2023 despite glaring absence at Xbox show",
      "url": "https://www.polygon.com/23571596/starfield-release-date-delayed-xbox-developer-direct",
      "description": "Microsofts Developer Direct livestream on Jan. 25 mentioned a lot of games, except for one big one. Starfield. Is Bethesda Game Studios RPG still on schedule?",
      "body": "Image: Bethesda Game Studios/Bethesda Softworks\nLets just cut to the chase. Is Starfield delayed?\nOfficially, no. And to be fair to Microsoft and Bethesda Game Studios, they already told us we wouldnt be hearing anything out of Todd Howards next epic role-playing game during Wednesdays Developer Direct showcase. Theres going to be a stand-alone showcase for Starfield at some point. Its still one hell of an elephant not in the room, especially if two of the four games shown  Redfall and The Elder Scrolls Onlines Necrom expansion  are big Bethesda projects launching in May and June, respectively. It doesnt seem likely that Bethesda would want to cannibalize interest in those projects (or Starfield) by packing that game into a May or June release window.\nRemember that, during the Xbox and Bethesda Showcase last June, Microsoft more or less wrote an IOU to fans, promising that Starfield would be among a large catalog of highly anticipated games launching in the first half of 2023 (and, as first-party games, available the same day to Xbox Game Pass subscribers).\nThe updates we got Wednesday from Xbox and Bethesda on Wednesday show that the first half of Microsofts 2023 game calendar now looks like this:\nApril 18  Minecraft Legends\nJune 20  The Elder Scrolls Online: Necrom\nTBA 2023  Forza Motorsport\nUnless the Xbox folks have a surprise shadow drop,  la Tango Gameworks Hi-Fi Rush, planned for Starfield  which would seem ill-advised  the sci-fi RPGs release is starting to feel slippery. (As is Forzas; Microsoft and Turn 10 seem unwilling to recommit to a first-half-of-2023 window for their racing game.)\nThe most recent information about Starfields launch came last May, in which Bethesda told fans that it had been pushed to a first-half of 2023 launch window (along with Redfall.) Microsoft, during last years E3-adjacent summer showcase, made a big deal out of telling fans all the things they wanted to play would arrive by the first half of 2023. Starfield was implied to be one of those things.\nIn November, Howard, Bethesda Game Studios creative director, spoke with podcaster Lex Fridman about Starfield and the difficult decision to delay the game the first time, from a November 2022 launch to the somewhat softer, less definite window it now has.\nI wish it was soon, Howard said. We want it out, too. And I wish they didnt take as long as they did. But, they do.\nWeve asked Xbox and Bethesda representatives if Starfield should be considered delayed. Its doubtful theyll want to comment on that, but if they do, well be sure to update it here.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Microsofts Developer Direct livestream on Jan.\n25 mentioned a lot of games, except for one big one.\nIs Bethesda Game Studios RPG still on schedule?.\nImage: Bethesda Game Studios/Bethesda Softworks Lets just cut to the chase.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T21:30:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/Fk7mSW62-zonGoCy8cAqzKnAUsA=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22657905/Starfield_Trailer_Pilot.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23571596/starfield-release-date-delayed-xbox-developer-direct"
      }
    },
    {
      "id": "6122904154429642804",
      "title": "Cowboy Bebops director has some thoughts about Netflixs series",
      "url": "https://www.polygon.com/2023/1/27/23574886/cowboy-bebop-creator-made-it-through-one-scene-of-the-netflix-version",
      "description": "In an interview with Forbes published on Thursday, Cowboy Bebop director Shinichir Watanabe touches on his involvement in the 2021 live-action Netflix series, and how he had to turn the show off during the first episode.",
      "body": "Email\nPhoto: Geoffrey Short/Netflix\nNobody seems to want to talk about Netflixs Cowboy Bebop series since it premiered back in November 2021 and was subsequently canceled the following month  least of all Netflix, by all appearances. The only person who seems to want to forget the series more is none other than the director of the original Cowboy Bebop himself.\nIn an interview published on Forbes on Thursday, Shinichir Watanabe, known for his prolific career as a director on such anime as Cowboy Bebop, Samurai Champloo, Space Dandy, and Carole & Tuesday, spoke at length about the milestones of his career, from his early years working at  Sunrise (now Bandai Namco Filmworks) under his mentor Rysuke Takahashi (Blue Gender) and the origins of Cowboy Bebop, to the lessons he learned from on Flux creator Peter Chung while working on 2003s The Animatrix.\nNaturally, the conversation turned to his thoughts about Netflixs Cowboy Bebop, of which Watanabe is credited as an associate producer and consultant. And boy, he did not mince words. For the new Netflix live-action adaptation, they sent me a video to review and check, Watanabe told Forbes. It started with a scene in a casino, which made it very tough for me to continue. I stopped there and [...] only saw that opening scene.\nWatanabe goes on to elaborate on how he felt the live-action series compared to the original 1998 anime. It was clearly not Cowboy Bebop and I realized at that point that if I wasnt involved, it would not be Cowboy Bebop. I felt that maybe I should have done this. Although the value of the original anime is somehow far higher now.\nOuch! Well, if its any consolation for Watanabe, Cowboy Bebop is far from the first beloved, idiosyncratic animated series to receive a well meaning live-action adaptation that missed the mark. One can only hope that Netflixs upcoming live-action One Piece series can take the lessons learned from the live-action Cowboy Bebop in stride, and deliver a series worthy of Eiichiro Odas",
      "snippet": "In an interview with Forbes published on Thursday, Cowboy Bebop director Shinichir Watanabe touches on his involvement in the 2021 live-action Netflix series, and how he had to turn the show off during the first episode.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T20:50:44",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/wtlqvFdp7IXPQNAk4uNe-eg3mMg=/0x258:3600x2143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23037235/COWBOYBEB_Unit_06047RC3__1_.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/2023/1/27/23574886/cowboy-bebop-creator-made-it-through-one-scene-of-the-netflix-version"
      }
    },
    {
      "id": "5411785717940425349",
      "title": "M&Ms spokescandies change was actually a Super Bowl ad stunt",
      "url": "https://www.polygon.com/23574687/m-and-m-spokescandies-super-bowl-ad",
      "description": "The M&Ms spokescandies will be returning at the Super Bowl after all. Mars Wrigley announced that the mascots would not be permanently replaced with Maya Rudolph.",
      "body": "Email\nPhoto: Joe Raedle/Getty Images\nGood news: The non-sexy green M&M is coming back! On Monday, M&Ms parent company Mars Wrigley announced that it would be pulling its M&Ms spokescandies mascots indefinitely and replacing them with the actor Maya Rudolph. However, the company told the New York Times on Friday that the controversial move was all just a PR stunt, and that the spokescandies will indeed return at the upcoming Super Bowl.\nRest assured, the characters are our official long-term spokescandies, Mars Wrigley said in a statement to the New York Times. The mascots are taking a break for the time being, but the M&Ms Super Bowl ad will resolve the situation and bring back the spokescandies, a representative for the company said.\nThe twisting story started roughly a year ago, when Mars Wrigley rebranded the mascot candies to become more inclusive and reflect more modern sensibilities. For example, the green M&M was changed so she had shorter legs and stopped wearing high heels. The redesign prompted backlash from far-right pundits like Tucker Carlson, who criticized the changes as woke.\nAlthough no recent changes had been announced, Carlson brought up the spokescandies once again in recent weeks. Then on Monday, Mars Wrigley made its announcement about the spokescandies indefinite pause. The puzzling decision referenced the polarizing nature of the green M&Ms shoes, so it appeared to be meant to temper the right-wing backlash. However, the company had also announced just last month that it would have an M&Ms ad campaign tied to the Super Bowl. Now we know that it was all just one giant troll.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The M&Ms spokescandies will be returning at the Super Bowl after all.\nMars Wrigley announced that the mascots would not be permanently replaced with Maya Rudolph.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T20:18:18",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/-RYnTxaApTWmYCAHSLwQ3eqgky8=/0x263:3000x1834/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390592/1459175136.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574687/m-and-m-spokescandies-super-bowl-ad"
      }
    },
    {
      "id": "3978908475631989626",
      "title": "D&D wont change the OGL: Hasbro and Wizards capitulate to angry fans",
      "url": "https://www.polygon.com/23574677/dungeons-dragons-dnd-ogl-canceled-wizards-fans-win",
      "description": "The Dungeons & Dragons Open Gaming License wont be changed. Wizards of the Coast and Hasbro say theyre making D&D more open than ever before.",
      "body": "Email\nImage: Kieran Yanner/Wizards of the Coast\nDungeons & Dragons publisher Wizards of the Coast will abandon attempts to alter the Open Gaming License (OGL). The announcement, made Friday, comes after weeks of virulent anger from fans and third-party publishers caused the story to make international headlines  and on the eve of a high-profile movie starring Chris Pine.\nThe OGL was developed and refined in the lead-up to D&Ds 3rd edition, and a version of it has been in place for more than 20 years. It provides a legal framework by which people have been able to build their own tabletop RPGs alongside the Hasbro-owned brand. It has also buoyed the entire role-playing game industry, giving rise to popular products from Paizo, Kobold Press, and many individual creators. But proposed changes to the OGL, leaked to and first reported on by io9 on Jan. 5, seemed like they would create an adversarial relationship between Wizards and its community. The story has since made headlines around the world  including a nearly 10-minute segment this week on NPRs All Things Considered and lengthy write-ups by organizations such as CNBC.\nRelated\nD&D 5th edition comes to a close in 2023 against a backdrop of fan anger\nOn Jan. 19, D&Ds new executive producer, Kyle Brink, issued a full-throated apology, a sharp contrast to the petulant response published in an unsigned post earlier this month. Brink also released a new, new OGL  dubbed OGL 1.2  and a request for fan feedback. The feedback window was expected to close on Feb. 3, with rounds of revisions to follow. It appears that whatever feedback Wizards received in the last few days  from more than 15,000 fans  was enough to short-circuit that process.\nWhen you give us playtest feedback, we take it seriously, Brink wrote on Friday.\nGoing forward, the OGL 1.0a  the existing OGL that Wizards had sought to revoke  will not be changed. But the publisher is going even further, by making D&D more explicitly open than ever before. The Systems Reference Document  literally a subsection of the published rules and lore of D&D  will be moved to a Creative Commons license.\nCreative Commons is a nonprofit organization that, by its own description, helps overcome legal obstacles to the sharing of knowledge and creativity to address the worlds most pressing challenges.\nThis Creative Commons license makes the content freely available for any use, Brinks said. We dont control that license and cannot alter or revoke it. Its open and irrevocable in a way that doesnt require you to take our word for it. And its openness means theres no need for a VTT policy. Placing the SRD under a Creative Commons license is a one-way door. Theres no going back.\nUnfortunately, the damage may already be done. People have taken to social media behind the #OpenDnD hashtag, with many publicly committing to no longer supporting what was once considered the worlds most popular tabletop role-playing game. Other publishers have also stepped forward, including a coalition of developers in Europe and others in the United States.\nThe sudden distaste for the brand may have a noticeable impact on the success of Dungeons & Dragons: Honor Among Thieves, the movie starring Chris Pine and Michelle Rodriguez. The film  a major initiative for Hasbros eOne subsidiary, and a feather in the cap of CEO Chris Cocks  is due out in theaters on March 31.\nNext Up In",
      "snippet": "The Dungeons & Dragons Open Gaming License wont be changed.\nWizards of the Coast and Hasbro say theyre making D&D more open than ever before.\nEmail Image: Kieran Yanner/Wizards of the Coast Dungeons & Dragons publisher Wizards of the Coast will abandon attempts to alter the Open Gaming License (OGL).",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T20:06:19",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/IFWJaVE133gRmeFrRGZoo-AcEsc=/0x808:7538x4755/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23954244/329834___ch_1_opener___Art_by_Kieran_Yanner_copy.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574677/dungeons-dragons-dnd-ogl-canceled-wizards-fans-win"
      }
    },
    {
      "id": "4308712396378437285",
      "title": "GoldenEye Facility walkthrough from door decoder to double agent",
      "url": "https://www.polygon.com/guides/23572826/facility-door-decoder-006-dr-doak-double-agent-remote-mine-keycard",
      "description": "Meet up with Dr.Doak, the double agent, and warn him of the incoming danger. Rendezvous with 006 and destroy all of the gas tanks to complete Facility.",
      "body": "Email\nImage: Rare/Nintendo via Polygon\nYoull arrive in the Facility in GoldenEye 007 after jumping from the dam after the first level.\nThe facility is a major hurdle that is filled with guards and soldiers that are holding you back. There are a variety of objectives you must complete, with one of them being the first randomized objective - finding the double agent - that youll encounter for those on Secret Agent difficulty and above.\nRead on to figure out how to find Dr. Doak, rendezvous with 006, and destroy the gas tanks with ease.\nTips before starting Facility in GoldenEye 007\nThroughout, we recommend shooting your weapon at the floor to make the enemies come to you. Take them out one by one to slowly but surely progress through the facility.\nAfter interacting with the panels, there is a timer for how long the associated door can be opened. Move quickly so you dont have to go back and forth.\nThe Double Agent, Dr. Doak, can spawn in one of six locations. You must find him to receive the door decoder to progress in the level on Secret Agent difficulty and above. He is dressed up as a scientist with an object in his hand, so youll have to search the rooms in the walkthrough for a scientist who is not afraid of you.\nWait for your conversation with 006 is done to complete the rendezvous objective.\nAt the end, make sure to place the remote mines in a position that will destroy two tanks at once. They are lined up in two rows of five tanks, so if you place the mines in between two tanks it should take out two at once.\nAfter placing the remote mines, position yourself at either the double doors or the conveyor belt exit for a quick escape. Blow up the tanks with the fire button when youre in position and leave immediately.\nFacility objectives\nDepending on the difficulty, you can have up to five primary objectives to complete at the Facility. The five objectives are as follows:\nObj. A  Gain entry to laboratory area (Agent difficulty and above)\nObj. B  Contact double agent (Secret Agent difficulty and above)\nObj. C  Rendezvous with 006 (Agent difficulty and above)\nObj. D  Destroy all tanks in the bottling room (Agent difficulty and above)\nObj. E  Minimize scientist casualties (Agent difficulty and above)\nRestroom\nImage: Rare/Nintendo via Polygon\nMove towards the left through the air ducts to find an open vent that leads to a restroom, but dont drop down just yet.\nTake out the guard inside the stall with your silenced pistol. Once dealt with, drop down into the restroom.\nDefeat the four other guards in the bathroom. Some of them will be in the stalls, so make sure to check them.\nExit the bathrooms two doors to the first floor.\nActivating the Control Panel and gaining entry to the laboratory area\nGrid View\nDefeating this enemy will drop Clearance Keycard B. Make sure to pick it up before moving on.\nGraphic: Johnny Yu/Polygon | Source Images: Rare/Nintendo\nImage: Rare/Nintendo via Polygon\nStick to the left until you find a double door.\nProceed through the double doors and eliminate the guard at the bottom of the stairs. Another guard may come through the double doors at the bottom of the stairs, so be ready to take out another enemy.\nGo down the stairs and head through the double doors.\nHug the left wall to find a guard facing the opposite direction.\nTake out the guard and pick up Clearance B Keycard off of his body.\nMove through the double doors in the hallway, and hug the left wall until you reach another set of double doors.\nGo through the double doors and eliminate the enemies inside.\nProceed down the hallway on the left and defeat any enemy that comes out of the connecting rooms. If youre using the silenced pistol, the guards will stay in their rooms, so head into each room and defeat any enemies inside.\nEnter the first door on the right, and defeat any enemies inside while avoiding the panel on the right.\nInteract with the panel inside to activate the security door, and quickly exit the room.\nStick to the left side of the hallway, and interact with the door to open it. If the door doesnt open, return back to the panel and try again.\nLocating the Double Agent\nBefore we begin, know that Double Agent, Dr. Doak, can spawn in one of six locations. You must find him to receive the door decoder to progress in the level on Secret Agent difficulty and above. He is dressed up as a scientist with an object in his hand, so youll have to search the rooms in the walkthrough for a scientist who is not afraid of you.\nImage: Rare/Nintendo via Polygon\nDefeat the two guards in the locker room.\nOpen the door ahead, and take out the three guards inside without shooting the scientists. If youre using the KF7 Soviet rifle, more enemies may come from behind you, so make sure to take them out as well.\nCheck the rooms on the left and right of the hallway to see if Dr. Doak, the Double Agent is inside.\nIf he is inside one of these opening rooms, he will give you the door decoder, which youll need to open the bottling room door later on. If he isnt here, dont worry - you can appear later in the level (which we highlight below) and is required to unlock the final area of the game, so you technically cant miss him.\nProceed down the hallway through the first door. Prepare yourself to face off against many enemies behind the next door.\nDefeat the enemies by either waiting for them to come to the door or facing them head on. Once defeated, head through the door ahead of you to find two panels similar to the one before.\nActivate the panel on the right to unlock the door on the right, and take a left out of the room.\nProceed down the hallway to a locked door which will open once the door behind you closes. In the next room, youll be checking to see if the Double Agent is inside, but there are multiple guards inside. You can evade the detection of the guards by peaking to see who is on top of each platform, and not fully going up the stairs.\nReturn back to the central room with the two panels, and interact with the left panel.\nTake a right out of the room and proceed down the hallway through the door  completing Objective A. There will be multiple enemies in this room as well, so be prepared to eliminate multiple guards here.\nDefeat the enemies inside and go up the stairs to the next area. Follow the path and defeat enemies along the way until you reach an opening with a pillar.\nCheck the three rooms here for last opportunities to meet Dr. Doak, the Double Agent  completing Objective B. Continue down the hallway to a locked door.\nHow to use the door decoder\nGraphic: Johnny Yu/Polygon | Source Images: Rare/Nintendo\nIf you are on Secret Agent and 00 Agent difficulty, this requires the door decoder from Dr. Doak - see above for his locations.\nOpen your inventory by pressing the start button and select the door decoder in the weapons section.\nUnlock the door by aiming at the door and using the fire button, and enter the room.\nLaboratories and Bottling Room\nGraphic: Johnny Yu/Polygon | Source images: Rare/Nintendo\nHead down the stairs a",
      "snippet": "Email Image: Rare/Nintendo via <b>Polygon</b> Youll arrive in the Facility in GoldenEye 007 after jumping from the dam after the first level. The facility ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T19:47:57",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/AcDbbKXzw_hJEKYt98yDha1Lgl0=/0x0:1600x838/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390188/jamesbondfacility.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23572826/facility-door-decoder-006-dr-doak-double-agent-remote-mine-keycard"
      }
    },
    {
      "id": "7612071886482291952",
      "title": "GoldenEye Dam walkthrough from covert modem to alarm locations",
      "url": "https://www.polygon.com/guides/23572572/dam-covert-modem-alarm-tunnel-bungee",
      "description": "Sneakily neutralize all of the alarms at the dam to install the covert modem and intercept the data. Escape by bungee jumping off to complete the Dam.",
      "body": "Email\nImage: Rare via Polygon\nIn GoldenEye 007s first mission, Dam, youre dropped off at the base of a dam in the former Soviet Union, and its your job to infiltrate the facility and intercept the shipping and contact information.\nDepending on your difficulty, you have to neutralize the alarms, intercept the data, and bungee jump to safety - all of which is explained step-by-step in our GoldenEye 007 Dam walkthrough.\nTips before starting Dam in Goldeneye 007\nIf youre used to regular aiming conventions, switch your aim from inverted to upright in the start menu.\nOn default control schemes, interacting with objects and doors is done by pressing the B button on the Nintendo Switch and the A button on Xbox. When it comes to aiming, use the aim feature, L on the Nintendo Switch and LT on the Xbox, to aim at the alarms and the small screen for the Covert Modem.\nWhen shooting the alarms, use the silenced pistol to prevent more enemies from coming out of nowhere and setting it off.\nAllow enemies to come to you in the tunnel to easily pick them off one by one, especially if you have the sniper rifle to hand.\nOn the Nintendo Switch, you can create your own check points in the Suspend menu. Press the - button to open the Suspend menu, and create a Suspend point to make your own check point. This is particularly useful on 00 Agent difficulty. And no - there is no suspend on the Xbox version!\nDam objectives\nDepending on the difficulty, you can have up to four primary objectives to complete at the Dam. The four objectives are as follow:\nObj. A  Neutralize all alarms (Secret Agent difficulty and above)\nObj. B  Install covert modem (00 Agent difficulty)\nObj. C  Intercept data backup (00 Agent difficulty)\nObj. D  Bungee jump from platform (Agent difficulty and above)\nHere is how to complete each objective, step-by-step.\nDam Security Area\nSniper location on Dam in GoldenEye 007\nImage: Rare/Nintendo via Polygon\nHead to the left and quickly take out the guard with your pistol.\nPick up the guards rifle and defeat the guards around the guard tower with your pistol or rifle. Also, there is a sniper rifle that you can pick up at the top of the tower to use against upcoming enemies.\nDefeat the two guards inside the tunnel either from a distance with the sniper or head on with your other weapons.\nFollow the green truck through the tunnel to the next area.\nInstalling the Covert Modem\nGrid View\nFollow the arrow to the gate of the building. You want to end up behind the circled boxes marked in the image.\nImage: Rare/Nintendo via Polygon\nThrow the Covert modem onto the screen on the side of the building to install it.\nImage: Rare/Nintendo via Polygon\nTake cover behind the boxes on the left and take down the five enemies in this area. You can skip the two in the bunker if you act quickly.\nInteract with the switch to open the gate, and activate the next switch to open the following gate.\nTake out the two enemies in the next area quickly to prevent them from setting off the alarm.\nContinue forward and shoot the red alarm on the wall to neutralize one of the alarms. (This is one of four - if you want to see all locations at a glance, see the next section.)\nProceed inside the building by entering the gate on the right side of the wall, and defeat the enemies inside.\nTurn right out of the building, and move behind the stacked crates beside the building to find a screen on the wall. You can see what it looks like in the above image gallery.\nOpen the start menu to bring up your watch, and switch to your inventory.\nSelect the covert modem from your inventory, and carefully throw it onto the screen by using the fire button. You only have one modem, so do not miss. This step completes Objective B.\nTurn right out of this area, and shoot the lock on the gate to open it.\nProceed forward to the top of the dam.\nIntercept data backup\nHead towards the first guard tower, and quickly take out the guard inside.\nFind the red alarm inside, and shoot it to neutralize it.\nGo down the stairs inside the tower to find an underground tunnel system filled with enemies.\nProceed through the gate and turn left defeating any enemy along the way. Make sure to check your corners as there are enemies hidden everywhere.\nOpen the door at the end of the corridor to find a room filled with even more enemies, but wait at the opened door. Allow the enemies to come to you to easily clear the room.\nInteract with the rectangular servers on the left side of the room, which will start a timer depicting how long itll take to transfer the data due to your covert modem  completing Objective C.\nExit the room, and return up the stairs you came down before. The entrance to the stairs will be depicted with the number two on the wall.\nMake your way to the second guard tower, and take out the guard inside.\nFind the alarm inside, and neutralize it.\nRepeat steps 8 and 9 for the third guard tower.\nDam alarm locations\nGraphic: Johnny Yu/Polygon | Source Images: Rare/Nintendo\nAlarm 2 location on the first guard tower\nGraphic: Johnny Yu/Polygon | Source Images: Rare/Nintendo\nAlarm 3 location on the second guard tower.\nGraphic: Johnny Yu/Polygon | Source Images: Rare/Nintendo\nAlarm 4 location on the third and final guard tower.\nGraphic: Johnny Yu/Polygon | Source Images: Rare/Nintendo\nThough well cover these as we go in the above sections, here is at a glance the four alarm locations, in the event you finished the mission and managed to miss one or two:\nBefore you install the covert modem and reach the guard towers on top of the dam proper, the alarm is on the wall before the gate.\nOn the dam there are three guard towers. The second alarm is inside the door of the first tower.\nThe second guard tower features the third alarm - again, just inside the door on the wall.\nThe third and final guard tower has, you used it, the fourth and final alarm. Open the door and destroy it. Provided you have also done the others, this objective should be complete.\nBungee jump from platform\nImage: Rare/Nintendo via Polygon\nOnce you have completed all the other objectives, within the dam area, you can find a small set of stairs leading to a platform.\nFrom here, simply move through the railings into the water below to escape and complete the mission.\nThat completes the Dam portion of Mission 1: Arkangelsk, and leads into Facility.\nBefore you move on, it might be worth unlocking this levels GoldenEye 007 cheat, now youre fully familiar with its objectives.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Email Image: Rare via <b>Polygon</b> In GoldenEye 007s first mission, Dam, youre dropped off at the base of a dam in the former Soviet Union, and its your ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T19:47:55",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/O9Vo4kC4L1UCJDaos9eJKs1knPc=/0x74:1771x1001/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390436/goldeneye_dam_1.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23572572/dam-covert-modem-alarm-tunnel-bungee"
      }
    },
    {
      "id": "8051422216677530807",
      "title": "Pokmon Scarlet and Violet Greninja 7-star raid best counters",
      "url": "https://www.polygon.com/pokemon-scarlet-violet-guide/2023/1/27/23572884/greninja-7-star-tera-raid-counters-builds-slowbro-clodsire-gastrodon",
      "description": "Greninja is one of the event seven-star Tera Raid targets in Pokmon Scarlet and Violet. Our guide lists the best counters and how to beat it.",
      "body": "Email\nGraphic: Julia Lee/Polygon | Source images: Game Freak/The Pokmon Company, Nintendo\nGreninja is being added to the Pokmon Scarlet and Violet roster via seven-star Tera Raids. This event-exclusive raid is a higher difficulty, just like the last ones, so youll need to be properly prepared before diving in.\nGreninjas seven-star Tera Raids will run from Jan. 26 at 7 p.m. until Jan. 30 at 6:59 p.m. EST and Feb. 9 at 7 p.m. until Feb. 13 at 6:59 p.m. EST, so if you miss it the first time around, youll have a second chance. If you completely miss the event, tons of players will be breeding Froakie, so you can always get one via trade, though it wont have the event Mightiest Mark.\nThese raids are tough and you wont even have access to them until you unlock six-star raids, which requires you to clear the Academy Ace Tournament and do a handful of four- and five-star raids. Jacq will give you a call once youve hit the requirements, warning you to stay away from these powerful raid dens.\nGreninja Tera Raid rewards\nWhen you beat Greninja, youll be able to catch it, but you can only catch one. After you catch the Greninja, you wont be able to get another one, even if you successfully clear the raid again. You can continue to beat Greninja for additional rewards after catching it, though.\nJust like the seven-star raid targets that came before it, Greninja has its Hidden Ability, Protean, which changes its type to the type of the move its about to use. This only works once per switch in, but it has no effect while the Pokmon is Terastillized, so you wont have to worry about it during the raid. This special Greninja will also come with perfect IVs and the Mightiest Mark.\nJust like other Tera Raids, you can get lots of good loot, like Exp. Candy, Tera Shards, and Bottle Caps by completing the raid. On the first clear, youll get TM91 (Toxic Spikes) and an Ability Patch. Greninja does not drop Herba Mystica. You can see the complete loot table on Serebii.net.\nGreninja Tera Raid best counters\nAs of this writing, there are a few successful builds that weve been seeing: Clodsire, Gastrodon, and Slowbro (the same one from the Cinderace raids, actually).\nGreninja is level 100 with a poison Tera Type. It knows Gunk Shot, Hydro Pump, Ice Beam, Night Slash, Double Team, and Toxic Spikes. It will use Toxic Spikes right away at the beginning the match, poisoning your Pokmon only if they faint and get thrown back into battle.\nAs usual, there are lots of builds that can help take down Greninja or solo it entirely. While weve seen clears with Pokmon like Kingambit and Toxapex across the internet, the Pokmon we list below are ones we had first-hand experience with and give our stamp of approval.\nGreninja Slowbro Tera Raid build\nNature: Modest\nEVs: 4 HP/252 Defense/252 Special Attack\nIVs: Maxed HP, Defense, Special Attack\nHeld item: Twisted Spoon or Leftovers\nMoveset: Stored Power (TM41), Iron Defense (TM104), and Nasty Plot (TM140)\nJust like against Cinderace, this Slowbro will pack a bunch just from stacking Iron Defense and Nasty Plot and then using Stored Power.\nOn turn one, make sure to set up Iron Defense, as Greninja does know Night Slash, a dark-type move that is super effective against Slowbro. It should not kill your Slowbro, as long as its been trained correctly. After using Iron Defense once or twice, the damage from Night Slash will be negligible.\nIf your team has no supports in it, make sure to keep your Slowbro healthy. You can use this by teaching it Heal Pulse or you can just use the healing cheers. (We had a team of all Slowbro and alternated between buffing, cheering, and using Stored Power, so we could keep each pink round friend alive.)\nThis raid screenshot might look bleak, but we all obliterated the Greninja around two turns later.\nImage: Game Freak/The Pokmon Company, Nintendo via Polygon\nGreninja Gastrodon Tera Raid build\nNature: Modest\nEVs: 4 Defense/252 HP/252 Special Attack\nIVs: Maxed HP, Defense, Special Attack\nHeld item: Soft Sand\nMoveset: Clear Smog (Mirror Herb move), Recover, Earth Power\nTo give Gastrodon Clear Smog, delete a move from its repertoire, give it a Mirror Herb to hold, and set up a picnic with only the Gastrodon and another Pokmon that knows Clear Smog. Foongus and Torkoal both learn this by leveling up. After about a minute, your Gastrodon should learn Clear Smog from its picnic partner.\nThe strategy with Gastrodon is to debuff the Double Team that Greninja uses with Clear Smog and then spam Earth Power. Once you can Terastillize, power-up further and keep spamming Earth Power. Heal and keep debuffing as you need to.\nThe prize here with Gastrodon is its Storm Drain ability, which not only makes it immune to water-type moves, but it sucks up all the water-type moves, so no other Pokmon in your raid will get hit with it either. It also boosts its Special Attack when it absorbs the moves, becoming a monstrous hard-hitter. You wont have to worry about a health-depleting Hydro Pump if you have a Gastrodon in your party!\nGreninja Clodsire Tera Raid build\nNature: Modest\nEVs: 4 Special Defense/252 HP/252 Special Attack\nIVs: Maxed HP, Defense, Special Attack\nHeld item: Leftovers\nMoveset: Acid Spray, Helping Hand, Chilling Water, Earth Power\nThe Clodsire build we recommend is more supportive, so dont expect to one-shot the Greninja, but you will be able to beef up your buddies who are using Gastrodon, Slowbro, or another offensive Pokmon.\nSpam Chilling Water to lower Greninjas attack and Acid Spray to lower its Special Defense. This will leave it wide open for attacks, increasing its damage taken and reducing its damage output. Use Helping Hand to beef up your allies a bit more and you can use Earth Power to help deal damage, especially once Greninjas Special Defense has been lowered.\nWater Absorb, similarly to Gastrodons Storm Drain ability, will render Clodsire immune to water-type moves. Greninjas Hydro Pump will instead heal Clodsire. Itll still take damage from Ice Beam, but it shouldnt one-shot it. Make sure to heal using cheers appropriately.\nNext Up In",
      "snippet": "Image: Game Freak/The Pokmon Company, Nintendo via <b>Polygon</b> Greninja Gastrodon Tera Raid build Nature: Modest EVs: 4 Defense/252 HP/252 Special Attack ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T19:42:35",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/XvjymlDnsKFcQhTBwqa3VV2nX5A=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390358/jlee_230127_1001_scarvi_greninja.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/pokemon-scarlet-violet-guide/2023/1/27/23572884/greninja-7-star-tera-raid-counters-builds-slowbro-clodsire-gastrodon"
      }
    },
    {
      "id": "8914057031842375620",
      "title": "How to prep for Destiny 2: Lightfall from bounties to whats leaving",
      "url": "https://www.polygon.com/destiny-2-guide-walkthrough/23546578/lightfall-preperation-bounty-prep-weapons-materials-seasons-whats-leaving",
      "description": "Destiny 2: Lightfall is almost here. From bounties you should complete to a rundown of whats leaving Destiny 2, heres how to prepare.",
      "body": "This story is part of a group of stories called\nOur\nDestiny 2\nguide explains everything you need to know, including choosing a class, a guide to Exotic armor, emotes, weapons, sparrows and ships, how to trigger Heroic Public Events and much more.\nOn Feb. 28, 2023, Bungie will release Destiny 2: Lightfall, the shared world shooters largest content drop since last years critically acclaimed The Witch Queen expansion.\nPreparing for these large add-ons can be a hard and confusing process, so in this Destiny 2: Lightfall preparation guide, well break down everything you should know about whats leaving the game and tell you everything you need to know to best prepare for Lightfall.\nHow to prep your Destiny 2 character for Lightfall\nImage: DestinyRecipes via Polygon\nOne of the best ways to prepare for a new season or expansion is to start saving up on materials and bounties. There are a few community-made tools that can help you prepare, like the amazing Destiny Recipes. Log in with your Destiny 2 account, and this tool will help show you the materials, bounties, and vault space you have, thus giving you a target to aim for. Below well break down the major categories of this checklist to help give you an idea of what to stockpile before Lightfall.\nUnlike in previous years, you can no longer acquire Planetary Materials, so we dont recommend you save them. If you still have some, theyll be great to turn into Glimmer at Rahool, but you do not have to worry about saving them up.\nMaterials prep\nImage: DestinyRecipes via Polygon\nMaterials in Destiny 2 serve a wide variety of purposes from upgrading weapons and armor to purchasing weapons and armor from a vendor like Banshee-44. Going into a new expansion, you want to start with as many materials as you can  however much you think youll need is less than you really need. Starting out with a large stockpile of materials can help delay the need to go out and hunt for them. You want to spend the first days or weeks of the expansion focusing on the new content, so get as much of each material as you can so you can focus on everything new.\n Pre-Seasonal Checklist gives a great breakdown of what materials you want, and how many of each material to get - they can be found under the Resources section. We agree with their goals, so we suggest targeting the following:\nLegendary Shards: 3,000\nUpgrade Modules: 25 (a full inventory)\nAscendant Shards: 10 (a full inventory)\nEnhancement Prisms: 50 (a full inventory)\nEnhancement Cores: 200\nGlimmer: 200,000\n We suggest that you have a full inventory of these items, but you can also store them in your postmaster. The amount that each of your characters can hold in their inventory is the same amount you can store in each of your postmasters, meaning that the inventory cap of 10 Ascendant Shards is the same per postmaster: 10. This means you can hold a total of 40 Ascendant Shards across your inventory and three postmasters. For all of these materials, when your inventory is full, they will automatically go to your postmaster and can stay there until you need them.\n You need Glimmer for almost everything in Destiny 2, so having as much as possible is the way to go. You can store Glimmer by buying certain ships and sparrows from collections, you can keep them in your vault and dismantle them when you need some extra Glimmer. For example, you can purchase the Otherside sparrow for 7,500 Glimmer and 5 Legendary Shards. When you dismantle it, you will get back 5,000 Glimmer and 5 Legendary Shards. This means if you were to have 50 of these sparrows across your inventory and vault, you would have an extra 250,000 Glimmer that you can break out when you need to.\nBounty prep\nSaving bounties is tedious and not for everyone. It allows you to get a head start on the season pass and on the new artifact, but its not really going to hold you back past the first couple of days. Prominent community members Skarrow9 and Kimo made a very handy spreadsheet that you can use to keep track of all the bounties you should be saving, well break down the different types of bounties and what you want to prioritize below. You can watch Skarrow9s YouTube video going over bounty prep and the spreadsheet here:\nIf you do want to save bounties, you want to optimize which ones you go for. The bounties that you want the most are the weekly bounties  these give the most XP and have the label XP++. You can currently save 26 weekly bounties, as follows:\n8 Weekly Clan bounties\n2 Cosmodrome bounties\n1 Starhorse Bounty\n These bounties are on a rotation so not all of them will be available at one time; for example, the four total Europa weekly bounties are spread out over three weeks. Every week, there is a general Europa bounty for completing Lost Sectors, Patrols, and other small missions like. There is also one bounty per Empire Hunt available each week. The earlier you start hoarding, the more weekly bounties you can save. Each of the six weekly Ascendant Challenges in the Dreaming City has a bounty associated with them (as of publishing, we are less than six weeks away from Lightfall - but its worth starting now if you havent already.)\nAfter weekly bounties, you want to fill up your remaining inventory with daily bounties, not repeatable bounties, since those do not give as much XP. Youll want to try to save seven bounties from each vendor of the three primary playlist activities: Crucible, Vanguard Ops, and Gambit. This will get you almost all the way toward completing the weekly challenge of completing eight bounties. You want to only save seven because if you complete that bounty challenge too early, the light level of the gear you receive will be too low to be useful. Wait to complete these challenges until after you complete the campaign and reach the games soft power cap, which will be revealed in the coming weeks as the expansion approaches.\nBecause youre prepping for a new expansion, there are bounties that will not be available to turn in when Lightfall starts. These bounties include anything from one of the seasons (see more about the seasons below) and anything from any event such as the Dawning or the Festival of the Lost. Any bounties from these sources will get removed from your inventory before you log in for Lightfall.\nVault cleaning\nKeeping your vault clean is something few of us like to do, but it is a necessary step in preparing for a new expansion  youre going to need space for the multitude of new items youre about to receive. There are many things to think about when cleaning your vault, and well break down a few of them here. For even more advice, we recommend Dattos video about the topic.\nOur biggest tip when it comes to keeping your vault clean is to use a tool like Destiny Item Manager (DIM), which allows you to organize your inventory outside of the game. DIM is packed full of amazing features that not only help keep your vault clean but streamline playing the game as well. DIMs primary feature is to help move items bet",
      "snippet": "How to prep your Destiny 2 character for Lightfall Image: DestinyRecipes via <b>Polygon</b> One of the best ways to prepare for a new season or expansion is ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T19:32:12",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/tCLTA1LL6BjB6gAAIMiCHNKBjS4=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24383553/LightfallPrep.Main.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/destiny-2-guide-walkthrough/23546578/lightfall-preperation-bounty-prep-weapons-materials-seasons-whats-leaving"
      }
    },
    {
      "id": "5813103969721459645",
      "title": "Hi-Fi Rush review: Xboxs rhythm-action game arrived on Game Pass at the perfect time",
      "url": "https://www.polygon.com/reviews/23574584/hi-fi-rush-review-game-pass-xbox-series-x-pc",
      "description": "Hi-Fi Rush, the surprise release from The Evil Within developer Tango Gameworks, melds rhythm, combat, and exploration in a rock story about taking down an evil corporation.",
      "body": "What to Watch\n.\nIn a different time, the premise itself might have seemed trivial. Protagonist Chai, a kid obsessed with music who constantly spouts puns, approaches Vandelay Technologies for the promise of robotic augmentation. An incident leads to his iPod being inserted into his chest, and now the world is in sync with his playlist  a mix of an original score with licensed tracks from the likes of Nine Inch Nails, The Black Keys, and The Prodigy.\nVandelay immediately deems the protagonist a defect and sends an army of angry robots to terminate him. Blending combat reminiscent of the Devil May Cry series with the spirit of rhythm-infused games such as No Straight Roads and Metal: Hellsinger, the game sees Chai band together with a crew of surprisingly likeable characters to hack, slash, dodge, and jump to the beat, all in an attempt to expose Vandelays evil deeds to the masses.\nAcross 12 levels, you move from QA to the finance departments of the company, each office corridor replete with Vandelay propaganda, surveillance bots, and gold statues of the CEO. Speaking with the robot NPCs elicits venting about overwork and their fear of layoffs. They also ask Chai not to be a narc whenever he spots them taking five by lying down on the floor.\nImage: Tango Gameworks/Bethesda Softworks via Polygon\nAn early level puts you up against Zanzo, a boss in charge of developing SPECTRA, an AI designed to let Vandelay control peoples thoughts  a poignant scenario, considering the latest trend that is already proving to be a disaster. As you plunge through the R&D department, one of Zanzos employees warns him about wasting budget on increasingly extravagant, yet ultimately useless weaponry. He (unsurprisingly) ignores this warning, and Hi-Fi Rush is quick to make fun of the mistake: The games UI displays a percentage bar to show his budget shrinking in real time. Balancing creativity with realistic goals is the mark of a good leader, says one of your teammates. Clearly Zanzo needs guidance.\nWere only a few weeks into 2023, but layoffs are rampant across tech and media  even at Microsoft, which owns Hi-Fi Rushs publisher Bethesda  as people continue to fight for unionization. Hi-Fi Rush is a cathartic, hopeful takedown of the corporate systems (and the people in charge) that churn through workers like any other expendable resource.\nImage: Tango Gameworks/Bethesda Softworks via Polygon\nMuch has been said about the use of quips in Forspoken this past week, comparing the dialogue to Joss Whedons work, and citing it as yet another casualty of the Marvel-ization of storytelling. Hi-Fi Rush is also at fault in this regard, but its satire is so poignant, and its characters so earnest, that it works. Chais jokes can be silly, but hes unwilling to let his and his teammates spirits flicker, determined to keep moving forward and shutting down the deluded plans of Vandelays c-suite. Context makes all the difference.\nThe shadow drop was novel in and of itself, but the game is a triumph. The gorgeous animations and Jet Set Radio-esque art style are vivid and arresting. The array of tutorials, visual aids, and clever mechanics makes the rhythm aspects approachable to genre newcomers. And the vibrant, positive energy is present in every beat, keeping you tapping your feet as you take down a corporation built on a lack of vision. Hi-Fi Rush is a cathartic anthem that arrived at the perfect time.\nHi-Fi Rush\nwas released on Jan. 25 on Windows PC and Xbox Series X. The game was reviewed on Xbox. Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. You can find",
      "snippet": "Image: Tango Gameworks/Bethesda Softworks via <b>Polygon</b> An early level puts you up against Zanzo, a boss in charge of developing SPECTRA, an AI ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T19:18:35",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/R0OF6W2MHP0BYb7JJV0U9VR4Y6g=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390481/hi_fi_rush_7.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/reviews/23574584/hi-fi-rush-review-game-pass-xbox-series-x-pc"
      }
    },
    {
      "id": "9062380657580679151",
      "title": "Dead Space remake: Where to find the Peng treasure",
      "url": "https://www.polygon.com/guides/23574398/dead-space-remake-peng-treasure-location-chapter",
      "description": "Every installment of Dead Space includes a Peng treasure. Our guide will point you to the Dead Space remakes very late-game Peng Treasure location.",
      "body": "Email\nImage: Motive Studio/Electronic Arts via Polygon\nAs players work their way through the USG Ishimura in the Dead Space remake, theyre going to see one name pop up a lot: Peng. In posters, on stickers, and in graffiti, it seems this Pengs all anyones ever talking about. So sick and tired of hearing about how brilliant that Peng is. Overrated! While I cant tell you who or what Peng is, I can tell you how to find the Peng treasure hidden in the Dead Space remake to unlock the Theres Always Peng! trophy/achievement.\nThe good news is for players who have started playing Dead Space but havent found this games Peng treasure (theres one in every installment of Dead Space) yet is that its a very late-game discovery, and its relatively easy to acquire. Its right on the critical path.\nPeng treasure location\nThe Peng treasure can be found in Chapter 11, Alternate Solutions, when Isaac is tasked with moving the Marker which requires him to engage the cargo crane. After entering the Cargo Bay in Hangar-Cargo-Tram Control, take the cargo lift down one floor. (Youll pass through this area much earlier, but its before you pick up the Kinesis Module, so you cant get to the locker.)\nLook for the locker covered in Peng stickers.\nImage: Motive Studio/Electronic Arts via Polygon\nYoull need to kill an Exploder Necromorph first, but immediately to Isaacs left will be a small cluster of lockers partially obscured by a couple kinesis crates and a corpse. The Peng treasure is inside one the leftmost locker. Its pretty easy to spot since there at least five Peng stickers stuck to it.\nHeres its location on the map:\nThe map location of the locker with the Peng treasure inside.\nImage: Motive Studio/Electronic Arts via Polygon\nWhat does the Peng treasure do? Nothing. But like the collectible semiconductors, you can sell it at one of the USG Ishimuras store kiosks, netting you a cool 30,000 credits. The real treasure is crossing this particular collectible off your to-do (and Achievements or Trophies) list.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Email Image: Motive Studio/Electronic Arts via <b>Polygon</b> As players work their way through the USG Ishimura in the Dead Space remake, theyre going to ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T19:02:59",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/gzDPzsTaE27mnldOlRJaKugmaGE=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24390503/dead_space_peng_treasure.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/guides/23574398/dead-space-remake-peng-treasure-location-chapter"
      }
    },
    {
      "id": "4095990120602149660",
      "title": "Polygon One Day Volume Tops $1.10 Billion (MATIC)",
      "url": "https://www.themarketsdaily.com/2023/01/27/polygon-one-day-volume-tops-1-10-billion-matic.html",
      "description": "Read Polygon One Day Volume Tops $1.10 Billion (MATIC) at Markets Daily",
      "body": "Polygons\ngenesis date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. Polygons official message board is blog.polygon.technology. Polygons official website is polygon.technology. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nPolygon Coin Trading\nIt is usually not presently possible to purchase alternative cryptocurrencies such as Polygon directly using US dollars. Investors seeking to trade Polygon should first purchase Bitcoin or Ethereum using an exchange that deals in US dollars such as Changelly, Gemini or Coinbase. Investors can then use their newly-acquired Bitcoin or Ethereum to purchase Polygon using one of the aforementioned exchanges.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> One Day Volume Tops $1.10 Billion (MATIC) at Markets Daily. <b><b>Polygon</b>s</b> genesis date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T18:59:52",
      "provider": {
        "name": "themarketsdaily",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "themarketsdaily",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.themarketsdaily.com/2023/01/27/polygon-one-day-volume-tops-1-10-billion-matic.html"
      }
    },
    {
      "id": "182012897099264428",
      "title": "Polygon Market Capitalization Achieves $10.15 Billion (MATIC)",
      "url": "https://theenterpriseleader.com/2023/01/27/polygon-market-capitalization-achieves-10-15-billion-matic.html",
      "description": "Read Polygon Market Capitalization Achieves $10.15 Billion (MATIC) at Enterprise Leader",
      "body": "Polygons\ngenesis date was March 26th, 2018. Polygons total supply is 10,000,000,000 coins and its circulating supply is 8,734,317,475 coins. Polygons official Twitter account is @0xpolygon and its Facebook page is accessible here. The Reddit community for Polygon is https://reddit.com/r/0xpolygon and the currencys Github account can be viewed here. Polygons official website is polygon.technology. Polygons official message board is blog.polygon.technology.\nAccording to CryptoCompare, The Ethereum blockchain is home to thousands of smart contracts and decentralized applications. The flurry of activity on it has seen transaction fees make using the network economically unviable for some of its users, creating demand for scaling solutions, like Polygon.What is Polygon?Polygon (MATIC) is a Layer-2 scaling solution for Ethereum that provides users with faster transactions and lower costs as a parallel blockchain running alongside the main Ethereum network.To use the Polygon network, users have to bridge their tokens from Ethereum to it. There are numerous decentralized applications built on top of Polygon, including several leading Ethereum-based protocols that have made their applications work on both networks.The Polygon network can be used through cryptocurrency wallets compatible with Web3 applications such as MetaMask or the Coinbase Wallet. These are wallets that can interact with smart contracts on the blockchain and can be found built-in to some web browsers such as Opera and Brave.What is the MATIC token?The MATIC token is Polygons native currency, used to pay for transaction fees on the network. The cryptocurrency is also Polygons governance token, which means MATIC token holders get to vote on change proposals to Polygon.As the network uses a Proof-of-Stake (PoS) consensus algorithm, MATIC can be staked to help secure the network in exchange for rewards in MATIC. The ticker MATIC comes from a previous stage of Polygons development, as at launch it was named the MATIC Network.Who Created Polygon?Polygon was first launched back in 2017 as the Matic Network by several Ethereum developers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. The network went live in 2020 and quickly attracted some of the largest DeFi applications.The network raised the equivalent of $5.6 million in TH with the sale of 1.9 billion MATIC tokens back in April 2019.The Polygon network currency has several blue-chip DeFi applications launched on top of it, including decentralized exchange Uniswap, lending platform Aave, and decentralized lottery platform PoolTogether.\nBuying and Selling Polygon\nIt is usually not presently possible to purchase alternative cryptocurrencies such as Polygon directly using U.S. dollars. Investors seeking to acquire Polygon should first purchase Bitcoin or Ethereum using an exchange that deals in U.S. dollars such as Gemini, Coinbase or Changelly. Investors can then use their newly-acquired Bitcoin or Ethereum to purchase Polygon using one of the aforementioned exchanges.\nReceive News & Updates for Polygon Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Polygon and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
      "snippet": "Read <b>Polygon</b> Market Capitalization Achieves $10.15 Billion (MATIC) at Enterprise Leader. <b><b>Polygon</b>s</b> genesis date was March 26th, 2018.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T18:42:42",
      "provider": {
        "name": "theenterpriseleader",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cryptocurrencies/polygon-MATIC.png?v=2022-10-05&amp;w=240&amp;h=240&amp;zc=2",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "theenterpriseleader",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://theenterpriseleader.com/2023/01/27/polygon-market-capitalization-achieves-10-15-billion-matic.html"
      }
    },
    {
      "id": "8470828836075194791",
      "title": "Bengals Joe Burrow is a Ness main and may win the Super Bowl",
      "url": "https://www.polygon.com/23574520/bengals-joe-burrow-smash-bros",
      "description": "Cincinnati Bengals quarterback Joe Burrow plays Super Smash Bros. before games, and he has the most annoying main: Ness.",
      "body": "Email\nImage: Bandai Namco Studios, Sora Ltd./Nintendo\nCincinnati Bengals quarterback Joe Burrow is many things: a gifted passer, tall, capable of making dramatic last-minute runs and maintaining a very handsome, chill vibe in spite of his violent profession. Hes also an avid Super Smash Bros. player, with the most annoying possible main: Ness.\nThe news comes from NFL Network reporter Cameron Wolfe, who shared on Twitter that Burrow plays Smash on Saturday nights, getting his filthy Ness habit in before he plays the game hes actually paid to play on Sunday.\nJoe Burrow says he usually plays Super Smash Bros on Saturday flights to road game and Saturday nights before the game because his film work is usually wrapped up.\nBurrow also dropped that he's a Ness main. Smash fans rejoice.\n Cameron Wolfe (@CameronWolfe)\nJanuary 27, 2023\nIn the NFL, Burrow is a big deal right now, a young quarterback playing for a team that may make its second Super Bowl appearance in as many years when the Big Game airs in two weeks. This Sunday, the Bengals will play in the AFC championship game against the Kansas City Chiefs. The winner will advance to the Super Bowl against the Philadelphia Eagles (go birds) or the San Francisco 49ers, who are playing for the NFC crown the same day.\nIf Burrow and the Bengals do return to the Super Bowl, maybe this time it will go better for them  they lost to the Los Angeles Rams last year, 23-20, perhaps because Burrow is a Ness main. Either way, between this and Jamaal Williams Naruto shout-out earlier this month, the NFL should consider pivoting to livestreamed LAN parties  theyd be great fun for everyone, and far less injury-prone.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Cincinnati Bengals quarterback Joe Burrow plays Super Smash Bros.\nbefore games, and he has the most annoying main: Ness.\nEmail Image: Bandai Namco Studios, Sora Ltd./Nintendo Cincinnati Bengals quarterback Joe Burrow is many things: a gifted passer, tall, capable of making dramatic last-minute runs and maintaining a very handsome, chill vibe in spite of his violent profession.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T18:41:17",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/p9ccw6Dzvucfej4tFDPpYJlmVQ0=/0x0:1843x965/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13644406/Screen_Shot_2018_12_21_at_3.55.13_PM.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574520/bengals-joe-burrow-smash-bros"
      }
    },
    {
      "id": "8536958644718526228",
      "title": "You People review: Eddie Murphy Jonah Hill try to solve racism with cringe",
      "url": "https://www.polygon.com/reviews/23572985/you-people-review-netflix",
      "description": "From Black-ish creator Kenya Barris, Netflixs Eddie Murphy/Jonah Hill team-up is a dispiriting and dull use of tremendous comedic talent that includes Veep and Seinfelds Julia Louis-Dreyfus and The Fresh Prince of Bel-Airs Nia Long.",
      "body": "Flipboard\nEmail\nTake it from someone who knows: Interracial relationships in America are almost always weird in ways that are hard to plan for. Regardless of how well-meaning a person can be, any challenge to their baseline assumptions about life and the world is going to be uncomfortable and disorienting, and missteps will be made. There can be catharsis in making fun of this in conversation or art, and it can even be a channel for growth and moving past said difficulties  which is where the appeal of a movie like\nNetflix\ns new comedy You People comes in.\nA modern take on Guess Whos Coming to Dinner, You People wades into the difficulties and awkwardness of interracial romance, and the cultural exchange and conflict that comes with it. Directed by Kenya Barris (\nBlack-ish\n) with a script by Barris and Jonah Hill, the film follows Ezra Cohen (Hill), a white Jewish guy who falls in love with Amira Mohammed (Lauren London), a Black Muslim woman. In a beat that feels fairly true to life, neither of them fully anticipates how weird their respective families will be about their relationship. Unfortunately, its surrounded by a film that does not feel so true; You Peoples story feels assembled on the fly, an endless stream of vignettes with no real point to make but two hours of time to fill, ideally with cringe comedy.\nWatching You People is a disorienting experience. Scenes dont feel written or directed, merely suggested, like an improv show gone immediately off the rails. Every transition introduces another scenario where two characters have a forced misunderstanding that leads to awkward riffing until the scene arbitrarily ends. This approach is applied to all kinds of moments: When a member of the Cohens synagogue asks Ezra about his penis; when Ezras father (played by David Duchovny) babbles on about how much he loves Xzibit; when his mother (Julia Louis-Dreyfus) makes uncomfortably performative attempts to be inclusive; or the many, many times that Ezra pretends he is knowledgeable about Black culture and Amiras father, Akbar (\n), calls him out on it.\nPhoto: Parrish Lewis/Netflix\nIf youve seen a bunch of Jonah Hill comedies, you can recognize this pattern  an awkward stammering and droning cadence that takes ignorance to its logical endpoint, as Hills characters bumble their way into a hole they cant stop digging for themselves even when they know they should. Its fun when the actor is a supporting character, less so when hes one of the protagonists. Hill is able to effortlessly make a meal out of cringe comedy, but its not an appetizing one.\nIn this mode, You People comes across as both insincere as a whole, and disingenuous when it comes to Ezras character. All of these jokes require Ezra to stubbornly insist that he can hang with Amiras Black family even though he continually shows he has no idea what hes talking about  and yet You People is earnest in its portrayal of his romance with the far less fleshed-out Amira, who has to suffer through his ignorance and the discomfort his family causes her.\nAll of this is a shame, because even if the movie is barely directed, it is stacked with comedic legends, some of whom can actually get good laughs out of Hills signature mumblecore bullshitting. Scenes with Ezras podcast partner and best fried Mo (Sam Jay) are laid-back and casually funny, like in their segment that opens the movie, in which they each imagine their ideal Barack Obama. And even though Eddie Murphy plays Akbar in a cooly distant and annoyed manner, brief moments of mischievousness surface when paired with other comedians, like Mike Epps or Deon Cole, the latter of whom helps him riff on throwing a Tron-style wedding.\nTheres this weird notion that good comedy is offensive, when in fact its empathetic. In order to make someone laugh and do it consistently, its necessary to understand something about them first. This is why the impulse behind a film like You People can be a good one, as comedy can make a lot of hay out of the misunderstandings people have about one another as they bumble toward understanding. You People, however, is mostly interested in ignorance, and as such it gets old fast. Because the most offensive comedy isnt ignorant or bigoted, its simply boring.\nYou People",
      "snippet": "From Black-ish creator Kenya Barris, Netflixs Eddie Murphy/Jonah Hill team-up is a dispiriting and dull use of tremendous comedic talent that includes Veep and Seinfelds Julia Louis-Dreyfus and The Fresh Prince of Bel-Airs Nia Long.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T18:03:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/P70ngc_d2kcw784OS5Jt7qBEJCI=/0x515:7200x4285/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24387903/UJHP_20211122_27511_R.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/reviews/23572985/you-people-review-netflix"
      }
    },
    {
      "id": "7569499467118454731",
      "title": "The Last of Us season 2 renewal announced by HBO",
      "url": "https://www.polygon.com/23574412/the-last-of-us-season-2-hbo-max",
      "description": "HBO Max has greenlit a second season of The Last of Us, based on The Last of Us Part 2 video game. Pedro Pascal and Bella Ramsey should gear up to fight more infected!",
      "body": "The Last of Us\nis already shaping up to be one of the best TV shows of 2023, a natural evolution from a video game borrowing the style of prestige TV to prestige TV borrowing the style of a video game. And HBO seems to think so too  The Last of Us will return for a second season, the network announced Friday.\nAccording to HBOs news release, The Last of Us premiere was the companys second-biggest launch of a series, behind only\nHouse of the Dragon\ns debut, and the shows audience grew by more than 20% for the second episode. The third episode of The Last of Us, Long Long Time, premieres Sunday on HBO and HBO Max at 9 p.m. EST. (And if youre on the fence about the series but dont have an HBO Max subscription, HBO has made the first episode of The Last of Us available for free on the streaming service.)\nIm so grateful to [The Last of Us co-creator] Neil Druckmann and HBO for our partnership, executive producer Craig Mazin said in the news release, and Im even more grateful to the millions of people who have joined us on this journey. The audience has given us the chance to continue, and as a fan of the characters and world Neil and Naughty Dog created, I couldnt be more ready to dive back in.\nThe first season of HBOs The Last of Us covers the events of the 2013 video game of the same name. That leaves Naughty Dogs 2020 sequel, The Last of Us Part 2, for season 2 of the show  and, with Mazin having previously said that the game sequel would take more than one season to cover in a TV adaptation, a potential for a third season.\nThe Last of Us Part 2 sees Ellie largely succeed Joel as the games main character, which is great news for Bella Ramsey! Were confident that Pedro Pascal will find something to keep himself busy with.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "HBO Max has greenlit a second season of The Last of Us, based on The Last of Us Part 2 video game.\nPedro Pascal and Bella Ramsey should gear up to fight more infected!.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T17:41:29",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/BjRlWOOllZPCBSirdYSb8AKRmhs=/0x138:1920x1143/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24347960/Bella_Ramsey__Anna_Torv___Liane_Hentscher_HBO.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574412/the-last-of-us-season-2-hbo-max"
      }
    },
    {
      "id": "4869524564939286753",
      "title": "Dead Space remakes secret ending sets up Dead Space 2",
      "url": "https://www.polygon.com/23574108/dead-space-remake-secret-ending-alternate-sequel",
      "description": "The Dead Space remake includes a second, secret ending that can be unlocked through New Game Plus. The \"alternative ending\" for Dead Space ties into the events of Dead Space 2 in a more elegant way.",
      "body": "Email\nImage: Motive Studio/Electronic Arts\nMotive Studios remake of sci-fi survival horror classic Dead Space is excellent, filling in the gaps and addressing shortcomings of the original 2008 game. It also adds to the original Dead Space, including a secret alternative ending that provides stronger connective tissue to the original games sequel, 2011s Dead Space 2.\nDead Space players who have peeked at the achievements and trophies for the remake know that theres a secret ending, but it requires a good amount of work to get there. For those who are curious  or simply dont want to play, like, 30 hours of the Dead Space remake  heres whats different in the alternative ending.\n[Ed. note: Spoilers for Dead Space follow, naturally.]\nAt the end of the game, hero engineer Isaac Clarke is confronted with a harrowing reality. The woman that he loves, the person that brought him to the USG Ishimura in the first place, Dr. Nicole Brennan, was already dead by the time he arrived. The woman hes been talking to throughout the game isnt Nicole, but someone else entirely; Isaac has been hallucinating, a condition brought on by The Marker, the alien technology at the heart of the Necromorph infection and the mass hysteria that consumed the Ishimura crew.\nIn the original ending, Isaac appears to accept Nicoles death, and escapes the colony Aegis VII in a shuttlecraft. He rewatches Nicoles final video message to him, appearing to come to grips with his loss. He then hears the ghostly whispers of Nicole once more, and a bloody specter of the undead Nicole lunges at Isaac from the co-pilot seat. The game cuts to a black screen. Its just one more jump scare in the long train of Dead Spaces jump scares.\nRelated\nDead Spaces accessibility options contain an amazing tool\nIn the alternative ending, things play out mostly the same. Isaac realizes hes been hallucinating Nicoles face and voice, and he escapes Aegis VII. But Isaac is behaving very differently on the shuttlecraft. He looks loopy and detached  almost happy. Nicole appears behind him, seemingly in good health, and says, The Ishimura really was a great ship.\nYeah, we were lucky to see her in her prime, Isaac replies.\nAre we going home, Isaac? Theres so much work to do, Nicole says. Soon, I promise, Isaac responds. Gotta build a little something first.\nFor me? Nicole says. What is it?\nIts a surprise, sweetie, Isaac says, grinning. But I think youre gonna like it.\nThe camera then pans behind them and we see Isaacs helmet laying on the floor. The deck of the escape shuttle is revealed to be slathered in Marker symbols  you know, the bloody graffiti scrawled all over the Ishimura  implying that the Marker has affected Isaac more deeply than just haunting him with his dead ex-girlfriend.\nThe Dead Space remakes alternative ending more strongly ties the ending of the first game to the events of Dead Space 2. In the sequel, Isaac wakes up in a hospital in a settlement called the Sprawl with no memory of the past three years. Dead Space 2 reveals that a new Necromorph infestation plaguing the Sprawl was caused by Isaac himself  in the intervening years, Isaac built a new marker, and the church of Unitology wants him to build more.\nUnlocking the secret alternative ending in the Dead Space remake reinforces that narrative, because it requires finding 12 Marker fragments scattered throughout the game in New Game Plus mode. That mode only unlocks after completing Dead Space once, meaning players are in for a long journey to see the remakes secret ending for themselves.\nEA hasnt said anything yet about a remake of Dead Space 2, but the alternative ending is a sign of hope that the sequel is next for Motive Studio.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Dead Space remake includes a second, secret ending that can be unlocked through New Game Plus.\nThe \"alternative ending\" for Dead Space ties into the events of Dead Space 2 in a more elegant way.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T16:30:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/OSI2GGrYs3CedhaO9jdQ5VGTR10=/0x0:3840x2010/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24389874/DS_UP_ISAAC_16x9.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574108/dead-space-remake-secret-ending-alternate-sequel"
      }
    },
    {
      "id": "7713655717619192845",
      "title": "Polygon (MATIC) Surpassed Ethereum (ETH), Cardano (ADA) by This Major Metric: Details",
      "url": "https://u.today/polygon-matic-surpassed-ethereum-eth-cardano-ada-by-this-major-metric-details",
      "description": "Recently shared data shows that Polygon has outpaced Ethereum but still lags behind BNB Chain in this important metric",
      "body": "January 27, 2023\nPolygon outdoes Ethereum, Solana and Cardano\nToken Terminal data shows that the number of daily active users on Polygon has surpassed that of the second largest blockchain, Ethereum. A total of 344,000 for Polygon compare with Ethereum's 324,000. Therefore, Polygon has become the second biggest platform in DAU.\nAhead of it comes Binance Smart Chain (BSC), also known as BNB Chain, with its 781,000 daily active users.\nPopular crypto YouTuber and trader Lark Davis shared a screenshot from the same sourcewith some more details on this. His image shows that after Ethereum, next comes Solana, with 135,000 active users per day, and Near protocol with 69,000 active users on a daily basis.\nAds\nCardano-themed account doubts MATIC DAU data\nCEO and co-founder of Binance Changpeng Zhao (often called simply CZ) commented on Davis' post, stating that Binance is focusing on actual daily users and not on TVL (total value of assets locked) provided by several large whales only.\nCardano blockchain boasts 76,254 daily active users, according to an anonymous Cardano-themed account called ADA whale with over 125,300 followers on Twitter.\nCardano 76,254\nAnd by the way the numbers shown for at least Sol and Matic are complete bs. Communities with less than half our presence on here (if were being super generous) with 5x the transactions, yeah lol\n ADA whale (@cardano_whale)\nJanuary 27, 2023\nThe person behind this account also doubted that the figures for at least Solana and MATIC on Davis' screenshot are correct since these are communities \"with less than half our presence on here (if we're being super generous) with 5x the transactions.\"",
      "snippet": "... data shows that <b>Polygon</b> has outpaced Ethereum ... metric. January 27, 2023 <b>Polygon</b> outdoes Ethereum, Solana ... active users on <b>Polygon</b> has surpassed that of ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T16:30:00",
      "provider": {
        "name": "u",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://u.today/sites/default/files/styles/twitter/public/2023-01/30339.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "u",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://u.today/polygon-matic-surpassed-ethereum-eth-cardano-ada-by-this-major-metric-details"
      }
    },
    {
      "id": "3469096321867792448",
      "title": "Kaguya-sama: Love is War movie gets a trailer and release date",
      "url": "https://www.polygon.com/23574216/kaguya-sama-love-is-war-movie-trailer-release-date",
      "description": "The Kaguya-sama: Love Is War -The First Kiss That Never Ends trailer shows what happens after Shirogane and Shinomiya finally kissed in the season 3 finale. The movie is out for two days, kicking off on Valentines Day.",
      "body": "Flipboard\nEmail\nThe Kaguya-sama: Love Is War movie is coming to North America next month  right on Valentines Day! Titled Kaguya-sama: Love Is War - The First Kiss That Never Ends, the movie will be in theaters for a two-day special event kicking off on Feb. 14. It will be shown in Japanese with English subtitles.\nThe movie picks up right after the third season finale where stubborn and prideful student council members Miyuki Shirogane and Kaguya Shinomiya finally  finally!  admitted their feelings for one another and kissed. (Still screaming, btw). The trailer, however, reveals that things arent as obvious as the two maybe hoped. After all, neither of them actually defined anything about their relationship. The trailer pivots from laughs to more serious reflections on their feelings for one another  something the show always deftly balances.\nThe official synopsis is as follows:\nShuchiin Academys student council room, the place where Student Council Vice President Kaguya Shinomiya and President Miyuki Shirogane met. After a long battle in love, these two geniuses communicated their feelings and, at the Hoshin Festival, had their very first kiss. However, there was no clear confession of love. The relationship between these two, who assumed they would be a couple, remains ambiguous. Now, overly conscious of their feelings, they must face the biggest challenge yet: Christmas. Its Shirogane who wants it to be perfect versus Kaguya who pursues the imperfect situation. This is the very normal love story of two geniuses and the first kiss that never ends.\nKaguya-sama: Love Is War is available to stream on Crunchyroll. Its an absolutely hilarious romantic comedy, following two very capable, intelligent, and arrogant students who decide to make the other fall in love. It backfires splendidly, and for three seasons, Shirogane and Shinomiya dance around their feelings in series of elaborate schemes and miscommunications. But its not just hilarity enthusing; the show also dives into the lead characters deeper vulnerabilities and fleshes out the eclectic supporting cast.\nTickets are on sale for Kaguya-sama: Love Is War - The First Kiss That Never Ends via Fandango.  Check out the first poster:\nImage: A-1 Pictures",
      "snippet": "The Kaguya-sama: Love Is War -The First Kiss That Never Ends trailer shows what happens after Shirogane and Shinomiya finally kissed in the season 3 finale.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T16:05:58",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/YWocspkn502yD97fO40IAEVtgro=/0x8:1470x778/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24389960/Screen_Shot_2023_01_27_at_10.53.18_AM.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574216/kaguya-sama-love-is-war-movie-trailer-release-date"
      }
    },
    {
      "id": "2032089181850180955",
      "title": "Cat Person review: Viral short story is now a ready-to-go-viral romance movie",
      "url": "https://www.polygon.com/23571353/cat-person-movie-review",
      "description": "Cat Person stars Successions Nicholas Braun and CODAs Emilia Jones as a blossoming couple. But theres a twist just like in the 2017 New Yorker story. In this case, its that the 2023 Sundance movie isnt so hot.",
      "body": "Cat Person\n got at something fundamental about sexual relationships between women and men: Theres an undercurrent of fear in everyday life for women (used broadly here, to include a variety of feminine gender expressions) that simply isnt present for men. Crossing the street when someone is walking behind you. Going into a parking garage with keys clutched in your fist. Getting it over with because youre not sure how hell react if you say no. This truth is botched, like so many other things, in the film version of Cat Person, which premiered this week at the 2023 Sundance Film Festival.\nCat Person gets it wrong so consistently, makes its points so inelegantly, and pads out the short story in such an ill-conceived way that it ends up invalidating the same concerns on which its built. When a cop tells the protagonist that she should stop watching murder shows, its not institutional indifference toward violence against women. Its a voice of reason, as the protagonists own actions later prove. This is a film that includes both a therapist who appears to state the subtext as text, then vanishes, and a one-dimensional best friend of color who exists solely to drop feminist buzzwords from five years ago (Geraldine Viswanathan, who deserves better). Its confident in its cluelessness, and not in a way that underlines that same quality in its 20-year-old heroine.\nMargot (Emilia Jones) is a college sophomore majoring in anthropology (maybe  its never directly stated) who also has a part-time job at a movie theater that only plays problematic Hollywood films from the 1960s through the 80s. Thats where she meets Robert (Nicholas Braun), an older man  she thinks hes 25, ancient in her friends eyes  with whom she strikes up a flirty relationship via text. They get along beautifully with the phone screen as a mediator; he gives good banter, one might say. But when they finally meet in real life, Robert is awkward and evasive. Margot isnt even sure if he really has the two cats he talked about in their texts.\nThe centerpiece of both the short story and the film version of Cat Person is a scene where Margot changes her mind about having sex with Robert, but goes along with the encounter anyway. She dissociates, floating out of her body and viewing herself from above. She looks silly. He looks sillier. She agreed to go to bed with him because, in her words, he seems like he would be grateful for the physical connection with a hot young woman like herself. But now the attention is neither validating nor enjoyable. Hes a bad kisser, and a worse lover. Oh, and hes actually 33 (knocked down a year from the storys 34). Its an awkward moment, but an intensely relatable one for many people.\nPhoto: Sundance Institute\nMayfair Witches\n) handles script duties here  brings this experience to the screen in a flat visual style. For the majority of the scene, Margot talks to a double of herself standing on the other side of the room, an externalized internal monologue that overlays comedy onto the films most distressing moment. But the dialogue isnt all that funny, which makes the whole thing just fall flat.\nThe same goes for the films horror flourishes, which are bluntly inserted and summarily dismissed. The entire concept of female hyperawareness about the danger posed by men is presented in such a studied way in Cat Person that it ends up draining all the emotion from the theme, particularly in its mind-boggling final stretch. None of the additions to the story really work: Like Viswanathan, Isabella Rossellini is mostly wasted as a professor whos fond of talking about how male bees penises fall off during the act of copulation, disemboweling them in the process. And what happens in the movie after the short story ends is especially misguided. Without spoiling, Margot has quite an ax to grind with Harrison Ford.\nTo be fair, rolling your eyes and saying that Star Wars is sooo boring is something a 20-year-old would do. Its a rite of passage to reject what came before you, even  or perhaps especially  if a guy youre rapidly realizing isnt as attractive as you thought makes what came before you his entire personality. The thing is, in the dynamic between Margot and Robert, its never clear if this is supposed to be an affectionate nod to the unearned sense of superiority inherent to 20-year-olds, or if the movie is actually rehashing Twitter discourse from the mid-to-late 2010s with a straight face. It plays like the latter.\nThere was a time when a crack about men not having bed frames was fresh. But culture moves very quickly in the social media age  too fast for the development, production, and release of a feature film based on a short story thats inextricable from the online chatter around it, perhaps. Some of Cat Persons observations about sex and dating are relatable, at least to those who are attracted to men: Who among us has not laid on some guys dirty sheets and watched a movie on a laptop after bad sex? But as filmmakers try to figure out how to lasso the internet and tame it for the screen, Cat Person is mostly useful as a lesson in what not to do.\nCat Person",
      "snippet": "Cat Person stars Successions Nicholas Braun and CODAs Emilia Jones as a blossoming couple.\nBut theres a twist just like in the 2017 New Yorker story.\nIn this case, its that the 2023 Sundance movie isnt so hot.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T16:03:50",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/MntLeBqu3XR_ZWXP0YoszU_jZXw=/0x47:2400x1304/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24385338/Cat_Person_Still_1.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23571353/cat-person-movie-review"
      }
    },
    {
      "id": "4196951435258832281",
      "title": "The Simpsons returns for season 35 36 and may never get canceled",
      "url": "https://www.polygon.com/23574155/simpsons-not-canceled-seasons-35-36-renewal-disney-plus",
      "description": "The Simpsons isnt just a huge show, its massively popular streaming on Disney Plus. Heres why the show may never end and why Bobs Burgers and Family Guy are benefitting.",
      "body": "The Simpsons\n? Though its cultural domination peaked over 20 years ago, the Fox animated series created by Matt Groening, James L. Brooks, and Sam Simon is still going strong  and maybe as strong as ever in the changing tides of network-vs.-streaming landscape. Fox announced on Thursday that The Simpsons had once again been renewed, and for two more seasons. The order will shepherd in season 35 and 36 for the series, maintaining the shows record as the longest-running scripted sitcom in television history. (Saturday Night Live, considered a variety show, sits at the top of all-timers with 48 seasons.)\nThe Simpsons order comes at a time when live appointment television beyond major sporting events is in a tailspin. But the animated series maintains a solid ratings streak; recent episodes have had as many 4 million viewers, trouncing most other non-sports network programming. The renewal also comes with good news for the animated series bolstered by and in the orbit of The Simpsons: Bobs Burgers will return for seasons 14 and 15, while Family Guy will receive a 22nd and 23rd season.\nMaybe the most surprising factoid about The Simpsons is that its also one of Disneys only streaming hits. What The Office did for Netflix, The Simpsons does for Disney Plus. Nielsen U.S. revealed this week that while tentpole shows like Stranger Things, Wednesday, and Cobra Kai were massively popular in 2022, seasons new and old of The Simpsons did comparable numbers, to the tune of 15.9 billion minutes of screen time. Having 667 available episodes on the Disney Plus platform cant hurt.\nSince the acquisition of 20th Century Fox, Disney has mostly used The Simpsons to leverage other brands. On top of newly added episodes, Disney Plus has released six short films starring the characters, that have integrated everything from Star Wars to Marvel to Billie Eilishs concert event. It might seem crass if not for the shows legacy of merchandising!\nNo, The Simpsons aint what it used to be  but the writers arent content with doing the same old same old 35 seasons in either. This is a show that, for all the Disney brand awareness, has also in recent years paid Don Hertzfeldt to design his own couch gag and committed space to an extended Edward Gorey tribute. The Simpson family and its wide cast of characters arent that different than The Muppets in their ability to plug and play in weirdo animated worlds. No wonder The Simpsons fandom is thriving, even when the expression of that fandom has little to do with the show itself.\nThe Simpsons season 34 is currently on hiatus, with new episodes set to premiere later this year.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "The Simpsons isnt just a huge show, its massively popular streaming on Disney Plus.\nHeres why the show may never end and why Bobs Burgers and Family Guy are benefitting.",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-01-27T15:28:19",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/yWQXiBv4GwI6foeXZRmEW93guEs=/0x0:3840x2010/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24389785/TheSimpsons_3219_TheWayzWeWere_QABF19Sc2056AvidColorCorrected.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574155/simpsons-not-canceled-seasons-35-36-renewal-disney-plus"
      }
    },
    {
      "id": "5289184362579344948",
      "title": "Like A Dragon: Ishin! preview: Yakuzas historical samurai game",
      "url": "https://www.polygon.com/23574077/like-a-dragon-ishin-preview-yakuza-sega",
      "description": "Segas samurai spin on Yakuza, Like A Dragon: Ishin!, is the Red Dead Redemption of Yakuza games. Its coming to PS4, PS5, Steam, Xbox One, and Xbox Series X in February.",
      "body": "Email\nImage: Ryu Ga Gotoku Studio/Sega\nSegas Yakuza series, now known as Like A Dragon in the West, is beloved for its serious, stone-faced drama and brutal street brawls as it is for the silly antics of its stars, Kiryu Kazuma, Goro Majima, and Ichiban Kasuga. None of that is changing for the next game in the franchise, Like A Dragon: Ishin!, despite the games historical 19th century setting. If anything, Like A Dragon: Ishin! is an opportunity for the franchise to be a little sillier and more serious.\nBut lets back up. What is Like A Dragon: Ishin? Its the remake of a Yakuza spinoff that was originally released only in Japan in 2014 for PlayStation 3 and PlayStation 4. Its a stand-alone entry; neither a sequel nor direct prequel to the mainline Like A Dragon/Yakuza games, so if youre intimidated by the sheer volume of Segas beat-em-up adventure franchise, its a good jumping-in point. (Though fans of Yakuza 0 and Yakuza: Like A Dragon will recognize some familiar faces here.)\nThe story of Like A Dragon: Ishin! centers on Sakamoto Ryoma  he just happens to look a lot like Yakuza protagonist Kiryu Kazuma  who embarks on a mission to uncover a mysterious assailant after his father figure and mentor, Yoshida Toyo, is murdered. The only thing Ryoma knows about the masked attacker is his swordfighting style, known as Tennen Rishin. Seeking answers, Ryoma travels from his backwater town Tosa to Japans capital city of Kyo where he joins the Shinsengumi, a special police force, under an alias.\nI recently played an early chapter of Like A Dragon: Ishin! on Xbox Series X  its also coming to PlayStation 4, PlayStation 5, Windows PC, and Xbox One in February  and found it just as engrossing, melodramatic, and comical as any Yakuza game to date. In some cases, the historical Bakumatsu period setting only made some elements of the Ishin! even funnier.\nChapter 3 of Like A Dragon: Ishin!, Mibu Wolves, sees Ryoma settling in the Fushimi district of Kyo. Its a bustling, metropolitan town full of vendors, restaurants, bars, and brothels, as well as outlaws and lowlifes roaming the streets just looking for a fight. There are also minigames  gambling, chicken racing, even a proto-karaoke bar  and diversions like bathhouses and dojos where Ryoma can train in a variety of fighting styles.\nImage: Ryu Ga Gotoku Studio/Sega\nFighting styles in Ishin! feel more distinct from previous games, where Kiryu could switch between a variety of brawling methods. Ryomas incorporate weapons across four styles:\nSwordsman, a stance focused on powerful strikes with a katana\nGunman, which lets Ryoma attack at long range with pistols\nWild Dancer, a flashy stance that combines firearms and katana\nBrawler, bare fists combined with environmental weapons\nYou can educate yourself on all of those styles in dojos throughout Fushimi. Theres also a blacksmith in town who will forge, intensify, and imbue weapons, given the right materials. There are dozens, if not hundreds, of swords, spears, pistols, cannons, bits of armor, and other items to unlock and upgrade throughout the game.\nLike Yakuza games of the era when Ishin! was first released, street toughs will regularly challenge Ryoma to fights, but theyre relatively easy to put down. Ryoma faces a true challenger in his audition for the Shinsengumi, when he comes face to face with a capable swordsmen like Nagakura Shinpachi, the forces second division captain (who just happens to be trained in the Tennen Rishin style). He also comes face to face with  but does not directly fight  a man named Okita Soji, Ishin!s Goro Majima lookalike.\nIts in these moments, and in conversation with Shinsengumi deputy chief Hijikata Toshizo, where the drama of Like A Dragon: Ishin! is at its most compelling. The machismo is off the charts as Ryoma, Soji, and Shinpachi feel out each others combat prowess, bloodthirstiness, and true motivations. A later scene, where the deputy chief pits Ryoma and the mysterious Man in White in a battle to the death, ratchets up the drama further  with some excellent dialogue and an English-language localization that adds dimension to Ishin!s characters.\nImage: Ryu Ga Gotoku Studio/Sega\nThe silly stuff on display in this chapter is great too. This includes:\nA scene where Ryoma visits a bathhouse and is visited by a clothes thief. Ryoma then has to chase the perverted purloiner through the streets of Fushimi wearing nothing but a loin cloth, leading the local cops to try to nab him for indecency.\nA group of protesters who rally behind a dance, one so infectious that Ryoma shouts Stop dancing at me! only to succumb himself to the trend. Its very cute.\nA waiting-in-line-for-good-sushi minigame. Where you just wait in line. And then the vendor sells out.\nA karaoke performance (with flute solo) from Ryoma, singing the classic Yakuza tune Baka Mitai, during which a stoic audience member is so entranced he seems to develop a crush on our hero and sobs uncontrollably.\nRyoma learning to buyo dance  a fan dance, traditionally performed by women  that shows, like Kiryu, hes cool tapping into his feminine side\nIshin! also includes fishing, wood chopping, mahjong, shoji, poker, and dozens of substories, just like previous games in Segas seemingly unstoppable franchise. All of which adds up to a very fun, quite varied experience, just like Yakuza games of the modern era. Its just of a different time.\nLike A Dragon: Ishin! will be released on consoles and PC on Feb. 21. A digital deluxe edition will grant early access to the game on Feb. 17.\nSign up for the                  newsletter\nPatch Notes",
      "snippet": "Segas samurai spin on Yakuza, Like A Dragon: Ishin!, is the Red Dead Redemption of Yakuza games.\nIts coming to PS4, PS5, Steam, Xbox One, and Xbox Series X in February.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-01-27T14:00:00",
      "provider": {
        "name": "polygon",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.vox-cdn.com/thumbor/29qVEW_QqRRuBmivWJl90_orpf8=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24389635/ss_5402b29e1b20297e547da36affb3fd6b8ab4b660.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "polygon",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.polygon.com/23574077/like-a-dragon-ishin-preview-yakuza-sega"
      }
    }
  ]
}
